[
  {
    "message_id": "11d19b41a874b24b",
    "date_utc": "Mon, 20 Oct 2008 04:01:10 -0600",
    "subject": "thoughts to live by",
    "verse": "I have not stopped giving thanks for you, remembering you in my prayers. I keep asking that the God of our Lord Jesus Christ, the glorious Father, may give you the Spirit of wisdom and revelation, so that you may know Him better. (Ephesians 1:16, 17) NIV",
    "reflection": "Paul's prayer was that the Ephesians would come to know Christ better. This should be the prayer of every Christian, because Christ is to be our model, and the more we know Him, the more we will be like Him. If we study Jesus' life in the Gospels we will see what He was like 2000 years ago, this will cause us to know Him better. A personal knowledge of Christ will change your life.",
    "prayer": "Dear Heavenly Father I pray for the wisdom to come into a closer relationship with Your Son Jesus Christ, so that I might become more like Him. Amen.",
    "reading": "",
    "original_content": "10/20/08~~~(food for thought)~~~\"He that loveth his brother abideth in the light\" \n(I Jn.2:10).\n\nOur Verses for Today:\n\nI have not stopped giving thanks for you, remembering you in my\nprayers...\n\nI keep asking that the God of our Lord Jesus Christ, the glorious \nFather, may give you the Spirit of wisdom and revelation, so that\nyou may know Him better...(Eph. 1:16, 17) NIV\n\nOur Thought for Today:\n\nPaul's prayer was that the Ephesians would come to know Christ\nbetter. This should be the prayer of every Christian, because Christ\nis to be our model, and the more we know Him, the more we will\nbe like Him...\n\nIf we study Jesus' life in the Gospels we will see what He was like\n2000 years ago, this will cause us to know Him better...\n\nA personal knowledge of Christ will change your life...\n\nOur Prayer for Today:\nDear Heavenly Father I pray for the wisdom to come\ninto a closer relationship with Your Son Jesus Christ, \nso that I might become more like Him...Amen.\n\nKeep looking up, He is only a prayer away\nYou are in the prayers of two who care\nPastor Al and Marcie Sather\n\n\nPs. Marcie and I had a wonderful time but it is wonderful\nto be home too. We traveled through 19 states and through \ntwo Canadian Provinces...We met some unique people and \nsome wonderful Christians...Marcie kept a journal of the people \nwe ate with each day on the train. I believe we have over six hundred\npictures on DVD...\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.5 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d1ecea23b8e7f6",
    "date_utc": "Tue, 21 Oct 2008 03:47:55 -0600",
    "subject": "thoughts to live by",
    "verse": "And His incomparably great power is like the working of His mighty strength, which He exerted in Christ when He raised Him from the dead and seated Him at His right hand in the heavenly realms, (Ephesians 1:19, 20) NIV",
    "reflection": "The world fears the power of the atom, yet we belong to the God of the universe, who not only created that atomic power but also raised Jesus Christ from the dead. God's incomparably great power is available to help us. There is nothing to difficult for Him.",
    "prayer": "Dear Heavenly Father, I thank You for Your grace and mercy which is new every morning. I pray that You would give me greater faith each day, help me to become more Christ-like each and every day. Amen.",
    "reading": "",
    "original_content": "10/21/08~~~(food for thought)~~~God never abandons us...\n\nOur Bible Verses for Today:\n\nAnd His incomparably great power is like the working of His \nmighty strength,\n\nwhich He exerted in Christ when He raised Him from the dead\nand seated Him at His right hand in the heavenly realms, (Eph. 1:19, 20) NIV\n\nOur Thought for Today:\n\nThe world fears the power of the atom, yet we belong to\nthe God of the universe, who not only created that atomic\npower but also raised Jesus Christ from the dead...\n\nGod's incomparably great power is available to help us.\nThere is nothing to difficult for Him...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for Your grace and \nmercy which is new every morning. I pray that You would \ngive me greater faith each day, help me to become more\nChrist-like each and every day...Amen.\n\nKeep looking up, He knows our every weakness...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.5 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d23e9074645baa",
    "date_utc": "Wed, 22 Oct 2008 03:34:54 -0600",
    "subject": "thoughts to live by",
    "verse": "Far above all rule and authority, power and dominion and every title that can be given, not only in the present age but also in the one, God placed all thing under His feet and appointed Him to be head over everything for the church. (Ephesians 1:21-22)",
    "reflection": "Having been raised from the dead, Christ is now the head of the church, the ultimate authority over the world. Jesus is the messiah, God's anointed one, the one Israel longed for, the one who would set their broken world right. As Christian we can be confident that God has won the final victory and is in control of everything.",
    "prayer": "I thank You Lord for the assurance that I have a sure foundation when I place my faith in You. Block from my mind all that would cause me to. Amen.",
    "reading": "",
    "original_content": "10/22/08~~~(food for thought)~~~\"We are made alive in Christ Jesus.\"\n\nOur Bible Verses for Today:\n\nFar above all rule and authority, power and dominion and\nevery title that can be given, not only in the present age\nbut also in the one,\n\nGod placed all thing under His feet and appointed Him to\nbe head over everything for the church...(Eph, 1:21, 22) NIV\n\nOur Thought for Today:\n\nHaving been raised from the dead, Christ is now the head of\nthe church, the ultimate authority over the world. Jesus is the \nmessiah, God's anointed one, the one Israel longed for, the\none who would set their broken world right...\n\nAs Christian we can be confident that God has won the final\nvictory and is in control of everything...\n\nOur Prayer for Today:\nI thank You Lord for the assurance that I have a sure foundation \nwhen I place my faith in You. Block from my mind all that would\ncause me to...Amen.\n\nKeep looking up, and receive His many blessings...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather \n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.5 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d29377fb6084e9",
    "date_utc": "Wed, 22 Oct 2008 16:09:04 -0600",
    "subject": "thoughts to live by",
    "verse": "God placed all things under His feet and appointed Him to be head over everything for the Church, which is His body, the fullness of Him who fills everything in every way. (Ephesians 1:22, 23) NIV",
    "reflection": "Christ fills the faithful church with gifts and blessings. The church should be the full expression of Christ, who Himself fills everything (see Ephesians 3:19). When reading Ephesians it is important to remember that it was written primarily to the entire church, not merely to an individual. Christ is the head, and we are the body of His church. Paul uses this metaphor in Romans 12:4, 5; I Corinthians 12:12-27 and Colossians 3:15. The image of the body shows the church's unity. Each member is involved with all the others as they go about doing Christ's word on earth. We should not attempt to work, serve, or worship merely on our own. We need the entire body.",
    "prayer": "Dear Heavenly Father, I pray for continued unity in the church. Help each member be of one mind in all things. open our hearts to receive Godly wisdom from above. Bless each and everyone who reads this devotional with good health and safety. Amen.",
    "reading": "",
    "original_content": "10/22/08~~~(food for thought)~~~Every Christian is called to be God's people...\n\nOur Bible Verses for Today:\n\nGod placed all things under His feet and appointed Him \nto be head over everything for the Church,\n\nwhich is His body, the fullness of Him who fills everything\nin every way...(Eph. 1:22, 23) NIV\n\nOur Lesson for Today:\n\nChrist fills the faithful church with gifts and blessings. The\nchurch should be the full expression of Christ, who Himself\nfills everything (see Eph. 3:19)...\n\nWhen reading Ephesians it is important to remember that it\nwas written primarily to the entire church, not merely to an\nindividual. Christ is the head, and we are the body of His church.\n\nPaul uses this metaphor in Ro. 12:4, 5; I Cor.12:12-27 and\nCol. 3:15. The image of the body shows the church's unity.\nEach member is involved with all the others as they go about\ndoing Christ's word on earth...\n\nWe should not attempt to work, serve, or worship merely on\nour own. We need the entire body...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray for continued unity in the church.\nHelp each member be of one mind in all things. open our hearts\nto receive Godly wisdom from above. Bless each and everyone\nwho reads this devotional with good health and safety...Amen.\n\nKeep looking up, His eye is on the sparrow\nand is surely on you...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.5 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d2e440e79cd170",
    "date_utc": "Thu, 23 Oct 2008 06:31:47 -0600",
    "subject": "thoughts to live by",
    "verse": "As for you, you were dead in your transgressions and sins, In which you used to live when you followed the ways of this world and of the ruler of the kingdom of the air, the spirit who is now at work in those who are disobedient. (Ephesians 2:1, 2) NIV",
    "reflection": "The 'ruler of the kingdom of the air' is Satan. Paul's readers believe that Satan and the evil spiritual forces inhabited the region between earth and the sky. And so Satan is pictured as ruling an evil spiritual kingdom ~ with the demons and those who are against Christ. Satan means \"the accuser\" He is also called the Devil (4:27). In the resurrection, Christ was victorious over Satan and his power. So now Christ is the permanent ruler of the whole world; Satan is only the temporary ruler of the part of the world that chooses to follow him.",
    "prayer": "Dear Heavenly Father, I pray that Satan's kingdom would continue to grow smaller and smaller, while the citizens of Your kingdom would grow larger and larger. I pray that there would be a revival in the world ~ a true awakening. I pray that this would be the prayer of every Christian. Amen.",
    "reading": "",
    "original_content": "10/24/08~~~(food for thought)~~~It is up to every Christian to show the world who God is...\n\nOur Bible Verses for Today:\n\nAs for you, you were dead in your transgressions and sins,\n\nIn which you used to live when you followed the ways of this \nworld and of the ruler of the kingdom of the air, the spirit who\nis now at work in those who are disobedient...(Eph. 2:1,2) NIV\n\nOur Lesson for Today:\n\nThe 'ruler of the kingdom of the air' is Satan.\nPaul's readers believe that Satan and the evil spiritual forces\ninhabited the region between earth and the sky...\n\nAnd so Satan is pictured as ruling an evil spiritual kingdom ~\nwith the demons and those who are against Christ. Satan means \n\"the accuser\" He is also called the Devil (4:27)...\n\nIn the resurrection, Christ was victorious over Satan and his power.\nSo now Christ is the permanent ruler of the whole world; Satan is\nonly the temporary ruler of the part of the world that chooses to\nfollow him...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that Satan's kingdom would\ncontinue to grow smaller and smaller, while the citizens of \nYour kingdom would grow larger and larger. I pray that there\nwould be a revival in the world ~ a true awakening. I pray that\nthis would be the prayer of every Christian...Amen.\n\nKeep looking up, He has promised He will return...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.5 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d3dbe74fb886dd",
    "date_utc": "Mon, 27 Oct 2008 03:56:42 -0600",
    "subject": "thoughts to live by",
    "verse": "Because of His great love for us, God who is rich in mercy, made us alive with Christ even when we were dead in transgressions ~ it is by grace you have been saved. (Ephesians 2:4, 5) NIV",
    "reflection": "In verses 1-3 Paul wrote about our old sinful nature. Here Paul emphasizes that we do not need to live any longer under sin's power. The penalty of sin and its power over us were miraculously destroyed by Christ on the cross. Through faith in Christ we stand acquitted, or not guilty, before God (Romans 3:21, 22). God does not take us out of the world or make us robots ~ we will still feel like sinning, and sometimes we will sin. The difference is that before we became Christians, we were dead in sin and were slaves to our sinful nature. BUT now we are alive with Christ (see Galatians 2:20).",
    "prayer": "Dear Heavenly Father, I thank You for Your love and mercy. I thank You for providing a way onto salvation through Your Son, or Lord Jesus Christ. I pray for a sensitive heart that I may be lead by Your Holy Spirit. Amen.",
    "reading": "",
    "original_content": "10/27/08~~~(food for thought)~~~We serve a God of love...\n\nOur Bible Verses for Today:\n\nBecause of His great love for us, God who is rich in mercy,\n\nmade us alive with Christ even when we were dead in transgressions ~\nit is by grace you have been saved...(Eph. 2:4, 5) NIV\n\nOur Lesson for Today:\n\nIn verses 1-3 Paul wrote about our old sinful nature. Here Paul emphasizes\nthat we do not need to live any longer under sin's power. The penalty of sin \nand its power over us were miraculously destroyed by Christ on the cross...\n\nThrough faith in Christ we stand acquitted, or not guilty, before God (Ro. 3:21, 22).\nGod does not take us out of the world or make us robots ~ we will still feel like \nsinning, and sometimes we will sin. The difference is that before we became\nChristians, we were dead in sin and were slaves to our sinful nature...\n\nBUT now we are alive with Christ (see Gal. 2:20)...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for Your love and mercy.\nI thank You for providing a way onto salvation through Your\nSon, or Lord Jesus Christ. I pray for a sensitive heart that I\nmay be lead by Your Holy Spirit...Amen.\n\nKeep looking up, He wants to guide us in \nthe way of eternal life...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.5 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d42c5180f0e78b",
    "date_utc": "Tue, 28 Oct 2008 03:21:09 -0600",
    "subject": "thoughts to live by",
    "verse": "God raised us up with Christ and seated us with Him in the heavenly realms in Christ Jesus. (Ephesians 2:6) NIV",
    "reflection": "Because of Christ's resurrection, we know that our body will also be raised from the dead (I Corinthians 15:2-23) and that we will be given the power to live as Christians now (Ephesians 1:19). These ideas are combined in Paul's image of sitting with Christ in the \"heavenly realm\". Our eternal life with Christ is certain because we are united in His powerful victory. This all came into being because of His great love for us.",
    "prayer": "Dear Heavenly Father, I thank You for the assurance we have of a resurrected life with you, I also thank you for the assurance that Your Holy Spirit is beside me to guide and direct my foot steps into a closer walk with You. Bless all my e-mail friends with good health and safety this week. Amen.",
    "reading": "",
    "original_content": "10/28/08~~~(food for thought)~~~He continually watches over you...\n\nOur Bible Verse for Today:\n\nGod raised us up with Christ and seated us with Him in the\nheavenly realms in Christ Jesus...(Eph. 2:6) NIV\n\nOur Lesson for Today:\n\nBecause of Christ's resurrection, we know that our body will also\nbe raised from the dead (I Cor. 15:2-23) and that we will be given \nthe power to live as Christians now (Eph. 1:19)...\n\nThese ideas are combined in Paul's image of sitting with Christ in \nthe \"heavenly realm\". Our eternal life with Christ is certain because \nwe are united in His powerful victory...\n\nThis all came into being because of His great love for us...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the assurance we have\nof a resurrected life with you, I also thank you for the assurance\nthat Your Holy Spirit is beside me to guide and direct my foot\nsteps into a closer walk with You. Bless all my e-mail friends with \ngood health and safety this week...Amen.\n\nKeep looking up, place your hand in the hand\nof the man who stilled the waters...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.5 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d481fcb49df15d",
    "date_utc": "Wed, 29 Oct 2008 04:18:19 -0600",
    "subject": "thoughts to live by",
    "verse": "For it is by grace you have been saved, through faith ~ and this not from yourselves, it is the gift of God ~ not by works, so that no one can boast. (Ephesians 2:8, 9) NIV",
    "reflection": "When someone gives you a gift, do you say, \"That's very nice~ now how much do I owe you?\" NO, the appropriate response to a gift is \"Thank you!\" Yet how often do Christians, even after they have been given the gift of salvation, feel obligated to try to work their way to God. Because our Salvation and even our faith are gifts, we should respond with gratitude, praise, and joy.",
    "prayer": "I thank You dear Lord for the gift of eternal life, even the gift of faith. Forgive me for all the times I have felt I had to work a bit harder to be worthy. Help me Lord to be a better witness to those who do not know about the free gift of eternal life. Amen.",
    "reading": "",
    "original_content": "10/29/08~~~(food for thought)~~~God gives strength to those who rely on Him...\n\nOur Bible Verses for Today:\n\nFor it is by grace you have been saved, through faith ~ \nand this not from yourselves, it is the gift of God ~\n\nnot by works, so that no one can boast...(Eph. 2:8, 9) NIV\n\nOur Lesson for Today:\n\nWhen someone gives you a gift, do you say, \"That's very nice~ \nnow how much do I owe you?\"\n\nNO, the appropriate response to a gift is \"Thank you!\" Yet\nhow often do Christians, even after they have been given the\ngift of salvation, feel obligated to try to work their way to God...\n\nBecause our Salvation and even our faith are gifts, we should \nrespond with gratitude, praise, and joy...\n\nOur Prayer for Today:\nI thank You dear Lord for the gift of eternal life, even\nthe gift of faith. Forgive me for all the times I have felt\nI had to work a bit harder to be worthy. Help me Lord\nto be a better witness to those who do not know about\nthe free gift of eternal life...Amen\n\nKeep looking up, God's grace awaits \nthose who come to Him in faith...\nYou are in the Prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.5 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d4d11c91df5bf0",
    "date_utc": "Thu, 30 Oct 2008 03:21:28 -0600",
    "subject": "thoughts to live by",
    "verse": "We are God's workmanship, created in Christ Jesus to do good works, which God prepared in advance for us to. (Ephesians 2:10) NIV",
    "reflection": "\"We are God's workmanship\" another translation says ~ \"We are God's masterpiece.\" It is easy for humans to be proud of what they have accomplished and we have accomplished some extraordinary things ~ BUT ~ let us never forget that our salvation is only something God can do. It is His powerful, creative work in us. Another thought ~ IF ~ God considers us his masterpiece, how dare we treat ourselves ~ OR ~ others for that matter with disrespect or as inferior work.",
    "prayer": "Dear Heavenly Father, forgive me for thumbing my noses at others. Help me to remember, every human being is a creation of Yours. Help me to remember that if someone does something I don't agree with, that I pray for them, and examine myselves so that I am not at throne in someone else's side. Amen.",
    "reading": "",
    "original_content": "10/30/08~~~(food for thought)~~~God sent His Spirit to comfort and encourage...\n\nOur Verse for Today:\n\nWe are God's workmanship, created in Christ Jesus \nto do good works, which God prepared in advance \nfor us to...(Eph. 2:10) NIV\n\nOur Lesson for Today:\n\n\"We are God's workmanship\" another translation says ~\n\"We are God's masterpiece.\"\n\nIt is easy for humans to be proud of what they have accomplished\nand we have accomplished some extraordinary things ~ BUT ~ let\nus never forget that our salvation is only something God can do...\nIt is His powerful, creative work in us. \n\nAnother thought ~ IF ~ God considers us his masterpiece, how dare \nwe treat ourselves ~ OR ~ others for that matter with disrespect or as \ninferior work...\n\nOur Prayer for Today:\nDear Heavenly Father, forgive me for thumbing my noses at \nothers. Help me to remember, every human being is a creation\nof Yours. Help me to remember that if someone does something\nI don't agree with, that I pray for them, and examine myselves so \nthat I am not at throne in someone else's side...Amen.\n\nKeep looking up, Seek Godly wisdom from above...\nYou are in the prayers of two who care...\nPastor AL & Marcie Sather\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.5 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d5242f334c524e",
    "date_utc": "Fri, 31 Oct 2008 03:33:51 -0600",
    "subject": "thoughts to live by",
    "verse": "Therefore, remember that formality you who are Gentiles by birth and called \"uncircumcised\" by those who call themselves \"the circumcision\" (that done in the body by the hands of men) ~ remember that at that time you were separate from Christ, excluded from citizenship in Israel and foreigners to the covenants of the promise, without hope and without God in the world. But now in Christ Jesus you who once were far away have been brought near through the blood of Christ. (Ephesians 2:11-13) NIV",
    "reflection": "Jews and Gentiles alike could be guilty of spiritual pride ~ Jews for thinking their faith and traditions elevated them above everyone else. Gentiles for trusting in their achievements, power, or position. Spiritual pride blinds us to our own faults and magnifies the faults of others, Be careful not to become proud of your salvation. Instead, humbly thank God for what He has done, and encourage others who might be struggling in their faith.",
    "prayer": "Dear Heavenly Father, I do thank You for the wonderful gift of salvation that is mine through faith in the shed blood of Christ. Forgive me for any spiritual pride I have shown in the past, remembering that salvation is a gift, not something I have achieved by any works of my own. Amen.",
    "reading": "",
    "original_content": "10/31/08~~~(food for thought)~~~Let us stop each day a remember how great a gift we \nhave been given through the shed blood of Christ..\n\nOur Bible Verses for Today:\n\nTherefore, remember that formality you who are Gentiles by birth\nand called \"uncircumcised\" by those who call themselves \"the\ncircumcision\" (that done in the body by the hands of men) ~\n\nremember that at that time you were separate from Christ, excluded\nfrom citizenship in Israel and foreigners to the covenants of the promise,\nwithout hope and without God in the world...\n\nBut now in Christ Jesus you who once were far away have been brought \nnear through the blood of Christ...(Eph. 2:11-13) NIV\n\nOur Lesson for Today:\n\nJews and Gentiles alike could be guilty of spiritual pride ~ Jews for thinking\ntheir faith and traditions elevated them above everyone else. Gentiles for \ntrusting in their achievements, power, or position...\n\nSpiritual pride blinds us to our own faults and magnifies the faults of others,\nBe careful not to become proud of your salvation. Instead, humbly thank God\nfor what He has done, and encourage others who might be struggling in\ntheir faith...\n\nOur Prayer for Today:\nDear Heavenly Father, I do thank You for the wonderful gift of \nsalvation that is mine through faith in the shed blood of Christ.\nForgive me for any spiritual pride I have shown in the past,\nremembering that salvation is a gift, not something I have achieved\nby any works of my own...Amen.\n\nKeep looking up, He is a mighty fortress...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.5 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]