[
  {
    "message_id": "16b15b50f205170d",
    "date_utc": "Sat, 01 Jun 2019 20:01:56 -0500",
    "subject": "A PLACE TO GO FOR HELP",
    "verse": "So let us come boldly to the throne of our gracious God. There we will find grace to help us when we need it. (Hebrews 4:16)",
    "reflection": "Prayer is our approach to God, and we are to come \"boldly.\" Some Christians approach God meekly with heads hung low, afraid to ask Him to meet their needs.Others pray flippantly giving little thought to what they say. Come with reverence because He is your king. But also come with bold assurance because He is your friend and counselor. WHEN LIFE KNOCKS YOU DOWN YOU ARE IN A PERFECT POSITION TO PRAY.",
    "prayer": "",
    "original_content": "VERSE FOR 5/2:_So let us come boldly to the throne of our gracious_\n_God. There we will find __grace to help us when we_ _need it._ (Heb.\n4:16) READ (Heb. 4:14-16)THOUGHT FOR TODAY:Prayer is our approach to\nGod, and we are to come \"boldly.\" Some Christians approach God meekly\nwith heads hung low, afraid to ask Him to meet their needs.Others pray\nflippantly giving little thought to what they say. Come with reverence\nbecause He is your king. But also come with bold assurance because He\nis your friend and counselor. WHEN LIFE NOCKS YOU DOWN YOU ARE IN A\nPERFECT POSITION TO PRAY. _PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Hebrews 4:14-16",
    "found_reading": true
  },
  {
    "message_id": "16b1adf46d9deace",
    "date_utc": "Sun, 02 Jun 2019 20:06:09 -0500",
    "subject": "STRENGTH FOR THE WEARY",
    "verse": "Those who hope in the Lord will renew their strength (Isaiah 40:31)",
    "reflection": "What is it like on your journey today? IF fatigue has caused you to forget God's presence and power, Why not pause and recall His promise.\"Those who hope in the Lord will renew their strength. (vs. 31) Now. Right where you are. WHEN LIFE'S STRUGGLES MAKE YOU WEARY FIND STRENGTH IN THE LORD.",
    "prayer": "",
    "found_verse": true,
    "original_content": "VERSE FOR 5:3:Those who hope in the Lord will renew their strength\n(Isa. 40:31) READ (Isa. 40:27-31)THOUGHT FOR TODAY:What is it like on\nyour journey today? IF fatigue has caused you to forget God's\npresence and power, Why not pause and recall His promise._\"Those_ _who\nhope in the Lord will __renew their __strength._ (vs. 31) Now. Right\nwhere you are. WHEN LIFE'S STRUGGLES MAKE YOU WEARY FINDSTRENGTH IN\nTHE LORD._ PASTOR AL_",
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Isaiah 40:27-31",
    "found_reading": true
  },
  {
    "message_id": "16b1fdcc65981152",
    "date_utc": "Mon, 03 Jun 2019 19:21:31 -0500",
    "subject": "YOU HAVE A PURPOSE",
    "verse": "If anyone serves, they should do so with the strength God provides, so that in all things God may be praised through Jesus Christ. (I Peter 4:11)",
    "reflection": "Remember God has created each of us for a specific purpose. Primarily that purpose is to bring honor to Him, and one way we do that is bymeeting the needs of others. (I Peter 4:10-11) NOW Psalm 139 saysthat before we were born \"All the days ordained for [us} were written in His book.\" (vs. 16) We are fearfully and wonderfully made\" tobring glory to our creator. (14) NEVER FORGET: YOU HAVE A PURPOSE.",
    "prayer": "",
    "original_content": "VERSE FOR 5/4/2019:_If anyone serves, they should do so with the\nstrength God provides,__so that in all things God may be praised\nthrough Jesus Christ. _(I Pet. 4:11) READ (I Pet. 4:7-11)THOUGHT FOR\nTODAY:Remember God has created each of us for a specific purpose.\nPrimarily that purpose is to bring honor to Him, and one way we do\nthat is bymeeting the needs of others. (I Pet. 4:10-11) NOW Psalm 139\nsaysthat before we were born \"_All the days ordained for [us} were\nwritten __in His book.\"_ (vs. 16) We are fearfully and wonderfully\nmade\" tobring glory to our creator. (14) NEVER FORGET: YOU HAVE A\nPURPOSE._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "I Peter 4:7-11",
    "found_reading": true
  },
  {
    "message_id": "16b2519536c41c77",
    "date_utc": "Tue, 04 Jun 2019 19:45:45 -0500",
    "subject": "WHO KNEW--WHO IMAGINED",
    "verse": "Now this is eternal life: that they may know You, the only true God. (John 17:3)",
    "reflection": "WHO knew that Jesus's death on a Roman crosswould turn out to reveal an eternal glory. WHO would have imagined that in the public curse and the agony of the cross we would find eternal glory.WHO could have foreseen that all of heaven andearth would one day sing, \"Worthy is the Lamb, who was slain, to receive power and wealth andwisdom and strength and honor and glory andpraise!\" LET US NOT FORGET, THAT THE LAMB WHO DIED IS THE LORD WHO LIVES.",
    "prayer": "",
    "original_content": "VERSE FOR 5/5/2019:_Now this is eternal life: that they may know You,\n__the only true God._ (Jn. 17:3) READ (Jn. 17:1-5)THOUGHT FOR\nTODAY:WHO knew that Jesus's death on a Roman crosswould turn out to\nreveal an eternal glory. WHO would have imagined that in the public\ncurse and the agony of the cross we would find eternal glory.WHO could\nhave foreseen that all of heaven andearth would one day sing, \"Worthy\nis the Lamb, who was slain, to receive power and wealth andwisdom and\nstrength and honor and glory andpraise!\" LET US NOT FORGET, THAT THE\nLAMB WHO DIED IS THE LORD WHO LIVES._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "John 17:1-5",
    "found_reading": true
  },
  {
    "message_id": "16b2a28fead55bb6",
    "date_utc": "Wed, 05 Jun 2019 19:20:58 -0500",
    "subject": "MADE NEW",
    "verse": "I KNOW, LORD, YOUR LAWS ARE RIGHTEOUS, AND THAT IS FAITHFULNESS YOU HAVE AFFLICTED ME. (Psalm 119:75)",
    "reflection": "Jesus is not a crouch for the weak. He IS the sourceof new spiritual life! When we are broken, He can make us new and whole. (Psalm 119:75) BROKENNESS CAN LEAD TO WHOLENESS.",
    "prayer": "",
    "original_content": "VERSE FOR 5/6/2019:_I KNOW, LORD, YOUR LAWS ARE RIGHTEOUS, AND THAT IS\n__FAITHFULNESS YOU HAVE AFFLICTED ME._ (Psalm 119:75)READ (Psalm\n119:71-75)THOUGHT FOR TODAY:Jesus is not a crouch for the weak. He IS\nthe sourceof new spiritual life! When we are broken, He can make us\nnew and whole. (Psalm 119:75)BROKENNESS CAN LEAD TO WHOLENESS.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 119:71-75",
    "found_reading": true
  },
  {
    "message_id": "16b2f7d11081895f",
    "date_utc": "Thu, 06 Jun 2019 20:10:54 -0500",
    "subject": "GO TELL",
    "verse": "The man went way and began to tell . how much Jesus had done for him. (Mark 5:20)",
    "reflection": "The man Jesus healed didn't need to preach a powerfulsermon; he simply needed to share his story. No matter what our conversion experience is, we can do what that man did: [He] went away and began to tell . how muchJesus had done for him. LET THE REDEEMED OF THE LORD TELL THEIR STORY. (Psalm 107:2)",
    "prayer": "",
    "original_content": "VERSE FOR 6/7/2017:_The man went way and began to tell . .__how much\nJesus had done for him._ (Mark 5:20)READ (Mark 5:1-20)THOUGHT FOR\nTODAY:The man Jesus healed didn't need to preach a powerfulsermon; he\nsimply needed to share his story. No matter what our conversion\nexperience is, we can do what thatman did: [He} went away and began to\ntell . how muchJesus had done for him. LET THE REDEEMED OF THE\nLORD TELLTHEIR STORY. (PS. 107:2)_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Mark 5:1-20",
    "found_reading": true
  },
  {
    "message_id": "16b348e736d4306b",
    "date_utc": "Fri, 07 Jun 2019 19:47:59 -0500",
    "subject": "BETTER BY FAR",
    "verse": "I desire to depart and be with Christ, which is better by far. (Philippians 1:23)",
    "reflection": "People who believe in the saving power of Jesus death and resurrection will be with Him forever It has been said, .\"all's well that ends up in heaven.\"Whether we live or die, we win. \"For to me, to live is Christ and to die is gain. (Philippians 1:21)BELIEF IN JESUS'S DEATH AND RESURRECTION BRINGSTHE ASSURANCE OF LIFE WITH HIM FOR EVER.",
    "prayer": "",
    "original_content": "VERSE FOR JUNE 8/2019_I desire to depart and be with Christ, which\n__is __better by far. _(Phil. 1:23) READ (Phil. 1:12-26)_._THOUGHT FOR\nTODAY:People who believe in the saving power of Jesus death and\nresurrection will be with Him forever It has been said, .\"all's well\nthat ends up in heaven.\"Whether we live or die, we win. \"For to me, to\nliveis Christ and to die is gain. (Phil. 1:21)BELIEF IN JESUS'S DEATH\nAND RESURRECTION BRINGSTHE ASSURANCE OF LIFE WITH HIM FOR EVER._\nPASTOR AL_____",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Philippians 1:12-26",
    "found_reading": true
  },
  {
    "message_id": "16b3987abf39b08d",
    "date_utc": "Sat, 08 Jun 2019 18:58:41 -0500",
    "subject": "WHAT REALLY MATTERS",
    "verse": "In humility value others above yourselves, not looking to your own interests but each of you to the interests of others. (Philippians 2:3-4)",
    "reflection": "Other people are not to be used for our own benefit. BECAUSE they are loved by God, as we are loved by Him. So we are to love one another, as he loves us. His love is the greatest love of all. TRUE JOY COMES FROM PUTTING ANOTHER'S NEEDS AHEAD OF OUR OWN.",
    "prayer": "",
    "original_content": "VERSE FOR 5/9/2019:_In humility value others above yourselves, not\nlooking to __your own interests but each of you to the interests of\nothers._(Phil. 2:3-4) READ (Phil. 2:1-11)THOUGHT FOR TODAY:Other\npeople are not to be used for our own benefit. BECAUSEthey are loved\nby God, as we are loved by Him.So we are to love one another, as e\nloves us. His love is the greatest love of all. TRUE JOY COMES FROM\nPUTTING ANOTHER'S NEEDS AHEAD OF OUR._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Philippians 2:1-11",
    "found_reading": true
  },
  {
    "message_id": "16b3ee026b53c865",
    "date_utc": "Sun, 09 Jun 2019 19:53:26 -0500",
    "subject": "TOGETHER WITH GOD",
    "verse": "Oh, the joys of those who do not follow the advice of the wicked, or stand around with sinners, or join in with scoffers. (Psalm 1:1)",
    "reflection": "In this lifetime, it may not be possible to adequately seek the depths of the book of Psalm,. Yet we need to start digging. The Psalm teach us to pray, encourage us to trust, and invite us to dine at the table of God's endless goodness.STARTING THIS WEEK:I WANT TO TAKE US THROUGH THE PSALMS ONE VERSE OF EACH CHAPTER DAY BY DAY.",
    "prayer": "",
    "original_content": "VERSE FOR 6/10/2019:_Oh, the joys _ _of those who do not follow the\n__advice__ of the wicked, or stand around with __sinners, or join __in\nwith scoffers._(Ps.1:1) READ PS. 1:1-3THOUGHT FOR TODAY:In this\nlifetime, it may not be possible to adequately seek the depths of the\nbook of Psalm,. Yet we need to start digging. The Psalm teach us to\npray, encourage us to trust, and invite us to dine at the table of\nGod's endless goodness.STARTING THIS WEEK:I WANT TO TAKE US THROUGH\nTHE PSALMS ONE VERSE OF EACH CHAPTER DAY BY DAY. _ PASTOR AL___",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 1:1-3",
    "found_reading": true
  },
  {
    "message_id": "16b441e44e493802",
    "date_utc": "Mon, 10 Jun 2019 20:19:23 -0500",
    "subject": "WHAT MAKES GOD LAUGH?",
    "verse": "The one enthroned in heaven laughs; the Lord scoffs at them. (Psalm 2:4)",
    "reflection": "Wicked nations were plotting to overthrow God's anointed, thus ultimately opposing the Almighty himself, and so He laughs. Is this a heartless or cruel laughter? No! His same infinite greatness that mocks man's defiance ALSO marks His sympathy with man in his lost condition. God's laughter reminds us that Christ WILL ultimately triumph over evil. REMEMBER MANKIND'S LIMITED POTENTIAL ACCENTS GOD'S LIMITLESS POWER.",
    "prayer": "",
    "original_content": "VERSE FOR 6/11/2019:_The one enthroned in heaven laughs; the\nLord__scoffs at them._ (Ps. 2:4) READ (Ps. 2:1-5)THOUGHT FOR\nTODAY:Wicked nations were plotting to overthrow God's anointed, thus\nultimately opposing the Almighty himself, and so He laughs. Is this a\nheartless or cruel laughter? No! His same infinite greatness that\nmocks man's defiance ALSO marks His sympathy with man in his lost\ncondition. God's laughter reminds us that Christ WILL ultimately\ntriumph over evil. REMEMBER MANKIND'S LIMITED POTENTIAL ACCENTS GOD'S\nLIMITLESS POWER. _ PASTOR AL._",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 2:1-5",
    "found_reading": true
  },
  {
    "message_id": "16b4959df5139050",
    "date_utc": "Tue, 11 Jun 2019 20:42:35 -0500",
    "subject": "BEGIN THE DAY WITH HOPE",
    "verse": "I lie down and sleep, I wake again, because the Lord sustains me. I will not fear though tens of thousands assail me on every side. (Psalm 3:5-6)",
    "reflection": "Do you ever wake up in the morning to discover feelings of dread clouding your mind? Some mornings we do wake up TO a very difficult day. When this happens, we can either give in to despair or follow the example of David. Faith, gratitude, and expectation will enable us to face the most trying day with strong confidence in God. REMEMBER, THAT EVERY DAY IS A GOOD DAY WHEN YOU ARE IN GOD'S WORD.",
    "prayer": "",
    "original_content": "VERSE FOR 6/12/2019_I lie down and sleep, I wake again, because __the\nLord sustains me. __I will not fear though __tens of thousands assail\nme on every side._(Ps. 3:5-6) READ (Ps. 3:1-5)THOUGHT FOR TODAY:Do you\never wake up in the morning to discover feelings of dread clouding\nyour mind? Some mornings we do wake up TO a very difficult day. When\nthis happens, we can either give in to despair or follow the example\nof David. Faith, gratitude, and expectation will enable us to face the\nmost trying day with strong confidence in God. REMEMBER, THAT EVERY\nDAY IS A GOOD DAY WHEN YOU ARE IN GOD'S WORD._ PASTOR AL___\n____",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 3:1-5",
    "found_reading": true
  },
  {
    "message_id": "16b4e6fac6f0c305",
    "date_utc": "Wed, 12 Jun 2019 20:24:30 -0500",
    "subject": "WHAT'S IN A SMILE?",
    "verse": "You have given me greater joy than those who have an abundant harvest of grain and wine. (Psalm 4:7)",
    "reflection": "Changes of the heart can show up on the face. BUT can changing our expression also help change our heart? Smiling isn't the only thing we can do to change the way we feel. In Psalm 4, we seewhen distress grips our soul, we can ask the Lord for relief and mercy(v. 1). We can take comfort in knowing we are among those who are favored by Him, remembering He hears us when we call (v. 3).We can acknowledge our feelings and be quiet before Him (v. 4).We can do what is right v. 5). And trust in Him to give us overflowinggladness (v. 7). And we can rest in the assurance of His peace andsafety (v. 8). A HEART TOUCHED BY GRACE BRINGS JOY TO THE FACE.",
    "prayer": "",
    "original_content": "VERSE FOR 6/13/2017:_You have given me greater joy than those who have\nan__abundant harvest of grain and wine._ (Ps. 4:7) READ (PS.\n4:1-8)THOUGHT FOR TODAY:Changes of the heart can show up on the face.\nBUT can changing our expression also help change our heart? Smiling\nisn't the only thing we can do to change the way we feel. In Psalm 4,\nwe seewhen distress grips our soul , we can ask the Lord for relief\nand mercy(v. 1). We can take comfort in knowing we are among those who\nare favored by Him, remembering He hears us when we call (v. 3).We can\nacknowledge our feelings and be quiet before Him (v. 4).We can do what\nis right v. 5). And trust in Him to give us overflowinggladness (v.\n7). And we can rest in the assurance of His peace andsafety (v. 8). A\nHEART TOUCHED BY GRACE BRINGS JOY TO THE FACE._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 4:1-8",
    "found_reading": true
  },
  {
    "message_id": "16b53839c579f2ff",
    "date_utc": "Thu, 13 Jun 2019 20:04:23 -0500",
    "subject": "EARLY DEFENSE SYSTEM",
    "verse": "Hear my cry for help, my king and my God, for to You I cry. (Psalm 5:2)",
    "reflection": "Charles Spurgeon once wrote many years ago, \"If you are not seeking the Lord, the devil is seeking you.\" So we need to seek the Lord early and rely on His, help being aware of the fact that the devil prowls around like a roaring lion looking for someone to devour (Peter 5:8) David came to God early in the morning and ask Him for His protection and help. This was David's regular practice. LET'S NOT MOVE INTO ANY DAY WITHOUT BEING AWARE OFOUR URGENT NEED FOR THE LORD.",
    "prayer": "",
    "original_content": "VERSE FOR 6/14/2019:_Hear my cry for help, my king and my God, for\nto__You I cry._ (Ps. 5:2) READ (PS. 5:1-8)THOUGHT FOR TODAY:Charles\nSpurgeon once wrote many years ago, \"If you are not seeking the Lord,\nthe devil is seeking you.\" So we need to seek the Lord early and rely\non His, help being aware of the fact that the devil prowls around like\na roaring lion looking for someone to devour (Pet. 5:8) David came to\nGod early in the morning and ask Him for His protection and help. This\nwas David's regular practice. LET'S NOT MOVE INTO ANY DAY WITHOUT\nBEING AWARE OFOUR URGENT NEED FOR THE LORD._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 5:1-8",
    "found_reading": true
  },
  {
    "message_id": "16b58a2aba1fc45f",
    "date_utc": "Fri, 14 Jun 2019 19:56:24 -0500",
    "subject": "WHEN YOU'RE DOWN",
    "verse": "Away from me, all you who do evil, for the Lord has heard my weeping. (Psalm 6:8)",
    "reflection": "Sometimes it doesn't take much to get us down, does it?Yes life can seem unbearable at times. But let us not let circumstances keep us down. We need to meditate onGod's goodness to us, and talk to Him. Knowing that He loves us and \"accepts our prayer\" (Psalm 6:9) will give usstrength to help us get up when we're down. WHEN THINGS ARE LOOKING DOWN, TRY LOOKING UP.",
    "prayer": "",
    "original_content": "VERSE FOR 6/15/2019:_Away from me, all you who do evil, for the Lord\n__has heard my weeping._ (Ps. 6:8) READ (Ps. 6:1-9)THOUGHT FOR\nTODAY:Sometimes it doesn't take much to get us down, does it?Yes life\ncan seem unbearable at times. But let us not let circumstances keep us\ndown. We need to meditate onGod's goodness to us, and talk to Him.\nKnowing that He loves us and \"accepts our prayer\" (Ps. 6:9) will give\nusstrength to help us get up when we're down. WHEN THINGS ARE LOOKING\nDOWN, TRY LOOKING UP._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 6:1-9",
    "found_reading": true
  },
  {
    "message_id": "16b5de89d5d15552",
    "date_utc": "Sat, 15 Jun 2019 20:30:54 -0500",
    "subject": "DANGER BELOW",
    "verse": "Whoever digs a hole and scoops it out falls into the pit they have made. (Psalm 7:15)",
    "reflection": "David wrote about danger we need to avoid. He said the timewould come when the wicked would fall into their own pitbecause of their ungodly ways. It may not happen right way.On the surface, everything may seem to be going well with people who disregard God. But the principle cannot be avoided:ANYONE who continually disobeys the Lord is headed for afall. HOW IMPORTANT, THEN, TO LIVE BY THE PRINCIPLES OF GOD'S WORD.",
    "prayer": "",
    "original_content": "VERSE FOR 6/16/2019:_Whoever digs a hole and scoops it out falls into\nthe pit__they have made._ (Ps. 7:15) READ (Ps. 7:11-17)THOUGHT FOR\nTODAY:David wrote about danger we need to avoid. He said the timewould\ncome when the wicked would fall into their own pitbecause of their\nungodly ways. It may not happen right way.On the surface, everything\nmay seem to be going well with people who disregard God. But the\nprinciple cannot be avoided:ANYONE who continually disobeys the Lord\nis headed for afall. HOW IMPORTANT, THEN, TO LIVE BY THE PRINCIPLES OF\nGOD'S WORD._ PASTOR AL___",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 7:11-17",
    "found_reading": true
  },
  {
    "message_id": "16b62a4c1f2acbe3",
    "date_utc": "Sun, 16 Jun 2019 18:34:53 -0500",
    "subject": "PASSENGERS ON A SPECK OF DUST",
    "verse": "What is man that You are mindful of him, and the son of man that You visit him? (Psalm 8:4)",
    "reflection": "Think of the question that was ask: What is man that You are mindfulof him? What came to mind here is that the earth is a mere speck ofdust traveling through the vast expanse of space, And we are the passengers,in hardily noticeable, BUT GOD, is not like man. His power is so great thatHe sees us. He knows us. He cares for us. He seeks us. He meets our need.YES, this powerful God loves us. When I think how small and helplesswe are in God's expansive and awesome creation, I'm thankful that His love is as great as His power (GOD LOVES US NOT BECAUSE OF WHO WE ARE BUT BECAUSE OF WHO HE IS)",
    "prayer": "",
    "original_content": "VERSE FOR 6/17/2019:_What is man that You are mindful of him, and the\nson of__man that You visit him_? (Ps. 8:4) READ (Ps. 8)THOUGHT FOR\nTODAY:Think of the question that was ask:_ What is man that You are\nmindful__of him?_ What came to mind here is that the earth is a mere\nspeck ofdust traveling through the vast expanse of space, And we are\nthe passengers,in hardily noticeable, BUT GOD, is not like man. His\npower is so great thatHe sees us. He knows us. He cares for us. He\nseeks us. He meets our need.YES, this powerful God loves us. When I\nthink how small and helplesswe are in God's expansive and awesome\ncreation, I'm thankful that His love is as great as His power (GOD\nLOVES US NOT BECAUSE OF WHO WE ARE BUT BECAUSE OF WHO HE IS)_ PASTOR\nAL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 8",
    "found_reading": true
  },
  {
    "message_id": "16b67fe5f7c163c2",
    "date_utc": "Mon, 17 Jun 2019 19:30:52 -0500",
    "subject": "FOUR K'S",
    "verse": "Those who know Your name trust in You, for You, Lord, have never forsaken those who seek You. (Psalm 9:10)",
    "reflection": "Sometimes the answer to our prayers don't come when we wish they would. Waiting is not always easy, but the end result, what ever it is, WILL be worth it. David put it this way, \"Those who know your name trust in You, for You, Lord, have never forsaken those who seek You. (Psalm 9:10) The beat advice is: Time spent in prayer IS ALWAYS time well spent KEEP SEEKING, KEEP TRUSTING, KEEP ASKING, KEEP PRAYING.",
    "prayer": "",
    "original_content": "VERSE FOR 6/18/2019:_Those who know Your name trust in You, for You,\nLord,__have never forsaken those who seek You._ (Ps. 9:10)READ (Ps.\n9:1-10)THOUGHT FOR TODAY:Sometimes the answer to our prayers don't\ncome when we wish they would. Waiting is not always easy, but the end\nresult, what ever it is, WILL be worth it. David put it this way,\n\"_Those who know __your name trust in You, for __You, Lord, have never\nforsaken those __who seek You. _(Ps. 9:10) The beat advice is: Time\nspent in prayer IS ALWAYS time well spent KEEP SEEKING, KEEP TRUSTING,\nKEEP ASKING, KEEP PRAYING._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 9:1-10",
    "found_reading": true
  },
  {
    "message_id": "16b6d367066fc195",
    "date_utc": "Tue, 18 Jun 2019 19:50:13 -0500",
    "subject": "GOD HAS HIS EYE ON YOU",
    "verse": "But You, God, see the trouble of the afflicted; You consider their grief and take it in hand. The victims commit themselves to You; You are the helper of the fatherless. (Psalm 10:14)",
    "reflection": "There is so much on the news today, about young people being kidnapped & killed. WHY do the young people keep dying at the hands of ruthless killers? The answer can be found in Psalm 10. The wicked act horribly because, in their thoughts there is no room for God. (v. 4) \"From ambush he murders the innocent.\" (v. 8) Thinking, \"God will never notice\" (v. 11). Murder and violence result when people don't think God sees or cares what they do. BUTGod does, and He will avenge the murder of the innocent (Vs. 14-15). WE CAN BE ASSURED THAT GOD'S JUSTICE WILL PREVAIL.",
    "prayer": "",
    "original_content": "VERSE FOR 6/19/2019:_But You, God, see the trouble of the afflicted;\n__You consider their __grief and take it in hand. The __the victims\ncommit themselves __to You; You are_ _the helper of the fatherless._\n(Ps. 10:14) READ(Ps. 10:1-15)THOUGHT FOR TODAY:There is so much on the\nnews today, about young people being kidnaped & killed. WHY do the\nyoung people keep dying at the hands of ruthless killers? The answer\ncan be found in Ps. 10. The wicked act horribly because, in their\nthoughts there is no room for God. (v. 4) \"From ambush he murders the\ninnocent.\" (v. 8) Thinking, \"God will never notice\" (v. 11). Murder\nand violence result when people don't think God sees or cares what\nthey do. BUTGod does, and He will avenge the murder of the innocent\n(Vs. 14-15). WE CAN BE ASSURED THAT GOD'S JUSTICE WILL PREVAIL._\nPASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 10:1-15",
    "found_reading": true
  },
  {
    "message_id": "16b724a2e4ba7e70",
    "date_utc": "Wed, 19 Jun 2019 19:29:53 -0500",
    "subject": "SPIRITUAL SLUMP",
    "verse": "How long, Lord? Will You forget me forever? How long will You hide Your face from me? (Psalm 13:1)",
    "reflection": "A spiritual slump can make us feel forsaken byGod. We struggle with troubling thoughts. ourhearts become sorrowful. We're sure that we'refighting a losing battle. Are you in a slump? plead with God, trust Him, and praise His name.Then get back in the game. FEED YOUR FAITH ANDYOUR DOUBTS WILL STARVE TO DEATH.",
    "prayer": "",
    "original_content": "VERSE FOR 6/20/2019:_How long, Lord? Will You forget me forever?__How\nlong will You hide Your face from me?_(Ps. 13:1) READ (Ps.\n13:1-6)THOUGHT FOR TODAY:A spiritual slump can make us feel forsaken\nbyGod. We struggle with troubling thoughts. ourhearts become\nsorrowful. We're sure that we'refighting a losing battle. Are you in a\nslump? plead with God, trust Him, and praise His name.Then get back in\nthe game. FEED YOUR FAITH ANDYOUR DOUBTS WILL STARVE TO DEATH._ PASTOR\nAL___\n____",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 13:1-6",
    "found_reading": true
  },
  {
    "message_id": "16b777932bce3e9d",
    "date_utc": "Thu, 20 Jun 2019 19:39:20 -0500",
    "subject": "NOT ABANDONED",
    "verse": "How long must I wrestle with my thoughts and day after day have sorrow in my heart? (Psalm 13:2)",
    "reflection": "In Psalm 13 David expresses his grief, he addressesGod with raw and honest words, \"How long,Lord?\" I believe we've all had dark times, whenwe wonder if God has abandoned us. But likeDavid, our aching can give way to joy when we approach God honestly, plead for help, and reaffirmour trust in a God whose love for us will never waver or change. Let us keep these three thoughtsin mind: SORROW LOOKS BACK--WORRY LOOKS AROUND--AND--FAITH LOOKS UP.",
    "prayer": "",
    "original_content": "VERSE FOR 6/21/2019:_How long must I wrestle with my thoughts and__day\nafter day have sorrow in my heart?_(Ps. 13:2) REREAD (Ps.\n13:1-6)THOUGHT FOR TODAY:In Ps. 13 David expresses his grief, he\naddressesGod with raw and honest words, \"How long,Lord?\" I believe\nwe've all had dark times, whenwe wonder if God has abandoned us. But\nlikeDavid, our aching can give way to joy when we approach God\nhonestly, plead for help, and reaffirmour trust in a God whose love\nfor us will never waver or change. Let us keep these three thoughtsin\nmind: SORROW LOOKS BACK--WORRY LOOKS AROUND--AND--FAITH LOOKS UP._\nPASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 13:1-6",
    "found_reading": true
  },
  {
    "message_id": "16b7c5e158dd1e2b",
    "date_utc": "Fri, 21 Jun 2019 18:27:49 -0500",
    "subject": "ROCK SOLID INTEGRITY",
    "verse": "Lord, who may dwell in Your sacred tent? Who may live on Your holy mountain? The one whose walk is blameless, who does what is righteous, who speaks the truth from their heart. (Psalm 15:1-2)",
    "reflection": "In the first verse of Psalm 15 David asked, what kind of person could live in God's holy presence. In the second verse he answers his own question, it is one whose walk is blameless, a person of integrity. Have you examined your integrity? Does your integrity stand the test of living honestly day by day? DAVID SAID THAT IF WE DO, WE WILL NEVER BE SHAKEN (15:5).",
    "prayer": "",
    "original_content": "VERSE FOR 6/22/2019:_Lord, who may dwell in Your sacred tent? Who\n__may live on Your holy mountain? __The one whose __walk is blameless,\nwho does what is righteous, __who speaks the __truth from their\nheart._ (Ps.15:1-2) READ (Ps. 15:1-5)THOUGHT FOR TODAY:In the first\nverse of Ps. 15 David asked, what kind of person could live in God's\nholy presence. In the second verse he answers his own question, it is\none whose walk is blameless, a person of integrity. Have you examined\nyour integrity? Does your integrity stand the test of living honestly\nday by day? DAVID SAID THAT IF WE DO, WE WILL NEVER BE SHAKEN\n(15:5)._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 15:1-5",
    "found_reading": true
  },
  {
    "message_id": "16b81e7aeec6b799",
    "date_utc": "Sat, 22 Jun 2019 20:16:13 -0500",
    "subject": "AWAITING TREASURES WITH NO COMPARISON",
    "verse": "Therefore my heart is glad and my tongue rejoices; my body also will rest secure. (Psalm 16:9)",
    "reflection": "If you noticed, David said, that there was no treasure more valuable than a personal relationship with God. (vs. 2, 5). I hope this has been your experience. ONLY because of Jesus's own death and resurrection, we too will rise one day (Acts 2:25-28 And we will find in heaven \"eternal pleasures\"(Psalm 16:11 NKJV).",
    "prayer": "",
    "original_content": "VERSE FOR 6/23/2019:_Therefore my heart is glad and my tongue\nrejoices;__my body also will rest secure. _(Ps. 16:9) READ(Ps.\n16:1:11)THOUGHT FOR TODAY: If you noticed, David said, that there was\nno treasure more valuable than a personal relationship with God. (vs.\n2, 5). I hope this has been your experience. ONLY because of Jesus's\nown death and resurrection, we too will rise one day (Acts 2:25-28 And\nwe will find in heaven \"eternal pleasures\"(Ps. 16:11 NKJV)._ PASTOR\nAL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 16:1:11",
    "found_reading": true
  },
  {
    "message_id": "16b863a6a8d0086d",
    "date_utc": "Sun, 23 Jun 2019 16:25:04 -0500",
    "subject": "A DIRECT LINE",
    "verse": "In my distress I called to the Lord; I cried to my God for help. from His temple He heard my voice; my cry came before Him, into His ears. (Psalm 18:8)",
    "reflection": "David could say, \"I love You, Lord\" because he understood God was a fortress, a rock, and a deliver (vs. 1-2). God was his shield, his salvation, and his stronghold. Maybe we have a hard time understanding David's praise because we have not experienced God's help. Is it because we reach for the phone before going to God for advice and help.",
    "prayer": "",
    "original_content": "VERSE FOR 6/24/19:_In my distress I called to the Lord; I cried to\nmy__God for help. from His temple He heard my voice;__my cry came\nbefore Him, into His ears._ (Ps. 18:8)READ (Ps. 18:1-8)THOUGHT FOR\nTODAY GOD WAS A FOR:David could say, \"I love You, Lord\" because\nheunderstood God was a fortress, a rock, and a deliver (vs. 1-2). God\nwas his shield, his salvation, and his stronghold. Maybe we have a\nhard time understanding David's praise because we have not experienced\nGod's help. Is it because we reach for the phone before going to God\nfor advice and help._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 18:1-8",
    "found_reading": true
  },
  {
    "message_id": "16b8c39b3256caba",
    "date_utc": "Mon, 24 Jun 2019 20:22:00 -0500",
    "subject": "OUR GREAT GOD",
    "verse": "The heavens declare the glory of God; the skies proclaim the work of His hands. (Psalm 19:1)",
    "reflection": "What is truly interesting is the fact that God hastaken a personal interest in us. that is truly fascinating when you think about the universe He created. The earth has a perfect amount of oxygen and nitrogen to sustain mankind. There are many other facts about the universethat I don't have the room to explain that makes man seem quiet insignificant yet God had such a love for us that He sent His own Son to die for our sins. YES ALL CREATION IS AN OUTSTRETCHED FINGER POINTING TOWARD GOD.",
    "prayer": "",
    "original_content": "VERSE FOR6/25/19:_The heavens declare the glory of God; the\nskies__proclaim the work of His hands._ (Ps. 19:1) READ(Ps.\n19:1-4)THOUGHT FOR TODAY:What is truly interesting is the fact that\nGod hastaken a personal interest in us. that is truly fascinating when\nyou think about the universe He created. The earth has a perfect\namount of oxygen and nitrogen to sustain mankind. There are many other\nfacts about the universethat I don't have the room to explain that\nmakes man seem quiet insignificant yet God had such a love for us that\nHe sent His own Son to die for our sins. YES ALL CREATION IS AN\nOUTSTRETCHED FINGER POINTING TOWARD GOD._ PASTOR AL_",
    "found_verse": false,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 19:1-4",
    "found_reading": true
  },
  {
    "message_id": "16b91687a55c89a0",
    "date_utc": "Tue, 25 Jun 2019 20:31:12 -0500",
    "subject": "MISPLACE TRUST",
    "verse": "Some trust in chariots and some in horses, but we trust in the name of the Lord our God. (Psalm 20:7)",
    "reflection": "Where have you placed your trust? In (Psalm 20:7) David says, \"Some trust in chariots and some in horses, but wetrust in the name of the Lord our God.\" Chariots and horsesrepresent material and human assets. They may be useful in our daily life, but they don't give us security in times oftrouble. Those who trust in their chariots and horses can be\"brought to their knees and fall,\" BUT those who trust in Goodwill \"rise up and stand firm\" (v. 8)IN A WORLD OF CHANGE, WE CAN TRUST OUR UNCHANGING GOD.",
    "prayer": "",
    "original_content": "VERSE FOR 6/26/19:_Some trust in chariots and some in horses, but we\n__trust __in the name of the Lord our God._ (Ps.20:7) READ (Ps.\n20)THOUGHT FOR TODAY:Where have you placed your trust? In (Ps. 20:7)\nDavid says, \"Some trust in chariots and some in horses, but wetrust in\nthe name of the Lord our God.\" Chariots and horsesrepresent material\nand human assets. They may be useful in our daily life, but they don't\ngive us security in times oftrouble. Those who trust in their chariots\nand horses can be\"brought to their knees and fall,\" BUT those who\ntrust in Godwill \"rise up and stand firm\" (v. 8)IN A WORLD OF CHANGE,\nWE CAN TRUST OUR UNCHANGING GOD._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 20",
    "found_reading": true
  },
  {
    "message_id": "16b9659b5bf92f1a",
    "date_utc": "Wed, 26 Jun 2019 19:33:10 -0500",
    "subject": "EVALUATING OUR DESIRES",
    "verse": "Take delight in the Lord, and He will give you the desires of your heart. (Psalm 37:4)",
    "reflection": "It is natural to spend time thinking about where we'd like to be or what we'd like to be, but let us remember to always reevaluate our desires to make sure they are consistent with what God says will truly satisfy. Whenour desires conform to God's will, we're not likely to waste time wishing for things that can't satisfy. REAL JOY COMES NOT IN GETTING WHAT WE WANT, BUT INWANTING TO BE CLOSE TO GOD.",
    "prayer": "",
    "original_content": "VERSE FOR 6/27/19:_Take delight in the Lord, and He will give you_\n_the __desires of your heart._ (Ps. 37:4) REREAD (Ps. 21:1-7)THOUGHT\nFOR TODAY:It is natural to spend time thinking about where we'd like\nto be or what we'd like to be, but let us rememberto always reevaluate\nour desires to make sure they are consistent with what God says will\ntruly satisfy. Whenour desires conform to God's will, we're not likely\nto waste time wishing for things that can't satisfy. REAL JOY COMES\nNOT IN GETTING WHAT WE WANT, BUT INWANTING TO BE CLOSE TO GOD._ PASTOR\nAL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 21:1-7",
    "found_reading": true
  },
  {
    "message_id": "16b9b61a84579c30",
    "date_utc": "Thu, 27 Jun 2019 18:59:57 -0500",
    "subject": "HOPE FOR WORRIERS",
    "verse": "The Lord is my shepherd, I lack nothing. (Psalm 23:1)",
    "reflection": "If you're a worrier, there's hope for you. Rick Warren,the author of The purpose Driven Life, wrote: \"When you think about a problem over and over in your mind, that's called worry .When you think about God's Word over and over in your mind, that's meditation. The more we meditate on God's Word the less we need to worry.GOD USES THOSE WHO CAN HONESTLY SAY, \"THE LORD IS MY SHEPHERD.\"",
    "prayer": "",
    "original_content": "VERSE FOR 6/28/19:_The Lord is my shepherd, I lack nothing._ (Ps.\n23:1)READ Psalm 23 once again!THOUGHT FOR TODAY:If you're a worrier,\nthere's hope for you. Rick Warren,the author of _The purpose Driven\nLife, _wrote: \"When you think about a problem over and over in your\nmind, that's called worry .When you think about God's Word over and\nover in your mind, that's _meditation._ The more we meditate on God's\nWord the less we need to worry.GOD USES THOSE WHO CAN HONESTLY SAY,\n\"THE LORD IS MY SHEPHERD.\" _ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 23",
    "found_reading": true
  },
  {
    "message_id": "16ba437874080ebe",
    "date_utc": "Sat, 29 Jun 2019 12:10:31 -0500",
    "subject": "CLEAN HANDS",
    "verse": "WHO may ascend the mountain of the Lord? WHO may stand in His holy place? THE ONE who has clean hands and a pure heart, WHO does not trust in an idol or swear by a false god. (Psalm 24:3-4)",
    "reflection": "Wherever we go now days we see signs encouraging us to wash our hands. We see in these two vss. that David spoke of the importance of clean hands, but for a very different reason. HERE \"CLEAN HANDS,\" is notin reference to personal hygiene BUT a metaphor for our spiritual condition being cleansed from sin. (I John 1:9) IT SPEAKS OF A LIFE COMMITTED TO WHAT IS RIGHT AND GODLY ENABLING US TO STAND BEFORE OUR LORD IN THE PRIVILEGE OF WORSHIP.",
    "prayer": "",
    "original_content": "VERSE FOR 6/29/19:WHO may ascend the mountain of the Lord?WHO may\nstand in His holy place? THE ONEwho has clean hands and a pure heart,\nWHOdoes not trust in an idol or swear by a false god.(Ps. 24:3-4) READ\nALL OF (Ps. 24)THOUGHT FOR TODAY:Wherever we go now days we see signs\nencouraging us to wash our hands. We see in these two vss. that David\nspoke of the importance of clean hands, but for a very different\nreason. HERE \"CLEAN HANDS,\" is notin reference to personal hygiene BUT\na metaphor for our spiritual condition being cleansed from sin. (I Jn.\n1:9) IT SPEAKS OF A LIFE COMMITTED TO WHAT IS RIGHT AND GODLY ENABLING\nUS TO STAND BEFORE OUR LORD IN THE PRIVILEGE OF WORSHIP._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 24",
    "found_reading": true
  },
  {
    "message_id": "16ba5fa459065811",
    "date_utc": "Sat, 29 Jun 2019 20:22:51 -0500",
    "subject": "ALWAY WITH YOU",
    "verse": "I am with you and will watch over you wherever you go, and I will bring you back to this land. I will not leave you until I have done what I have promised you. (Genesis 28:15)",
    "reflection": "Why do we so often try to go it alone in life when at every momentwe have access to God? Didn't He say: \"I am with you and will watchover you wherever you go?\" (Genesis 28:15) Doesn't He also assure us:that \"He will never leave us or forsake? (Hebrews 13:5). What a comfort to know that God is always with us--we don't need to go through life alone. GOD'S PRESENCE BRING GREAT COMFORT.",
    "prayer": "",
    "original_content": "VERSE FOR 6/30/19:_I am with you and will watch over you wherever yo\ngo, and I will__bring you back to this land. I will not leave you\nuntil I have done__what I have promised you._ (Gen. 28:15) READ (Ps.\n25:4-10)THOUGHT FOR TODAY:Why do we so often try to go it alone in\nlife when at every momentwe have access to God? Didn't He say: \"I am\nwith you and will watchover you wherever you go?\" (Gen 28:15) Doesn't\nHe also assure us:that \"He will never leave us or forsake? (Heb.\n13:5). What a comfort to know that God is always with us--we don't\nneed to go through life alone. GOD'S PRESENCE BRING GREAT COMFORT._\nPASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 25:4-10",
    "found_reading": true
  },
  {
    "message_id": "16bab03ab0cdb85d",
    "date_utc": "Sun, 30 Jun 2019 19:51:13 -0500",
    "subject": "ALWAYS DO RIGHT",
    "verse": "Test me, Lord, and try me, examine my heart and my mind. (Psalm 26:2)",
    "reflection": "Mark Twain once said \"Always do right. This will gratify some people and astonish the rest.\" There is a lot of truth in that statement. People are often surprised when someone does what is right. Doing what's right IS NOT a new idea. David finally realized what it took to walk in integrity. What will; doing right cost you? Some worldly entertainment? Some money at tax time? Some travel time on the highway because you obeyed the speed limit? Are any of these things worth more than honoring the Lord with your integrity? THEY WHO DO NOT LIVE UP TO THEIR IDEALS SOON FIND THAT THEY HAVE LOST THEM.",
    "prayer": "",
    "original_content": "VERSE FOR 7/1/19:\n\n_Test me, Lord, and try me, examine my heart and my mind. _(Ps. 26:2)\n\nTHOUGHT FOR TODAY:\n\nMark Twain once said \"Always do right. This will gratify some people\n\nand astonish the rest.\" There is a lot of truth in that statement.\nPeople\n\nare often surprised when someone does what is right. Doing what's\nright\n\nIS NOT a new idea. David finally realized what it took to walk in\nintegrity.\n\nWhat will; doing right cost you? Some worldly entertainment? Some\n\nmoney at tax time? Some travel time on the highway because you obeyed\n\nthe speed limit? Are any of these things worth more than honoring the\n\nLord with your integrity? _THEY WHO DO NOT LIVE UP TO THEIR IDEALS\nSOON_\n\n_FIND THAT THEY HAVE LOST THEM._\n\n_ PASTOR AL _",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalm 26",
    "found_reading": true
  }
]
