[
  {
    "message_id": "16bb03dbfc2cb58a",
    "date_utc": "Mon, 01 Jul 2019 20:12:45 -0500",
    "subject": "HE UNDERSTANDS",
    "verse": "(Ps. 27:1-8)The Lord is my light and salvation--whom shall I fear? The Lord is stronghold of my life--of",
    "reflection": "Jesus understands our fears and problems, so whenwe describe our struggles to Him, He doesn't brush us aside, He doesn't minimize our feelings,or tell us to snap out of it, He relates to our distress.Somehow, knowing that He understand can dispelthe loneliness that often accompanies suffering.IN OUR DARKEST TIMES, HE IS OUR LIGHT AND OUR SALVATION. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/2/19: (Ps. 27:1-8)_The Lord is my light and\nsalvation--whom shall I fear? __The Lord is stronghold of my life--of\nwhom__shall I be afraid?_ (Ps. 27:1)THOUGHT FOR TODAY:Jesus\nunderstands our fears and problems, so whenwe describe our struggles\nto Him, He doesn't brush us aside, He doesn't minimize our feelings,or\ntell us to snap out of it, He relates to our distress.Somehow, knowing\nthat He understand can dispelthe loneliness that often accompanies\nsuffering.IN OUR DARKEST TIMES, HE IS OUR LIGHT AND OUR SALVATION._\nPASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16bb52deffe1ca85",
    "date_utc": "Tue, 02 Jul 2019 19:13:35 -0500",
    "subject": "A DOUBLE PROMISE",
    "verse": "(Ps. 29) The Lord gives strength to His people; The Lord blesses Hispeople",
    "reflection": "Are you facing a difficulty--the lose of a loved one--a severe physical or emotional crises? turn it over to God. You'll havemany trying days, BUT He'll give you the strength to go on andHis peace to comfort your soul. Claim the double promise of(Ps. 29:11) as your own. THE SECRET OF PEACE IS TO GIVE ALLYOUR ANXIETIES TO GOD. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/3/19: (Ps. 29)\n_The Lord gives strength to His people; The Lord blesses His__people\nwith peace._ (Ps. 29:11)THOUGHT FOR TODAY:Are you facing a\ndifficulty--the lose of a loved one--a severe physical or emotional\ncrises? turn it over to God. You'll havemany trying days, BUT He'll\ngive you the strength to go on andHis peace to comfort your soul.\nClaim the double promise of(Ps. 29:11) as your own. THE SECRET OF\nPEACE IS TO GIVE ALLYOUR ANXIETIES TO GOD. _PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16bb962b60267a4c",
    "date_utc": "Wed, 03 Jul 2019 14:49:43 -0500",
    "subject": "PRAY FOR OUR NATION",
    "verse": "(Ps. 122:6-9) READ (2 Chron. 7:16)I urge . . . that petitions, prayers, intercession and be made for all people. (I",
    "reflection": "The Bible reveals that God intervenes in the affairs of nations (2 Chron. 7:14). And when God intervenes He uses ordinary people. It is up to us to do that through prayer. As the psalmist urged the ancient Israelites to pray for the peace and healing of Jerusalem, so we should also pray for the peace and healing of our nations. When we pray in humility, turn from our sins, and seek God, He hears us. PRAYER FOR THOSE IN AUTHORITY IS BOTH A PRIVILEGE AND A DUTY. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/4/19: (Ps. 122:6-9) READ (2 Chron. 7:16)_I urge . . .\nthat petitions, prayers, inter_cession and be made for all people. (I\nTim. 2:1)THOUGHT FOR TODAY:The Bible reveals that God intervenes in\nthe affairs of nations (2 Chron. 7:14). And when God intervenes He\nuses ordinary people. It is up to us to do that through prayer. As the\npsalmist urged the ancient Israelites to pray for the peace and\nhealing of Jerusalem, so we should also pray for the peace and healing\nof our nations. When we pray in humility, turn from our sins, and seek\nGod, He hears us. PRAYER FOR THOSE IN AUTHORITY IS BOTH A PRIVILEGE\nAND A DUTY._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "2",
    "found_reading": true
  },
  {
    "message_id": "16bbf93a22fee9fa",
    "date_utc": "Thu, 04 Jul 2019 19:40:52 -0500",
    "subject": "READY TO GO",
    "verse": "(Ps. 30)His anger lasts only a moment, BUT His favor lasts a lifetime;weeping may stay for the night, BUT rejoicing",
    "reflection": "Life in heaven is far better than anything earth can offer, YET wedo our best to avoid dying. If we get sick, we pray for recovery.The psalmist was no different, as we see in Ps. 30. We don't need to feel guilty about not wanting to die and go to heaven. God madeus that way. We need to keep walking with Him, doing His will,and trust Him to meet our needs. When we are called home to heaven, by grace we will be ready to go.DEATH IS THE LAST CHAPTER ON TIME, BUT THE FIRST CHAPTER ON ETERNITY. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/5/19: (Ps. 30)_His anger lasts only a moment, BUT His\nfavor lasts a lifetime;__weeping may stay for the night, BUT rejoicing\ncomes in the __morning._ (Ps. 30:5)THOUGHT FOR TODAY:Life in heaven is\nfar better than anything earth can offer, YET wedo our best to avoid\ndying. If we get sick, we pray for recovery.The psalmist was no\ndifferent, as we see in Ps. 30. We don't need to feel guilty about not\nwanting to die and go to heaven. God madeus that way. We need to keep\nwalking with Him, doing His will,and trust Him to meet our needs. When\nwe are called home to heaven, by grace we will be ready to go.DEATH IS\nTHE LAST CHAPTER ON TIME, BUT THE FIRST CHAPTER ON ETERNITY._ PASTOR\nAL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16bc4ba7fe81fcd0",
    "date_utc": "Fri, 05 Jul 2019 19:41:25 -0500",
    "subject": "DAVID'S HIDING PLACE",
    "verse": "Turn Your ear to me, come quickly to my rescue; be my rock and refuge,a strong fortress to save me. Since You are my rock and my fortress, forthe sake of Your name lead and guide me",
    "reflection": "Protection comes in many forms. Where does a believer hide whensurrounded by danger? David has the answer in Psalm 31. Rememberwhen he wrote this psalm things were not going well for him. He was in a vulnerable position, BUT he was not defenseless. David had a refuge. He knew that God is the best possible source of safety and that the wisest defense strategy is to have a right relationship with God. David calledupon the name of God. Are we as wise? Are we as quick to seek thatsame security? HE WHO WAS A SURE HIDING PLACE FOR DAVID IS ALSO THEONE WE SHOULD CLING TO FOR PROTECTION. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/6/19:_Turn Your ear to me, come quickly to my rescue; be\nmy rock and refuge,__a strong fortress to save me. Since You are my\nrock and my fortress, for__the sake of Your name lead and guide me_\n(Ps. 31:2-3)THOUGHT FOR TODAY:Protection comes in many forms. Where\ndoes a believer hide whensurrounded by danger? David has the answer in\nPsalm 31. Rememberwhen he wrote this psalm things were not going well\nfor him. He was in a vulnerable position, BUT he was not defenseless.\nDavid had a refuge. He knew that God is the best possible source of\nsafety and that the wisest defense strategy is to have a right\nrelationship with God. David calledupon the name of God. Are we as\nwise? Are we as quick to seek thatsame security? HE WHO WAS A SURE\nHIDING PLACE FOR DAVID IS ALSO THEONE WE SHOULD CLING TO FOR\nPROTECTION._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 31:1-16",
    "found_reading": true
  },
  {
    "message_id": "16bc8215c3e4a627",
    "date_utc": "Sat, 06 Jul 2019 11:32:38 -0500",
    "subject": "TRUST THE CREATOR'S GUIDANCE",
    "verse": "I will instruct you and guide you in the way you should go;I will counsel you with My loving eyes on you. (Ps.",
    "reflection": "We all face storms that threaten to confuse and disorient us. It may be a doctor's office, a friend who has betrayed you, or a shattered dream. Those are the times to be especially careful.When you are blinded by life's disappointment, don't trust yourinstincts. Go to your Bible and trust God to guide you. Hepromised \"I WILL INSTRUCT YOU AND TEACH YOU IN THE WAY YOU SHOULD GO.\" (Ps. 32:8)THE CLOSER WE WALK WITH GOD, THE CLEARED WE WILL SE HIS GUIDANCE. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/7/19:_I will instruct you and guide you in the way you\nshould go;__I will counsel you with My loving eyes on you. _(Ps.\n32:8)THOUGHT FOR TODAY: We all face storms that threaten to confuse\nand disorient us. It may be a doctor's office, a friend who has\nbetrayed you, or a shattered dream. Those are the times to be\nespecially careful.When you are blinded by life's disappointment,\ndon't trust yourinstincts. Go to your Bible and trust God to guide\nyou. Hepromised \"_I WILL INSTRUCT YOU AND TEACH YOU IN THE WAY YOU\n__SHOULD GO__.\"_ (Ps. 32:8)THE CLOSER WE WALK WITH GOD, THE CLEARED WE\nWILL SE HIS GUIDANCE._ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 32",
    "found_reading": true
  },
  {
    "message_id": "16bcf117a911043b",
    "date_utc": "Sun, 07 Jul 2019 19:52:38 -0500",
    "subject": "LET'S SING",
    "verse": "Sing joyfully to the Lord, you righteous, it is fitting for the upright to praise Him. . . Sing to Him a new",
    "reflection": "Why should we sing? IS IT ONLY to prepare worshipers for the sermon? Paul would have frowned on such an idea BECAUSE he was convinced that the gospel alone, truthfully proclaimed, is (The power of God that brings salvation. (Ro. 1:16) No we sing because it is a great way to express our adoration and proclaim our faith. So let us join enthusiastically with others in praising God through song. THE LORD IS PLEASED WITH ANY MELODY OF PRAISE THAT COMES FROM THE HEART. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/8/19:_Sing joyfully to the Lord, you righteous, it is\nfitting_ _for the __upright to praise Him. . . Sing to Him a new\n__song._ (Ps. 33:1, 3,)THOUGHT FOR TODAY:Why should we sing? IS IT\nONLY to prepare worshipers for the sermon? Paul would have frowned on\nsuch an idea BECAUSE he was convinced that the gospel alone,\ntruthfully proclaimed, is _ __(The power of God that brings\n__salvation._ (Ro. 1:16) No we sing because it is a great way to\nexpress our adoration and proclaim our faith. So let us join\nenthusiastically with others in praising God through song. THE LORD IS\nPLEASED WITH ANY MELODY OF PRAISE THAT COMES FROM THE HEART._ PASTOR\nAL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "ps. 33:1-11",
    "found_reading": true
  },
  {
    "message_id": "16bd43ad1490042c",
    "date_utc": "Mon, 08 Jul 2019 19:55:53 -0500",
    "subject": "FREE FROM FEARS",
    "verse": "I sought the Lord, and He answered me; He delivered me from all my fears. (Ps. 34:4)",
    "reflection": "Fears have away of sneaking into our heart without permission. WHEN fears and worries strike, we need to read David's prayer in Psalm 34:4. How does God deliver us from our fears? When we “look to Him” (vs. 5) and when we focus on Him our fears fade; and we trust Him to be in control. David's awe of the Lord's goodness helps us put our fears into perspective. When we remember who God is and how much He loves us, we can relax into His peace. IN (VS. 9) David concludes: “Those who fear Him lack nothing,” HOW WONDERFUL TO DISCOVER THAT IN THE FEAR OF THE LORD WE CAN BE DELIVERED FROM OUR FEARS.” PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/9/19:\n\n_I sought the Lord, and He answered me; He delivered me from all my\nfears. _(Ps. 34:4)\n\nTHOUGHT FOR TODAY:\n\nFears have away of sneaking into our heart without permission. WHEN\nfears and worries strike, we need to read David's prayer in Psalm\n34:4. How does God deliver us from our fears? When we _“look to\nHim”_ (vs. 5) and when we focus on Him our fears fade; and we trust\nHim to be in control. David's awe of the Lord's goodness helps us\nput our fears into perspective. When we remember who God is and how\nmuch He loves us, we can relax into His peace. IN (VS. 9) David\nconcludes: _“Those who fear Him lack nothing,” _ HOW WONDERFUL TO\nDISCOVER THAT IN THE FEAR OF THE LORD WE CAN BE DELIVERED FROM OUR\nFEARS.”\n\n_PASTOR AL _\n\n_ _\n\n_ _",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 34:1-10",
    "found_reading": true
  },
  {
    "message_id": "16bd94c0bd2de660",
    "date_utc": "Tue, 09 Jul 2019 19:32:48 -0500",
    "subject": "JUST YOU AND GOD",
    "verse": "",
    "reflection": "Have you found yourself in an environment that is not friendly to godliness? If so what can you do? Here are some suggestions that may help you survive and even thrive. Concentrate on God goodness and depend on it. (Nah.1:7) Stay true to your convictions. (Dan. 1) Immerse yourself in the Bible. (Ps. 119:49-50) Do good to those who oppose you (Mt. 5:44) Trust God to be your companion. (Heb. 13:5) WITH GOD BEHIND YOU AND HIS ARM BENEATH YOU, YOU CAN FACE WHATEVER IS BEFORE YOU. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR7/10/19:\n\n_Contend, Lord, with those who contend with me; _\n\n_fight against those who fight against me. _(Ps. 35:1)\n\nTHOUGHT FOR TODAY:\n\nHave you found yourself in an environment that is\n\nnot friendly to godliness? If so what can you do?\n\nHere are some suggestions that may help you survive\n\nand even thrive.\n\n_Concentrate on God goodness and depend on it._ (Nah.1:7)\n\n_Stay true to your convictions. _(Dan. 1)\n\n_Immerse yourself in the Bible. _(Ps. 119:49-50)\n\n_Do good to those who oppose you_ (Mt. 5:44)\n\n_Trust God to be your companion. _(Heb. 13:5)\n\nWITH GOD BEHIND YOU AND HIS ARM BENEATH YOU,\n\nYOU CAN FACE WHATEVER IS BEFORE YOU.\n\n_PASTOR AL__ _",
    "found_verse": false,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 35:1-10",
    "found_reading": true
  },
  {
    "message_id": "16bde9aba6fa5993",
    "date_utc": "Wed, 10 Jul 2019 20:16:51 -0500",
    "subject": "ABUNDANT SUPPLY",
    "verse": "They feast on the abundance of your house; you give them drink from your river of delights. (Ps. 36:8)",
    "reflection": "Sometimes we may feel that all the demands of life have depleted our strength and there is no one to replenish it. Others cannot replenish it, but God can. In Ps. 36 we read about God's lovingkindness. It describes those who put their trust in Him and are abundantly satisfied. God gives them water from His “river of delight” (vs. 8). He is the fountain of life. We can go to God every day to supply of our needs. Let us be filled with His abundant supply, His fountain will never run dry, GOD'S LOVE IS ABUNDANT. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/11/19:\n\n_They feast on the abundance of your house; you give them drink from\nyour river of delights. _(Ps. 36:8)\n\nTHOUGHT FOR TODAY:\n\nSometimes we may feel that all the demands of life have depleted our\nstrength and there is no one to replenish it. Others cannot replenish\nit, but God can. In Ps. 36 we read about God's lovingkindness. It\ndescribes those who put their trust in Him and are abundantly\nsatisfied. God gives them water from His “river of delight” (vs.\n8). He is the fountain of life. We can go to God every day to supply\nof our needs. Let us be filled with His abundant supply, His fountain\nwill never run dry,\n\nGOD'S LOVE IS ABUNDANT.\n\n_PASTOR AL___",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16be2ff0ed90c725",
    "date_utc": "Thu, 11 Jul 2019 16:44:55 -0500",
    "subject": "STRATEGY FOR PATIENCE",
    "verse": "Trust in the Lord and do good; dwell in the land and enjoy safe pasture. . . Be still before the Lord and wait patiently for Him; do not fret when people Succeed in their ways, when they carry out their wicked schemes. (Ps. 33:3, 7)",
    "reflection": "Patient perseverance should characterize the life of every believer. In Ps. 37 God is saying, in effect, “Do what is right and trust Me. Regardless of how badly you may seem to be losing, do My will and leave the outcome to Me.” Such a strategy will not only keep us from beating ourselves but it will also lead to victory. GOD'S CLOCK IS NEVER SLOW, BUT SOMETIMES OURS IS FAST! ! ! PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/12/19:\n\n_Trust in the Lord and do good; dwell in the land and enjoy safe\npasture. . . _\n\n_Be still before the Lord and wait patiently for Him; do not fret\nwhen people _\n\n_Succeed in their ways, when they carry out their wicked schemes.\n_(Ps. 33:3, 7)__\n\nTHOUGHT FOR TODAY:\n\nPatient perseverance should characterize the life of every believer.\n\nIn Ps. 37 God is saying, in effect, “Do what is right and trust Me.\n\nRegardless of how badly you may seem to be losing, do My will and\n\nleave the outcome to Me.” Such a strategy will not only keep us\nfrom\n\nbeating ourselves but it will also lead to victory. GOD'S CLOCK IS\nNEVER\n\nSLOW, BUT SOMETIMES OURS IS FAST! ! !\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 37:1-11",
    "found_reading": true
  },
  {
    "message_id": "16be8c4873abd58e",
    "date_utc": "Fri, 12 Jul 2019 19:38:42 -0500",
    "subject": "THE PATH TO WISDOM",
    "verse": "",
    "reflection": "If you read the first 15 vs. of Ps. 38 you will notice that David poured out his struggles and complaint to God. The answer for our destructive foolishness is to grasp the wisdom of God. (PRO. 9:10) reminds us, “The fear of the Lord is the beginning of wisdom, AND knowledge of the Holy One is understanding.” Only by allowing God to transform us can we overcome the foolish decisions that cause us so much trouble. WITH HIS lOVING GUIDANCE, WE CAN FOLLOW THE PATHWAY OF GODLY WISDOM. PASTOR AL",
    "prayer": "",
    "original_content": "Yesterday there was a typ-o the text came from Ps. 37:3, 7 not 33:3,\n7\n\nVERSE FOR 7/13/19. . . . . . . . . .\n\n_Lord, I wait for You; You will answer, Lord my God. _(Ps. 38:15)\n\nTHOUGHT FOR TODAY:\n\nIf you read the first 15 vs. of Ps. 38 you will notice that David\npoured\n\nout his struggles and complaint to God. The answer for our\ndestructive\n\nfoolishness is to grasp the wisdom of God. (PRO. 9:10) reminds us,\n\n_“The _f_ear of the Lord is the beginning of wisdom, AND knowledge\nof the _\n\n_Holy One is_ understanding.” Only by allowing God to transform us\ncan\n\nwe overcome the foolish decisions that cause us so much trouble. WITH\n\nHIS lOVING GUIDANCE, WE CAN FOLLOW THE PATHWAY OF GODLY WISDOM.\n\n_PASTOR AL_",
    "found_verse": false,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 38:1-15",
    "found_reading": true
  },
  {
    "message_id": "16beda0615eb60bd",
    "date_utc": "Sat, 13 Jul 2019 18:17:19 -0500",
    "subject": "JOY IN THE MORNING (Ps. 40:1-5)",
    "verse": "For His anger lasts only for a moment, but His favor lasts a lifetime: weeping may stay for the night, but rejoicing comes in the morning. (Ps. 30:5)",
    "reflection": "Have you experienced extreme sorrow? There is a promise of future joy amid your tears as you lean upon our loving Lord. YOU CAN LEAVE YOUR SORROWS WITH JESUS THE “MAN OF SORROWS.” PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/14/19:\n\n_For His anger lasts only for a moment, but His favor lasts_\n\na lifetime: weeping may stay for the night, but rejoicing\n\ncomes in the morning. (Ps. 30:5)\n\nTHOUGHT FOR TODAY:\n\nHave you experienced extreme sorrow? There is a promise\n\nof future joy amid your tears as you lean upon our loving\n\nLord. YOU CAN LEAVE YOUR SORROWS WITH JESUS THE “MAN OF\n\nSORROWS.”\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16bf35b3ed535e7c",
    "date_utc": "Sun, 14 Jul 2019 20:59:32 -0500",
    "subject": "New Message",
    "verse": "For His anger lasts only for a moment, but His favor lasts a lifetime: weeping may stay for the night, but rejoicing comes in the morning. (Ps. 30:5)",
    "reflection": "Have you experienced extreme sorrow? There is a promise of future joy amid your tears as you lean upon our loving Lord. YOU CAN LEAVE YOUR SORROWS WITH JESUS THE “MAN OF SORROWS.” PASTOR AL",
    "prayer": "",
    "original_content": "JOY IN THE MORNING (Ps. 40:1-5)\n\nVERSE FOR 7/14/19:\n\n_For His anger lasts only for a moment, but His favor lasts_\n\na lifetime: weeping may stay for the night, but rejoicing\n\ncomes in the morning. (Ps. 30:5)\n\nTHOUGHT FOR TODAY:\n\nHave you experienced extreme sorrow? There is a promise\n\nof future joy amid your tears as you lean upon our loving\n\nLord. YOU CAN LEAVE YOUR SORROWS WITH JESUS THE “MAN OF\n\nSORROWS.”\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16bf83303b3c3c71",
    "date_utc": "Mon, 15 Jul 2019 19:33:41 -0500",
    "subject": "ONE TONGUE IS ENOUGH",
    "verse": "",
    "reflection": "Our one tongue has a lot more potential than most of us will ever put to use. A tongue devoted to God can accomplish much. Have you ever become discouraged, thinking that you have little to offer God? If you have Christ's love in your heart and a willing tongue in your mouth, you can offer them boldly to God today and begin to bring praise and honor to the lord. REMEMBER THAT LITTLE IS MUCH WHEN GOD IS IN IT! PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/16/19\n\n_My heart is stirred by a noble theme as I recite my verses_\n\n_for the king; my tongue is the pen of a skillful writer. _(Ps.\n45:1)__\n\nTHOUGHT FOR TODAY:\n\nOur one tongue has a lot more potential than most of us will\n\never put to use. A tongue devoted to God can accomplish much.\n\nHave you ever become discouraged, thinking that you have little\n\nto offer God? If you have Christ's love in your heart and a willing\n\ntongue in your mouth, you can offer them boldly to God today\n\nand begin to bring praise and honor to the lord.\n\nREMEMBER THAT LITTLE IS MUCH WHEN GOD IS IN IT!\n\n_PASTOR AL_",
    "found_verse": false,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 45",
    "found_reading": true
  },
  {
    "message_id": "16bfd3fe2ec7da29",
    "date_utc": "Tue, 16 Jul 2019 19:05:51 -0500",
    "subject": "A GOOD GOD--",
    "verse": "The Lord is a refuge for the oppressed, a stronghold In times of trouble. (Ps. 9:9)",
    "reflection": "When we experience tragedy, we may wonder about God's goodness. Is God always good? YES, He is! He DOESN'T promise that bad things will never happen to us, but He DOES promise to be “our refuge and strength.” (Ps. 46:1). He DOESN'T promise that we will NEVER walk through heart-wrenching circumstances, BUT he promises that we won't be alone (Ps. 23:4). God is good— no matter what suffering we are experiencing. EVEN WHEN we don't understand, we can say with Habakkuk, “Yet I will rejoice in the Lord, I will be joyful in God my Savior.” (Hab. 3:18). GOD TESTS OUR FAITH SO WE MAY TRUST HIS FAITHFULNESS. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/17/19:\n\n_The Lord is a refuge for the oppressed, a stronghold_\n\n_In times of trouble. _(Ps. 9:9)\n\nTHOUGHT FOR TODAY:\n\nWhen we experience tragedy, we may wonder about God's\n\ngoodness. Is God always good? YES, He is! He DOESN'T promise\n\nthat bad things will never happen to us, but He DOES promise\n\nto be “_our refuge and strength_.” (Ps. 46:1). He DOESN'T\npromise\n\nthat we will NEVER walk through heart-wrenching circumstances,\n\nBUT he promises that we won't be alone (Ps. 23:4). God is good—\n\nno matter what suffering we are experiencing. EVEN WHEN we\n\ndon't understand, we can say with Habakkuk, “Yet I will rejoice\n\nin the Lord, I will be joyful in God my Savior.” (Hab. 3:18).\n\nGOD TESTS OUR FAITH SO WE MAY TRUST HIS FAITHFULNESS.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 46--not a typ-o",
    "found_reading": true
  },
  {
    "message_id": "16c0794446dde246",
    "date_utc": "Thu, 18 Jul 2019 19:14:13 -0500",
    "subject": "THOUGHTFUL PRAISES (read all of Ps. 47",
    "verse": "For God is the King of all the earth: sing to Him a psalm of praise. (Ps. 47:7)",
    "reflection": "I wonder what God thinks about the way we sing in church. I'm NOT talking about the quality of our voices, BUT the honesty of our words. Are we being truthful? The following rewritten hymn titles might more accurately express what is in our hearts as we sing: “Just As I Am” IS “Just As I Pretend To Be” “O How I Love Jesus” BECOMES “O How I Like Jesus” “He's Everything To Me” MEANS “He's Quiet A Bit To Me” Jesus said that we are to worship Him in truth. (Jn. 4:24) LET'S TAKE UP THE CHALLENGE BY SEEKING GOD'S HELP TO MAKE THE ORIGINAL TITLES OF THESE HYMNS TRUE FOR US. PASTOR AL PS. SORRY FOR THE DELAY",
    "prayer": "",
    "original_content": "THOUGHTFUL PRAISES (read all of Ps. 47)\n\nVERSE FOR 7:18:19:\n\n_For God is the King of all the earth: sing to Him a psalm _\n\n_of praise. _(Ps. 47:7)\n\nTHOUGHT FOR TODAY:\n\nI wonder what God thinks about the way we sing in church.\n\nI'm NOT talking about the quality of our voices, BUT the honesty\n\nof our words. Are we being truthful? The following rewritten\n\nhymn titles might more accurately express what is in our hearts\n\nas we sing:\n\n“Just As I Am” IS “Just As I Pretend To Be”\n\n“O How I Love Jesus” BECOMES “O How I Like Jesus”\n\n“He's Everything To Me” MEANS “He's Quiet A Bit To Me”\n\nJesus said that we are to worship Him in truth. (Jn. 4:24)\n\nLET'S TAKE UP THE CHALLENGE BY SEEKING GOD'S HELP TO MAKE\n\nTHE ORIGINAL TITLES OF THESE HYMNS TRUE FOR US.\n\n_PASTOR AL_\n\nPS. SORRY FOR THE DELAY",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16c07eb9fe3f9c7d",
    "date_utc": "Thu, 18 Jul 2019 20:49:38 -0500",
    "subject": "HOLY IS THE LORD. . . (real all of Ps. 48)",
    "verse": "\"Holy, Holy, Holy, is the Lord Almighty; the whole earth is full of His glory.\" (Isa. 6:3)",
    "reflection": "There are some things God can't do. For example, God CANNOT tell a lie. He CAN'T do anything that conflicts with His holy character. Let me explain what this means to us on a practical level. His perfect righteousness ASSURES US that we can trust His will because He will always do what is right. (Gen. 18:25) His perfect Justice MEANS that God will be unquestionably fair. (2 Cor. 5:10) His perfect truthfulness ASSURES US that we can take Him at His word. (Num. 23:19) His perfect faithfulness TELLS US that He will never let us down. (Lam. 3:22, 23) THE HOLINESS OF GOD CONVICTS THE SINNER AND COMFORTS TO SAINT. (believer) PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/19/19:\n\n_\"Holy, Holy, Holy, is the Lord Almighty; the whole earth_\n\n_is full of His glory.\" _(Isa. 6:3)\n\nTHOUGHT FOR TODAY:\n\nThere are some things God can't do. For example, God CANNOT\n\ntell a lie. He CAN'T do anything that conflicts with His holy\n\ncharacter. Let me explain what this means to us on a practical\n\nlevel.\n\n_His perfect righteousness ASSURES US _that we can trust His will\n\nbecause He will always do what is right. (Gen. 18:25)\n\n_His perfect Justice _MEANS that God will be unquestionably fair. (2\nCor. 5:10)\n\n_His perfect truthfulness_ ASSURES US that we can take Him at His\nword. (Num. 23:19)\n\n_His perfect faithfulness_ TELLS US that He will never let us down.\n(Lam. 3:22, 23)\n\nTHE HOLINESS OF GOD CONVICTS THE SINNER AND COMFORTS TO SAINT.\n(believer)\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16c0ca8dc5fd2d78",
    "date_utc": "Fri, 19 Jul 2019 18:54:49 -0500",
    "subject": "NEED A LIFT?",
    "verse": "Surely God is my help; the Lord is the one who sustains me. (Ps. 54:4)",
    "reflection": "When life has you down---whether through sorrow that seems to hard to bear OR circumstances that make each day a morning- to-night grind-let God pull you up by His power (Ps. 54:1-4) says. Then hold on to His hand. Cling to Him, Eph. 6:10 says: \"Be strong in the Lord and His mighty power.\" Trust in His power and hold on. Isa. 49:31 say: HE WILL GIVE YOU THE STRENGTH TO KEEP YOU FROM FALLING. PASTOR SATHER'S, FOOD FOR THOUGHT",
    "prayer": "",
    "original_content": "DEVO. FOR 7/20/19: VERSE FOR TODAY:\n\n_Surely God is my help; the Lord is the one who sustains me. _(Ps.\n54:4)\n\nTHOUGHT FOR TODAY:\n\nWhen life has you down---whether through sorrow that seems\n\nto hard to bear OR circumstances that make each day a morning-\n\nto-night grind-let God pull you up by His power (Ps. 54:1-4) says.\n\nThen hold on to His hand. Cling to Him, Eph. 6:10 says:\n\n_\"Be strong in the Lord and His mighty power.\"_ Trust in His\n\n_power __and hold on. _Isa. 49:31 say:_ HE WILL GIVE YOU THE STRENGTH\n_\n\n_TO KEEP YOU FROM FALLING._\n\n_PASTOR SATHER'S, FOOD FOR THOUGHT_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 54:1-7",
    "found_reading": true
  },
  {
    "message_id": "16c11c0eda33588b",
    "date_utc": "Sat, 20 Jul 2019 18:39:12 -0500",
    "subject": "WALKING WITH GOD",
    "verse": "The eternal God is our refuge, and underneath are the everlasting arms. (Deut. 33:27)",
    "reflection": "Once you have begun to walk with God, you need only to keep waking with Him, and all of life becomes one long stroll. As we sense the strength of God's everlasting arms beneath us, we can stroll though life with confidence, as-long-as we keep our hand in the hand of our unseen Companion. We can be confident about tomorrow if we walk with God today. PASTOR AL.",
    "prayer": "",
    "original_content": "VERSE FOR 7/21/19:\n\n_The eternal God is our refuge, and underneath are the _\n\n_everlasting arms. _(Deut. 33:27)\n\nTHOUGHT FOR TODAY:\n\nOnce you have begun to walk with God, you need only\n\nto keep waking with Him, and all of life becomes one\n\nlong stroll.\n\nAs we sense the strength of God's everlasting arms beneath\n\nus, we can stroll though life with confidence, as-long-as we\n\nkeep our hand in the hand of our unseen Companion.\n\nWe can be confident about tomorrow if we walk with God\n\ntoday.\n\n_PASTOR AL._",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 56:1-4",
    "found_reading": true
  },
  {
    "message_id": "16c17293e8464719",
    "date_utc": "Sun, 21 Jul 2019 19:51:15 -0500",
    "subject": "THE POWER OF MUSIC",
    "verse": "I will sing of Your strength, in the morning I will sing of your love. (Ps. 59:16) read (Ps. 59:6-16)",
    "reflection": "It's amazing to think that David wrote this song as he was being hunted down by men seeking to kill him! Despite his circumstances, David remembered God's power and mercy, and singing of them encouraged him to go on. MAY OUR GOD GIVE US A SONG TODAY THAT WILL REMIND US OF HIS GOODNESS AND GREATNESS. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/22/19:\n\n_I will sing of Your strength, in the morning I will sing of your\nlove._\n\n_ _(Ps. 59:16) read (Ps. 59:6-16)\n\nTHOUGHT FOR TODAY:\n\nIt's amazing to think that David wrote this song as he was being\nhunted\n\ndown by men seeking to kill him! Despite his circumstances, David\n\nremembered God's power and mercy, and singing of them encouraged\n\nhim to go on. MAY OUR GOD GIVE US A SONG TODAY THAT WILL REMIND US\n\nOF HIS GOODNESS AND GREATNESS.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16c1c4f96ccc41dd",
    "date_utc": "Mon, 22 Jul 2019 19:51:14 -0500",
    "subject": "THE BEAUTY OF SILENCE",
    "verse": "",
    "reflection": "",
    "prayer": "",
    "original_content": "VERSE FOR 7/23/19:\n\n_Truly my soul finds rest in God; my salvation comes from Him._\n\n(Ps. 62:1)\n\nSOMETHING TO THINK ABOUT:\n\nWe live in a noisy world Today, RIGHT? I live next to a highway\n\nand I couldn't even guess how may trucks and cars come into\n\ntown or pass through town on this highway. But there are days\n\nwe need to close the patio door just to hear ourselves think. It is\n\nsad but often our church sanctuaries are so noisy that it leaves\n\nlittle time for quiet reflection. The Psalmist's words are still\n\nrelevant today. _\"Wait silently for God alone.\" _(Ps. 62:5) The\n\ntrick today is to find that place of silence. WHY? BECAUSE WE\n\nNEED SILENCE TO HEAR GOD'S VOICE, SO WE NEED TO TURN DOWN\n\nTHE WORLD'S VOLUME.\n\n_PASTOR AL_",
    "found_verse": false,
    "found_reflection": false,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16c21a8fe74f5b34",
    "date_utc": "Tue, 23 Jul 2019 20:46:59 -0500",
    "subject": "PREPARING FOR HEAVEN",
    "verse": "",
    "reflection": "",
    "prayer": "",
    "original_content": "VERSE FOR 7/24/19: (read Ps. 63)\n\n_You, God, are my God, earnestly I seek You; I thirst for You, my\nwhole being longs for You, in a dry and parched land where there is no\nwater. _(Ps. 63:1)\n\nTHOUGHT ON THIS SUBJECT:\n\nSome people openly declare that they don't want to go to heaven.\nMost people, however, say they hope to go to heaven when they die,\nBUT, I've often wondered what makes them think they would be happy\nthere. Now David makes no reference in Psalm 63 to spending eternity\nwith God, there is no doubt about his deep longing for the Lord. Now\nto me, that raises some heart-searching questions: How passionately do\nwe seek fellowship with God? How much time do we spend reading His\nWord, praying, and worshiping? How earnestly do we want to please Him?\nDoes our soul thirst for Him and our heart long for Him? IF SO, we can\nsay with David, _“My soul follows close behind You” _(v. 8 NKJV).\n\nONE OF LIFE'S GREATEST JOYS IS THE SURE HOPE OF HEAVEN.\n\n_PASTOR AL_",
    "found_verse": false,
    "found_reflection": false,
    "found_prayer": false,
    "reading": "Ps",
    "found_reading": true
  },
  {
    "message_id": "16c269d69ce2e75f",
    "date_utc": "Wed, 24 Jul 2019 19:52:26 -0500",
    "subject": "THE MYSTERY OF TRAGEDY",
    "verse": "",
    "reflection": "When we suffer pain or loss, we sometimes ask the question, \"If the Lord is with us, why has all this happened?\" While the Bible tells us the future of human history, it supplies no specific explanation of the events that take place daily in our lives. Sometimes when tragedy strikes we understand very little, AND are unable to fathom the mystery of disease or accidents. Are you going through circumstances you don't understand. CONTINUE TO TRUST HIS WISDOM AND GOODNESS, REMEMBER HE IS OUR QUARTERBACK. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/25/19\n\n_Praise be to God, who has not rejected my prayer or _\n\n_withheld His love from me! _(Ps. 66:20)\n\nTHOUGHT FOR TODAY:\n\nWhen we suffer pain or loss, we sometimes ask the question,\n\n_\"If the Lord is with us, why has all this happened?\"_ While\n\nthe Bible tells us the future of human history, it supplies no\n\nspecific explanation of the events that take place daily in our\n\nlives. Sometimes when tragedy strikes we understand very little,\n\nAND are unable to fathom the mystery of disease or accidents.\n\nAre you going through circumstances you don't understand.\n\nCONTINUE TO TRUST HIS WISDOM AND GOODNESS, REMEMBER HE\n\nIS OUR QUARTERBACK.\n\n_PASTOR AL_",
    "found_verse": false,
    "found_reflection": true,
    "found_prayer": false,
    "reading": ": 66:8-20",
    "found_reading": true
  },
  {
    "message_id": "16c2b91043b2893c",
    "date_utc": "Thu, 25 Jul 2019 18:57:00 -0500",
    "subject": "THE OTHER EIGHTY PERCENT",
    "verse": "",
    "reflection": "",
    "prayer": "",
    "original_content": "VERSE FOR 7/26/19:\n\n_Let heaven and earth praise Him, the seas and all that move in them.\n_(Ps. 69:34)\n\nSOMETHING TO THINK ABOUT:\n\nAs we grow to understand the wonder of creation, it must always point\nus to the Creator--Himself and call us to worship Him. as the psalmist\nsaid, _\"let heaven and earth praise Him, the seas ad all that move in\nthem\"_ (vs. 69:34). If creation itself give praise\n\nto the Creator, we can and certainly should join the chorus.\n\nWHAT A WONDERFUL GOD WE SERVE.\n\n_PASTOR AL_",
    "found_verse": false,
    "found_reflection": false,
    "found_prayer": false,
    "reading": "Ps. 69:29-36",
    "found_reading": true
  },
  {
    "message_id": "16c3137f765ef4b3",
    "date_utc": "Fri, 26 Jul 2019 21:17:27 -0500",
    "subject": "LIFE'S SEASONS",
    "verse": "",
    "reflection": "",
    "prayer": "",
    "original_content": "VERSE FOR 7/27/19:\n\n_From birth I have relied on You, You brought me forth from my\nmothers' womb.__I will ever praise You. _(Ps. 71:6)\n\nFOOD FOR THOUGHT:\n\nHow ironic! When we are young, we can't wait to grow up! When we\nare old we look back longingly to former years. God intends that we\njoyfully\n\ntake each season of life as it comes. He asks us to commit our way to\nHim\n\nand accept what He allows of struggle and what He provides of\nstrength.\n\nNow the question is, are you in life's spring time? Trust God's\ntiming to\n\nfulfil your dreams. Are you in life's summer or autumn? Face your\ndaily\n\nchallenges head on. AND if you feel winter's chill, concentrate on\nknowing\n\nGod better. HIS PRESENCE WILL MAKE EVERY SEASON OF LIFE ONE OF\nSTRENGTH\n\nAND BEAUTY.\n\n_PASTOR AL_",
    "found_verse": false,
    "found_reflection": false,
    "found_prayer": false,
    "reading": "71:1-20",
    "found_reading": true
  },
  {
    "message_id": "16c360224ff82f8c",
    "date_utc": "Sat, 27 Jul 2019 19:36:46 -0500",
    "subject": "WHAT ARE YOU RUNNING TO",
    "verse": "But as for me, it is good to be near God. I have made the Sovereign Lord my refuge; I will tell of all Your deeds. (Ps. 73:28)",
    "reflection": "The psalmist knew what he was running from. He had been living from doubt and despair. But now he knew where he was going to run and why. He sang, \"It is good to be near God . . . I will tell of all Your deeds\" (Ps. 73:28). He also said, \"You guide me with your counsel, and after- ward You will take me into glory\" (vs. 24). Have you figured out what you are running from? MORE IMPORTANT, DO YOU KNOW WHAT YOU ARE RUNNING TO. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/28/19:\n\n_But as for me, it is good to be near God. I have made the Sovereign_\n\n_Lord my refuge; I will tell of all Your deeds. _(Ps. 73:28)\n\nTHOUGHT FOR TODAY:\n\nThe psalmist knew what he was running from. He had been living from\n\ndoubt and despair. But now he knew where he was going to run and why.\n\nHe sang, \"It is good to be near God . . . I will tell of all Your\ndeeds\"\n\n(Ps. 73:28). He also said, \"You guide me with your counsel, and\nafter-\n\nward You will take me into glory\" (vs. 24). Have you figured out what\n\nyou are running from? MORE IMPORTANT, DO YOU KNOW WHAT YOU ARE\n\nRUNNING TO.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 73",
    "found_reading": true
  },
  {
    "message_id": "16c3b8ce5ad15be1",
    "date_utc": "Sun, 28 Jul 2019 21:26:25 -0500",
    "subject": "DAYS OF DOUBT",
    "verse": "I will remember the deeds of the Lord; yes, I will remember Your miracles of long ago. (Ps. 77:11)",
    "reflection": "If you will read all of Ps. 77 you will see that the faith of the psalmist was floundering. AFTER listing his serious doubts, he asked, \"Has God forgotten to be merciful?\" (v. 9) THEN SUDDENLY he stopped and said, I will remember the deeds of the Lord, yes, I will remember your miracles of long ago\" (v. 11). The act of remembering obviously revived his faith. SO why not create your own book of remembrance, recording God's wonderful deeds? THEN READ IT OFTEN, ESPECIALLY ON DAYS OF DOUBT. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/29/19:\n\n_I will remember the deeds of the Lord; yes, I will remember Your _\n\n_miracles of long ago. _(Ps. 77:11)\n\nTHOUGHT FOR TODAY:\n\nIf you will read all of Ps. 77 you will see that the faith of the\npsalmist\n\nwas floundering. AFTER listing his serious doubts, he asked, \"_Has\nGod_\n\n_forgotten to be merciful?\"_ (v. 9) THEN SUDDENLY he stopped and\nsaid,\n\n_I will remember the deeds of the Lord, yes, I will remember your_\n\n_miracles of long ago\" _(v. 11). The act of remembering obviously\n\nrevived his faith. SO why not create your own book of remembrance,\n\nrecording God's wonderful deeds? THEN READ IT OFTEN, ESPECIALLY ON\n\nDAYS OF DOUBT.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "all of Ps. 77",
    "found_reading": true
  },
  {
    "message_id": "16c4092b8f3c8b0d",
    "date_utc": "Mon, 29 Jul 2019 20:50:53 -0500",
    "subject": "A PATTERN FOR PARENTS",
    "verse": "Fathers, don't exasperate your children; instead, bring them up in the training and instruction of the Lord. (Eph. 6:4).",
    "reflection": "A man was having a little chat with his young son. He was trying to tell him what a Christian should be like and how he should act. When he was finished talking, his son looked at him and asked a stunning question. The boy asked, \"Daddy have I seen a Christian?\" What a telling commentary on the life of the father, and any other father. How would we feel if our children were to ask us this same question. Psalm 78 gives us some help in making sure that doesn't happen. It sets forth a pattern for parenting. Be sure to read the first 7 verses of Ps. 78. Here is a point to remember: CHILDREN MAY CLOSE THEIR EARS TO ADVICE, BUT THEY KEEP THEIR EYES OPEN TO EXAMPLE.",
    "prayer": ".",
    "original_content": "VERSE FOR 7/30/19:\n\n_Fathers, don't exasperate your children; instead, bring them up in_\n\n_the training and instruction of the Lord. _(Eph. 6:4).\n\nTHOUGHT FOR TODAY:\n\nA man was having a little chat with his young son. He was trying\n\nto tell him what a Christian should be like and how he should act.\n\nWhen he was finished talking, his son looked at him and asked a\n\nstunning question. The boy asked, \"Daddy have I seen a Christian?\"\n\nWhat a telling commentary on the life of the father, and any other\n\nfather. How would we feel if our children were to ask us this same\n\nquestion. Psalm 78 gives us some help in making sure that doesn't\n\nhappen. It sets forth a pattern for parenting. Be sure to read the\nfirst\n\n7 verses of Ps. 78. Here is a point to remember: CHILDREN MAY CLOSE\n\nTHEIR EARS TO ADVICE, BUT THEY KEEP THEIR EYES OPEN TO EXAMPLE.\n\nPASTOR AL.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "78:1-7",
    "found_reading": true
  },
  {
    "message_id": "16c45b2cb1107f12",
    "date_utc": "Tue, 30 Jul 2019 20:44:01 -0500",
    "subject": "WHEN GOD THUNDERS",
    "verse": "In your distress you called and I rescued you, I answered you out of a thundercloud; I tested you at the waters of Meribah. (Ps. 81:7)",
    "reflection": "Are you in trouble? Cry out to God in your sorrow and distress. You may not hear the thunder roll, but if you trust in God He will speak comforting words to your heart through His Word and deliver you from your fears. THOSE WHO TRUST IN GOD FIND COMFORT IN HIS POWER. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 7/31/19:\n\n_In your distress you called and I rescued you,_\n\n_I answered you out of a thundercloud; I tested_\n\n_you at the waters of Meribah. _(Ps. 81:7)\n\nTHOUGHT FOR TODAY:\n\nAre you in trouble? Cry out to God in your sorrow\n\nand distress. You may not hear the thunder roll, but\n\nif you trust in God He will speak comforting words\n\nto your heart through His Word and deliver you from\n\nyour fears. THOSE WHO TRUST IN GOD FIND COMFORT IN\n\nHIS POWER.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 81:6-10",
    "found_reading": true
  },
  {
    "message_id": "16c4a944615522f1",
    "date_utc": "Wed, 31 Jul 2019 19:28:47 -0500",
    "subject": "HELP THE CHILDREN",
    "verse": "\"Whoever welcomes one of these little children in My name welcomes Me; and whoever welcomes Me does not welcome Me but the One who sent Me.\" (Mk. 9:37)",
    "reflection": "The hurting children of the world need two things: First, the gospel of Jesus, who told us that in helping them we would be doing His work (Mk. 9:37). And second, they need the hope that comes from someone who cares enough to feed, cloth, and shelter them. What can your family do to help the children? GIVE HOPE TO A CHILD, SHARE THE LOVE OF CHRIST. PASTOR AL",
    "prayer": "",
    "original_content": "VERSE FOR 8/1/31:\n\n_\"Whoever welcomes one of these little children in My_\n\n_name welcomes Me; and whoever welcomes Me does_\n\n_not welcome Me but the One who sent Me.\" _(Mk. 9:37)\n\nTHOUGHT FOR TODAY:\n\nThe hurting children of the world need two things: First,\n\nthe gospel of Jesus, who told us that in helping them we\n\nwould be doing His work (Mk. 9:37). And second, they\n\nneed the hope that comes from someone who cares enough\n\nto feed, cloth, and shelter them. What can your family do\n\nto help the children? GIVE HOPE TO A CHILD, SHARE THE LOVE\n\nOF CHRIST.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Ps. 82",
    "found_reading": true
  }
]