[
  {
    "message_id": "1421324abc58e148",
    "date_utc": "Fri, 1 Nov 2013 05:05:59 -0500",
    "subject": "thoughts to live by",
    "verse": "6 Now I know that the Lord rescues his anointed king. He will answer him from his holy heaven and rescue him by his great power. 7 Some nations boast of their chariots and horses, but we boast in the name of the Lord our God.",
    "reflection": "The number of David's opponents meant nothing as long as he was on the Lord's side. Victory is \"not by force nor by strength, but by the Spirit, says the Lord Almighty. Are you on the Lord's side? You may never face an enemy army, but the battles you face every day can be won with the Lord's strength. .",
    "prayer": "Dear Lord, you know that I have never faced an enemy army-but I need your strength to win my battles against Satan, the world, and my own flesh. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 20:6-7 (NLT)\n\n6 Now I know that the Lord rescues his anointed king. He will answer him\nfrom his holy heaven and rescue him by his great power.\n\n7 Some nations boast of their chariots and horses, but we boast in the name\nof the Lord our God. \n\nToday's Thoughts:\n\nThe number of David's opponents meant nothing as long as he was on the\nLord's side.\n\nVictory is \"not by force nor by strength, but by the Spirit, says the Lord\nAlmighty.\n\n\n\nAre you on the Lord's side? You may never face an enemy army, but the\nbattles you\n\nface every day can be won with the Lord's strength. .\n\nToday's Prayer Suggestion:\n\nDear Lord, you know that I have never faced an enemy army-but I need your\nstrength\n\nto win my battles against Satan, the world, and my own flesh. Amen. \n\n\n\nPastor Alvin and Marcie Sather\n\nIf anyone is in Christ, he is a new creation;\n\nThe old has gone, the new has come. (2 Cor. 5:17) NIV",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "142186278442a437",
    "date_utc": "Sat, 2 Nov 2013 05:36:15 -0500",
    "subject": "thoughts to live by",
    "verse": "8 Those nations will fall down and collapse, but we will rise up and stand firm. 9 Give victory to our king, O Lord! Answer our cry for help.",
    "reflection": "No nation will stand that puts their total trust in their military. The Lord alone is able to hear and save. By a Carpenter mankind was made, and only by that Carpenter can mankind be remade.",
    "prayer": "Dear Lord, I pray that You would increase in me a faith, a hope, and a trust in Your grace and mercy. Forgive me for following anyone or anything else. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 20:8-9\n\n8 Those nations will fall down and collapse, but we will rise up and stand\nfirm. \n9 Give victory to our king, O Lord! Answer our cry for help.\n\nToday's Thoughts:\n\nNo nation will stand that puts their total trust in their military.\n\nThe Lord alone is able to hear and save. .\n\n\n\nBy a Carpenter mankind was made, and only by that Carpenter\n\ncan mankind be remade. \n\nToday's Prayer Suggestion:\n\nDear Lord, I pray that You would increase in me a faith, a hope, and a trust\n\nin Your grace and mercy. Forgive me for following anyone or anything else. .\n. Amen. \n\n\n\nPastor Al & Marcie Sather\n\n\"Fear of the Lord is the beginning of wisdom.\" Pro. 1:7",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1421dab46e9b867b",
    "date_utc": "Sun, 3 Nov 2013 05:13:52 -0600",
    "subject": "thoughts to live by",
    "verse": "1 How the king rejoices in your strength, O Lord! He shouts with joy because You give him victory. 6 You have endowed him with eternal blessings and given him the joy of Your presence.",
    "reflection": "In vs. 1-6 David described all that he had as gifts from God: his heart's desiresuccess and prosperity-a crown of fine gold-long life-splendor and majestyeternal blessing-and joy. We, too, must look upon all that we have-position-family-wealth-talentas a gift from God. Only then will we use them to give glory back to Him.",
    "prayer": "Dear Heavenly Father, help me remember every day is a gift from You and all that I have is only possible because You sustain me down to the air that I breathe. Help me to use the gifts I have received to give glory to You. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 21:1, 6\n\n1 How the king rejoices in your strength, O Lord! He shouts with joy because\nYou give him victory. \n\n6 You have endowed him with eternal blessings and given him the joy of Your\npresence.\n\nToday's Thoughts:\n\nIn vs. 1-6 David described all that he had as gifts from God: his heart's\ndesiresuccess and prosperity-a crown of fine gold-long life-splendor and majestyeternal blessing-and joy. \n\nWe, too, must look upon all that we have-position-family-wealth-talentas a gift from God. Only then will we use them to give glory back to Him.\n\nToday's Prayer Suggestion:\n\nDear Heavenly Father, help me remember every day is a gift from You and\n\nall that I have is only possible because You sustain me down to the air that\n\nI breathe. Help me to use the gifts I have received to give glory to You. .\n. Amen.\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\nThere is no one righteous, not even one. Ro. 3:10\n\n\n\nThe Christian church is not a congregation of righteous people. \n\nIt is a society of those who know they are not good.\n\n(Dwight E. Stevenson)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14222abad208bb59",
    "date_utc": "Mon, 4 Nov 2013 04:32:18 -0600",
    "subject": "thoughts to live by",
    "verse": "7 For the king trusts in the Lord. The unfailing love of the Most High will keep him from stumbling.",
    "reflection": "Because David trusted in God-God would not let him stumble (be removed from his throne). When we trust in God we have permanence and stability. We may lose a great deal such as, families-jobs-material possessions-but we cannot be shaken from God's favor. He will be our foundation our solid rock-He will never leave or desert us. .",
    "prayer": "I thank You, O Lord, that I have a solid foundation in You. I thank You, for Your loving favor, that was proven by Your Son taking my place on the cross and paying the penalty in full for my sins. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Psalm 21:7 (NLT)\n\n7 For the king trusts in the Lord. The unfailing love of the Most High will\nkeep him from stumbling. \n\nToday's Thoughts:\n\nBecause David trusted in God-God would not let him stumble (be removed from\nhis throne).\n\nWhen we trust in God we have permanence and stability. We may lose a great\ndeal such as,\n\nfamilies-jobs-material possessions-but we cannot be shaken from God's favor.\n\n\n\nHe will be our foundation our solid rock-He will never leave or desert us. .\n.\n\nToday's Prayer Suggestion:\n\nI thank You, O Lord, that I have a solid foundation in You.\n\nI thank You, for Your loving favor, that was proven by\n\nYour Son taking my place on the cross and paying the \n\npenalty in full for my sins. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nChoose for yourselves this day whom you will serve. (Jos. 24:15 NIV)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "142280866c69f9bb",
    "date_utc": "Tue, 5 Nov 2013 05:31:45 -0600",
    "subject": "thoughts to live by",
    "verse": "11 Although they plot against you, their evil schemes will never succeed. 12 For they will turn and run when they see your arrows aimed at them.",
    "reflection": "When you see people succeeding with evil acts, remember they will not succeed forever. Their power is only temporary, and God's very presence can send them scattering in a moment. God, according to His plan and purpose, will intervene for His people and give the wicked the judgment they deserve. We should not be dismayed when we see the temporary advantage God's enemies seem to have.",
    "prayer": "Dear Lord, Help me to always have You at the center of my life so that I may acquire Godly wisdom which is the best strength I can have. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalm 21:11-12 (NLT)\n\n11 Although they plot against you, their evil schemes will never succeed.\n\n12 For they will turn and run when they see your arrows aimed at them. \n\nToday's Thoughts:\n\nWhen you see people succeeding with evil acts, remember they will not\nsucceed forever.\n\nTheir power is only temporary, and God's very presence can send them\nscattering in a \n\nmoment. God, according to His plan and purpose, will intervene for His\npeople and give \n\nthe wicked the judgment they deserve. \n\n\n\nWe should not be dismayed when we see the temporary advantage God's enemies\nseem to have.\n\nToday's Prayer Suggestion:\n\nDear Lord, Help me to always have You at the center of my life so that I may\n\n\nacquire Godly wisdom which is the best strength I can have. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nUnless you change and become like little childern,\n\nYou will never enter the Kingom of heaven. Mat. 18:3 NIV\n\n\n\nI have never seen any stronger faith than what I have seen in a child.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1422d159feca7f16",
    "date_utc": "Wed, 6 Nov 2013 05:04:16 -0600",
    "subject": "thoughts to live by",
    "verse": "1 My God, my God, why have you abandoned me? Why are you so far away when I groan for help?",
    "reflection": "David gave an accurate description of the suffering the Messiah would endure hundreds of years later. David was obviously suffering some great trial, but through his suffering, he like the Messiah to come gained victory. The cry of the Messiah was not a cry of doubt, but an urgent appeal to God.",
    "prayer": "O Lord, great is Thy faithfulness unto me, help me to stand steadfast in Your loving kindness with no doubts in my mind. Forgive me for any questions that may come to mind when Your answers are slow in coming. Amen",
    "reading": "",
    "original_content": "Today's Verse: Psalm 22:1 (NLT)\n\n1 My God, my God, why have you abandoned me? \n\nWhy are you so far away when I groan for help? \n\nToday's Thoughts:\n\nDavid gave an accurate description of the suffering the Messiah would endure\n\nhundreds of years later. David was obviously suffering some great trial, but\n\nthrough his suffering, he like the Messiah to come gained victory.\n\nThe cry of the Messiah was not a cry of doubt, but an urgent appeal to God.\n\nToday's Prayer Suggestion:\n\nO Lord, great is Thy faithfulness unto me, help me to stand steadfast in\n\nYour loving kindness with no doubts in my mind. Forgive me for any\n\nquestions that may come to mind when Your answers are slow in coming. .\nAmen \n\n\n\nPastor Alvin and Marcie Sather\n\nMay my meditations be pleasing to him, as I rejoice in the Lord. Ps. 104\n:34",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1423290e7b4d0fa1",
    "date_utc": "Thu, 7 Nov 2013 06:37:02 -0600",
    "subject": "thoughts to live by",
    "verse": "4 Our ancestors trusted in you, and you rescued them. 5 They cried out to you and were saved. They trusted in you and were never disgraced. 6 But I am a worm and not a man. I am scorned and despised by all!",
    "reflection": "When others despise us and belittle us, they treat us as if we were less than human. After being degraded we may become like David, and feel like worms and possibly Feel like maybe they are right-maybe I am no good. When we feel the sting of rejection we need to keep in mind the hope and victory that God promises us. Yes He has said, \"I will never leave you or forsake you. \" That to us should be enough. .",
    "prayer": "O Lord, when I feel down and out, remind me that You are there for me. Remind me again of the love You have for us all and that this life is not all that there is. Remind me again of that wonderful day when I will arrive at the place You promised with no more pain or suffering-where love reigns supreme. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalm 22:4-6 (NLT)\n\n4 Our ancestors trusted in you, and you rescued them.\n\n5 They cried out to you and were saved. They trusted in you and were never\ndisgraced. \n6 But I am a worm and not a man. I am scorned and despised by all! \n\nToday's Thoughts:\n\nWhen others despise us and belittle us, they treat us as if we were less\nthan human.\n\nAfter being degraded we may become like David, and feel like worms and\npossibly\n\nFeel like maybe they are right-maybe I am no good.\n\n\n\nWhen we feel the sting of rejection we need to keep in mind the hope and\nvictory\n\nthat God promises us. Yes He has said, \"I will never leave you or forsake\nyou.\"\n\nThat to us should be enough. .\n\nToday's Prayer Suggestion:\n\nO Lord, when I feel down and out, remind me that You are there for me.\n\nRemind me again of the love You have for us all and that this life is not \n\nall that there is. Remind me again of that wonderful day when I will arrive \n\nat the place You promised with no more pain or suffering-where love \n\nreigns supreme. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nWorship the LORD with gladness; \ncome before him with joyful songs. Psalm 100:2",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1423774901dacb97",
    "date_utc": "Fri, 8 Nov 2013 05:24:14 -0600",
    "subject": "thoughts to live by",
    "verse": "You brought me safely from my mother's womb and led me to trust you at my mother's breast. 10 I was thrust into your arms at my birth. You have been my God from the moment I was born. 11 Do not stay so far from me, for trouble is near, and no one else can help me.",
    "reflection": "Be assured that God's loving concern does not begin on the Day we are born and end on the day we die. It reaches back to the days before we were born and reaches ahead along the unending path of eternity. Really our only sure help comes from a God whose concern for us reaches beyond our earthly existence. How can anyone reject such love. .",
    "prayer": "Dear Heavenly Father, where could I go while seeking a refuge for my soul? Needing a friend to help me to the end-where could I go but to You O Lord. Yes only in You can I find comfort for my soul. Thank You Lord, for this blessed assurance. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalm 22:9-11 (NLT)\n\nYou brought me safely from my mother's womb and led me to trust you at my\nmother's breast.\n\n10 I was thrust into your arms at my birth. You have been my God from the\nmoment I was born. \n11 Do not stay so far from me, for trouble is near, and no one else can help\nme. \n\nToday's Thoughts:\n\nBe assured that God's loving concern does not begin on the Day we are born\nand end on the day we die.\n\nIt reaches back to the days before we were born and reaches ahead along the\nunending path of eternity.\n\nReally our only sure help comes from a God whose concern for us reaches\nbeyond our earthly existence.\n\n\n\nHow can anyone reject such love. \n\nToday's Prayer Suggestion:\n\nDear Heavenly Father, where could I go while seeking a refuge for my soul?\n\nNeeding a friend to help me to the end-where could I go but to You O Lord.\n\nYes only in You can I find comfort for my soul. Thank You Lord, for this\n\nblessed assurance. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n\"He says, \"Be still, and know that I am God;\" Psalm 46:10",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1423c8b0d96a752c",
    "date_utc": "Sat, 9 Nov 2013 05:06:56 -0600",
    "subject": "thoughts to live by",
    "verse": "21 Snatch me from the lion's jaws and from the horns of these wild oxen. 22 I will proclaim your name to my brothers and sisters. I will praise you among your assembled people.",
    "reflection": "We see here that David promises to praise God among the people because his private deliverance deserved a public testimony. At times we may go through trials not because we want to sufferBUT because we want to obey God's will. Let the example of Jesus' obedience sustain and encourage you in times of trial. You will be able to face anything if you know that Jesus is with you. Let us always be prepared to offer public praise for His care for us.",
    "prayer": "O Lord, our Savior and comforter, in You I can stand against the trials of life because I know You are with me. May Your Spirit guide me in coming before You in reverent submission, willing to do whatever God wants. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 22:21-22\n\n21 Snatch me from the lion's jaws and from the horns of these wild oxen. \n22 I will proclaim your name to my brothers and sisters. I will praise you\namong your assembled people. \n\nToday's Thoughts:\n\nWe see here that David promises to praise God among the people because his\nprivate deliverance \n\ndeserved a public testimony. At times we may go through trials not because\nwe want to sufferBUT because we want to obey God's will. \n\nLet the example of Jesus' obedience sustain and encourage you in times of\ntrial. You will be able \n\nto face anything if you know that Jesus is with you. Let us always be\nprepared to offer public \n\npraise for His care for us.\n\nToday's Prayer Suggestion:\n\nO Lord, our Savior and comforter, in You I can stand against the trials of\nlife because I know \n\nYou are with me. May Your Spirit guide me in coming before You in reverent\nsubmission, \n\nwilling to do whatever God wants. Amen. \n\n\n\nPastor AL & Marcie Sather\n\nI Cor. 3:20 The Lord knows the thoughts of the wise, that they are\nworthless.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14241bc4fe3c455d",
    "date_utc": "Sun, 10 Nov 2013 05:18:43 -0600",
    "subject": "thoughts to live by",
    "verse": "30 Our children will also serve him. Future generations will hear about the wonders of the Lord 31 His righteous acts will be told to those not yet born. They will hear about everything he has done.",
    "reflection": "We need to remember that unborn generations are depending upon our faithfulness today. As we teach our children about the Lord, so they will teach their children and their children's children. If we fail to tell our children about the Lord, we may well be breaking the chain of God's influence in generations to come. We must view our children and all young people we meet as God's future leaders. If we want our children to serve the Lord, they must hear about Him from usIt is not enough to rely on the church or those with more knowledge to provide all their Christian education-We most reinforce the lessons of the Bible in our home. .",
    "prayer": "Dear Heavenly Father, I pray again that Your Spirit would be my guide so that I would be faithful in sharing Your word so that generations to come would come to faith in You. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalm 22:30-31 (NLT) \n\n30 Our children will also serve him. Future generations will hear about the\nwonders of the Lord\n\n31 His righteous acts will be told to those not yet born. They will hear\nabout everything he has done.\n\nToday's Thoughts:\n\nWe need to remember that unborn generations are depending upon our\nfaithfulness today.\n\nAs we teach our children about the Lord, so they will teach their children\nand their children's \n\nchildren. If we fail to tell our children about the Lord, we may well be\nbreaking the chain of\n\nGod's influence in generations to come. We must view our children and all\nyoung people we\n\nmeet as God's future leaders. .\n\n\n\nIf we want our children to serve the Lord, they must hear about Him from usIt is not enough to rely on the church or those with more knowledge to\nprovide\n\nall their Christian education-We most reinforce the lessons of the Bible in\nour home. \n\nToday's Prayer Suggestion:\n\nDear Heavenly Father, I pray again that Your Spirit would be my guide so\nthat I\n\nwould be faithful in sharing Your word so that generations to come would\ncome\n\nto faith in You. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n2 May God give you more and more grace and peace as you grow in your\nknowledgeof God and Jesus our Lord. 2 Peter 1:2 (NLT)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14246e20ff2bd7d5",
    "date_utc": "Mon, 11 Nov 2013 05:18:03 -0600",
    "subject": "thoughts to live by",
    "verse": "The Lord is my shepherd; I shall not want.",
    "reflection": "In describing the Lord as a shepherd, David wrote out of his own experience. Sheep are totally dependent on the shepherd for provision, guidance, and protection. The New Testament call Jesus the \"Good Shepherd\" (John 10:11). The \"Great Shepherd\" (Hebrews 13:20). The \"Head Shepherd\" (I Peter 5:4). As the Lord is the Good Shepherd, so we are His sheep-not frighten, passive animals, but obedient follows, wise enough to follow one who will lead us in the right places and in right ways. This psalm does not focus on animal-like qualities of sheep but on the discipleship qualities of those who will follow-When you recognize the Good Shepherd follow Him. .",
    "prayer": "Dear Heavenly Father, I thank You for being a caring Shepherd and a dependable guide. I thank You for being my one sure hope of eternal life and security. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Psalm 23:1 (ESV)\n\nThe Lord is my shepherd; I shall not want.\n\nToday's Thoughts:\n\nIn describing the Lord as a shepherd, David wrote out of his own experience.\n\nSheep are totally dependent on the shepherd for provision, guidance, and\nprotection.\n\nThe New Testament call Jesus the \"Good Shepherd\" (Jn. 10:11).\n\nThe \"Great Shepherd\" (Heb. 13:20).\n\nThe \"Head Shepherd\" (I Pet. 5:4).\n\n\n\nAs the Lord is the Good Shepherd, so we are His sheep-not frighten, passive\nanimals, \n\nbut obedient follows, wise enough to follow one who will lead us in the\nright places and \n\nin right ways. This psalm does not focus on animal-like qualities of sheep\nbut on the \n\ndiscipleship qualities of those who will follow-When you recognize the Good\nShepherd \n\nfollow Him. .\n\nToday's Prayer Suggestion:\n\nDear Heavenly Father, I thank You for being a caring Shepherd and a\ndependable guide.\n\nI thank You for being my one sure hope of eternal life and security. .\nAmen. \n\n\n\nPastor Alvin and Marcie Sather\n\nStand firm then, with the belt of truth buckeled\n\nAround your waist. Eph. 6:14",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1424bfcad7d22c57",
    "date_utc": "Tue, 12 Nov 2013 05:05:14 -0600",
    "subject": "thoughts to live by",
    "verse": "He makes me lie down in green pastures. He leads me beside still waters. 3 He restores my soul. He leads me in paths of righteousness for his name's sake.",
    "reflection": "When we allow God, our shepherd, to guide us, we have contentment. When we choose to sin and go our own way, we cannot blame God for the environment we have created for ourselves. Our Shepherd knows the \"green meadows\" and \"peaceful streams\" that will restore us. We will reach these places only by flowing Him obediently. Rebelling against the Shepherds leading is actually rebelling against our own best interests. We must remember this the next time we are tempted to go our own way rather than the Shepherds way. .",
    "prayer": "Dear Lord, help me remember the next time I decide to go my own waythat You have a better way-forgive me for often choosing another way. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalm 23:2-3 \n\nHe makes me lie down in green pastures. He leads me beside still waters. \n\n3 He restores my soul. He leads me in paths of righteousness for his name's\nsake. \n\nToday's Thoughts:\n\nWhen we allow God, our shepherd, to guide us, we have contentment.\n\nWhen we choose to sin and go our own way, we cannot blame God for \n\nthe environment we have created for ourselves. Our Shepherd knows the \n\n\"green meadows\" and \"peaceful streams\" that will restore us. We will reach \n\nthese places only by flowing Him obediently. Rebelling against the Shepherds\n\n\nleading is actually rebelling against our own best interests. \n\n\n\nWe must remember this the next time we are tempted to go our own way rather \n\nthan the Shepherds way. .\n\nToday's Prayer Suggestion:\n\nDear Lord, help me remember the next time I decide to go my own waythat You have a better way-forgive me for often choosing another way. .\nAmen. \n\n\n\n\n\nPastor Alvin and Marcie Sather\n\nThe house of the righteous stands firm. Pro. 12:7 NIV",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1425141d3ee387ca",
    "date_utc": "Wed, 13 Nov 2013 05:38:55 -0600",
    "subject": "thoughts to live by",
    "verse": "Even though I walk through the valley of the shadow of death, I will fear no evil, for you are with me; your rod and your staff, they comfort me.",
    "reflection": "Death can cast a frightening shadow over us, because we are entirely helpless in its presence. We can struggle with other enemies-pain, suffering, disease, and injury, but strength and courage cannot overcome death-It has the final word. ONLY ONE PERSON-can walk with us through death's dark valley and bring us safely to the other side-to the God of life, our shepherdBecause life is uncertain, we should follow this shepherd who offers us eternal comfort.",
    "prayer": "O Lord of all life, let me feel Your Spirit's presence when that dark valley comes. Lead me to the other side where there will be eternal comfort. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Ps. 23:4\n\nEven though I walk through the valley of the shadow of death, I will fear no\nevil,\n\nfor you are with me; your rod and your staff, they comfort me. \n\nToday's Thoughts:\n\nDeath can cast a frightening shadow over us, because we are entirely\nhelpless in\n\nits presence. We can struggle with other enemies-pain, suffering, disease,\nand \n\ninjury, but strength and courage cannot overcome death-It has the final\nword.\n\n\n\nONLY ONE PERSON-can walk with us through death's dark valley and bring \n\nus safely to the other side-to the God of life, our shepherdBecause life is uncertain, we should follow this shepherd who offers us\neternal comfort.\n\nToday's Prayer Suggestion:\n\nO Lord of all life, let me feel Your Spirit's presence when that dark valley\ncomes. Lead\n\nme to the other side where there will be eternal comfort. .Amen. \n\n\n\nPastor Alvin and Marcie Sather\n\nAs in the Master's Spirit you take into your arms the little ones,\n\nHis own everlasting arms will encircle them and you.\n\n(James Hamilton)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "142565943df53148",
    "date_utc": "Thu, 14 Nov 2013 05:22:37 -0600",
    "subject": "thoughts to live by",
    "verse": "5 You prepare a table before me in the presence of my enemies; you anoint my head with oil; my cup overflows. 6 Surely goodness and mercy shall follow me all the days of my life, and I shall dwell in the house of the Lord forever.",
    "reflection": "God offers protection even when the enemies surround us. This is the final scene of this psalmWe see that the believers will dwell with God. God, will be the perfect shepherd and the perfect host who promises to guide and protect us throughout our life and to bring us into His house-where a place has already been prepared for us (John 14:2)",
    "prayer": "Dear Lord help me every day to experience the joy of doing things for You. O Lord allow nothing to discourage me nor rob me of the joy which is put into my heart by Your Holy Spirit. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 23:5, 6\n\n5 You prepare a table before me in the presence of my enemies; you anoint my\nhead with oil; my cup overflows. \n\n6 Surely goodness and mercy shall follow me all the days of my life, and I\nshall dwell in the house of the Lord forever. \n\nToday's thoughts:\n\nGod offers protection even when the enemies surround us. This is the final\nscene of this psalmWe see that the believers will dwell with God. God, will be the perfect\nshepherd and the perfect host\n\nwho promises to guide and protect us throughout our life and to bring us\ninto His house-where \n\na place has already been prepared for us (Jn. 14:2)\n\nToday's Prayer Suggestion:\n\nDear Lord help me every day to experience the joy of doing things for You. \n\nO Lord allow nothing to discourage me nor rob me of the joy which is put \n\ninto my heart by Your Holy Spirit. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-_1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1425bb721cb99074",
    "date_utc": "Fri, 15 Nov 2013 06:23:16 -0600",
    "subject": "thoughts to live by",
    "verse": "The earth is the Lord's and the fullness thereof, the world and those who dwell therein, 2 for He has founded it upon the seas and established it upon the rivers. 3 Who shall ascend the hill of the Lord? And who shall stand in His holy place?",
    "reflection": "Because \"the earth is the Lord's\" all of us are stewards or caretakers. We should be committed to the proper management of the world and its resources-BUT we are not to become devoted to anything created or act as the sole proprietors-because this world will pass away (I John 2:17) Verse one sure shots a hole in the old saying of some-\" I'm a self-made Man. \" All that we possess is a gift from God, He is the one who has given us strength to get up and do our thing-He has given us the resources to put together the things we enjoy. .",
    "prayer": "O Lord, as I think about all that exists and that everything came about by Your creation, I feel so small and yet You invite us to come before You with our requests. My request today is that Your Holy Spirit would comfort all who are in need of comfort. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 24:1-3\nThe earth is the Lord's and the fullness thereof, the world and those who\ndwell therein, \n2 for He has founded it upon the seas and established it upon the rivers. \n3 Who shall ascend the hill of the Lord? And who shall stand in His holy\nplace? \nToday's Thoughts:\nBecause \"the earth is the Lord's\" all of us are stewards or caretakers.\nWe should be committed to the proper management of the world and \nits resources-BUT we are not to become devoted to anything created \nor act as the sole proprietors-because this world will pass away (I Jn.\n2:17)\n\nVerse one sure shots a hole in the old saying of some-\" I'm a self-made\nMan.\"\nAll that we possess is a gift from God, He is the one who has given us\nstrength\nto get up and do our thing-He has given us the resources to put together the\n\nthings we enjoy. .\nToday's Prayer Suggestion:\nO Lord, as I think about all that exists and that everything came about by\nYour creation, I feel so small and yet You invite us to come before You with\n\nour requests. My request today is that Your Holy Spirit would comfort all\nwho are in need of comfort. Amen.\n\nPastor Alvin and Marcie Sather\nCarry each others burdens, and in this way you \nwill fulfill the Law of Christ. Gal. 6:2 NIV",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14260946fc98a972",
    "date_utc": "Sat, 16 Nov 2013 05:03:29 -0600",
    "subject": "thoughts to live by",
    "verse": "He who has clean hands and a pure heart, who does not lift up his soul to what is false and does not swear deceitfully. 5 He will receive blessing from the Lord and righteousness from the God of his salvation. 6 Such is the generation of those who seek Him, who seek the face of the God of Jacob.",
    "reflection": "Vs. 4 refers to all lies, especially those told under oath. God truly values honesty. Dishonesty come easily, especially when complete truthfulness could cost us something, make us uncomfortable, or put us is an unfavorable light. Dishonest communication hinders relationships. Without honesty, a relationship with God is impossible. If we lie to others, we will begin to deceive ourselves. God cannot hear us or speak to us if we are building a wall of deception. God has set before us a choice-either a curse or a blessing. It is amazing how so many through their disobedience have chosen the curse. YES we have a choice to make-what will it be a blessing or a curse. We can live for ourselves OR live in service to God. To choose our own way-is to live on a deadened road, but to choose God's way is to receive eternal life (John 5:24).",
    "prayer": "O Lord, how good and faithful You are in spite of my sinfulness and unfaithfulness. As Your baptized child, I return to You for forgiveness and for renewed zeal to do Your will; in Jesus name. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 24:4-6\n\nHe who has clean hands and a pure heart, who does not lift up his soul to\nwhat is false and does not swear deceitfully.\n\n5 He will receive blessing from the Lord and righteousness from the God of\nhis salvation. \n\n6 Such is the generation of those who seek Him, who seek the face of the God\nof Jacob. \n\nToday's Thoughts:\n\nVs. 4 refers to all lies, especially those told under oath. God truly values\nhonesty.\n\nDishonesty come easily, especially when complete truthfulness could cost us\nsomething, \n\nmake us uncomfortable, or put us is an unfavorable light. Dishonest\ncommunication \n\nhinders relationships. Without honesty, a relationship with God is\nimpossible. If we lie \n\nto others, we will begin to deceive ourselves. \n\nGod cannot hear us or speak to us if we are building a wall of deception. .\n.\n\n\n\nGod has set before us a choice-either a curse or a blessing. It is amazing\nhow so many \n\nthrough their disobedience have chosen the curse. YES we have a choice to\nmake-what \n\nwill it be a blessing or a curse. \n\nWe can live for ourselves OR live in service to God. To choose our own\nway-is to live \n\non a dead-end road, but to choose God's way is to receive eternal life (Jn.\n5:24). \n\nToday's Prayer Suggestion:\n\nO Lord, how good and faithful You are in spite of my sinfulness and\nunfaithfulness.\n\nAs Your baptized child, I return to You for forgiveness and for renewed zeal\nto do\n\nYour will; in Jesus name. Amen. \n\n\n\nPastor Al & Marcie Sather\n\nI will thank the Lord because He is just;\n\nI will sing praises to the name of the Lord Most High.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14265e372e2ab305",
    "date_utc": "Sun, 17 Nov 2013 05:47:54 -0600",
    "subject": "thoughts to live by",
    "verse": "7 Lift up your heads, O gates! And be lifted up, O ancient doors, that the King of glory may come in. 8 Who is this King of glory? The Lord, strong and mighty, the Lord, mighty in battle! 9 Lift up your heads, O gates! And lift them up, O ancient doors, that the King of glory may come in. 10 Who is this King of glory? The Lord of hosts, he is the King of glory!",
    "reflection": "The question was, \"Who is the King of glory?\" Of course He is identified as the Lord AlmightyThe Messiah Himself. This phrase was often used in the temple-outside the temple the people would resound with the answer, \"He is the Lord Almighty. \" This was an important lesson to the children who were participating. It is a lesson we should all learn well - YES the King of Glory, is the Lord of hosts. Matt 21:5 (ESV) \"Say to the daughter of Zion, 'Behold, your king is coming to you, humble, and mounted on a donkey, and on a colt, the foal of a beast of burden. ' \" When Jesus entered Jerusalem on the donkey He affirmed His Messianic royalty as well as His humility.",
    "prayer": "Dear Lord of grace and mercy draw near to your people wherever they are, and help them through their trials and troubles. Forgive us all of our many sins through the cleansing power of Your precious blood. Grant us the strength to live victorious every day. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 24: 7-10\n\n7 Lift up your heads, O gates! And be lifted up, O ancient doors, that the\nKing of glory may come in. \n\n8 Who is this King of glory? The Lord, strong and mighty, the Lord, mighty\nin battle! \n\n9 Lift up your heads, O gates! And lift them up, O ancient doors, that the\nKing of glory may come in. \n\n10 Who is this King of glory? The Lord of hosts, he is the King of glory! \n\nToday's Thoughts:\n\nThe question was, \"Who is the King of glory?\" Of course He is identified as\nthe Lord AlmightyThe Messiah Himself. This phrase was often used in the temple-outside the\ntemple the people \n\nwould resound with the answer, \"He is the Lord Almighty.\" This was an\nimportant lesson to the \n\nchildren who were participatingIt is a lesson we should all learn well-YES the King of Glory, is the Lord\nof hosts. Matt 21:5 (ESV)\n\n\"Say to the daughter of Zion, 'Behold, your king is coming to you, humble,\nand mounted \n\non a donkey, and on a colt, the foal of a beast of burden.' \" \n\n\n\nWhen Jesus entered Jerusalem on the donkey He affirmed His Messianic royalty\nas well as His humility.\n\nToday's Prayer Suggestion:\n\nDear Lord of grace and mercy draw near to your people wherever they are, \n\nand help them through their trials and troubles. Forgive us all of our many \n\nsins through the cleansing power of Your precious blood. Grant us the\nstrength \n\nto live victorious every day. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nMy mouth shall praise thee with joyful lips Ps. 63:5",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1426af2638313eb1",
    "date_utc": "Mon, 18 Nov 2013 05:22:18 -0600",
    "subject": "thoughts to live by",
    "verse": "To you, O Lord, I lift up my soul. 2 O my God, in you I trust; let me not be put to shame; let not my enemies exult over me.",
    "reflection": "Seventy-two Psalm-almost half the book-speak about enemies. Enemies are those who oppose not only us, but also God's way of living. Give this some thought-we can view temptations-money-successprestige-lust-as our enemies. Of course Satan is our greatest enemy David asked God to keep his enemies from overcoming him because they opposed what God stood for. If his enemies succeeded, David feared that many would think that trusting God was futile. We too should not want our enemies' success to be an obstacle to the faith of others.",
    "prayer": "O Lord, I am aware of the fact that I have many of these enemies-I pray that I would be sensitive to Your Spirit's guidance so that my enemies would not triumph over me. In Jesus name, Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 25:1-2\n\nTo you, O Lord, I lift up my soul. 2 O my God, in you I trust;\n\nlet me not be put to shame; let not my enemies exult over me.\n\nToday's Thoughts:\n\nSeventy-two Psalm-almost half the book-speak about enemies.\n\nEnemies are those who oppose not only us, but also God's way of living.\n\nGive this some thought-we can view temptations-money-successprestige-lust-as our enemies. Of course Satan is our greatest enemy\n\n\n\nDavid asked God to keep his enemies from overcoming him because they \n\nopposed what God stood for. If his enemies succeeded, David feared that \n\nmany would think that trusting God was futile.\n\n\n\nWe too should not want our enemies' success to be an obstacle to the faith\nof others.\n\nToday's Prayer Suggestion:\n\nO Lord, I am aware of the fact that I have many of these enemies-I pray that\n\n\nI would be sensitive to Your Spirit's guidance so that my enemies would not \n\ntriumph over me. In Jesus name, Amen. \n\n\n\nPastor Al & Marcie Sather\n\nFix your thoughts on what is true and honorable and right.\n\nPhil. 4:8",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1427020dcf0a7e81",
    "date_utc": "Tue, 19 Nov 2013 05:31:10 -0600",
    "subject": "thoughts to live by",
    "verse": "Indeed, none who wait for you shall be put to shame; they shall be ashamed who are wantonly treacherous. 4 Make me to know your ways, O Lord; teach me your paths.",
    "reflection": "David wanted God's guidance-but how do we receive God's guidance? WELL the very first step is to want to be guided and to realize that God's primary guidance system is in His Word, the Bible Psalm 119 tells of the endless knowledge found in God's Word. By reading it and constantly learning from it, we will gain the wisdom to understand God's direction for our lives. We may be tempted to demand answers from God, but David asked for direction. When we are willing to seek God, learn from His Word, and obey His commands, then we will receive His specific guidance.",
    "prayer": "Dear Lord, my prayer is that of David, \"Make me know Your Ways-teach me Your paths. \" In Jesus Name. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 25:3-4\n\nIndeed, none who wait for you shall be put to shame; they shall be ashamed\nwho are wantonly treacherous.\n\n4 Make me to know your ways, O Lord; teach me your paths. \n\nToday's Thoughts:\n\nDavid wanted God's guidance-but how do we receive God's guidance? WELL the\nvery first step \n\nis to want to be guided and to realize that God's primary guidance system is\nin His Word, the Bible \n\nPs. 119 tells of the endless knowledge found in God's Word. .\n\n\n\nBy reading it and constantly learning from it, we will gain the wisdom to\nunderstand God's direction \n\nfor our lives. We may be tempted to demand answers from God, but David asked\nfor direction. \n\nWhen we are willing to seek God, learn from His Word, and obey His commands,\nthen we will receive \n\nHis specific guidance. \n\nToday's Prayer Suggestion:\n\nDear Lord, my prayer is that of David, \"Make me know Your Ways-teach me Your\npaths.\"\n\nIn Jesus Name. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nIn His great mercy He has given us new birth into a living hope.\n\nPet. 1:3 NIV\n\n\n\nOptimism is the faith that leads to achievment.\n\nNothing can be done without hope.\n\n(Helen Keller)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "142755705f0503cc",
    "date_utc": "Wed, 20 Nov 2013 05:48:31 -0600",
    "subject": "thoughts to live by",
    "verse": "Good and upright is the Lord; therefore he instructs sinners in the way. 9 He leads the humble in what is right, and teaches the humble his way. 10 All the paths of the Lord are steadfast love and faithfulness, for those who keep his covenant and his testimonies. 11 For your name's sake, O Lord, pardon my guilt, for it is great.",
    "reflection": "How much thought do we put into the fact that we are bombarded every day with relentless appeals to go in various directions? TV advertising alone places hundreds of options before us, in addition to appeals from political partiescults-false religions and dozens of other groups. Numerous organizations, including Christian organizations, seek to motivate us to support a cause. Add to that dozens of decisions we must make concerning our job, our family, our money, and our society, and we become desperate for someone to show us the right way-If you find yourself pulled in several directions, remember that God teaches the humble way, His way. .",
    "prayer": "Dear Lord, when I am pulled in several directions each day help to remember to ask myself-What Would Jesus Do-WWJD. So that the truth of Christ would be in me. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 25:8-11\n\nGood and upright is the Lord; therefore he instructs sinners in the way. \n\n9 He leads the humble in what is right, and teaches the humble his way. \n\n10 All the paths of the Lord are steadfast love and faithfulness, \n\nfor those who keep his covenant and his testimonies. \n\n11 For your name's sake, O Lord, pardon my guilt, for it is great. \n\nToday's Thought:\n\nHow much thought do we put into the fact that we are bombarded every day \n\nwith relentless appeals to go in various directions? TV advertising alone\nplaces \n\nhundreds of options before us, in addition to appeals from political\npartiescults-false religions and dozens of other groups. \n\nNumerous organizations, including Christian organizations, seek to motivate\nus \n\nto support a cause. Add to that dozens of decisions we must make concerning \n\nour job, our family, our money, and our society, and we become desperate for\n\n\nsomeone to show us the right way-If you find yourself pulled in several\ndirections, \n\nremember that God teaches the humble way, His way. \n\nToday's Prayer Suggestion:\n\nDear Lord, when I am pulled in several directions each day help to remember \n\nto ask myself-What Would Jesus Do-WWJD. So that the truth of Christ \n\nwould be in me. Amen. \n\n\n\nPastor Alvin and Marcie Sather\n\nWorship the LORD with gladness; \ncome before him with joyful songs. Psalm 100:2",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1427a3af61729b4a",
    "date_utc": "Thu, 21 Nov 2013 04:35:59 -0600",
    "subject": "thoughts to live by",
    "verse": "12 Who is the man who fears the Lord? Him will he instruct in the way that he should choose. 13 His soul shall abide in well-being, and his offspring shall inherit the land.",
    "reflection": "To fear the Lord is to recognize God's attributes. He is holy-almighty-righteous-pureall knowing-all powerful-and all wise. When we regard God correctly, we gain a clearer picture of ourselves, sinful-weak-frail-and needy. When we recognize who God is and who we are-we will fall at His feet in humble respect. Only then will He show us His way. .",
    "prayer": "O Lord, forgive me for not always having a clear view of who You really are. Help me to always come before You in humble respect. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 25: 12-13\n\n12 Who is the man who fears the Lord? Him will he instruct in the way that\nhe should choose. \n\n13 His soul shall abide in well-being, and his offspring shall inherit the\nland. \n\nToday's thoughts:\n\nTo fear the Lord is to recognize God's attributes. He is\nholy-almighty-righteous-pureall knowing-all powerful-and all wise. When we regard God correctly, we gain\na clearer \n\npicture of ourselves, sinful-weak-frail-and needy.\n\nWhen we recognize who God is and who we are-we will fall at His feet in\nhumble respect.\n\nOnly then will He show us His way. .\n\nToday's Prayer Suggestion:\n\nO Lord, forgive me for not always having a clear view of who You really are.\n\nHelp me to always come before You in humble respect. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nBy God's trials, He means to purify us-and to bring \n\nus into implicit humble trust in Himself.\n\n(Horace Bushnell)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1427fdde19e4e9a7",
    "date_utc": "Fri, 22 Nov 2013 06:52:04 -0600",
    "subject": "thoughts to live by",
    "verse": "The Lord advises those who fear him. He reveals to them the intent of his promise. 15 My eyes are always on the Lord. He removes my feet from traps.",
    "reflection": "\"Friendship with the Lord is reserved for those who fear Him. \" God offers intimate and lasting friendship to those who revere Him, who hold Him in highest honor. What relationship could ever compare with having the Lord of all creation for a friend? Your everlasting friendship will grow as you revere Him.",
    "prayer": "O Lord, I pray that I would always be sensitive to Your Spirit's advice so that I might receive the intent of Your promises. Guide my feet so that I would not fall into the traps of this world. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 25:14-15\n\nThe Lord advises those who fear him. He reveals to them the intent of his\npromise. \n15 My eyes are always on the Lord. He removes my feet from traps.\n\nToday's Thoughts:\n\n\"Friendship with the Lord is reserved for those who fear Him.\" God offers\nintimate \n\nand lasting friendship to those who revere Him, who hold Him in highest\nhonor. \n\nWhat relationship could ever compare with having the Lord of all creation\nfor a friend?\n\nYour everlasting friendship will grow as you revere Him. \n\nToday's Prayer Suggestion:\n\nO Lord, I pray that I would always be sensitive to Your Spirit's advice so\nthat \n\nI might receive the intent of Your promises. Guide my feet so that I would\nnot \n\nfall into the traps of this world. Amen.\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\nUnder the shadow of earthly disappointment, all \n\nunconscious to ourselves, our Divine Redeemer \n\nis walking by our side. (E. H. Chapin)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14284a0ecb90e54f",
    "date_utc": "Sat, 23 Nov 2013 05:03:35 -0600",
    "subject": "thoughts to live by",
    "verse": "16 Turn to me, and have pity on me. I am lonely and oppressed. 17 Relieve my troubled heart, and bring me out of my distress. 18 Look at my misery and suffering, and forgive all my sins.",
    "reflection": "Do life's problems seem to go from bad to worse? God is the only one who can reverse this downward spiral. He can take our problems and turn them into glorious victories. BUT there is one necessary requirement-we like David, must cry out, \"Turn to me and have mercy on me. \" When you are willing to do that, God can turn the worst into something wonderful. The next step is yours-God has already made His offer. .",
    "prayer": "Dear Lord Jesus, thank You for being my one and onlyall-sufficient Savior. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 25:16-18\n\n16 Turn to me, and have pity on me. I am lonely and oppressed. \n\n17 Relieve my troubled heart, and bring me out of my distress. \n\n18 Look at my misery and suffering, and forgive all my sins. \n\nToday's Thoughts:\n\nDo life's problems seem to go from bad to worse? \n\nGod is the only one who can reverse this downward spiral. \n\nHe can take our problems and turn them into glorious victories. \n\nBUT there is one necessary requirement-we like David, must cry out,\n\n\"Turn to me and have mercy on me.\" When you are willing to do that, \n\nGod can turn the worst into something wonderful.\n\n\n\nThe next step is yours-God has already made His offer. .\n\nToday's Prayer Suggestion:\n\nDear Lord Jesus, thank You for being my one and onlyall-sufficient Savior. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n(the Lord's promise) I will be with you always-(Mt. 28:20)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14289b4e00084fd1",
    "date_utc": "Sun, 24 Nov 2013 04:43:08 -0600",
    "subject": "thoughts to live by",
    "verse": "19 See how my enemies have increased in number, how they have hated me with vicious hatred! 20 Protect my life, and rescue me! Do not let me be put to shame. I have taken refuge in You. 21 May integrity and honesty protect me, for I put my hope in You.",
    "reflection": "If ever two powerful forces were needed to preserve us along life's way, they are integrity and honesty. The psalmist asks for these to protect him step by step. Honesty makes us learn God's requirements and strive to fulfill them. Integrity-being what we say we are-keeps us from claiming to be honest while living as if we do not know God. Honesty-says, \"This is the Shepherds way. \" And integrity-says, \"I will walk consistently in it. \" Are you walking consistently in the Shepherds way?",
    "prayer": "Dear Lord, in my weakness and with my sins, help me hear Your loving voice calling me. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 25:19-21\n\n19 See how my enemies have increased in number, how they have hated me with\nvicious hatred! \n\n20 Protect my life, and rescue me! Do not let me be put to shame. I have\ntaken refuge in You. \n\n21 May integrity and honesty protect me, for I put my hope in You.\n\nToday's Thoughts:\n\nIf ever two powerful forces were needed to preserve us along life's way, \n\nthey are integrity and honesty. The psalmist asks for these to protect him \n\nstep by step. Honesty makes us learn God's requirements and strive to \n\nfulfill them. Integrity-being what we say we are-keeps us from claiming \n\nto be honest while living as if we do not know God. .\n\n\n\nHonesty-says, \"This is the Shepherds way.\" \n\nAnd integrity-says, \"I will walk consistently in it.\"\n\nAre you walking consistently in the Shepherds way?\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord, in my weakness and with my sins, help me hear \n\nYour loving voice calling me. .Amen.\n\nPastor Alvin and Marcie Sather\n\nWe rejoice in our sufferings, becausse we know that suffering produces \n\nperseverance; preseverance, character, and character, hope. Ro. 5:3",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1428ef9543acb3d6",
    "date_utc": "Mon, 25 Nov 2013 05:16:03 -0600",
    "subject": "thoughts to live by",
    "verse": "1 Vindicate me, O Lord, for I have walked in my integrity, and I have trusted in the Lord without wavering. 2 Prove me, O Lord, and try me; test my heart and my mind. 3 For your steadfast love is before my eyes, and I walk in your faithfulness.",
    "reflection": "When David said, he had walked in integrity, he was not claiming to be sinless-that is impossible for any human being. BUT he was consistently in fellowship with Godclearing his record when he sinned by asking for forgiveness. Here he pleads with God to clear his name of false charges made against him by his enemies. We too can ask God to examine us, trusting Him to forgive our sins and clear our record according to His mercy. .",
    "prayer": "Thank You Lord, for the love that forgives me. Help me treasure it even though I cannot understand it. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 26:1-3\n\n1 Vindicate me, O Lord, for I have walked in my integrity, and I have\ntrusted in the Lord without wavering. \n\n2 Prove me, O Lord, and try me; test my heart and my mind. \n\n3 For your steadfast love is before my eyes, and I walk in your\nfaithfulness. \n\nToday's Thought:\n\nWhen David said, he had walked in integrity, he was not claiming to be\nsinless-that is \n\nimpossible for any human being. BUT he was consistently in fellowship with\nGodclearing his record when he sinned by asking for forgiveness. Here he pleads\nwith God \n\nto clear his name of false charges made against him by his enemies. .\n\nWe too can ask God to examine us, trusting Him to forgive our sins and clear\nour record\n\naccording to His mercy. .\n\nToday's Prayer Suggestion:\n\nThank You Lord, for the love that forgives me. Help me treasure it \n\neven though I cannot understand it. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nIn everything give thanks. (I Thess. 5:18)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1429417dfda6df99",
    "date_utc": "Tue, 26 Nov 2013 05:07:37 -0600",
    "subject": "thoughts to live by",
    "verse": "4 I do not sit with men of falsehood, nor do I consort with hypocrites. 5 I hate the assembly of evildoers, and I will not sit with the wicked.",
    "reflection": "Should we stay away from unbelievers? No! Although there are-some places Christians should avoid. Jesus demonstrated that we must go out among unbelievers to help them. But remember there is a difference between being with unbelievers and being one of them. Being one of them harms our witness for God. Ask yourself about the people you enjoy. \"If I am with them often, will I become less obedient to God in outlook or action?\" If the answer is yes, carefully monitor how you spend your time with these people and what effect it has on you. .",
    "prayer": "O Lord, bless my sharing of Your powerful Word. Use it to bring dead hearts to life and protect my heart in the process. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 96:4, 5\n\n4 I do not sit with men of falsehood, nor do I consort with hypocrites. \n\n5 I hate the assembly of evildoers, and I will not sit with the wicked. \n\nToday's Thoughts:\n\nShould we stay away from unbelievers? No! Although there are-some\nplaces \n\nChristians should avoid. Jesus demonstrated that we must go out among\nunbelievers \n\nto help them. But remember there is a difference between being with\nunbelievers and \n\nbeing one of them. Being one of them harms our witness for God. \n\n\n\nAsk yourself about the people you enjoy. \"If I am with them often, will I\nbecome less \n\nobedient to God in outlook or action?\" If the answer is yes, carefully\nmonitor how you \n\nspend your time with these people and what effect it has on you. .\n\nToday's Prayer Suggestion:\n\nO Lord, bless my sharing of Your powerful Word.\n\nUse it to bring dead hearts to life and protect my\n\nheart in the process. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nThe finest test of Character is seen in the amount \n\nand the power of gratitude we have.\n\n(Milo H. Gates)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1429950fc83fa5d1",
    "date_utc": "Wed, 27 Nov 2013 05:28:03 -0600",
    "subject": "thoughts to live by",
    "verse": "6 I will wash my hands in innocence. I will walk around your altar, O Lord, 7 so that I may loudly sing a hymn of thanksgiving and tell about all your miracles. 8 O Lord, I love the house where you live, the place where your glory (light) shines.",
    "reflection": "God's light represents what is good, pure, true, holy and reliable. Of course darkness represents what is sinful and evil. God alone can guide us out of the darkness of sin. Light is also related to the truth in that light exposes whatever exists, whether it is good or bad. David exclaimed how he loved to worship in the house where the Lord lived. We should worship God with the same love and reverence as David did. .",
    "prayer": "Dear Lord, make me a faithful witness to the Savior so that others may walk with me to heaven. Amen",
    "reading": "",
    "original_content": "Today's Verses: Ps. 26:6-8\n\n6 I will wash my hands in innocence. I will walk around your altar, O Lord, \n\n7 so that I may loudly sing a hymn of thanksgiving and tell about all your\nmiracles. \n8 O Lord, I love the house where you live, the place where your glory\n(light) shines. \n\nToday's Thoughts:\n\nGod's light represents what is good, pure, true, holy and reliable. Of\ncourse darkness \n\nrepresents what is sinful and evil. God alone can guide us out of the\ndarkness of sin. \n\nLight is also related to the truth in that light exposes whatever exists,\nwhether it is \n\ngood or bad. David exclaimed how he loved to worship in the house where the\nLord lived.\n\n\n\nWe should worship God with the same love and reverence as David did. \n\nToday's Prayer Suggestion:\n\nDear Lord, make me a faithful witness to the Savior so \n\nthat others may walk with me to heaven. .Amen \n\n\n\nPastor Alvin and Marcie Sather\n\nSimplicity reaches out after God; purity discovers and enjoys Him.\n\nThomas A Kempis",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1429e9bb4c281b62",
    "date_utc": "Thu, 28 Nov 2013 06:07:53 -0600",
    "subject": "thoughts to live by",
    "verse": "9 Do not sweep away my soul along with hardened sinners or my life along with bloodthirsty people. 10 Evil schemes are in their hands. Their right hands are full of bribes. 11 But I walk with integrity. Rescue me, and have pity on me. 12 My feet stand on level ground. I will praise the Lord with the choirs in worship.",
    "reflection": "How often have we complained about our problems to whoever would listenand praise God in private? O how much better it would be if we for us to complain in private and praise God publicly. Let us remember today, from where our blessing flow.",
    "prayer": "Dear Lord, keep me awake and watching for my Saviors return so I can follow Him to glory. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 26:9-12\n\n9 Do not sweep away my soul along with hardened sinners or my life along\nwith bloodthirsty people. \n\n10 Evil schemes are in their hands. Their right hands are full of bribes. \n\n11 But I walk with integrity. Rescue me, and have pity on me. \n\n12 My feet stand on level ground. I will praise the Lord with the choirs in\nworship. \n\nToday's Thoughts:\n\nHow often have we complained about our problems to whoever would listenand praise God in private? O how much better it would be if we for us to\ncomplain \n\nin private and praise God publicly. Let us remember today, from where our\nblessing flow.\n\nToday's Prayer Suggestion:\n\nDear Lord, keep me awake and watching for my Saviors return \n\nso I can follow Him to glory. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nClothe yourselves with humility toward one another, because, \n\nGod opposes the proud but give grace to the humble. I Pet 5:5",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1429f54249daada5",
    "date_utc": "Thu, 28 Nov 2013 09:29:19 -0600",
    "subject": "thoughts to live by",
    "verse": " Always be joyful in the Lord! I'll say it again: Be joyful! Let everyone know how considerate you are. The Lord is near. Never worry about anything. But in every situation let God know what you need in prayers and requests while giving thanks. Then God's peace, which goes beyond anything we can imagine, will guard your thoughts and emotions through Christ Jesus (Philippians 4:4-7)",
    "reflection": "Imagine never worrying about anything! It seems like an impossibility all have worries on the job, in our homes, at school. BUT Paul advice's us to turn our worries into prayers. Would you like to worry less? Then pray more! Whenever you start to worry, stop and pray, giving thanks for all that God has done in the past and what He promises to do in the future.",
    "prayer": "",
    "reading": "",
    "original_content": "Spec. Thanksgiving Verses: Phil 4:4-7 \n\n4 Always be joyful in the Lord! I'll say it again: Be joyful! \n\n5 Let everyone know how considerate you are. The Lord is near. \n\n6 Never worry about anything. But in every situation let God know \n\nwhat you need in prayers and requests while giving thanks. \n\n7 Then God's peace, which goes beyond anything we can imagine, \n\nwill guard your thoughts and emotions through Christ Jesus \n\nThanksgiving Thought's:\n\nImagine never worrying about anything! It seems like an impossibilitywe all have worries on the job, in our homes, at school. BUT Paul advices \n\nus to turn our worries into prayers. Would you like to worry less?\n\nThen pray more! Whenever you start to worry, stop and pray, giving thanks \n\nfor all that God has done in the past and what He promises to do in the\nfuture.\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "142a3a50c80d07c3",
    "date_utc": "Fri, 29 Nov 2013 05:36:07 -0600",
    "subject": "thoughts to live by",
    "verse": "The Lord is my light and my salvation. Who is there to fear? The Lord is my life's fortress. Who is there to be afraid of? 2 Evildoers closed in on me to tear me to pieces. My opponents and enemies stumbled and fell. 3 Even though an army sets up camp against me, my heart will not be afraid. Even though a war breaks out against me, I will still have confidence {in the Lord}.",
    "reflection": "Fear is a dark shadow that envelopes us and ultimately imprisons us within ourselves. I think that each of us have been a prisoner of fear one time or another-fear of rejection, misunderstanding, uncertainty, sickness, or even death. But we can conquer fear by using the bright liberating light of the Lord, who brings salvation. If we want to dispel the darkness of fear, let us remember the words of the psalmist, \"the Lord is my light and my salvation. \"",
    "prayer": "O Lord, the next time I come into a situation that causes fear, help me remember the wise words of wisdom and encouragement of the psalmist; \"The Lord is my light and salvation. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 27:1-3\n\nThe Lord is my light and my salvation. Who is there to fear? The Lord is my\nlife's fortress. Who is there to be afraid of? \n2 Evildoers closed in on me to tear me to pieces. My opponents and enemies\nstumbled and fell. \n\n3 Even though an army sets up camp against me, my heart will not be afraid.\nEven though a war \n\nbreaks out against me, I will still have confidence {in the Lord}. \n\nToday's Thoughts:\n\nFear is a dark shadow that envelopes us and ultimately imprisons us within\nourselves.\n\nI think that each of us have been a prisoner of fear one time or\nanother-fear of rejection, \n\nmisunderstanding, uncertainty, sickness, or even death. But we can conquer\nfear by using \n\nthe bright liberating light of the Lord, who brings salvation.\n\nIf we want to dispel the darkness of fear, let us remember the words of the\npsalmist, \n\n\"the Lord is my light and my salvation.\"\n\nToday's Prayer Suggestion:\n\nO Lord, the next time I come into a situation that causes fear, help me\nremember the wise \n\nwords of wisdom and encouragement of the psalmist; \"The Lord is my light and\nsalvation. Amen.\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "142a8b1024fdfda3",
    "date_utc": "Sat, 30 Nov 2013 05:07:23 -0600",
    "subject": "thoughts to live by",
    "verse": "4 I have asked one thing from the Lord. This I will seek: to remain in the Lord's house all the days of my life in order to gaze at the Lord's beauty and to search for an answer in His temple. 5 He hides me in His shelter when there is trouble. He keeps me hidden in His tent. He sets me high on a rock. 6 Now my head will be raised above my enemies who surround me. I will offer sacrifices with shouts of joy in His tent. I will sing and make music to praise the Lord.",
    "reflection": "By the \"house of the Lord\" and \"His Temple, \" David could have been referring to the Tabernacle in Gibeon, or to the Temple that his son Solomon was to build-but David may have also used the word Temple to mean \"The presence of the Lord. \" His greatest wish was to live in God presence each day of his life. Sadly this is not the greatest desire of many who claim to be believers. But those who desire to live in God's presence each day will be able to enjoy that relationship forever. .",
    "prayer": "O Lord, I thank You for the help You offer for today and a hope for the future. I pray for an unwavering confidence in You so that I may never fear those dark days that may trouble me. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Ps. 27:4-6\n\n4 I have asked one thing from the Lord. This I will seek: to remain in the\nLord's house all the days of my life\n\nin order to gaze at the Lord's beauty and to search for an answer in His\ntemple.\n\n5 He hides me in His shelter when there is trouble. He keeps me hidden in\nHis tent. He sets me high on a rock. \n\n6 Now my head will be raised above my enemies who surround me. I will offer\nsacrifices with shouts of joy in His tent. \n\nI will sing and make music to praise the Lord. \n\nToday's Thoughts:\n\nBy the \"house of the Lord\" and \"His Temple,\" David could have been referring\nto the Tabernacle in Gibeon, \n\nor to the Temple that his son Solomon was to build-but David may have also\nused the word Temple to mean \n\n\"The presence of the Lord.\" His greatest wish was to live in God presence\neach day of his life.\n\nSadly this is not the greatest desire of many who claim to be believers. But\nthose who desire to live in God's \n\npresence each day will be able to enjoy that relationship forever. .\n\nToday's Prayer Suggestion:\n\nO Lord, I thank You for the help You offer for today and a hope for the\nfuture.\n\nI pray for an unwavering confidence in You so that I may never fear those \n\ndark days that may trouble me. Amen. \n\n\n\nPastor Alvin and Marcie Sather\n\nThe thoughts of the righteous are right. Pro. 12:5",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]