[
  {
    "message_id": "11c2cb26dc9c79d1",
    "date_utc": "Wed, 3 Sep 2008 15:35:49 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul an apostle of Christ Jesus by the will of God, to the saints in Ephesus, the faithful in Christ Jesus. (Eph. 1:1) NIV",
    "reflection": "\"Faithful followers of Christ Jesus\" ~ What an excellent reputation! Such a label would be an honor for any believer. What would it take for others to characterize you as a faithful follower of Christ? We need to hold fast to our faith one day at a time: faithfully obeying God, in every detail of our lives. Then, like the Ephesians, we will be known as a person who is faithful to the Lord.",
    "prayer": "Help me to be sensitive to Your leading, that I may be characterized as a faithful follower. Help me to trust in You for every detail of my life. Amen.",
    "reading": "",
    "original_content": "09/04/08~~~~(food for thought)~~~The best way to get even is to forget...(Lk.6:35)\n\nOur Bible Verse for Today:\n\nPaul an apostle of Christ Jesus by the will of God,\nto the saints in Ephesus, the faithful in Christ Jesus.\n(Eph. 1:1) NIV\n\nOur Lesson for Today:\n\n\"Faithful followers of Christ Jesus\" ~ What an excellent reputation!\nSuch a label would be an honor for any believer...\n\nWhat would it take for others to characterize you as a faithful follower \nof Christ? \n\nWe need to hold fast to our faith one day at a time: faithfully obeying \nGod, in every detail of our lives...\n\nThen, like the Ephesians, we will be known as a person who is faithful \nto the Lord...\n\nOur Prayer for Today:\nHelp me to be sensitive to Your leading, that I may be characterized \nas a faithful follower. Help me to trust in You for every detail of my\nlife...Amen.\n\nKeep looking up, all things are possible \nif we only believe...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11c3215ec4fb1e51",
    "date_utc": "Thu, 4 Sep 2008 09:42:16 -0600",
    "subject": "thoughts to live by",
    "verse": "Grace and peace to you from God our Father and the Lord Jesus Christ. Praise be to the God and Father of our Lord Jesus Christ, who has blessed us in the heavenly realms with every spiritual blessing in Christ. (Eph. 1:2, 3) NIV",
    "reflection": "\"Who has blessed us with every spiritual blessing in the heavenly realms\" means that in Christ we have all the benefits of knowing God ~ being chosen for salvation, being adopted as His children, forgiveness, insight, the gifts of the spirit, power to do God's will, the hope of living forever with Christ. Because we have an intimate relationship with Christ, we can enjoy these blessings now. The \"heavenly realm\" means that these blessings are eternal not temporal. The blessings come from Christ's spiritual realm. For more information on the heavenly realms in this letter look to 1:20, 2:6, 3:10. These passages reveal Christ in His victorious, exalted role as ruler of all.",
    "prayer": "Dear Lord Jesus, I thank You for the gift of grace that You have bestowed upon each believer. I thank You for the many heavenly blessings that we receive through faith in You. Amen.",
    "reading": "",
    "original_content": "09/05/08~~~(food for thought)~~~People don't care how much you know,\nuntil they know how much you care...(Phil. 2:3)\n\nOur Bible Verses for Today:\n\nGrace and peace to you from God our Father and the Lord Jesus Christ...\n\nPraise be to the God and Father of our Lord Jesus Christ, who has blessed \nus in the heavenly realms with every spiritual blessing in Christ...(Eph. 1:2, 3) NIV\n\nOur Lesson for Today:\n\n\"Who has blessed us with every spiritual blessing in the heavenly realms\" \nmeans that in Christ we have all the benefits of knowing God ~\n\nbeing chosen for salvation, being adopted as His children, forgiveness, insight, \nthe gifts of the spirit, power to do God's will, the hope of living forever with Christ...\n\nBecause we have an intimate relationship with Christ, we can enjoy these blessings\nnow. \n\nThe \"heavenly realm\" means that these blessings are eternal not temporal. The\nblessings come from Christ's spiritual realm...\n\nFor more information on the heavenly realms in this letter look to 1:20, 2:6, 3:10.\nThese passages reveal Christ in His victorious, exalted role as ruler of all...\n\nOur Prayer for Today:\nDear Lord Jesus, I thank You for the gift of grace that\nYou have bestowed upon each believer. I thank You for \nthe many heavenly blessings that we receive through \nfaith in You...Amen.\n\nKeep looking up, He's got the whole world in His hands...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11c3719a85b61cdb",
    "date_utc": "Fri, 5 Sep 2008 10:01:12 -0600",
    "subject": "thoughts to live by",
    "verse": "For He chose us in Him before the creation of the world to be holy and blameless in His sight. (Eph. 1:4) NIV",
    "reflection": "Paul says that God \"chose us\" this is to emphasize that salvation depends totally on God. We are not saved because we deserve it but because God is gracious and freely gives salvation. We did not influence God's decision to save us, He save us according to His plan. SO, there is no way to take credit for our salvation or to allow room for pride. The mystery of salvation originated in the timeless mind of God long before we existed. It is hard to understand how God could accept us. BUT because of Christ, we are holy and blameless in His sight. Yes, God chose us, and when we belong to Him through Jesus Christ, God looks at us as if we had never sinned. All we can do is express our thanks for His wonderful love.",
    "prayer": "Dear Heavenly Father, I could say thanks every day for the wonderful gift of salvation, but it would never suffice for this wonderful gift, and Your wonderful love. Help me to be better witness of Your grace and mercy. Amen.",
    "reading": "",
    "original_content": "09/06/08~~~(food for thought)~~~Humor is to life what shock absorbers\nare to cars...(Pro. 17:22)\n\nOur Bible Verse for Today:\n\nFor He chose us in Him before the creation of the world\nto be holy and blameless in His sight...(Eph. 1:4) NIV\n\nOur Lesson for Today:\n\nPaul says that God \"chose us\" this is to emphasize that salvation\ndepends totally on God. We are not saved because we deserve\nit but because God is gracious and freely gives salvation...\n\nWe did not influence God's decision to save us, He save us \naccording to His plan. SO, there is no way to take credit for our\nsalvation or to allow room for pride...\n\nThe mystery of salvation originated in the timeless mind of God\nlong before we existed. It is hard to understand how God could\naccept us...\n\nBUT because of Christ, we are holy and blameless in His sight.\nYes, God chose us, and when we belong to Him through Jesus\nChrist, God looks at us as if we had never sinned...\n\nAll we can do is express our thanks for His wonderful love...\n\nOur Prayer for Today:\nDear Heavenly Father, I could say thanks every day for\nthe wonderful gift of salvation, but it would never suffice\nfor this wonderful gift, and Your wonderful love. Help me \nto be better witness of Your grace and mercy...Amen.\n\nKeep looking up, be an example of His love...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11c412d7b94f46bb",
    "date_utc": "Sun, 7 Sep 2008 14:42:13 -0600",
    "subject": "thoughts to live by",
    "verse": "He predestined us to be adopted as His sons through Jesus Christ, in accordance with His pleasure. (Eph. 1:5) NIV",
    "reflection": "He \"predestined us\" is another way of saying that salvation is God's work and not our own doing. In His infinite love, God has adopted us as His own children. Though Jesus' sacrifice, He has bought us into His family and made us heirs along with Jesus (Romans 8:17). In Roman law adopted children had the same rights and privileges as biological children. Even if they had been slaves. Paul uses this term to show how strong our relationship to God is. Have you entered into this relationship with God?",
    "prayer": "Dear Heavenly Father, I thank You for Your infinite love, for without Your plan I would be lost, for as Isaiah says my works are but filthy rags. Bless all my e-mail friends with good health and safety this week. Amen.",
    "reading": "",
    "original_content": "09/08/08~~~(Food for thought)~~~A man wrapped up in himself makes\na very small package...Pro. 18:2) NIV\n\nOur Bible Verse for Today:\n\nHe predestined us to be adopted as His sons through Jesus Christ,\nin accordance with His pleasure...(Eph. 1:5) NIV\n\nOur Lesson for Today:\n\nHe \"predestined us\" is another way of saying that salvation is God's\nwork and not our own doing. In His infinite love, God has adopted us \nas His own children...\n\nThough Jesus' sacrifice, He has bought us into His family and made \nus heirs along with Jesus (Ro. 8:17). In Roman law adopted children\nhad the same rights and privileges as biological children. Even if they\nhad been slaves...\n\nPaul uses this term to show how strong our relationship to God is. Have\nyou entered into this relationship with God?\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for Your infinite love,\nfor without Your plan I would be lost, for as Isaiah says\nmy works are but filthy rags. Bless all my e-mail friends \nwith good health and safety this week...Amen.\n\nKeep looking up, for you are in His plan...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11c4c09b6bbfc1e7",
    "date_utc": "Wed, 10 Sep 2008 05:16:42 -0600",
    "subject": "thoughts to live by",
    "verse": "In Him we have redemption through His blood, the forgiveness of sins, in accordance with the riches of God's grace That He lavished on us with all wisdom and understanding. (Eph. 1:7-8) NIV",
    "reflection": "God showered His kindness on us ~ that is called God's \"grace\". This is His voluntary and loving favor given to those He saves. We can't earn salvation, nor do we deserve it. No religious, intellectual, or moral effort can gain it, because it comes only from God's mercy and love. Without God's grace, no person can be saved. To receive it, we must acknowledge that we cannot save ourselves, that only God can save us, and that our only way to receive this loving favor is through faith in Christ. .",
    "prayer": "Dear Heavenly Father, I thank You again today for Your love and mercy, for without it I would be lost for all eternity. Help me remove myself from the busyness of each day to look up and give You thanks. Amen.",
    "reading": "",
    "original_content": "09/10/08~~~(food for thought)~~~It isn't your position that makes you happy\nor unhappy, it's your disposition...(I Tim. 6:6, 7)\n\nOur Bible Verse for Today:\n\nIn Him we have redemption through His blood, the forgiveness of sins,\nin accordance with the riches of God's grace\n\nThat He lavished on us with all wisdom and understanding...(Eph. 1:7-8) NIV\n\nOur Lesson for Today:\n\nGod showered His kindness on us ~ that is called God's \"grace\". This is\nHis voluntary and loving favor given to those He saves...\n\nWe can't earn salvation, nor do we deserve it. No religious, intellectual, or \nmoral effort can gain it, because it comes only from God's mercy and love...\n\nWithout God's grace, no person can be saved. To receive it, we must acknowledge \nthat we cannot save ourselves, that only God can save us, and that our only\nway to receive this loving favor is through faith in Christ....\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You again today for Your love\nand mercy, for without it I would be lost for all eternity. Help\nme remove myself from the busyness of each day to look\nup and give You thanks...Amen.\n\nKeep looking up ~ that's all He asks...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11c50ffe226de7d0",
    "date_utc": "Wed, 10 Sep 2008 16:31:34 -0600",
    "subject": "thoughts to live by",
    "verse": "And He made known to us the mystery of His will according to His good pleasure, which He purposed in Christ, to be put into effect when the times will have reached their fulfillment ~ to bring all things in heaven and on earth together under one head, even Christ. (Eph. 1:9, 10) NIV",
    "reflection": "God was not intentionally keeping His plan secret, but His plan for the world could not be fully understood until Christ rose from the dead. His purpose for sending Christ was to unite Jews and Gentile in one body with Christ as the head, Many people still do not understand God's plan; but at the right time, He will bring us together to be with Him forever. Then everyone will understand. On that day, all people will bow to Jesus as Lord, either because they love Him or because they fear His power (See Philippians 2:10, 11).",
    "prayer": "Dear Heavenly Father, I thank You for Your wonderful plan to one day bring all people together to worship You the One True God. Help me become a better witness that I might have a hand in making this message clear to more people. Keep looking up, for Godly wisdom. Amen.",
    "reading": "",
    "original_content": "09/11/08~~~(food for thought)~~~It takes more to plow a field than merely\nturning it over in your mind...(I Thess. 4:11, 12)\n\nOur Bible Verses for Today:\n\nAnd He made known to us the mystery of His will according to His good \npleasure, which He purposed in Christ,\n\nto be put into effect when the times will have reached their fulfillment ~\nto bring all things in heaven and on earth together under one head,\neven Christ...(Eph. 1:9, 10) NIV\n\nOur Lesson for Today:\n\nGod was not intentionally keeping His plan secret, but His plan for the\nworld could not be fully understood until Christ rose from the dead...\n\nHis purpose for sending Christ was to unite Jews and Gentile in one\nbody with Christ as the head, Many people still do not understand \nGod's plan; but at the right time, He will bring us together to be with\nHim forever...\n\nThen everyone will understand. On that day, all people will bow to \nJesus as Lord, either because they love Him or because they fear\nHis power (See Phil. 2:10, 11).\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for Your wonderful plan to \none day bring all people together to worship You the One True \nGod. Help me become a better witness that I might have a hand\nin making this message clear to more people...\n\nKeep looking up, for Godly wisdom...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\nPs. please hold all e-mail to me until after Oct. 15th",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11c55bbcff6a8c41",
    "date_utc": "Thu, 11 Sep 2008 06:37:17 -0600",
    "subject": "thoughts to live by",
    "verse": "In Him we were also chosen, having been predestined according to the plan of Him who works out everything in conformity with the purpose of His will, in order that we, who were the first to hope in Christ, might be for the praise of His glory. (Eph. 1:11, 12) NIV",
    "reflection": "It has, and always will be, God's purpose to offer salvation to the world, which He planned since the beginning of time. God is sovereign, He is in charge. Oh so often our lives seem to become chaotic, but we can always rest in this truth: Jesus is Lord, and God is in control. God's purpose to save you cannot be thwarted, no matter what evil Satan may bring.",
    "prayer": "Dear Heavenly Father, I thank You that no matter how chaotic my life may seem, I still have this one abiding truth ~ \"You are Lord, and still in control.\" I pray that today I would remain obedient to Your leading, so that there would be some order to my life. Amen.",
    "reading": "",
    "original_content": "09/12/08 ~~~ PLEASE!!! ~~~ Hold all e-mails to me beginning Saturday I will\nbe gone for a month ~~~ Thank you!\n\nOur Bible Verses for Today:\n\nIn Him we were also chosen, having been predestined according\nto the plan of Him who works out everything in conformity with the\npurpose of His will,\n\nin order that we, who were the first to hope in Christ, might be for\nthe praise of His glory...(Eph. 1:11, 12) NIV\n\nOur Lesson for Today:\n\nIt has, and always will be, God's purpose to offer salvation to the world, \nwhich He planned since the beginning of time. God is sovereign, He is\nin charge...\n\nOh so often our lives seem to become chaotic, but we can always rest\nin this truth: Jesus is Lord, and God is in control. God's purpose to save \nyou cannot be thwarted, no matter what evil Satan may bring...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You that no matter how chaotic\nmy life may seem, I still have this one abiding truth ~ \"You are \nLord, and still in control.\" I pray that today I would remain \nobedient to Your leading, so that there would be some order \nto my life...Amen.\n\nKeep looking up, you can not go wrong if you follow Him...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]
