[
  {
    "message_id": "1124c30c80cedd3d",
    "date_utc": "Wed, 2 May 2007 04:46:23 -0600",
    "subject": "thoughts to live by",
    "verse": "Pray for us. We are sure that we have a clear conscience and desire to live honorably in every way. I particularly urge you to pray so that I may be restored to you soon. (Heb. 13:18, 19) NIV",
    "reflection": "The writer here recognizes the need for prayer. Christian leaders are especially vulnerable to criticism from others, pride (if they succeed), depression (if they fail), and Satan's constant efforts to destroy their work for God. They desperately need our prayers! Think for a minute, for whom should you regularly pray???",
    "prayer": "Dear Heavenly Father, I thank you for the avenue of prayer. There are many whom need our prayers but so often we are so concerned about our own little problems that we forget to pray for those who really need our prayers. Forgive me Lord for this sin of omission. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~food for thought)~~~Be ye fishers of men. You catch them - He'll clean them...\n\nOur Meditation for Today:\n\nPray for us. We are sure that we have a clear conscience\nand desire to live honorably in every way...\n\nI particularly urge you to pray so that I may be restored to \nyou soon...(Heb. 13:18, 19) NIV\n\nOur Thought for Today:\n\nThe writer here recognizes the need for prayer...\n\nChristian leaders are especially vulnerable to criticism from others, \npride (if they succeed), depression (if they fail), and Satan's constant\nefforts to destroy their work for God...\n\nThey desperately need our prayers!\n\nThink for a minute, for whom should you regularly pray???\n\nOur Prayer for Today:\nDear Heavenly Father, I thank you for the avenue of prayer.\nThere are many whom need our prayers but so often we\nare so concerned about our own little problems that we forget\nto pray for those who really need our prayers. Forgive me\nLord for this sin of omission...Amen.\n\nKeep looking up, with an attitude of gratitude...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1125159cdec70da5",
    "date_utc": "Wed, 2 May 2007 18:24:47 -0600",
    "subject": "thoughts to live by",
    "verse": "May the God of peace, who through the blood of the eternal covenant brought back from the dead our Lord Jesus, that great Shepherd of the sheep, equip you with everything good for doing His will, and may He work in us what is pleasing to Him, through Jesus Christ, to whom be glory for ever and ever. Amen. (Heb. 13:20, 21) NIV",
    "reflection": "What we should see is that these verses include two significant results of Christ's death and resurrection. God works in us to make us the kind of people that would please Him, and He equips us to do the kind of work that would please Him. So let God change you from within and then use you to help others.",
    "prayer": "Dear Heavenly Father, I thank You for the results that were brought about by Christ's death and His resurrection. I pray that I would allow You to work in my heart that my life would be pleasing to You. I pray that I would allow You to use me as You wish. Bless and keep my e-mail friends healthy and safe. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~Coincidence is when God chooses to remain anonymous...\n\nOur Meditation for Today:\n\nMay the God of peace, who through the blood of the eternal\ncovenant brought back from the dead our Lord Jesus, that \ngreat Shepherd of the sheep,\n\nequip you with everything good for doing His will, and may He \nwork in us what is pleasing to Him, through Jesus Christ, to\nwhom be glory for ever and ever...Amen. (Heb. 13:20, 21) NIV\n\nOur Thought for Today:\n\nWhat we should see is that these verses include two significant \nresults of Christ's death and resurrection...\n\nGod works in us to make us the kind of people that would please\nHim, and He equips us to do the kind of work that would please\nHim...\n\nSo let God change you from within and then use you to help others...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the results that were\nbrought about by Christ's death and His resurrection. I pray \nthat I would allow You to work in my heart that my life would\nbe pleasing to You. I pray that I would allow You to use me \nas You wish...\n\nBless and keep my e-mail friends healthy and safe...Amen.\n\nKeep Looking up, with an attitude of gratitude...\nYou're in the prayers of two who care... \nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11256708b476e7f4",
    "date_utc": "Fri, 4 May 2007 04:32:10 -0600",
    "subject": "thoughts to live by",
    "verse": "Greet all your leaders and all God's people. Those from Italy send you their greetings. Grace be with you all. (Heb. 13:24, 25)",
    "reflection": "The book of Hebrew has been a call to Christian maturity. It was addressed to first-century Jewish Christians, but it applies to Christians of any age or background. Christian maturity means making Christ the beginning and the end of our faith. To grow in maturity we must center our life on Him, not depending on religious ritual, not falling back into sin, not trusting in ourselves, and not letting anything come between us and Christ. Christ is sufficient and superior.",
    "prayer": "Dear Lord, what a wonderful thought that comes to mind when I think about the Savior, He is the beginning and the end. What a difference when comparing this world where all we have here is temporary. I thank you for this relationship. Mt. 6:19-21 is so true, \"Don't store up your treasures here; store them in heaven. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~ (food for thought)~~~Don't put a question mark where God has put a period...\n\nOur Meditation for Today:\n\nGreet all your leaders and all God's people. Those from Italy\nsend you their greetings...\n\nGrace be with you all...(Heb. 13:24, 25)\n\nOur Thought for Today:\n\nThe book of Hebrew has been a call to Christian maturity.\nIt was addressed to first-century Jewish Christians, but it\napplies to Christians of any age or background...\n\nChristian maturity means making Christ the beginning and \nthe end of our faith. To grow in maturity we must center our\nlife on Him, \n\nnot depending on religious ritual,\nnot falling back into sin,\nnot trusting in ourselves,\nand not letting anything come between\nus and Christ...\n\nChrist is sufficient and superior...\n\nOur Prayer for Today:\nDear Lord, what a wonderful thought that comes to mind\nwhen I think about the Savior, He is the beginning and the \nend. What a difference when comparing this world where\nall we have here is temporary...I thank you for this relationship.\nMt. 6:19-21 is so true, \"Don't store up your treasures here;\nstore them in heaven...Amen.\n\nThis is the last devotional from Hebrews I will now start\nwith the book of Romans...\n\nKeep looking up, with an attitude of gratitude...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1125b9a07a215e0a",
    "date_utc": "Sat, 5 May 2007 04:35:35 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul, a servant of Jesus Christ, called to be an apostle, set apart for the gospel of God, Which He promised beforehand through His prophets in the Holy Scriptures, The gospel concerning His Son, who was descended from David according to the flesh And designated Son of God in power according to the Spirit of holiness by His resurrection from the dead, Jesus Christ our Lord. (Ro. 1:1-4)",
    "reflection": "Paul is quiet bold in his declaration of the greatness and certainty of his message. He claims a commission from God to deliver a message, \"the gospel concerning His Son.\" Paul's emphases is that God sent His Son into the world to redeem mankind otherwise lost because of sin. Matthew also declared this in reviewing the genealogy of Jesus in (Mt 1:1-17). It is also John's premise when he declared that Jesus, the Word \"became flesh and dwelt among us\" Jn. 1:14). Is this difficult for you to believe? YES! Christ became incarnate to redeem those who would believe in Him. Because of this there are million both in this life and in eternity who raise their songs in praise to His saving grace.",
    "prayer": "Dear Heavenly Father, I thank You and praise You for Christ's redeeming power. I thank You for the promise of eternal life where there will be no more suffering or death. Where we will live eternally. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~Don't wait for six strong men to take you to church...\n\nOur Meditation for Today:\n\nPaul, a servant of Jesus Christ, called to be an apostle, set apart\nfor the gospel of God, \n\nWhich He promised beforehand through His prophets in the Holy Scriptures, \n\nThe gospel concerning His Son, who was descended from David according \nto the flesh \n\nAnd designated Son of God in power according to the Spirit of holiness by His \nresurrection from the dead, Jesus Christ our Lord...(Ro. 1:1-4) \n\nOur Thought for Today:\n\nPaul is quiet bold in his declaration of the greatness and certainty\nof his message. He claims a commission from God to deliver a\nmessage, \"the gospel concerning His Son.\"\n\nPaul's emphases is that God sent His Son into the world to redeem\nmankind otherwise lost because of sin...\n\nMatthew also declared this in reviewing the genealogy of Jesus in \n(Mt 1:1-17).\n\nIt is also John's premise when he declared that Jesus, the Word\n\"became flesh and dwelt among us\" Jn. 1:14).\n\nIs this difficult for you to believe?\n\nYES! Christ became incarnate to redeem those who would \nbelieve in Him...\n\nBecause of this there are million both in this life and in eternity\nwho raise their songs in praise to His saving grace...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You and praise You for\nChrist's redeeming power. I thank You for the promise \nof eternal life where there will be no more suffering or\ndeath. Where we will live eternally...Amen.\n\nKeep looking up, toward the SON...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11265f07b1984876",
    "date_utc": "Sun, 6 May 2007 18:35:43 -0600",
    "subject": "thoughts to live by",
    "verse": "Through Christ, God has given us the privilege and authority to tell Gentiles everywhere what God has done for them, so that they will believe and obey Him, bringing glory to His name. (Ro. 1:5) NIV",
    "reflection": "We need to remember, that as Christians we have a privilege and a great responsibility. Paul and the apostles received the privilege of being called, but they also received the authority and the responsibility to share with others what God has done. God also graciously forgives our sins when we believe in Him as Lord. In doing this, we are committing ourselves to begin a new life. Paul's new life also involved a God-given responsibility: to witness about God's Good News to the world as a missionary. God may or may not call you to be a foreign missionary, but He does call you (and all believers) to be Christ's ambassador and to witness to the changed life that Jesus Christ has begun in you.",
    "prayer": "Dear Lord, because of Your name being glorified let Your mercy abound in me, to save me however unworthy I am. Sanctify me in Your Word for Your Word is true. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~Without Christ there is no grace...\n\nOur Meditation for Today:\n\nThrough Christ, God has given us the privilege and authority\nto tell Gentiles everywhere what God has done for them, so\nthat they will believe and obey Him, bringing glory to His name.\n(Ro. 1:5) NIV\n\nOur Thought for Today:\n\nWe need to remember, that as Christians we have a privilege\nand a great responsibility...\n\nPaul and the apostles received the privilege of being called,\nbut they also received the authority and the responsibility to\nshare with others what God has done...\n\nGod also graciously forgives our sins when we believe in Him\nas Lord. In doing this, we are committing ourselves to begin \na new life...\n\nPaul's new life also involved a God-given responsibility: to\nwitness about God's Good News to the world as a missionary.\n\nGod may or may not call you to be a foreign missionary, but\nHe does call you (and all believers) to be Christ's ambassador\nand to witness to the changed life that Jesus Christ has begun\nin you...\n\nOur Prayer for Today:\nDear Lord, because of Your name being glorified let Your\nmercy abound in me, to save me however unworthy I am.\nSanctify me in Your Word for Your Word is true...Amen.\n\nKeep looking up, with an attitude of gratitude...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1126b3c7bcbfb57e",
    "date_utc": "Tue, 8 May 2007 05:26:51 -0600",
    "subject": "thoughts to live by",
    "verse": "Dear friends in Rome. God loves you dearly, and He has called you to be His very own people. May grace and peace be yours from God our Father and the Lord Jesus Christ. (Ro. 1:7) NIV",
    "reflection": "All who are in Christ are entitled saints of God. There is no exception. There is no middle class. despite all degrees of sin among humans there are simply two classes in relation to God, namely, Christians and nonChristians, saints or sinners. Saintliness is the acceptance of Christ's merit and worthiness. It is being made the partaker of an inheritance otherwise not one's own. It is a gift of divine grace because even the most mature saints are not sinless and holy in themselves. Paul's greeting, \"May grace and peace be yours from God our Father and the Lord Jesus Christ.\" has two directives.\"Grace\" relates to the forgiveness of sins; \"Peace\" relates to a conscience free from unrest. When we have learned that no evil can befall us without the Father's knowledge, and that He wills only blessing for the believer, then there can be true peace of mind and heart. Our Lord spoke of this when He said, \"Peace I leave with you; My peace I give to you\" (Jn. 14:27).",
    "prayer": "Dear Lord, I thank You for the assurance of the forgiveness of my sins, and the peace of mind that come with the forgiveness of my sins. I thank You too for the knowledge that no evil can come upon me with out your knowledge of it. Bless and protect my e-mail friends today. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~Luther, \"Grace and peace comprehend the whole Christian life.\"\n\nOur Meditation for Today:\n\nDear friends in Rome. God loves you dearly, and He has called you\nto be His very own people. May grace and peace be yours from God \nour Father and the Lord Jesus Christ...(Ro. 1:7) NIV\n\nOur Thought for Today:\n\nAll who are in Christ are entitled saints of God. There is no\nexception. There is no middle class...\n\ndespite all degrees of sin among humans there are simply \ntwo classes in relation to God, namely, Christians and nonChristians, saints or sinners...\n\nSaintliness is the acceptance of Christ's merit and worthiness.\nIt is being made the partaker of an inheritance otherwise not \none's own...\n\nIt is a gift of divine grace because even the most mature saints\nare not sinless and holy in themselves...\n\nPaul's greeting, \"May grace and peace be yours from God our\nFather and the Lord Jesus Christ.\" has two directives...\n\n\"Grace\" relates to the forgiveness of sins; \"Peace\" relates to a \nconscience free from unrest...\n\nWhen we have learned that no evil can befall us without the Father's \nknowledge, and that He wills only blessing for the believer, then\nthere can be true peace of mind and heart...\n\nOur Lord spoke of this when He said, \"Peace I leave with you; My\npeace I give to you\" (Jn. 14:27)...\n\nOur Prayer for Today:\nDear Lord, I thank You for the assurance of the forgiveness\nof my sins, and the peace of mind that come with the forgiveness\nof my sins...I thank You too for the knowledge that no evil can\ncome upon me with out your knowledge of it...\n\nBless and protect my e-mail friends today...Amen.\n\nKeep looking up, with an attitude of gratitude...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1127044a8bf9730e",
    "date_utc": "Tue, 8 May 2007 14:51:08 -0600",
    "subject": "thoughts to live by",
    "verse": "I thank my God through Jesus Christ for all or you, because your faith is proclaimed in all the world. (Ro. 1:8) NIV",
    "reflection": "We can rejoice knowing that people are seeking Christ even though they are not free from faults. Children within a home are heirs at their birth. They are given parental love though there are differences in their ages, development, and personality. This is also true of the family of God. we are all beloved of God through Jesus Christ the Savior.",
    "prayer": "Dear Lord, I pray that my faith would be a witness of my love for You. I pray for Your guidance that my faith would always shine for You. Forgive me for all the times I have fallen short of the mark. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~We are all beloved of God through Jesus Christ the Savior...\n\n\nOur Meditation for Today:\n\nI thank my God through Jesus Christ for all or you,\nbecause your faith is proclaimed in all the world...(Ro. 1:8) NIV\n\nOur Thought for Today:\n\nWe can rejoice knowing that people are seeking Christ even though\nthey are not free from faults. Children within a home are heirs at their \nbirth. They are given parental love though there are differences in their\nages, development, and personality...\n\nThis is also true of the family of God. we are all beloved of God through \nJesus Christ the Savior...\n\nOur Prayer for Today:\nDear Lord, I pray that my faith would be a witness of my love\nfor You. I pray for Your guidance that my faith would always \nshine for You. Forgive me for all the times I have fallen short \nof the mark...Amen.\n\nKeep looking up, with an attitude of gratitude...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1127aad6048b580c",
    "date_utc": "Thu, 10 May 2007 13:42:58 -0600",
    "subject": "thoughts to live by",
    "verse": "I long to see you, that I may impart some spiritual gift to strengthen you, that is, that we may be mutually encouraged by each other's faith, both yours and mine. (Ro. 1:11, 12)",
    "reflection": "As Paul, we should be hopeful that we can be used by God to assist others in further growth and nurture. One glowing ember will fire a weaker one next to it. The company of believers results in the infusing and infiltration of spiritual power among them.",
    "prayer": "Dear Heavenly Father, I thank You for the fellowship of other believers. I pray that I would be an encouragement to those who are troubled. Help me to be a glowing ember. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~Faith aglow is strengthening to others...\n\nOur Meditation for Today:\n\nI long to see you, that I may impart some spiritual gift to\nstrengthen you, that is, \n\nthat we may be mutually encouraged by each other's faith,\nboth yours and mine...(Ro. 1:11, 12) \n\nOur Thought for Today:\n\nAs Paul, we should be hopeful that we can be used by God \nto assist others in further growth and nurture...\n\nOne glowing ember will fire a weaker one next to it...\n\nThe company of believers results in the infusing and \ninfiltration of spiritual power among them...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the fellowship of \nother believers. I pray that I would be an encouragement\nto those who are troubled. Help me to be a glowing ember...Amen.\n\nKeep looking up, with an attitude of gratitude...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1127fa0d6f64da6f",
    "date_utc": "Fri, 11 May 2007 14:41:17 -0600",
    "subject": "thoughts to live by",
    "verse": "I am obligated both to the Greeks and non-Greeks, both the wise and to the foolish. (Ro. 1:14) NIV",
    "reflection": "Like with Paul, there should be an urgent compulsion in the heart of every believer to bring the Gospel to everyone regardless of their differences. . It should be our burning desire to bring the knowledge of our Lord's salvation to as many as possible regardless of their stature or station in life.",
    "prayer": "Dear Heavenly Father, Help me to always be faithful in sharing the Gospel with all who will listen. Instill in me a sense of urgency in the need to share Your Word. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~Always be open to God's leading...\n\nOur Meditation for Today:\n\nI am obligated both to the Greeks and non-Greeks, \nboth the wise and to the foolish...(Ro. 1:14) NIV\n\nOur Thought for Today:\n\nLike with Paul, there should be an urgent compulsion\nin the heart of every believer to bring the Gospel to\neveryone regardless of their differences....\n\nIt should be our burning desire to bring the knowledge\nof our Lord's salvation to as many as possible regardless \nof their stature or station in life...\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to always be faithful in\nsharing the Gospel with all who will listen. Instill in me a \nsense of urgency in the need to share Your Word...Amen.\n\nKeep looking Up, with an attitude of gratitude...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1128a03de0909ade",
    "date_utc": "Mon, 14 May 2007 04:53:53 -0600",
    "subject": "thoughts to live by",
    "verse": "I am not ashamed of the Gospel: it is the power of God for salvation to everyone who has faith, to the Jew first and also to the Greek. (Ro. 1:16)",
    "reflection": "There are many who regard the Gospel of Jesus Christ as foolishness. To be identified as a witness of the Gospel means that one may be counted as foolish, and persecution may follow. Paul knew the consequences of this identity with the Gospel and he was not ashamed. The Gospel of Christ demands unconditional surrender of the intellect and the will. Of course this is not pleasing to the nature of man. the independence that he loves so much is threatened. The Gospel is not loved by the unbelieving world. The main reason for Paul's boldness regarding the Gospel was that, \"it is the power of God for salvation.\" The benefit of this power is received by \"everyone who has faith.\"",
    "prayer": "Dear Heavenly Father, give me the boldness and the wisdom to share the Gospel with those who regard it as foolishness. I pray that there would be a revival in the world, and let it start with me. Bless and protect my friends today. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought~~~The beneficiaries of the Gospel are those who believe...\n\nOur Meditation for Today:\n\nI am not ashamed of the Gospel: it is the power of God for salvation \nto everyone who has faith, to the Jew first and also to the Greek.\n(Ro. 1:16)\n\nOur Thought for Today:\n\nThere are many who regard the Gospel of Jesus Christ as foolishness.\nTo be identified as a witness of the Gospel means that one may be\ncounted as foolish, and persecution may follow...\n\nPaul knew the consequences of this identity with the Gospel and he was\nnot ashamed...\n\nThe Gospel of Christ demands unconditional surrender of the intellect and\nthe will. Of course this is not pleasing to the nature of man. the independence\nthat he loves so much is threatened. The Gospel is not loved by the unbelieving \nworld...\n\nThe main reason for Paul's boldness regarding the Gospel was that, \"it is the\npower of God for salvation.\" The benefit of this power is received by \"everyone\nwho has faith.\"\n\nOur Prayer for Today:\nDear Heavenly Father, give me the boldness and the wisdom\nto share the Gospel with those who regard it as foolishness.\nI pray that there would be a revival in the world, and let it start\nwith me. Bless and protect my e-mail friends today...Amen.\n\nKeep looking up, with an attitude of gratitude...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "112911a8fd62529b",
    "date_utc": "Tue, 15 May 2007 05:22:08 -0600",
    "subject": "thoughts to live by",
    "verse": "For in a righteousness from God is revealed, a righteousness that is by faith from first to last, just as it is written: \"The righteous will live by faith. (Ro. 1:17) NIV.",
    "reflection": "What is being said is: the righteousness of God is made known through the Gospel. What a revelation this is! It is this, that Christ's merit is imputed to believers. It is a right given to believers, and it is the only righteousness that will stand valid before God. This plan was conceived in the mind of God in order to provide a way of righteousness for persons who would claim it, through members of a fallen race. This way of righteousness has been wrought for us through Jesus Christ. It is appropriated by faith, and by it a sinner is acquitted from all guilt. When a person accepts this righteousness offered by the Lord his name is entered into the book of life and he becomes an heir to eternal life.",
    "prayer": "I thank You Lord for the Gospel and the truth which is revealed in it. I thank You for providing a way for each believer to inherit eternal life. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~God grades on the cross, not the curve...\n\nOur Meditation for Today:\n\nFor in a righteousness from God is revealed, a righteousness \nthat is by faith from first to last, just as it is written: \"The righteous\nwill live by faith...(Ro. 1:17) NIV...\n\nOur Thought for Today:\n\nWhat is being said is: the righteousness of God is made known through\nthe Gospel. What a revelation this is!\n\nIt is this, that Christ's merit is imputed to believers. It is a right given to\nbelievers, and it is the only righteousness that will stand valid before God.\n\nThis plan was conceived in the mind of God in order to provide a way of\nrighteousness for persons who would claim it, through members of a fallen\nrace...\n\nThis way of righteousness has been wrought for us through Jesus Christ.\nIt is appropriated by faith, and by it a sinner is acquitted from all guilt...\n\nWhen a person accepts this righteousness offered by the Lord his name\nis entered into the book of life and he becomes an heir to eternal life...\n\nOur Prayer for Today:\nI thank You Lord for the Gospel and the truth which is\nrevealed in it. I thank You for providing a way for each\nbeliever to inherit eternal life...Amen.\n\nKeep looking up, with an attitude of gratitude...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1129454aa106f779",
    "date_utc": "Tue, 15 May 2007 18:29:28 -0600",
    "subject": "thoughts to live by",
    "verse": "The wrath of God is being revealed from heaven against all the godlessness and wickedness of men who suppress the truth by their wickedness. (Ro. 1:18) NIV",
    "reflection": "These words tell of impending judgement awaiting those who do not possess the righteousness that God provided through His Son, Jesus Christ. The need for the Gospel is made clear because we are informed of the need that is ours. Unless we have Christ we have the wrath of God hovering over us. This warning is made very clear in vs. 5 of chapter 2: \"By your hard and impenitent heart you are storing up wrath for yourself on the day of wrath when God's righteous Judgement will be revealed.\"",
    "prayer": "Dear Heavenly Father, I thank You again that the Gospel warns me of my need for repentance. So, I ask that You would forgive me of my sins of thought, word and deed. I thank You for the finished work of Christ on the cross. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~Don't give God instructions, just report for duty...\n\nOur Meditation for Today:\n\nThe wrath of God is being revealed from heaven against\nall the godlessness and wickedness of men who suppress\nthe truth by their wickedness...(Ro. 1:18) NIV\n\nOur Thought for Today:\n\nThese words tell of impending judgement awaiting those who do not\npossess the righteousness that God provided through His Son, Jesus\nChrist...\n\nThe need for the Gospel is made clear because we are informed of the\nneed that is ours...\n\nUnless we have Christ we have the wrath of God hovering over us...\n\nThis warning is made very clear in vs. 5 of chapter 2: \"By your hard and\nimpenitent heart you are storing up wrath for yourself on the day of wrath\nwhen God's righteous Judgement will be revealed.\"\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You again that the Gospel warns me\nof my need for repentance. So, I ask that You would forgive me of my\nsins of thought, word and deed. I thank You for the finished work of\nChrist on the cross...Amen.\n\nKeep looking up with an attitude of gratitude...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "112997d5db61410b",
    "date_utc": "Wed, 16 May 2007 15:34:03 -0600",
    "subject": "thoughts to live by",
    "verse": "Since the creation of the world God's invisible qualities, His eternal power and divine nature, have been clearly seen, being understood from what has been made, so that men are without excuse. (Ro. 1:20) NIV",
    "reflection": "What Paul is saying is that even the Gentiles possess a degree of knowledge that makes them responsible before God. The evidences and wonders of creation are so clear that even the non-Christian world can see God's power. This evidence is all the more impressive in contrast with the \"ungodliness and the wickedness of men.\"",
    "prayer": "Dear heavenly Father, it is sad how some people try so frantically to explain away the creation of the word and all that is in it and even the existence of the human race. I thank You Lord for Your wisdom in creating all things, and Your sustaining power. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~You can tell how big a person is, \nby what it takes to discourage him...\n\nOur Meditation for Today:\n\nSince the creation of the world God's invisible qualities, His eternal\npower and divine nature, have been clearly seen, being understood\nfrom what has been made, so that men are without excuse...(Ro. 1:20) NIV\n\nOur Thought for Today:\n\nWhat Paul is saying is that even the Gentiles possess a degree of knowledge\nthat makes them responsible before God...\n\nThe evidences and wonders of creation are so clear that even the non-Christian\nworld can see God's power. This evidence is all the more impressive in contrast\nwith the \"ungodliness and the wickedness of men.\"\n\nOur Prayer for Today:\nDear heavenly Father, it is sad how some people try so frantically \nto explain away the creation of the word and all that is in it and even\nthe existence of the human race. I thank You Lord for Your wisdom \nin creating all things, and Your sustaining power...Amen.\n\nKeep looking up, and give thanks for His sustaining power...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1129e9826c8f400e",
    "date_utc": "Thu, 17 May 2007 06:30:16 -0600",
    "subject": "thoughts to live by",
    "verse": "For although they knew God, they neither glorified Him as God, nor give thanks to Him, but their thinking became futile and their foolish hearts were darkened. (Ro. 1:21) NIV",
    "reflection": "God has given us the true Gospel. He has bestowed His grace upon us. He has placed before us the wonders of creation testifying to His majesty. He has given us His Son to become our brother, mediator, and redeemer. He met every demand of the law, and offered His blood to redeem us from sin and the curse. He has given us His Word, telling us all about it. Day by day He sends His Holy Spirit to nurture the life of godliness within us. But there are many who still follow their own desires, disregarding God's Word and His will. But God will deal with them according to the words of this text.",
    "prayer": "Dear Lord, I thank You for Your Word which makes it clear what Your will is for man-kind. I pray that those who seek their own desires would come to the knowledge of the truth and seek Your will for their lives. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~There are many, who follow their own desires,\ndisregarding God's Word and His will...\n\nOur Meditation for Today:\n\nFor although they knew God, they neither glorified Him as God,\nnor give thanks to Him, but their thinking became futile and their \nfoolish hearts were darkened... (Ro. 1:21) NIV\n\nOur Thought for Today:\n\nGod has given us the true Gospel. He has bestowed His grace \nupon us. He has placed before us the wonders of creation testifying to His majesty...\n\nHe has given us His Son to become our brother, mediator, and \nredeemer. He met every demand of the law, and offered His blood\nto redeem us from sin and the curse...\n\nHe has given us His Word, telling us all about it. Day by day He \nsends His Holy Spirit to nurture the life of godliness within us...\n\nBut there are many who still follow their own desires, disregarding \nGod's Word and His will. But God will deal with them according to\nthe words of this text...\n\nOur Prayer for Today:\nDear Lord, I thank You for Your Word which makes it clear \nwhat Your will is for man-kind. I pray that those who seek\ntheir own desires would come to the knowledge of the truth\nand seek Your will for their lives...Amen.\n\nKeep looking up, and follow His will...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "112a3b948ba75a03",
    "date_utc": "Fri, 18 May 2007 17:00:53 -0600",
    "subject": "thoughts to live by",
    "verse": "Although they claim to be wise, they became fools and exchanged the glory of the immortal God for images made to look like mortal man and birds and animals and reptiles. (Ro. 1:22, 23) NIV",
    "reflection": "Through the ages the sin of pride has been unpleasing to God. Very often the most judicious minds and the most learned philosophers have fallen into gross foolishness when they have cast aside the fear of God in their claim to be wise. They have made fools of themselves, substituting all manner of idolatry in an effort to satisfy their religious hunger. One needs to be careful not to fall into the sin of pride, because more often than not that person will also casts aside God for some material object.",
    "prayer": "Dear Heavenly Father, I pray that my focus would always be on You. May my worship always be on You the creator and not on the created. I pray that my spiritual hunger would be on You O Lord. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~The sin of pride is in essence rebellion against God...\n\nOur Meditation for Today:\n\nAlthough they claim to be wise, they became fools and exchanged\nthe glory of the immortal God for images made to look like mortal\nman and birds and animals and reptiles...(Ro. 1:22, 23) NIV\n\nOur Thought for Today:\n\nThrough the ages the sin of pride has been unpleasing to God.\nVery often the most judicious minds and the most learned\nphilosophers have fallen into gross foolishness when they have\ncast aside the fear of God in their claim to be wise...\n\nThey have made fools of themselves, substituting all manner of\nidolatry in an effort to satisfy their religious hunger...\n\nOne needs to be careful not to fall into the sin of pride, because \nmore often than not that person will also casts aside God for some \nmaterial object...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that my focus would always be\non You. May my worship always be on You the creator and \nnot on the created. I pray that my spiritual hunger would be\non You O Lord...Amen.\n\nKeep looking up, then you are sure to be focused on Him...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "112ae1364ffb49f6",
    "date_utc": "Sun, 20 May 2007 15:16:20 -0600",
    "subject": "thoughts to live by",
    "verse": "Therefore God gave them over in the sinful desires of their hearts to sexual impurity for the degrading of their bodies with one another. They exchanged the truth of God for a lie, and worshiped and served created things rather then the creator, who is forever praised. Amen. (Ro. 1:24, 25) NIV",
    "reflection": "These words reveal the consequences of refusing to follow the gospel light that has been offered by our Lord. He simply leaves such stubborn ones to the lists of their own hearts. Powers of evil are so overwhelming to man that if the Lord forsakes him he will be immersed in all manner of sin and shame. If God did not check this deluge there could be no social order in existence. Even where the powers of grace are hindered God has provided checks against the destruction that wickedness causes. Some of these checks are common sense, fear of shame, fear of injury, and a desire for self-respect. But when the judgment of God is directed against gross wrongs of mankind He withholds the checks against the outbreak of sin. SO!!! Let us always give God the glory that is due Him.",
    "prayer": "Dear Heavenly Father, I pray that Your Holy Spirit will one day awaken these wayward ones, that they would turn from the lusts of their hearts. Help me to be mindful the give You the honor that is due You. Place your protective hand upon our troops--and my e-mail friends. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~We are to give God the glory that is due Him...\n\nOur Meditation for Today:\n\nTherefore God gave them over in the sinful desires of their hearts\nto sexual impurity for the degrading of their bodies with one another.\n\nThey exchanged the truth of God for a lie, and worshiped and served\ncreated things rather then the creator, who is forever praised...Amen.\n(Ro. 1:24, 25) NIV\n\nOur Thought for Today:\n\nThese words reveal the consequences of refusing to follow\nthe gospel light that has been offered by our Lord...\n\nHe simply leaves such stubborn ones to the lists of their own\nhearts. Powers of evil are so overwhelming to man that if the \nLord forsakes him he will be immersed in all manner of sin and\nshame...\n\nIf God did not check this deluge there could be no social order \nin existence. Even where the powers of grace are hindered God \nhas provided checks against the destruction that wickedness causes.\n\nSome of these checks are common sense, fear of shame, fear of\ninjury, and a desire for self-respect. But when the judgment of God\nis directed against gross wrongs of mankind He withholds the checks \nagainst the outbreak of sin...\n\nSO!!! Let us always give God the glory that is due Him...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that Your Holy Spirit will one \nday awaken these wayward ones, that they would turn from \nthe lusts of their hearts. Help me to be mindful the give You\nthe honor that is due You. Place your protective hand upon\nour troops--and my e-mail friends...Amen.\n\nKeep looking up, seeking His gracious will...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "112b358632d21a01",
    "date_utc": "Mon, 21 May 2007 17:04:49 -0600",
    "subject": "thoughts to live by",
    "verse": "Because of this, God gave them over to their shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lusts for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion. (Heb. 1:26, 27) NIV",
    "reflection": "When people dishonor God, reducing His image to that of man or animals, they sink lower than beasts. They practice iniquity lower than what might be considered that of animals. Not only are the coarse and grossly evil persons guilty of these sins, but learned ones and cultured people also have fallen in similar ways. When such filthy practices make slaves of the educated and the cultured it is evident that the avenger is near.",
    "prayer": "Dear Heavenly Father, There is much need for repentance in the world today. It is just as You predicted it would be many have given themselves over to the lust of the flesh. I pray that there would be a cleansing in the world and that these people would turn once again to righteousness. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~The task ahead of us is never as great \nas the power behind us...\n\nOur Meditation for Today:\n\nBecause of this, God gave them over to their shameful lusts.\nEven their women exchanged natural relations for unnatural\nones.\n\nIn the same way the men also abandoned natural relations\nwith women and were inflamed with lusts for one another.\nMen committed indecent acts with other men, and received \nin themselves the due penalty for their perversion...(Heb. 1:26, 27) NIV\n\nOur Thought for Today:\n\nWhen people dishonor God, reducing His image to that of man \nor animals, they sink lower than beasts. They practice iniquity \nlower than what might be considered that of animals...\n\nNot only are the coarse and grossly evil persons guilty of these\nsins, but learned ones and cultured people also have fallen in \nsimilar ways...\n\nWhen such filthy practices make slaves of the educated and the \ncultured it is evident that the avenger is near...\n\nOur Prayer for Today:\nDear Heavenly Father, There is much need for repentance \nin the world today. It is just as You predicted it would be\nmany have given themselves over to the lust of the flesh.\nI pray that there would be a cleansing in the world and that\nthese people would turn once again to righteousness...Amen.\n\nKeep looking up, for the cleansing power...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "112b8564c8b06813",
    "date_utc": "Tue, 22 May 2007 10:24:14 -0600",
    "subject": "thoughts to live by",
    "verse": "Furthermore, since they did not think it worthwhile to retain the knowledge of God, He gave them over to a depraved mind, to do what ought not be done. They have become filled with every kind of wickedness, evil greed and depravity. They are full of envy, murder, strife, deceit, and malice. They are gossips, slanders, God-haters, Insolent, arrogant and boastful; they invent ways of doing evil; they disobey their parents; they are senseless, faithless, heartless, ruthless. Although they know God's righteous decree that those who do such things deserve death, they not only continue to do these very things but also approve of those who practice them. (Ro. 1:28-32) NIV",
    "reflection": "Approving wrong identifies the one who approves with the ungodly. Those who do this give evidence of the law of sin that is at work within them. Defending sin, as the unregenerate defend their wrongdoing, is an indication of rebellion against God. The consequences is that rebellion brings the judgement of God, and the wrath of God will rest upon ungodliness. But repentant ones are willing to flee into the city of refuge, through the narrow gate, to be cleansed by the atoning blood of Christ.",
    "prayer": "Dear Heavenly Father, we often point our fingers at the sins of others, but help us to be mindful that in Your eyes sin is sin, there is not one sin better or worse than another. So Lord I thank You for the atoning blood of Jesus Christ for all sin. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~The reason evil enters the lives of many is that, \nthere is no commitment to do good...\n\nOur Meditation for Today:\n\nFurthermore, since they did not think it worthwhile to retain \nthe knowledge of God, He gave them over to a depraved \nmind, to do what ought not be done...\n\nThey have become filled with every kind of wickedness, \nevil greed and depravity. They are full of envy, murder, \nstrife, deceit, and malice. \n\nThey are gossips, slanders, God-haters, Insolent, arrogant \nand boastful; they invent ways of doing evil; they disobey \ntheir parents;\n\nthey are senseless, faithless, heartless, ruthless.\n\nAlthough they know God's righteous decree that those who \ndo such things deserve death, they not only continue to do\nthese very things but also approve of those who practice them.\n(Ro. 1:28-32) NIV\n\nOur Thought for Today:\n\nApproving wrong identifies the one who approves with the ungodly.\nThose who do this give evidence of the law of sin that is at work\nwithin them...\n\nDefending sin, as the unregenerate defend their wrongdoing, is an\nindication of rebellion against God. The consequences is that rebellion\nbrings the judgement of God, and the wrath of God will rest upon\nungodliness...\n\nBut repentant ones are willing to flee into the city of refuge, through the \nnarrow gate, to be cleansed by the atoning blood of Christ...\n\nOur Prayer for Today:\nDear Heavenly Father, we often point our fingers at the\nsins of others, but help us to be mindful that in Your\neyes sin is sin, there is not one sin better or worse than \nanother. So Lord I thank You for the atoning blood of \nJesus Christ for all sin...Amen.\n\nKeep looking up, for every good thing comes from God...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather\n\nThere will be no devotions the month of June \nas Marcie and I will be gone...",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "112bd8f4245db4a9",
    "date_utc": "Wed, 23 May 2007 13:46:00 -0600",
    "subject": "thoughts to live by",
    "verse": "You, therefore, have no excuse, you who pass judgement on someone else, for at whatever point you judge the other, you are condemning yourself, because you who pass judgment do the same things. (Ro 2:1) NIV",
    "reflection": "The Jews held a favored position as God's chosen people. they had been given the divine law, and knowledge of the true God had been revealed to them. Because of this they were inclined to judge others who did not possess the knowledge they did. Paul warns against this human tendency to judge, it is an inclination that it often used as an attempt to defend oneself and to build personal security. But we need to remember, that we are all guilty before God.",
    "prayer": "Dear heavenly Father help us one and all to remember that as we point a finger at someone else, there are three fingers pointing back at us. Forgive me for being judgmental, help me to see my own faults first. Bless and protect my e-mail friends. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~Judge not for all are guilty before God\n\nOur Meditation for Today:\n\nYou, therefore, have no excuse, you who pass judgement\non someone else, for at whatever point you judge the other, \nyou are condemning yourself, because you who pass judgment\ndo the same things...(Ro 2:1) NIV\n\nOur Thought for Today:\n\nThe Jews held a favored position as God's chosen people.\nthey had been given the divine law, and knowledge of the true\nGod had been revealed to them...\n\nBecause of this they were inclined to judge others who did not\npossess the knowledge they did...\n\nPaul warns against this human tendency to judge, it is an\ninclination that it often used as an attempt to defend oneself\nand to build personal security...\n\nBut we need to remember, that we are all guilty before God.\n\nOur Prayer for Today:\nDear heavenly Father help us one and all to remember\nthat as we point a finger at someone else, there are three\nfingers pointing back at us. Forgive me for being judgmental,\nhelp me to see my own faults first...\nBless and protect my e-mail friends...Amen.\n\nKeep looking up, for all things come from God...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "112c2b3df32a4b30",
    "date_utc": "Thu, 24 May 2007 20:32:04 -0600",
    "subject": "thoughts to live by",
    "verse": "Now we know that God's judgment against those who do such things is based on truth. (Ro. 2:2) NIV",
    "reflection": "Paul aims his words at the self-deception of supposing that one can deceive God. The Jews reassured themselves on the conclusion that they were children of Abraham, God's covenant people. BUT they would not admit that they disregarded the will of God as revealed in the law. There is a comparison that may be made similarly to nominal Christians who follow outward practices of the church, though their lives indicate defiance of God's ways. They hope to gain eternal life without repentance and the new birth which God offers.",
    "prayer": "Dear Heavenly Father, I know that I have sinned against You, so I pray that You would forgive me of my sins of thought, word, and deed. I thank You for Your love and mercy. Watch over my friends I pray in Jesus name. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~One can not inherit eternal life without repentance...\n\nOur Meditation for Today:\n\nNow we know that God's judgment against those who do\nsuch things is based on truth...(Ro. 2:2) NIV\n\nOur Thought for Today:\n\nPaul aims his words at the self-deception of supposing that one can\ndeceive God...\n\nThe Jews reassured themselves on the conclusion that they were children\nof Abraham, God's covenant people. BUT they would not admit that they \ndisregarded the will of God as revealed in the law...\n\nThere is a comparison that may be made similarly to nominal Christians\nwho follow outward practices of the church, though their lives indicate \ndefiance of God's ways...\n\nThey hope to gain eternal life without repentance and the new birth which \nGod offers...\n\nOur Prayer for Today:\nDear Heavenly Father, I know that I have sinned against You,\nso I pray that You would forgive me of my sins of thought,\nword, and deed. I thank You for Your love and mercy. Watch\nover my e-mail friends I pray in Jesus name...Amen.\n\nKeep looking up, He's looking down...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "112c7d9b0479f866",
    "date_utc": "Fri, 25 May 2007 15:52:45 -0600",
    "subject": "thoughts to live by",
    "verse": "So when you, a mere man, pass judgment on them and yet do the same things, do you think you will escape God's judgment? (Ro. 2:3) NIV",
    "reflection": "Paul's reference here is intended to show that judging others cannot avert being judged. Rather, the wrong is magnified when judgment is made against sin that is practiced by the one who judges. Now the favor of God had been directed toward the Jews, and they had experienced much grace, so their judgment would be much more formidable.",
    "prayer": "Dear Lord, this country has been blessed in so many ways by Your favor. Each of us have much to be thankful for yet we point fingers at the sins of other nations for their sins, sins of which we too are guilty of. Forgive us Lord for our short-sidedness, I would pray that a revival would begin in this country. Amen.",
    "reading": "",
    "original_content": "HAVE A NICE DAY!!!~~~(food for thought)~~~Judge not lest ye be judged~~~\n\nOur Meditation for Today:\n\nSo when you, a mere man, pass judgment on them and \nyet do the same things, do you think you will escape God's\njudgment? (Ro. 2:3) NIV\n\nOur Thought for Today:\n\nPaul's reference here is intended to show that judging others\ncannot avert being judged... Rather, the wrong is magnified \nwhen judgment is made against sin that is practiced by the \none who judges...\n\nNow the favor of God had been directed toward the Jews,\nand they had experienced much grace, so their judgment \nwould be much more formidable...\n\nOur Prayer for Today:\nDear Lord, this country has been blessed in so many ways\nby Your favor. Each of us have much to be thankful for yet\nwe point fingers at the sins of other nations for their sins,\nsins of which we too are guilty of. Forgive us Lord for our\nshort-sidedness, I would pray that a revival would begin in\nthis country...Amen.\n\nKeep looking up and pray for a revival too...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]