[
  {
    "message_id": "11d6720e7534de51",
    "date_utc": "Mon, 3 Nov 2008 06:19:08 -0600",
    "subject": "thoughts to live by",
    "verse": "For this reason I, Paul the prisoner of Christ Jesus for the sake of you Gentiles. (Eph. 3:1)",
    "reflection": "How often have you skimmed over a verse like this one, without giving any thought at all to it??? You may say, \"Well it does not have any doctrinal worth to it, so of what value is it?\" You are right on that account, but it may help us to deal with the problems we see in today's world, so let us examine Paul's situation. When Paul wrote this letter he was under house arrest in Rome for preaching about Christ. Why? Well the religious leaders in Jerusalem, were feeling threatened by Christ's teachings and didn't believe He was the Messiah. So, they pressured the Romans to arrest Paul and bring him to trial for treason and for causing rebellion among the Jews. Paul had appealed for his case to be heard by the emperor, and he was awaiting trials we see in (Acts 28:16-31). Even though Paul was under arrest he maintained his firm belief that God was in control of all that happened to him. The circumstances that we find ourselves in this election year, have you wondered if God has lost control of this world??? Like Paul, remember that no matter what happens, God directs the world's affairs. Ya-but what about all the difficulties we find happening in the world? Think about this ~ what does the first commandment say? \"Thou shalt have no other Gods before Me.\" Have we really made God our first priority? The Bible tells us we cannot worship God and money. What is the most important thing in your life? Like it or not we are probably getting what we deserve.",
    "prayer": "Dear Heavenly Father, forgive us our sins of omission, that is of omitting to put You first in our life. Help us to refocus our love by putting You first. Amen.",
    "reading": "",
    "original_content": "11/04/08~~~(food for thought)~~~God knows what is best...\n\nOur Bible Verse for Today:\n\nFor this reason I, Paul the prisoner of Christ Jesus for the\nsake of you Gentiles...(Eph. 3:1) NIV\n\nOur Lesson for Today:\n\nHow often have you skimmed over a verse like this one, \nwithout giving any thought at all to it???\n\nYou may say, \"Well it does not have any doctrinal worth to it,\nso of what value is it?\"\n\nYou are right on that account, but it may help us to deal with\nthe problems we see in today's world, so let us examine Paul's\nsituation...\n\nWhen Paul wrote this letter he was under house arrest in Rome\nfor preaching about Christ. Why? \n\nWell the religious leaders in Jerusalem, were feeling threatened \nby Christ's teachings and didn't believe He was the Messiah. So, \nthey pressured the Romans to arrest Paul and bring him to trial for \ntreason and for causing rebellion among the Jews...\n\nPaul had appealed for his case to be heard by the emperor, and\nhe was awaiting trials we see in (Acts 28:16-31)...\n\nEven though Paul was under arrest he maintained his firm belief\nthat God was in control of all that happened to him...\n\nThe circumstances that we find ourselves in this election year,\nhave you wondered if God has lost control of this world???\n\nLike Paul, remember that no matter what happens, God directs \nthe world's affairs...Ya-but what about all the difficulties we find\nhappening in the world?\n\nThink about this ~ what does the first commandment say?\n\"Thou shalt have no other Gods before Me.\" \n\nHave we really made God our first priority? The Bible tells us we\ncannot worship God and money...What is the most important thing \nin your life?\n\nLike it or not we are probably getting what we deserve...\n\nOur Prayer for Today:\nDear Heavenly Father, forgive us our sins of omission,\nthat is of omitting to put You first in our life. Help us to \nrefocus our love by putting You first...Amen.\n\nKeep looking up, where our focus should be...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d6c2de27fe8442",
    "date_utc": "Tue, 4 Nov 2008 05:43:38 -0600",
    "subject": "thoughts to live by",
    "verse": "Surely you have heard about the administration of God's grace that was given to me for you. That is the ministry made known to me by revelation, as I have already written briefly. (Eph. 3:2, 3) NIV",
    "reflection": "\"God's grace, \" that was given to Paul refers to the special stewardship, trust, or commitments that Paul had been given. He had been assigned the specail work of preaching the Good News to the Gentiles. All who have put their hand in God's have been given a similar task, that is spreading the Good News. The \"Great Commission\" Is to \"Go\". All to often we think the job is done when we place a poster in a public place inviting the public to come to a special meeting. This is well and good, but, our life should be a walking poster so that people would see Christ's light being reflected through us. Let your light so shine that all would see Christ in you and come to the knowledge of the truth.",
    "prayer": "Dear Heavenly Father, I pray that my life would a reflection of Your love which would give hope to those I come into contact with. Guide me in paths of righteousness. Keep looking up, God is still giving hope. Amen.",
    "reading": "",
    "original_content": "11/04/08~~~(food for thought)~~~Place your hope in God's hands...\n\nOur Bible Verses for Today:\n\nSurely you have heard about the administration of God's\ngrace that was given to me for you...\n\nThat is the ministry made known to me by revelation, as\nI have already written briefly...(Eph. 3:2, 3) NIV\n\nOur Lesson for Today:\n\n\"God's grace,\" that was given to Paul refers to the special \nstewardship, trust, or commitments that Paul had been given.\nHe had been assigned the specail work of preaching the Good\nNews to the Gentiles...\n\nAll who have put their hand in God's have been given a similar\ntask, that is spreading the Good News. The \"Great Commission\"\nIs to \"Go\". All to often we think the job is done when we place a \nposter in a public place inviting the public to come to a special \nmeeting...\n\nThis is well and good, but, our life should be a walking poster\nso that people would see Christ's light being reflected through \nus... Let your light so shine that all would see Christ in you\nand come to the knowledge of the truth...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that my life would a\nreflection of Your love which would give hope to \nthose I come into contact with. Guide me in paths \nof righteousness...Amen.\n\nKeep looking up, God is still giving hope...\nYou are in the prayers of two who care\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d71710f95dd7c8",
    "date_utc": "Wed, 5 Nov 2008 05:23:01 -0600",
    "subject": "thoughts to live by",
    "verse": "I became a servant of this Gospel by the gift of God's grace given me through the working of His power. (Eph. 3:7) NIV",
    "reflection": "When Paul began spreading the Good News, God gave him the ability to speak effectively. Now we may not be apostles or even an evangelist, but God will give us the opportunity to tell others about Christ. With those opportunities God will provide the ability, courage, and power. Whenever an opportunity presents itself, we need to make ourselves available to God as His servant. As we focus on another person and his or her needs, God will communicate your caring attitude. Your words will be natural, loving and compelling.",
    "prayer": "Dear Heavenly Father, with each passing day I pray for a greater faith in You and with that faith I pray that I would fully trust in Your grace. I pray that I would be sensitive to Your leading and guiding. Forgive me for any opportunities I may have neglected to address. Amen.",
    "reading": "",
    "original_content": "11/06/08~~~(food for thought)~~~God's Grace is sufficient...\n\nOur Bible Verse for Today:\n\nI became a servant of this Gospel by the gift of God's grace\ngiven me through the working of His power...(Eph. 3:7) NIV\n\nOur Lesson for Today:\n\nWhen Paul began spreading the Good News, God gave him\nthe ability to speak effectively. Now we may not be apostles\nor even an evangelist, but God will give us the opportunity to\ntell others about Christ...\n\nWith those opportunities God will provide the ability, courage, \nand power. Whenever an opportunity presents itself, we need\nto make ourselves available to God as His servant...\n\nAs we focus on another person and his or her needs, God\nwill communicate your caring attitude. Your words will be\nnatural, loving and compelling...\n\nOur Prayer for Today:\nDear Heavenly Father, with each passing day I pray for a greater \nfaith in You and with that faith I pray that I would fully trust in Your\ngrace. I pray that I would be sensitive to Your leading and guiding. \nForgive me for any opportunities I may have neglected to address...Amen\n\nKeep looking up, God will give you opportunity...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d76aa7f69edaca",
    "date_utc": "Thu, 6 Nov 2008 06:14:00 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul says: \"Although I am less than the least of all God's people, this grace was given to me: to preach to the Gentiles the unsearchable riches of Christ\". (Eph. 3:8) NIV",
    "reflection": "When Paul describes himself as \"Less than the least of all God's people, \" He means that without God's help, we would never be able to do God's work. Nevertheless God chose him to share the Good News with the Gentiles and gave him the power to do it. If we feel our role is minor, we may be right ~ except that we have forgotten what a difference God makes. We need to ask ourselves each day, \"How does God want to use me today?\" Each day we need to draw on His power, then do our part, and faithfully perform the special role God has called us to play in His plan.",
    "prayer": "Dear Heavenly Father, I know that I was created for a purpose make clear to me today the role You want me to play in that plan. Instill in me the grace to achieve the role You have for me. Amen.",
    "reading": "",
    "original_content": "11/07/08~~~(food for thought)~~~Where would we be if it were not for God's grace...\n\nOur Bible Verse for Today:\n\nPaul says: \"Although I am less than the least of all God's\npeople, this grace was given to me: to preach to the Gentiles\nthe unsearchable riches of Christ\"...(Eph. 3:8) NIV\n\nOur Lesson for Today:\n\nWhen Paul describes himself as \"Less than the least of all\nGod's people,\" He means that without God's help, we would\nnever be able to do God's work...\n\nNevertheless God chose him to share the Good News with the\nGentiles and gave him the power to do it...\n\nIf we feel our role is minor, we may be right ~ except that we have\nforgotten what a difference God makes. We need to ask ourselves \neach day, \"How does God want to use me today?\"\n\nEach day we need to draw on His power, then do our part, and\nfaithfully perform the special role God has called us to play in\nHis plan...\n\nOur Prayer for Today:\nDear Heavenly Father, I know that I was created for a purpose\nmake clear to me today the role You want me to play in that\nplan. Instill in me the grace to achieve the role You have for me...Amen.\n\nKeep looking up, God will reveal His plan for you...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d7bd626e08e87d",
    "date_utc": "Fri, 7 Nov 2008 06:19:47 -0600",
    "subject": "thoughts to live by",
    "verse": "Don't worry about tomorrow, for tomorrow will worry about itself. Each day has enough trouble of its own. (Matthew 6:34) NIV",
    "reflection": "Our world is filled with trouble and distress, and because this generation thrives on information, we are bombarded by all kinds of stressful news. God knows how this kind of negativity can cause anxiety. when we focus on problems whether personal or otherwise we have a tendency to take our eyes off the Lord. And we temporarily forget what He can do. So, the next time you began to feel anxious, just consider it a signal, a reminder that its time to turn, and run to God and lay your worries at His feet! Ask for His help, ask Him to bring about change, Ask Him for hope and healing ~ and for miracles. Remember what Jesus says in (Matthew 11:28) \"Come to Me ~ all of you ~ who are weary and burdened, and I will give you rest. Jesus can free ~us all ~ from our worries. The \"rest\" that Jesus promises is love, healing, and peace with God, not the end of all labor. A relationship with God changes meaningless, wearisome toil into spiritual productivity and purpose.",
    "prayer": "Dear Heavenly Father, So often I worry about things that never come into being possibly because you have taken care of them even though I have forgotten to pray. Help me to take my worries as a signal to turn and run to You. Lord I want to lift up this countries worries about our president elect. Give Him Godly wisdom to govern this country according to Your will. Amen.",
    "reading": "",
    "original_content": "I have moved from our devo. in Eph. because of all the negativity\nand worries I have heard during the election. Next week I will go\nbact to Eph.\n\n\n11/08/08~~~(food for thought)~~~Let God have your worries...\n\nOur Bible Verse for Today:\n\nDon't worry about tomorrow, for tomorrow will worry about itself.\nEach day has enough trouble of its own...(Mt. 6:34) NIV\n\nOur Lesson for Today:\n\nOur world is filled with trouble and distress, and because this\ngeneration thrives on information, we are bombarded by all kinds\nof stressful news...\n\nGod knows how this kind of negativity can cause anxiety. when \nwe focus on problems whether personal or otherwise we have\na tendency to take our eyes off the Lord. And we temporarily \nforget what He can do...\n\nSo, the next time you began to feel anxious, just consider it a \nsignal, a reminder that its time to turn, and run to God and lay\nyour worries at His feet! Ask for His help, ask Him to bring about \nchange, Ask Him for hope and healing ~ and for miracles. \n\nRemember what Jesus says in (Mt. 11:28)\n\"Come to Me ~ all of you ~ who are weary and burdened, and\nI will give you rest...\n\nJesus can free ~us all ~ from our worries. The \"rest\" that Jesus\npromises is love, healing, and peace with God, not the end of\nall labor.\n\nA relationship with God changes meaningless, wearisome toil\ninto spiritual productivity and purpose...\n\nOur Prayer for Today:\nDear Heavenly Father, So often I worry about things that never\ncome into being possibly because you have taken care of them\neven though I have forgotten to pray. Help me to take my worries \nas a signal to turn and run to You. Lord I want to lift up this countries\nworries about our president elect. Give Him Godly wisdom to govern\nthis country according to Your will...Amen.\n\nKeep looking up, pray for our country and the world...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d85fbc20eef9fc",
    "date_utc": "Sat, 8 Nov 2008 06:25:29 -0600",
    "subject": "thoughts to live by",
    "verse": "His (God's) intent was that now, through the church, the manifold wisdom of God should be made known to the rulers and authorities in the heavenly realms, according to His eternal purpose which He accomplished in Christ Jesus our Lord. In Him and through faith in Him we may approach God with freedom and confidence. (Eph. 3:10-12) NIV",
    "reflection": "It is an awesome privilege to be able approach God with freedom and confidence. Most of us would be apprehensive in the presence of a powerful ruler. But thanks to Christ, by faith we can enter directly into God's presence through prayer. We can have the assurance that we will be welcomed with open arms because we are God's children through our union with Christ. Don't be afraid of God. Talk to Him about everything. He is waiting to hear from you.",
    "prayer": "Dear Heavenly Father, I thank You for the free pass we have been given into Your presence through Jesus Christ Your Son. I thank You for the victory that is mine through His death and resurrection from the grave. Amen.",
    "reading": "",
    "original_content": "11/10/08~~~(food for thought)~~~God has won the Battle for us...\n\nOur Bible Verses for Today:\n\nHis (God's) intent was that now, through the church, the manifold\nwisdom of God should be made known to the rulers and authorities \nin the heavenly realms,\n\naccording to His eternal purpose which He accomplished in Christ\nJesus our Lord...\n\nIn Him and through faith in Him we may approach God with freedom\nand confidence...(Eph. 3:10-12) NIV\n\nOur Lesson for Today:\n\nIt is an awesome privilege to be able approach God with freedom \nand confidence. Most of us would be apprehensive in the presence\nof a powerful ruler. But thanks to Christ, by faith we can enter directly\ninto God's presence through prayer...\n\nWe can have the assurance that we will be welcomed with open\narms because we are God's children through our union with Christ.\nDon't be afraid of God. Talk to Him about everything. He is waiting\nto hear from you...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the free pass \nwe have been given into Your presence through Jesus\nChrist Your Son. I thank You for the victory that is mine\nthrough His death and resurrection from the grave...Amen.\n\nKeep looking up, there is victory in Jesus...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 14 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d8b2cb44ced1ce",
    "date_utc": "Mon, 10 Nov 2008 05:49:06 -0600",
    "subject": "thoughts to live by",
    "verse": "I ask you, therefore, not to be discouraged because of my sufferings for you, which are your glory. (Eph. 3:13) NIV",
    "reflection": "Why should Paul's suffering make the Ephesians feel honored and encouraged? ~~~ If Paul had not preached the Good News, he would not be in jail ~ but then the Ephesians would not have heard the message and been converted either. Just as a mother endures the pain of childbirth in order to bring new life into the world, Paul endured the pain of persecution in order to bring new life to the believers in Christ. Obeying Christ is never easy. He calls us to take our cross and follow Him (Matthew 16:24) ~ that is to be willing to endure pain so that God's message of salvation can reach the entire world. We should feel honored that others have suffered and sacrificed so that we might reap the benefit.",
    "prayer": "Dear Heavenly Father, I pray that you would bless those who have taken up their cross to make the message of salvation known to all who will listen. Soften the hearts of those who have not excepted. Amen.",
    "reading": "",
    "original_content": "11/11/08~~~(food for thought)~~~God wants to be our guide...\n\nOur Bible Verse for Today:\n\nI ask you, therefore, not to be discouraged because of my\nsufferings for you, which are your glory...(Eph. 3:13) NIV\n\nOur Lesson for Today:\n\nWhy should Paul's suffering make the Ephesians feel honored\nand encouraged? ~~~\n\nIf Paul had not preached the Good News, he would not be in jail ~\nbut then the Ephesians would not have heard the message and \nbeen converted either...\n\nJust as a mother endures the pain of child-birth in order to bring\nnew life into the world, Paul endured the pain of persecution in\norder to bring new life to the believers in Christ...\n\nObeying Christ is never easy. He calls us to take our cross and \nfollow Him (Mt. 16:24) ~ that is to be willing to endure pain so that \nGod's message of salvation can reach the entire world...\n\nWe should feel honored that others have suffered and sacrificed \nso that we might reap the benefit...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that you would bless those who\nhave taken up their cross to make the message of salvation \nknown to all who will listen. Soften the hearts of those who have \nnot excepted...Amen.\n\nKeep looking up in prayer...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d9057e80467312",
    "date_utc": "Tue, 11 Nov 2008 06:02:59 -0600",
    "subject": "thoughts to live by",
    "verse": "I pray that out of His glorious riches He may straighten you with power through His Spirit in your inner being, so that Christ may dwell in your hearts through faith. And I pray that you, being rooted and established in love, may have power, together with all the saints, to grasp how wide and long and high and deep is the love of Christ, and to know this love that surpasses knowledge ~ that you may be filled to the measure of all the fullness of God. (Eph. 3:16-20) NIV",
    "reflection": "God's love is total, says Paul. It reaches every corner of our experience. it is wide - it covers the breadth of our own experience, and it reaches out to the whole world. God's love is long - it continues the length of our life. It is high - it rises to the heights of our celebration and elation. His love is deep - it reaches to the depths of discouragement, despair, and yes even death. When you feel shut out or isolated, remember you can never be lost to God's love.",
    "prayer": "Dear Heavenly Father, I thank You for Your unconditional love. Thank you Lord for loving me even when I am less than lovable. Help me to have a Christ-like love for those who are also less than lovable. I pray for our president elect, give him the wisdom to remain in Your will. Amen.",
    "reading": "",
    "original_content": "11/12/08~~~(food for thought)~~~God's faithfulness is constant...\n\nOur Bible Verses for Today:\n\nI pray that out of His glorious riches He may straighten you with\npower through His Spirit in your inner being,\n\nso that Christ may dwell in your hearts through faith. And I pray\nthat you, being rooted and established in love,\n\nmay have power, together with all the saints, to grasp how wide \nand long and high and deep is the love of Christ,\n\nand to know this love that surpasses knowledge ~ that you may \nbe filled to the measure of all the fullness of God...(Eph. 3:16-20) NIV\n\nOur Lesson for Today:\n\nGod's love is total, says Paul. It reaches every corner of our \nexperience. \nit is wide - it covers the breadth of our own experience,\nand it reaches out to the whole world. \nGod's love is long - it continues the length of our life. \nIt is high - it rises to the hights of our celebration and elation. \nHis love is deep - it reaches to the depths of discouragement,\ndespair, and yes even death...\n\nWhen you feel shut out or isolated, remember you can never\nbe lost to God's love...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for Your unconditional love.\nThank you Lord for loving me even when I am less than loveable.\nHelp me to have a Christ-like love for those who are also less\nthan loveable. I pray for our president elect, give him the wisdom\nto remain in Your will...Amen.\n\nKeep looking up, from whence cometh our strength...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d9588d4bcd2faf",
    "date_utc": "Wed, 12 Nov 2008 06:03:00 -0600",
    "subject": "thoughts to live by",
    "verse": "(Paul calls for the unity in the body of Christ) As a prisoner for the Lord then, I urge you to live a life worthy of the calling you have received. Be completely humble and gentle; be patient, bearing with one another in love. (Eph. 4:1, 2) NIV",
    "reflection": "A fact that we need to remember is that God has called each of us to be Christ's representatives on earth. In light of this truth, Paul challenges us to live lives worthy of the calling we have received ~~~ What an awesome privilege of be called Christ's very own. This includes being humble, gentle, patient, understanding, and peaceful. people are watching our every action. Can they see Christ in your life? How well are you doing as His representative???",
    "prayer": "Dear Heavenly Father, I have to confess that I do not always do so well as Your representative, forgive me for falling short of Your calling. Help me to be more humble, gentle, patient, and loving. Amen.",
    "reading": "",
    "original_content": "11/13/08~~~(food for thought)~~~God will not be moved...\n\nOur Bible Verses for Today:\n\n(Paul calls for the unity in the body of Christ)\n\nAs a prisoner for the Lord then, I urge you to live a life\nworthy of the calling you have received...\n\nBe completely humble and gentle; be patient, bearing with \none another in love...(Eph. 4:1, 2) NIV\n\nOur Lesson for Today:\n\nA fact that we need to remember is that God has called \neach of us to be Christ's representatives on earth...\n\nIn light of this truth, Paul challenges us to live lives worthy\nof the calling we have received ~~~ What an awesome privilege \nof be called Christ's very own...\n\nThis includes being humble, gentle, patient, understanding,\nand peaceful. people are watching our every action...\n\nCan they see Christ in your life? How well are you doing as His \nrepresentative???\n\nOur Prayer for Today:\nDear Heavenly Father, I have to confess that I do not always\ndo so well as Your representative, forgive me for falling short\nof Your calling. Help me to be more humble, gentle, patient, and\nloving...Amen.\n\nKeep looking up, He is the Rock of our Salvation...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d9affefe5695d0",
    "date_utc": "Thu, 13 Nov 2008 06:43:55 -0600",
    "subject": "thoughts to live by",
    "verse": "There is one body and one Spirit - just as you were called to one hope when you were called - one Lord, one faith, one baptism; One God and Father of all, who is over all and through all and in all. (Eph. 4:4-6) NIV",
    "reflection": "Paul says, \"We are one body.\" Unity does not just happen, we have to work at it. To often differences among people can lead to division, but this should not be true in the church. Instead of concentrating on what divides us, we should remember what unites us: one body, one Spirit, one future, one Lord, one faith, one baptism, one God! Have you attempted to appreciate people who are different than you? Can you see how their differing gifts and viewpoints can help the church as it does God's work??? Learn to enjoy the way we as members of Christ's body complement one another. For further thoughts on this subject see (I Corinthians 12:12, 13)",
    "prayer": "Dear Heavenly Father, help me to remember the oneness that is to be among all Your children. Help me realize how differing gifts can help to further Your Kingdoms work. I pray for Godly wisdom in Jesus Name. Amen.",
    "reading": "",
    "original_content": "11/14/08~~~(food for thought)~~~We are all one in Christ...\n\nOur Bible Verses for Today:\n\nThere is one body and one Spirit - just as you were called to\none hope when you were called - one Lord, one faith, one baptism;\n\nOne God and Father of all, who is over all and through all and\nin all...(Eph. 4:4-6) NIV\n\nOur Lesson for Today:\n\nPaul says, \"We are one body.\" Unity does not just happen,\nwe have to work at it. To often differences among people\ncan lead to division, but this should not be true in the church...\n\nInstead of concentrating on what divides us, we should remember\nwhat unites us: one body, one Spirit, one future, one Lord, one\nfaith, one baptism, one God!\n\nHave you attempted to appreciate people who are different than\nyou? Can you see how their differing gifts and viewpoints can help\nthe church as it does God's work???\n\nLearn to enjoy the way we as members of Christ's body complement \none another...\n\nFor further thoughts on this subject see (I Cor. 12:12, 13)\n\nOur Prayer for Today:\nDear Heavenly Father, help me to remember the oneness \nthat is to be among all Your children. Help me realize how\ndiffering gifts can help to further Your Kingdoms work. I pray \nfor Godly wisdom in Jesus Name...Amen.\n\nKeep looking up, He gives freely to all who ask...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather \n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11d9f940fbd6ef93",
    "date_utc": "Fri, 14 Nov 2008 09:11:35 -0600",
    "subject": "thoughts to live by",
    "verse": "To each one of us grace has been given as Christ apportioned it. This is why it says: \"When He ascended on high, He led captives in His train and gave gifts to men.\" (Eph. 4:7, 8) NIV",
    "reflection": "God's grace is beyond any human comprehension. If we were asked to explain it, we could only make a feeble attempt. Oh yes, we may list a number of gifts we have received from Him, But the greatest gift we have been promised is eternal life, by grace alone, through faith alone, in Christ alone. And here is where words alone cannot shed adequate light on the meaning of God's grace, for such undeserving people such as we. Christ, in His crucifixion and resurrection was victorious over Satan. Through Christ's victory, we have victory.",
    "prayer": "Dear Heavenly Father, I cannot explain Your goodness and mercy in human words, but I pray that through following You my life might shed light on the true meaning of You grace. Amen.",
    "reading": "",
    "original_content": "11/15/08~~~(food for thought)~~~All of God's children are promised \neternal life. Are you one of God's children?\n\nOur Bible Verses for Today:\n\nTo each one of us grace has been given as Christ \napportioned it...\nThis is why it says: \"When He ascended on high, He\nled captives in His train and gave gifts to men.\"\n(Eph. 4:7, 8) NIV\n\nOur Lesson for Today:\n\nGod's grace is beyond any human comprehension.\nIf we were asked to explain it, we could only make a feeble attempt...\n\nOh yes, we may list a number of gifts we have received from Him,\nBut the greatest gift we have been promised is eternal life, by\ngrace alone, through faith alone, in Christ alone...\n\nAnd here is where words alone cannot shed adequate light on the\nmeaning of God's grace, for such undeserving people such as we...\n\nChrist, in His crucifixion and resurrection was victorious over Satan.\nThrough Christ's victory, we have victory...\n\nOur Prayer for Today:\nDear Heavenly Father, I cannot explain Your goodness and\nmercy in human words, but I pray that through following You\nmy life might shed light on the true meaning of You grace...Amen.\n\nKeep looking up, God's grace is sufficient...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11daa02b4f424bde",
    "date_utc": "Sat, 15 Nov 2008 15:16:37 -0600",
    "subject": "thoughts to live by",
    "verse": "In our last devo. in vs. 8 it says: \"He ascended\". This means that Christ first came down to the lowly world in which we live. The same One who came down is the One who ascended higher than all the heavens, so that His rule might fill the entire universe. (Eph. 4:9, 10) NLT",
    "reflection": "The \"lowly world\" may be: (1) the earth itself (lowly by comparison to heaven). (2) the grave, or (3) Hades (many believe Hades is the resting place of souls between death and resurrection). However we understand it, Christ is Lord of the whole universe, past, present, and future. Nothing or no one is hidden from Him. The Lord of all came to earth and face death to rescue all people no one is beyond His reach. Any view of God that violates either His transcendence or His immanence does not paint a true picture of God.",
    "prayer": "Dear Heavenly Father, I thank You for the gracious work of Your Son, our Lord Jesus Christ. Who by His death and resurrection made possible eternal life for all who will receive Him as their Lord. I pray that there would one day be a great revival and that all would come to receive Him as their Savior. Amen.",
    "reading": "",
    "original_content": "11/17/08~~~(food for thought)~~~God is \"over all\" ~ \"in us all\" ~ and\n\"living through us all.\" This shows \nHis overruling care....\n\nOur Bible Verses for Today:\n\nIn our last devo. in vs. 8 it says: \"He ascended\"...\n\nThis means that Christ first came down to the lowly world\nin which we live...\n\nThe same One who came down is the One who ascended\nhigher than all the heavens, so that His rule might fill the entire \nuniverse...(Eph. 4:9, 10) NLT\n\nOur lesson for Today:\n\nThe \"lowly world\" may be:\n(1) the earth itself (lowly by comparison to heaven).\n(2) the grave, or\n(3) Hades (many believe Hades is the resting place of souls\nbetween death and resurrection).\n\nHowever we understand it, Christ is Lord of the whole universe,\npast, present, and future. Nothing or no one is hidden from Him...\n\nThe Lord of all came to earth and face death to rescue all people\nno one is beyond His reach.\n\nAny view of God that violates either His transcendence or\nHis immanence does not paint a true picture of God...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the gracious work \nof Your Son, our Lord Jesus Christ. Who by His death and \nresurrection made possible eternal life for all who will receive \nHim as their Lord. I pray that there would one day be a great \nrevival and that all would come to receive Him as their Savior...Amen.\n\nKeep looking up, in love and adoration...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11daf6de76d1afff",
    "date_utc": "Mon, 17 Nov 2008 05:45:18 -0600",
    "subject": "thoughts to live by",
    "verse": "It was He who gave some to be apostles, some to be prophets, and some to be evangelists, and some to be pastor's and teachers, to prepare God's people for works of service, so that the body of Christ may be built up. (Eph. 4:11, 12) NIV",
    "reflection": "We need to remember that our oneness in Christ does not destroy our individuality. Why? because as we see by our verses today ~ The Holy Spirit has given each Christian differing gifts for building up the church. Because we have been given these gifts, it is crucial that we use them. Have you matured spiritually, exercising these gifts that have been given to you? If you know what your gifts are, look for opportunities to serve. If you don't know ask God to show you, perhaps with the help of your pastor or some Christian friend, you will begin to recognize your specail area of service. We are to use our gifts to strengthen and encourage the body of Christ (the church).",
    "prayer": "Dear Heavenly Father, Help me to exercise the gifts You have given me that I might be one with the body of Christ, so that the church may stand against the wiles for Satan. Amen.",
    "reading": "",
    "original_content": "11/18/08~~~(food for thought)~~~God's peace is more precious than\nall the world's riches...\n\n\nOur Bible Verses for Today:\n\nIt was He who gave some to be apostles, some to be\nprophets, and some to be evangelists,and some to be\npastor's and teachers,\n\nto prepare God's people for works of service, so that \nthe body of Christ may be built up...(Eph. 4:11, 12) NIV\n\nOur Lesson for Today:\n\nWe need to remember that our oneness in Christ does\nnot destroy our individuality...Why? because as we see\nby our verses today ~ The Holy Spirit has given each \nChristian differing gifts for building up the church...\n\nBecause we have been given these gifts, it is crucial that we\nuse them. Have you matured spiritually, exercising these gifts\nthat have been given to you?\n\nIf you know what your gifts are, look for opportunities to serve.\nIf you don't know ask God to show you, perhaps with the help\nof your pastor or some Christian friend, you will begin to recognize\nyour specail area of service...\n\nWe are to use our gifts to strengthen and encourage the body of\nChrist (the church)...\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to exercise the gifts You\nhave given me that I might be one with the body of Christ,\nso that the church may stand against the wiles for Satan...Amen.\n\nKeep looking up, He will show you where you are needed...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11db46816bc01459",
    "date_utc": "Tue, 18 Nov 2008 07:19:51 -0600",
    "subject": "thoughts to live by",
    "verse": "(Yes God!) Yes it was He who gave some to be apostles, some to be prophets, some to be evangelists, and some to be pastors and teachers, to prepare God's people for works of service, so that the body of Christ may be built up, until we all reach unity in the faith and in the knowledge of the Son of God and become mature, attaining to the whole measure of the fullness of Christ. (Eph. 4:11-13) NIV",
    "reflection": "(Yes God) has given His church an enormous responsibility ~ to make disciples of every nation (Matthew 28:18-20). This involves preaching, teaching, healing, nurturing, giving, administering, building, and many other tasks. If we had to fulfill this task as individuals, we might as well give up without trying ~ it would be impossible. But God ~ calls us as members of His body. Some of us can do one task; some can do another. Together we can obey God more fully than we can alone. It is a human tendency to underestimate what we can do as a group. But as the body of Christ, we can accomplish more together that we ever dreamed possible working by ourselves. Working together, the church can express the fullness of Christ.",
    "prayer": "Dear Heavenly Father, forgive us for not working together as we should. Help us to become more unified in the body of Christ. Help us to always be mindful of the responsibility that You have set before us. Amen.",
    "reading": "",
    "original_content": "11//19/08~~~(food for thought)~~~God wants to see unity in the church...\n\nOur Bible Verses for Today:\n\n(Yes God!)\nYes it was He who gave some to be apostles, some to be prophets,\nsome to be evangelists, and some to be pastors and teachers,\n\nto prepare God's people for works of service, so that the body of\nChrist may be built up,\n\nuntil we all reach unity in the faith and in the knowledge of the Son \nof God and become mature, attaining to the whole measure of the \nfullness of Christ...(Eph. 4:11-13) NIV\n\nOur Lesson for Today:\n\n(Yes God) has given His church an enormous responsibility ~ to make\ndisciples of every nation (Mt. 28:18-20).\n\nThis involves preaching, teaching, healing, nurturing, giving, administering,\nbuilding, and many other tasks. If we had to fulfill this task as individuals,\nwe might as well give up without trying ~ it would be impossible...\n\nBut God ~ calls us as members of His body. Some of us can do one\ntask; some can do another. Together we can obey God more fully\nthan we can alone...\n\nIt is a human tendency to underestimate what we can do as a group.\nBut as the body of Christ, we can accomplish more together that we\never dreamed possible working by ourselves...\n\nWorking together, the church can express the fullness of Christ...\n\nOur Prayer for Today:\nDear Heavenly Father, forgive us for not working together\nas we should. Help us to become more unified in the body \nof Christ. Help us to always be mindful of the responsibility\nthat You have set before us...Amen.\n\nKeep looking up, God wants to walk with us...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11db976cb4d90b1e",
    "date_utc": "Wed, 19 Nov 2008 06:00:33 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul says once we become mature in the faith of Christ ~ Then we will no longer be infants, tossed back and forth by the waves, and blown here and there by every wind of teaching and by the cunning and craftiness of men in their deceitful scheming. Instead, speaking the truth in love, we will in all things grow up into Him who is the Head, that is, Christ. From Him the whole body, joined and held together by every supporting ligament, grows and builds itself up in love, as each part does its work. (Eph. 4:14-16) NIV",
    "reflection": "As Christians we sometimes fear that any mistake will destroy our witness for the Lord. We see our weaknesses, and we think that many non-Christians seem to have stronger characters than we do. And we wonder when will I ever grow up into Christ??? The answer is that Christ forms us into a body ~ into a group of individuals who are united in their purpose and in their love for one another and for the Lord. If an individual stumbles the rest of the group is there to pick that person up and help him or her walk with God again. If a person sins, he or she can find restoration through the church (Galatians 6:1) even as the rest of the body continues to witness to God's truth. As part of Christ's body, do you reflect part of Christ's character and carry out your special role in His work???",
    "prayer": "Dear Heavenly Father help me grow in the body, help me to find my role in the body as a faithful witness. May we lift one another up through Your power and strength. Amen.",
    "reading": "",
    "original_content": "11/20/08~~~(food for thought)~~~God's grace is sufficient...\n\nOur Bible Verses for Today:\n\nPaul says once we become mature in the faith of Christ ~\n\nThen we will no longer be infants, tossed back and forth\nby the waves, and blown here and there by every wind of\nteaching and by the cunning and craftiness of men in their\ndeceitful scheming...\n\nInstead, speaking the truth in love, we will in all things grow\nup into Him who is the Head, that is, Christ...\n\nFrom Him the whole body, joined and held together by every \nsupporting ligament, grows and builds itself up in love, as each\npart does its work...(Eph. 4:14-16) NIV\n\nOur Lesson for Today:\n\nAs Christians we sometimes fear that any mistake will destroy\nour witness for the Lord. We see our weaknesses, and we think\nthat many non-Christians seem to have stronger characters than\nwe do...\n\nAnd we wonder when will I ever grow up into Christ???\n\nThe answer is that Christ forms us into a body ~ into a group\nof individuals who are united in their purpose and in their love \nfor one another and for the Lord...\n\nIf an individual stumbles the rest of the group is there to pick\nthat person up and help him or her walk with God again. If a \nperson sins, he or she can find restoration through the church\n(Gal 6:1) even as the rest of the body continues to witness to\nGod's truth...\n\nAs part of Christ's body, do you reflect part of Christ's character\nand carry out your special role in His work???\n\nOur Prayer for Today:\nDear Heavenly Father help me grow in the body, help\nme to find my role in the body as a faithful witness. May\nwe lift one another up through Your power and strength...Amen.\n\nKeep looking up, He will carry us through...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11dbecb46b1cf5dc",
    "date_utc": "Thu, 20 Nov 2008 06:08:00 -0600",
    "subject": "thoughts to live by",
    "verse": "So I tell you this, and insist on it in the Lord, that you must no longer live as the Gentiles do, in the futility of their thinking. (Eph. 4:17) NIV",
    "reflection": "The natural thinking of human beings is to think their way away from God ~ leaving them \"hopelessly confused.\" Intellectual pride, relations, and excuses all keep people from God. Don't be surprised if people can't grasp the Good News. The Good News will seem foolish to those who forsake faith and rely on their own understanding.",
    "prayer": "Dear Heavenly Father, sometimes Your ways are a bit confusing. So I pray for patience and wisdom to accept Your will for my life. Protect our nation from the deceptive ideals of mankind, and bless this nation with Godly leaders. Amen. Keep looking up, He has a plan for your life. Amen.",
    "reading": "",
    "original_content": "11/21/08~~~(food for thought)~~~As followers of Christ, we must be\ncommitted to the truth...\n\nOur Bible Verse for Today:\n\nSo I tell you this, and insist on it in the Lord, that you\nmust no longer live as the Gentiles do, in the futility of \ntheir thinking...(Eph. 4:17) NIV\n\nOur Lesson for Today:\n\nThe natural thinking of human beings is to think their way \naway from God ~ leaving them \"hopelessly confused.\"\nIntellectual pride, relations, and excuses all keep people\nfrom God...\n\nDon't be surprised if people can't grasp the Good News.\nThe Good News will seem foolish to those who forsake\nfaith and rely on their own understanding...\n\nOur Prayer for Today\nDear Heavenly Father, sometimes Your ways are \na bit confusing. So I pray for patience and wisdom\nto accept Your will for my life. Protect our nation from\nthe deceptive ideals of mankind, and bless this nation\nwith Godly leaders...Amen.\n\nKeep looking up, He has a plan for your life...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11dc3dc343423dcb",
    "date_utc": "Fri, 21 Nov 2008 06:29:46 -0600",
    "subject": "thoughts to live by",
    "verse": "(Paul's further thought about those who live without the light) They are darkened in their understanding and separated from the life of God because of the ignorance that is in them due to the hardening of their hearts. Having lost all sensitivity, they have given themselves over to sensuality so as to indulge in every kind of impurity, with a continual lust for more. You however, did not come to know Christ that way. (Eph 4:18, 19) NIV",
    "reflection": "People should always be able to see a difference between Christians and non-Christians because of the way Christians live. We are to live full of light (5:8). Paul told the Ephesians to leave behind the old life of sin, since they were followers of Christ. Living the Christian life is a process. Even though we have a new nature, we don't automatically think all good thoughts and express all right attitudes when we become new people in Christ. BUT if we keep listening to God, we will be changing all the time. As you look back over last year, do you see a process of change for the better in your thoughts, attitudes, and actions? Even though change may be slow, it comes as you trust in God to change you.",
    "prayer": "Dear Heavenly Father, Help me to improve my thoughts, attitudes, and actions, so that there would be a noticeable difference in me. May the world see Christ's light shining in me. Amen.",
    "reading": "",
    "original_content": "11/22/08~~~(food for thought)~~~Let us live as Children of the light...\n\nOur Bible Verses for Today:\n\n(Paul's further thought about those who live without the light)\nThey are darkened in their understanding and separated from\nthe life of God because of the ignorance that is in them due to\nthe hardening of their hearts...\n\nHaving lost all sensitivity, they have given themselves over to\nsensuality so as to indulge in every kind of impurity, with a\ncontinual lust for more...\n\nYou however, did not come to know Christ that way...\n(Eph 4:18, 19) NIV\n\nOur Lesson for Today:\n\nPeople should always be able to see a difference between \nChristians and non-Christians because of the way Christians \nlive. We are to live full of light (5:8)...\n\nPaul told the Ephesians to leave behind the old life of sin, \nsince they were followers of Christ. Living the Christian life \nis a process. Even though we have a new nature, we don't\nautomatically think all good thoughts and express all right\nattitudes when we become new people in Christ...\n\nBUT if we keep listening to God, we will be changing all the \ntime. As you look back over last year, do you see a process \nof change for the better in your thoughts, attitudes, and actions?\n\nEven though change may be slow, it comes as you trust in God\nto change you...\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to improve my thoughts,\nattitudes, and actions, so that there would be a noticeable \ndifference in me. May the world see Christ's light shining\nin me...Amen.\n\nKeep looking up, let His light shine through you...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11dce449e40b8ab1",
    "date_utc": "Sat, 22 Nov 2008 05:48:18 -0600",
    "subject": "thoughts to live by",
    "verse": "You were taught with regard to your former way of life, to put off your former way of life, to put off your old self, which is being corrupted by its deceitful desires; to be made new in the attitude of your minds; and to put on the new self, created to be like God in true righteousness and holiness. (Eph. 4:22-24) NIV",
    "reflection": "Our old way of life before we believed in Christ is completely in the past. We should put it behind us like old clothes to be thrown away. When we decide to accept Christ's gift of salvation (2:8-10), it is both a one time decision, as well as a daily conscious commitment. We are not to be driven by desire and impulse. We must put on the new nature, head in the new direction, AND have the new way of thinking that the Holy Spirit gives.",
    "prayer": "Dear Heavenly Father, Help me to make a daily conscious commitment to live by the new nature that is Christ's gift. Help me to head in the direct that the Holy Spirit leads. Amen.",
    "reading": "",
    "original_content": "11/24/08~~~(food for thought)~~~Trust completely in God...\n\nOur Bible Verses for Today:\n\nYou were taught with regard to your former way of life, \nto put off your former way of life, to put off your old self,\nwhich is being corrupted by its deceitful desires;\n\nto be made new in the attitude of your minds; and to put\non the new self, created to be like God in true righteousness\nand holiness... (Eph. 4:22-24) NIV\n\nOur Lesson for Today:\n\nOur old way of life before we believed in Christ is completely\nin the past. We should put it behind us like old clothes to be\nthrown away...\n\nWhen we decide to accept Christ's gift of salvation (2:8-10),\nit is both a one time decision, as well as a daily conscious\ncommitment. We are not to be driven by desire and impulse...\n\nWe must put on the new nature, head in the new direction, AND\nhave the new way of thinking that the Holy Spirit gives...\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to make a daily conscious\ncommitment to live by the new nature that is Christ's gift.\nHelp me to head in the direct that the Holy Spirit leads...Amen.\n\nKeep looking up, head in the new direction...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 15 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11dd33bacbecbe89",
    "date_utc": "Mon, 24 Nov 2008 08:43:41 -0600",
    "subject": "thoughts to live by",
    "verse": "Therefore each of you must put off falsehood and speak truthfully to his neighbor, for we are all members of one body.\"In your anger do not sin\". Do not let the sun go down while you are still angry, and do not give the devil a foothold. (Eph. 4:25-27) NIV",
    "reflection": "Now the Bible does not tell us that we should not feel angry, BUT it does point out that it is important to handle anger properly. If vented thoughtlessly anger can hurt others and destroy our relationships. IF bottled up inside, it can cause us to become bitter and destroy us from within. Paul tells us to deal with our anger immediately in a way that builds relationships rather than destroying them. If we nurse our anger, we will give Satan an opportunity to divide us. Are you angry with someone right now? What could you do to resolve your differences? Is it a sense of false pride??? Don't let another day end before you begin to work on mending you relationship.",
    "prayer": "Dear Heavenly Father, Help me to give up all false pride. Help me to put aside any differences I have against another person, so that I can truly begin to work on mending my relationships. For You say if we are unwilling to forgive our Father will not forgive us. Amen.",
    "reading": "",
    "original_content": "11/25/08~~~(food for thought)~~~Lying destroys relationships...\n\nOur Bible Verses for Today:\n\nTherefore each of you must put off falsehood and speak \ntruthfully to his neighbor, for we are all members of one \nbody...\n\n\"In your anger do not sin\". Do not let the sun go down while \nyou are still angry,\n\nand do not give the devil a foothold...(Eph.4:25-27) NIV\n\nOur lesson for Today:\n\nNow the Bible does not tell us that we should not feel angry,\nBUT it does point out that it is important to handle anger properly.\n\nIf vented thoughtlessly anger can hurt others and destroy our \nrelationships. IF bottled up inside, it can cause us to become\nbitter and destroy us from within...\n\nPaul tells us to deal with our anger immediately in a way that builds\nrelationships rather than destroying them. If we nurse our anger, \nwe will give Satan an opportunity to divide us...\n\nAre you angry with someone right now? What could you do to \nresolve your differences? Is it a sense of false pride???\n\nDon't let another day end before you begin to work on mending\nyou relationship...\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to give up all false pride.\nHelp me to put aside any differences I have against another\nperson, so that I can truly begin to work on mending my\nrelationships. For You say if we are unwilling to forgive our\nFather will not forgive us...Amen.\n\nKeep looking up, for the strength to forgive...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.6 million users fighting spam.\nSPAMfighter has removed 16 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11dd8568fa5e3309",
    "date_utc": "Tue, 25 Nov 2008 05:45:50 -0600",
    "subject": "thoughts to live by",
    "verse": "Do not let any unwholesome talk come out of your mouths, but only what is helpful for building others up according to their needs, that it may benefit those who listen. And do not grieve the Holy Spirit of God, with whom you are sealed for the day of redemption. Get rid of all bitterness, rage and anger, brawling and slander, along with every form of malice. Be kind and compassionate to one another, forgiving each other, just as in Christ God forgave you. (Eph. 4:29-32) NIV",
    "reflection": "We need to remember that we can bring sorrow to the Holy Spirit by the way we live. Paul warns against unwholesome language, bitterness, improper us of anger, harsh words, slander, and bad attitudes toward others. Instead of acting that way, we should be forgiving, just as God has forgiven us. Are you bringing sorrow or pleasing God with your attitude and actions. Let us act in love toward our brothers and sisters in Christ, just as God acted in love by sending His Son to die for our sins.",
    "prayer": "Dear Heavenly Father, forgive me for my sins of thought word and deed. Help me to be more loving and forgiving. Help me to move from hate to love in my attitude toward others. Amen",
    "reading": "",
    "original_content": "11-26-08~~~(food for thought)~~~God understands each burden you bear...\n\nOur Bible Verses for Today:\n\nDo not let any unwholesome talk come out of your mouths,\nbut only what is helpful for building others up according to\ntheir needs, that it may benefit those who listen...\n\nAnd do not grieve the Holy Spirit of God, with whom you\nare sealed for the day of redemption...\n\nGet rid of all bitterness, rage and anger, brawling and slander,\nalong with every form of malice...\n\nBe kind and compassionate to one another, forgiving each other,\njust as in Christ God forgave you...(Eph. 4:29-32) NIV\n\nOur Lesson for Today:\n\nWe need to remember that we can bring sorrow to the Holy Spirit\nby the way we live. Paul warns against unwholesome language,\nbitterness, improper us of anger, harsh words, slander, and bad\nattitudes toward others...\n\nInstead of acting that way, we should be forgiving, just as God\nhas forgiven us. Are you bringing sorrow or pleasing God with \nyour attitude and actions...\n\nLet us act in love toward our brothers and sisters in Christ, just \nas God acted in love by sending His Son to die for our sins...\n\nOur Prayer for Today:\nDear Heavenly Father, forgive me for my sins of thought\nword and deed. Help me to be more loving and forgiving.\nHelp me to move from hate to love in my attitude toward \nothers...Amen.\n\nKeep looking up, seeking a more loving attitude...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11de2c969a97ae26",
    "date_utc": "Thu, 27 Nov 2008 06:46:37 -0600",
    "subject": "thoughts to live by",
    "verse": "Keep your lives free from the love of money and be content with what you have, because God has said, \"Never will I leave you: never will I forsake you.\" (Hebrews 13:5) NIV",
    "reflection": "I believe that our culture has created an epidemic of coveting what everyone else has. we seem to crave more and more, yet we do not enjoy what we already possess. A simple person is a satisfied person; they don't crave more of anything, but they do thoroughly enjoy what they have. They trust that more will come in due time. Does \"more\" truly have the ability to make us happy as the world wants us to believe? The answer is no! In fact, the more we have, the more work we must do to take care of it. We may think \"more\" makes life easier, but in reality, it often complicates the day to day. The tenth commandment tells us not to covet; we aren't to want what others have. Paul says in (Philippians 4:11) that he learn how to become content no matter what his circumstances were. Even hearing that statement reminds me of simplicity and ministers comfort to me. There is nothing wrong with having things, but it is wrong to lust after them. When we feel we cannot be happy without something, we are lusting after it. Let me leave you with this thought: \"We should develop the habit of asking God for what we want, and believe He will give it to us, if and when, it is right.\" This simple approach to life sets us free to enjoy life.",
    "prayer": "Dear Heavenly Father, Help me to be content with the simple things of life. Forgive me for working harder at acquiring more things than I do at giving thanks for the things I already have. Amen. Keep looking up, in contentment ~ for contentment is not the fulfillment of what you want, but the realization of how much you already have.\" (author unknown) Amen.",
    "reading": "",
    "original_content": "11/28/08~~~(food for thought)~~~Be satisfied with what you have...\n\nOur Bible Verse for Today:\n\nKeep your lives free from the love of money and be content\nwith what you have, because God has said, \"Never will I \nleave you: never will I forsake you.\" (Heb. 13:5) NIV\n\nOur Lesson for Today:\n\nI believe that our culture has created an epidemic of coveting\nwhat everyone else has. we seem to crave more and more,\nyet we do not enjoy what we already possess...\n\nA simple person is a satisfied person; they don't crave more of \nanything, but they do thoroughly enjoy what they have. They trust \nthat more will come in due time...\n\nDoes \"more\" truly have the ability to make us happy as the world\nwants us to believe? The answer is no! In fact, the more we have,\nthe more work we must do to take care of it. We may think \"more\" \nmakes life easier, but in reality, it often complicates the day to day...\n\nThe tenth commandment tells us not to covet; we aren't to want what\nothers have. Paul says in (Phil 4:11) that he learn how to become\ncontent no matter what his circumstances were. Even hearing that\nstatement reminds me of simplicity and ministers comfort to me...\n\nThere is nothing wrong with having things, but it is wrong to lust after\nthem. When we feel we cannot be happy without something, we are\nlusting after it...\n\nLet me leave you with this thought: \n\"We should develop the habit of asking God for what we want, and believe\nHe will give it to us, if and when, it is right...\"\n\nThis simple approach to life sets us free to enjoy life...\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to be content with the simple \nthings of life. Forgive me for working harder at acquiring more \nthings than I do at giving thanks for the things I already have...Amen.\n\nKeep looking up, in contentment ~ for contentment\nis not the fulfillment of what you want, but the\nrealization of how much you already have.\"\n(author unknown)\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.7 million users fighting spam.\nSPAMfighter has removed 17 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11de7d37a59f256a",
    "date_utc": "Fri, 28 Nov 2008 06:31:50 -0600",
    "subject": "thoughts to live by",
    "verse": "God told Abram ~ \"I will make you a great nation and I will bless you; I will make your name great, and you will be a blessing. (Genesis 12:2) NIV",
    "reflection": "I have read various books indicating one cannot be prosperous and also simple. This teaching is a bit disturbing to me because I believe it is God's will for His people to be prosperous in every area of their lives, including finances and material goods. Psalms 35:27 says that God takes pleasure in the prosperity of His people. I cannot recall any Scripture saying God is pleased when His people do not have their needs met. Oh yes it is true that Scripture says it is hard for a rich man to get into heaven (see Matthew 19:23), but it is not impossible. Money can divert our attention away from God and His will, but it doesn't have to. We should not be afraid of abundance; instead we should learn how to handle it properly. If we maintain a proper attitude toward money and material things, they can be used to bless many people. Instead of telling people to totally abstain from something I'd rather try to teach them how to avoid excessiveness. Remember God has created all thing for us to enjoy. Prosperity and abundance only become a problem when we allow them to own us instead of us owning them. We should use our belongings to bless people. We need to be careful not to use people to get more Stuff. Money is only a problem if we hoard it. The Bible does not say money is a problem; what it says is that, \"the love of money is a problem.\" We need to learn to be a channel, not a reservoir. Let things flow to you and through you. God is delighted when He finds someone He can generously bless who will keep Him first and use what they have to be a blessing to others.",
    "prayer": "Dear Heavenly Father, I thank you for the many blessings I have received in my life; help me to learn how to use my blessings to be a blessing to others. Help me to be a channel not a reservoir. Help to remember to always put You first. Amen.",
    "reading": "",
    "original_content": "11/29/08~~~(food for thought)~~~Our life is of God, not of goods...\n\nOur Bible Verse for Today:\nGod told Abram ~\n\"I will make you a great nation and I will bless you;\nI will make your name great, and you will be a blessing.\n(Gen. 12:2) NIV\n\nOur Lesson for Today:\n\nI have read various books indicating one cannot be prosperous\nand also simple. This teaching is a bit disturbing to me because\nI believe it is God's will for His people to be prosperous in every\narea of their lives, including finances and material goods. Ps. 35:27\nsays that God takes pleasure in the prosperity of His people...\n\nI cannot recall any Scripture saying God is pleased when His people\ndo not have their needs met.\n\nOh yes it is true that Scripture says it is hard for a rich man to get \ninto heaven (see Mt. 19:23), but it is not impossible. Money can divert \nour attention away from God and His will, but it doesn't have to. We\nshould not be afraid of abundance; instead we should learn how to \nhandle it properly...\n\nIf we maintain a proper attitude toward money and material things,\nthey can be used to bless many people...\n\nInstead of telling people to totally abstain from something I'd rather \ntry to teach them how to avoid excessiveness. Remember God\nhas created all thing for us to enjoy...\n\nProsperity and abundance only become a problem when we allow\nthem to own us instead of us owning them. We should use our\nbelongings to bless people. We need to be careful not to use people\nto get more Stuff...\n\nMoney is only a problem if we hoard it. The Bible does not say money\nis a problem; what it says is that, \"the love of money is a problem.\" We \nneed to learn to be a channel, not a reservoir. Let things flow to you and \nthrough you...\n\nGod is delighted when He finds someone He can generously bless\nwho will keep Him first and use what they have to be a blessing to\nothers...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank you for the many blessings I\nhave received in my life; help me to learn how to use my\nblessings to be a blessing to others. Help me to be a channel\nnot a reservoir. Help to remember to always put You first...Amen.\n\nKeep looking up, and you will be putting God first...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.7 million users fighting spam.\nSPAMfighter has removed 17 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]
