[
  {
    "message_id": "11560782ea781bba",
    "date_utc": "Mon, 1 Oct 2007 19:33:21 -0600",
    "subject": "thoughts to live by",
    "verse": "And we know that in all things God works for the good of those who love Him, who have been called according to His purpose. (Ro. 8:28) NIV",
    "reflection": "God works in \"everything\" not just isolated incidents for our good. This does not mean that all that happens to us is good. Evil is prevalent in our fallen world, but God is able to turn every circumstance around for our long-range good. We need to note that God is not always working to make us happy but to fulfill His purpose. We also should note that this promise is not for everyone. It can only be claimed by those who love God, and are called by Him, that is, those whom the Holy Spirit convinces to receive Christ. Such people have a new perspective, a new mind-set. They trust in God, not in worldly treasures; their security is in heaven, not on earth. Their faith in God does not waver in pain and persecution because they know God is with them.",
    "prayer": "Dear Heavenly Father of all mercy and grace, the creator of all things, keep our nation, its citizens, and our troops safe from all harm. Bless my e-mail friends with good health and safety. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~Honor the Lord with your first-fruits~~~(your best)...(Pro. 3:9)\n\nOur Meditation for Today:\n\nAnd we know that in all things God works for the good of those \nwho love Him, who have been called according to His purpose.\n(Ro. 8:28) NIV\n\nHere Is What We Should Learn From This Verse:\n\nGod works in \"everything\" not just isolated incidents for our good.\nThis does not mean that all that happens to us is good...\n\nEvil is prevalent in our fallen world, but God is able to turn every \ncircumstance around for our long-range good...\n\nWe need to note that God is not always working to make us happy\nbut to fulfill His purpose...\n\nWe also should note that this promise is not for everyone. It can \nonly be claimed by those who love God, and are called by Him, that\nis, those whom the Holy Spirit convinces to receive Christ...\n\nSuch people have a new perspective, a new mind-set. They trust\nin God, not in worldly treasures; their security is in heaven, not on\nearth. Their faith in God does not waver in pain and persecution \nbecause they know God is with them...\n\nOur Prayer for Today:\nDear Heavenly Father of all mercy and grace, the creator of all things,\nkeep our nation, its citizens, and our troops safe from all harm. Bless\nmy e-mail friends with good health and safety...Amen.\n\nKeep looking up, He will help you with your problems...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1156557cf2b61e7b",
    "date_utc": "Tue, 2 Oct 2007 11:28:28 -0600",
    "subject": "thoughts to live by",
    "verse": "For those God foreknew He also predestined to be conformed to the likeness of His Son, that He might be the firstborn among many brothers. And those He predestined, He also called; those He called he also justified; Those He justified, He also glorified. (Ro. 8:29, 30) NIV.",
    "reflection": "God's ultimate goal for us is to make us like Christ (I Jn. 3:2). As we become more and more like Him, we will discover our true selves, the person we were created to be. How can we become like Christ? By reading and heeding the Word, by studding His life on earth through the Gospels, by spending time in prayer, by being filled with His Spirit, and by doing His work in the world.",
    "prayer": "Dear Heavenly Father, I thank You for Your Word, I thank You for Your Son's coming to earth, and living a life we can attempt to copy. I thank You for the avenue of prayer in which we can come to You day or night. Help me to be sensitive to what it is You want me to do for You today. Amen.",
    "reading": "",
    "original_content": "THIS IS THE DAY THE LORD HAS MADE~~~LET US REJOICE AND BE GLAD IN IT...\n\nOur Meditation for Today:\n\nFor those God foreknew He also predestined to be conformed\nto the likeness of His Son, that He might be the firstborn among\nmany brothers...\n\nAnd those He predestined, He also called; those He called he\nalso justified; Those He justified, He also glorified...(Ro. 8:29, 30) NIV\n\nWhat Is The Meaning of This:\n\nGod's ultimate goal for us is to make us like Christ (I Jn.3:2).\n\nAs we become more and more like Him, we will discover our true\nselves, the person we were created to be...\n\nHow can we become like Christ? By reading and heeding the Word, \nby studding His life on earth through the Gospels, by spending time in\nprayer, by being filled with His Spirit, and by doing His work in the world.\n\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for Your Word,\nI thank You for Your Son's coming to earth, and\nliving a life we can attempt to copy. I thank You for\nthe avenue of prayer in which we can come to You\nday or night. Help me to be sensitive to what it is You \nwant me to do for You today...Amen.\n\nKeep looking up, He possibly has a special job for you today...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1156a7e290b426db",
    "date_utc": "Wed, 3 Oct 2007 12:12:43 -0600",
    "subject": "thoughts to live by",
    "verse": "What then shall we say in response to this? If God is for us, who can be against us? He who did not spare His own Son, but gave Him up for us, how will He not also along with Him, graciously give us all things. Who will bring a charge against those whom God has chosen? It is God who justifies. Who is He that condemns? Christ Jesus, who died, more than that, who was raised to life, is at the right hand of God and is also interceding for us. (Ro. 8:31-34) NIV",
    "reflection": "Do you ever think that because you aren't good enough for God, He will not save you? Do you ever feel as if salvation is for everyone else but you? Then these verses are especially for you. If God gave His Son for you, He isn't going to hold back the gift of salvation! If Christ gave His life for you, He isn't going to turn around and condemn you! He will not withhold anything you need to live for Him. The book of Romans is more than a theological explanation of God's redeeming grace~~it is a letter of comfort and confidence addressed to you.",
    "prayer": "Dear Heavenly Father, I thank You for (Jn. 3:16) and the assurance it give me of my salvation. I thank You for the confidence I receive of Your redeeming love. I pray today for the safety of our nation, its citizens and our troops. Bless and keep my e-mail friend safe and secure. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~Above all things, guard your heart, for it is the wellspring of life. \n\nOur Meditation for Today:\n\nWhat then shall we say in response to this? If God is for us, \nwho can be against us?\n\nHe who did not spare His own Son, but gave Him up for us,\nhow will He not also along with Him, graciously give us all\nthings...\n\nWho will bring a charge against those whom God has chosen?\nIt is God who justifies...\n\nWho is He that condemns? Christ Jesus, who died, more than \nthat, who was raised to life, is at the right hand of God and is also \ninterceding for us...(Ro. 8:31-34) NIV\n\nWhat Can Be Learned From This? \n\nDo you ever think that because you aren't good enough for God,\nHe will not save you?\n\nDo you ever feel as if salvation is for everyone else but you?\n\nThen these verses are especially for you...\n\nIf God gave His Son for you, He isn't going to hold back the gift\nof salvation! If Christ gave His life for you, He isn't going to turn \naround and condemn you!\n\nHe will not withhold anything you need to live for Him...\n\nThe book of Romans is more than a theological explanation of\nGod's redeeming grace~~it is a letter of comfort and confidence \naddressed to you...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for (Jn. 3:16) and the assurance\nit give me of my salvation. I thank You for the confidence I receive \nof Your redeeming love. I pray today for the safety of our nation, its\ncitizens and our troops. Bless and keep my e-mail friend safe and\nsecure...Amen.\n\nKeep looking up, fix your gaze on Him...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1156f9e558b92ac9",
    "date_utc": "Thu, 4 Oct 2007 07:11:28 -0600",
    "subject": "thoughts to live by",
    "verse": "Who shall separate us from the love of Christ? Shall trouble or hardship or persecution or famine or nakedness or danger or sword? As it is written: \"For Your sake we face death all day long; we are considered as sheep to be slaughtered.\" (Ro. 8:35, 36) NIV",
    "reflection": "These words were written to a church which would soon undergo terrible persecution. In just a few years, Paul's hypothetical situations would turn into painful realities. But this passage also reaffirms God's profound love for His people. No matter what happens to us, no matter where we are, we can never be separated from His love. Suffering should not drive us away from God but help us to identify with Him and allow His love to heal us.",
    "prayer": "Dear Heavenly Father, our Protector, Provider, and Redeemer, I thank You, that You are always near to protect, provide and save me from the wiles of Satan. Instill in me a sensitivity to the dangers of temptation. Help me to have a closer walk with Thee. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~Remember the Lord sees and hears us 24/7...\n\nOur Meditation for Today:\n\nWho shall separate us from the love of Christ? Shall trouble\nor hardship or persecution or famine or nakedness or danger\nor sword?\n\nAs it is written: \"For Your sake we face death all day long; \nwe are considered as sheep to be slaughtered.\" (Ro. 8:35, 36) NIV\n\nWhat We Should Learn From This:\n\nThese words were written to a church which would soon undergo \nterrible persecution...\n\nIn just a few years, Paul's hypothetical situations would turn into \npainful realities...\n\nBut this passage also reaffirms God's profound love for His people...\n\nNo matter what happens to us, no matter where we are, we can never \nbe separated from His love...\n\nSuffering should not drive us away from God but help us to identify with \nHim and allow His love to heal us...\n\nOur Prayer for Today:\nDear Heavenly Father, our Protector, Provider, and Redeemer,\nI thank You, that You are always near to protect, provide and\nsave me from the wiles of Satan. Instill in me a sensitivity to the\ndangers of temptation...Help me to have a closer walk with Thee...Amen.\n\nKeep looking up, He will sustain you in your troubles...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11574d3f471fe666",
    "date_utc": "Fri, 5 Oct 2007 09:48:30 -0600",
    "subject": "thoughts to live by",
    "verse": "No, in all these things we are more than conquerors through Him who loved us. For I am convinced that neither death nor life, neither angels, nor demons, neither the present nor the future, nor any powers, neither height nor depth, nor anything else in all creation, will be able to separate us from the love of God that is in Christ Jesus our Lord. (Ro. 8:37-39) NIV ",
    "reflection": "These verse contain one of the most comforting promises in all the Scriptures. Believers have always needed to face hardships in many forms: Persecution, illness, imprisonment, and yes even death. But of course this sometimes cause believers to think they have been abandoned by Christ. But Paul says: \"This is impossible.\" He says it is impossible to be separated from Christ. How can we be sure of this? ~~ Christ's death for us is proof of His unconquerable love. Nothing, can separate us from Christ's presence. God tells us how great His love is so that we will feel totally secure in Him. If we believe these overwhelming assurances, we will not be afraid.",
    "prayer": "Dear heavenly Father, I thank You for this wonderful promise. I thank You for the assurance that nothing can separate me from the presence of Jesus Christ. I thank You for Your love. Amen.",
    "reading": "",
    "original_content": "THIS IS THE DAY THAT THE LORD HAS MADE~~LET US REJOICE AND BE GLAD IN IT...\n\nOur Meditation for Today:\n\nNo, in all these things we are more than conquerors through Him\nwho loved us.\n\nFor I am convinced that neither death nor life, neither angels, nor\ndemons, neither the present nor the future , nor any powers,\n\nneither height nor depth, nor anything else in all creation, will be\nable to separate us from the love of God that is in Christ Jesus\nour Lord...(Ro. 8:37-39) NIV\n\nHere is What We Can Learn From This:\n\nThese verse contain one of the most comforting promises in all\nthe Scriptures...\n\nBelievers have always needed to face hardships in many forms:\nPersecution, illness, imprisonment, and yes even death...\n\nBut of course this sometimes cause believers to think they have been \nabandoned by Christ...\n\nBut Paul says: \"This is impossible.\" He says it is impossible to\nbe separated from Christ...\n\nHow can we be sure of this? ~~ Christ's death for us is proof of His\nunconquerable love. Nothing, can separate us from Christ's presence.\n\nGod tells us how great His love is so that we will feel totally secure in Him.\nIf we believe these overwhelming assurances, we will not be afraid...\n\nOur Prayer for Today:\nDear heavenly Father, I thank You for this wonderful promise.\nI thank You for the assurance that nothing can separate me\nfrom the presence of Jesus Christ. I thank You for Your love...Amen.\n\nKeep looking up ~~ He has a blessing for you...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1157f0a88a3d7cda",
    "date_utc": "Sun, 7 Oct 2007 16:20:03 -0600",
    "subject": "thoughts to live by",
    "verse": "I Speak the truth in Christ~~~I am not lying, my conscience confirms it in the Holy Spirit, I have great sorrow and unceasing anguish in my heart. For I could wish that I myself were cursed and cut off from Christ for the sake of my brothers, those of my own race. (Ro. 9:1-3)",
    "reflection": "Here Is What We Should Learn From These Verses: We see that Paul expresses concern for his Jewish \"brothers and sisters\" by saying that he would willingly take their punishment if that would save them. Now we need to remember, Christ is the only one who can save us. Paul shared a rare depth of love. Like Jesus he was willing to sacrifice so others would be saved. How concerned are you for those who do not know Christ? Are you willing to sacrifice your time, money, energy, comfort, and safety to see them come to faith in Jesus?",
    "prayer": "Dear Heavenly Father, forgive me for not showing the concern I should for the lost. Instill in me a genuine concern for all who are walking in darkness. Amen.",
    "reading": "",
    "original_content": "HAPPY COLUMBUS DAY~~~(food for thought)~~~Remember our ways are in full view\nof the Lord...\n\nOur Meditation for Today:\n\nI Speak the truth in Christ~~~I am not lying, my conscience\nconfirms it in the Holy Spirit,\n\nI have great sorrow and unceasing anguish in my heart...\n\nFor I could wish that I myself were cursed and cut off from\nChrist for the sake of my brothers, those of my own race...\n(Ro. 9:1-3)\n\nHere Is What We Should Learn From These Verses:\n\nWe see that Paul expresses concern for his Jewish \"brothers\nand sisters\" by saying that he would willingly take their punishment\nif that would save them...\n\nNow we need to remember, Christ is the only one who can save us.\n\nPaul shared a rare depth of love. Like Jesus he was willing to \nsacrifice so others would be saved...\n\nHow concerned are you for those who do not know Christ?\n\nAre you willing to sacrifice your time, money, energy, comfort, and \nsafety to see them come to faith in Jesus?\n\nOur Prayer for Today:\nDear Heavenly Father, forgive me for not showing the \nconcern I should for the lost. Instill in me a genuine concern\nfor all who are walking in darkness...Amen.\n\nKeep looking up, He wants to be your guide...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1158429c97b1127a",
    "date_utc": "Mon, 8 Oct 2007 06:19:45 -0600",
    "subject": "thoughts to live by",
    "verse": "When Paul mentioned the people of \"his own race\" he was referring to the people of Israel. Theirs is the adoption as sons; theirs the divine glory, the covenants, the receiving of the law, the temple worship and the promises. Theirs are the patriarchs, and from them is traced the human ancestry of Christ, who is God over all, forever praised! Amen. (Ro. 9:4, 5) NIV",
    "reflection": "What we should always remember is, that the Jews are God's chosen people. The Jews viewed God's choosing of Israel in the Old Testament as being like adoption. They were undeserving and without rights as natural children~~ Yet God adopted them and granted them the status of His sons and daughters. But lets also remember (2 Cor. 5:17, 18) Therefore if anyone is in Christ, he is a new creation; the old has gone, and the new has come! All this is from God who reconciled us to Himself through Christ and gave us the ministry of reconciliation. Those who accept Christ, and become Christians have become new people on the inside~~The Holy Spirit gives them new life, and they are not the same anymore. They are re-created (new creations) living in vital union with Christ (Co. 2:6, 7).",
    "prayer": "Dear Heavenly Father, I know that I am undeserving of being called your child, but I do believe in the finished work of Christ on the cross thus making me a new creature. I thank You also for the work of the Holy Spirit which gives new life so that I can be reconciled to You. I thank You for the union with Christ that is so vital in my life. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~Remember He sees and hears everything we do and say!!!\n\nOur Meditation for Today:\n\nWhen Paul mentioned the people of \"his own race\" he was referring to \nthe people of Israel. Theirs is the adoption as sons; theirs the divine \nglory, the covenants, the receiving of the law, the temple worship and\nthe promises...\n\nTheirs are the patriarchs, and from them is traced the human ancestry\nof Christ, who is God over all, forever praised! Amen...(Ro. 9:4, 5) NIV\n\nWhat Can We Learn From This?\n\nWhat we should always remember is, that the Jews are God's \nchosen people. The Jews viewed God's choosing of Israel in\nthe Old Testament as being like adoption...\n\nThey were undeserving and without rights as natural children~~\nYet God adopted them and granted them the status of His sons \nand daughters...\n\nBut lets also remember (2 Cor. 5:17, 18) Therefore if anyone is in\nChrist, he is a new creation; the old has gone, and the new has \ncome! \n\nAll this is from God who reconciled us to Himself through Christ and \ngave us the ministry of reconciliation...\n\nThose who accept Christ, and become Christians have become new \npeople on the inside~~The Holy Spirit gives them new life, and they \nare not the same anymore...\n\nThey are re-created (new creations) living in vital union with Christ (Co. 2:6, 7).\n\nOur Prayer for Today:\nDear Heavenly Father, I know that I am undeserving of being called\nyour child, but I do believe in the finished work of Christ on the cross\nthus making me a new creature. I thank You also for the work of the\nHoly Spirit which gives new life so that I can be reconciled to You.\nI thank You for the union with Christ that is so vital in my life...Amen.\n\nKeep looking up, it is vital for our union with Him...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115895bdc45ca7fa",
    "date_utc": "Tue, 9 Oct 2007 06:34:31 -0600",
    "subject": "thoughts to live by",
    "verse": "It is not as though God's word had failed. For not all who are descended from Israel are Israel. Nor because they are his descendents are they all Abraham's children. On the contrary, \"It is Through Isaac that your offspring will be reckoned. In other words, it is not the natural children who are God's children, but it is the children of the promise who are regarded as Abraham's offspring. (Ro. 9:6-8) NIV",
    "reflection": "We should remember that the beautiful covenant promises that we have in God's Word originally came to Abraham. The \"Covenant people, \" the true children of Abraham, are not just his biological descendents. They are those who trust God and in what Jesus Christ has done for them (Ro. 2:9: Gal. 3:7).",
    "prayer": "Dear Heavenly Father, I pray for the faithfulness to walk in the Light of Christ. I pray for a sensitivity to Your Holy Spirit's guidance. Forgive me Lord for my sins of thought, word, and deed. Instill in me a Christ-like attitude. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~Our deeds~~actions, speak volumes about our heart...\n\nOur Meditation for Today:\n\nIt is not as though God's word had failed. For not all who are \ndescended from Israel are Israel...\n\nNor because they are his descendents are they all Abraham's \nchildren. On the contrary, \"It is Through Isaac that your offspring \nwill be reckoned...\n\nIn other words, it is not the natural children who are God's children,\nbut it is the children of the promise who are regarded as Abraham's \noffspring...(Ro. 9:6-8) NIV\n\nThe Lesson to be Learned:\n\nWe should remember that the beautiful covenant promises that\nwe have in God's Word originally came to Abraham...\n\nThe \"Covenant people,\" the true children of Abraham, are not just\nhis biological descendents. They are those who trust God and in what\nJesus Christ has done for them (Ro. 2:9: Gal. 3:7)...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray for the faithfulness to walk\nin the Light of Christ. I pray for a sensitivity to Your Holy\nSpirit's guidance. Forgive me Lord for my sins of thought,\nword, and deed...Instill in me a Christ-like attitude...Amen.\n\nKeep looking up, trusting in His loving kindness...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1158a676397cbb58",
    "date_utc": "Wed, 10 Oct 2007 06:49:02 -0600",
    "subject": "thoughts to live by",
    "verse": "(God's sovereign choice)~~~ God promised: \"At the appointed time I will return, and Sarah will have a son\". Not only that but Rebekah's children had one and the same father, our father Isaac. Yet, before the twins were born or had done anything good or bad~ in order that God's purpose in election might stand: not by works but by Him who calls~she was told, \"The older will serve the younger. (Ro. 9:8-11) NIV",
    "reflection": "The Jews were proud of the fact that their lineage came from Isaac, whose mother was Sarah (Abraham's legitimate wife), rather than Ishmael, whose mother was Hagar (Sarah's servant. Paul makes it very clear that no one can claim to be chosen by God because of his or her heritage or good deeds. God freely chooses to save whom-ever He wills. In the doctrine of election we are taught that God's sovereign choice to save us, is by His goodness and mercy, not by our own merit.",
    "prayer": "Dear Heavenly Father, I thank You for Your goodness and mercy. I truly thank You that my salvation does not depend upon my good deeds, for they are but filthy rags. Help me to walk in the way of our Lord and Savior Jesus Christ, trusting in His finished work on the cross. Keep our nation, its citizens and our troops safe. Bless all my e-mail friends with good health and safety. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~The fear of the Lord is to hate evil...\n\nOur Meditation for Today:\n\n(God's sovereign choice)~~~\nGod promised: \"At the appointed time I will return, and Sarah \nwill have a son\"...\n\nNot only that but Rebekah's children had one and the same father,\nour father Isaac...\n\nYet, before the twins were born or had done anything good or bad~\nin order that God's purpose in election might stand:\n\nnot by works but by Him who calls~she was told, \"The older will \nserve the younger...(Ro. 9:8-11) NIV\n\nWhat Is To Be Learned From This:\n\nThe Jews were proud of the fact that their lineage came from Isaac,\nwhose mother was Sarah (Abraham's legitimate wife), rather than\nIshmael, whose mother was Hagar (Sarah's servant...\n\nPaul makes it very clear that no one can claim to be chosen by God\nbecause of his or her heritage or good deeds...\n\nGod freely chooses to save whom-ever He wills...\n\nIn the doctrine of election we are taught that God's sovereign choice to \nsave us, is by His goodness and mercy, not by our own merit...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for Your goodness and mercy.\nI truly thank You that my salvation does not depend upon my good \ndeeds, for they are but filthy rags. Help me to walk in the way of \nour Lord and Savior Jesus Christ, trusting in His finished work on\nthe cross...Keep our nation, its citizens and our troops safe. Bless \nall my e-mail friends with good health and safety...Amen.\n\nKeep looking up, He is our help in the time of trouble...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11593ccfff52aad2",
    "date_utc": "Thu, 11 Oct 2007 06:48:06 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul writes: Not by works but by Him who calls ~ Rebekah was told, \"The older will serve the younger. Just as it is written: \"Jacob I loved, but Esau I hated.\" What then shall we say? Is God unjust? Not at all! For He says to Moses, \"I will have mercy on whom I have mercy, and will have compassion on whom I have compassion. (Ro. 9:12-15) NIV",
    "reflection": "The Lesson to be Learned: Was it right for God to choose Jacob, the younger, to be over Esau? In Malachi 1:2, 3, the statement \"I showed my love for you by loving your ancestor Jacob. Yet Esau was Jacob's brother, and I rejected Esau\" this refers to the nation of Israel and Edom rather than the individual brothers. God chose Jacob to continue the family line of the faithful because He knew his heart was for God. BUT He did not exclude Esau from knowing and loving Him. We need to keep in mind the kind of God we worship: He is sovereign; He is not arbitary; in all things He works for our good; He is trustworthy; He will save all who believe in Him. When we understand these qualities of God, we know that His choices are good even if we do not understand all His reasons.",
    "prayer": "Dear Heavenly Father, I surely don't understand all that You do, for if I did You would not be God. But I do accept Your reasoning by faith seeking to follow You daily. Forgive me when I stumble. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~The Lord says, \"I hate pride and arrogance \nevil behavior and perverse speech...\n\nOur Meditation for Today:\n\nPaul writes: Not by works but by Him who calls ~ Rebekah was told,\n\"The older will serve the younger.\n\nJust as it is written: \"Jacob I loved, but Esau I hated.\"\n\nWhat then shall we say? Is God unjust? Not at all!\n\nFor He says to Moses, \"I will have mercy on whom I have mercy,\nand will have compassion on whom I have compassion...\n(Ro. 9:12-15) NIV\n\nThe Lesson to be Learned:\n\nWas it right for God to choose Jacob, the younger, to be over Esau?\n\nIn Malachi 1:2, 3, the statement \"I showed my love for you by loving\nyour ancestor Jacob. Yet Esau was Jacob's brother, and I rejected Esau\"\nthis refers to the nation of Israel and Edom rather than the individual brothers.\n\nGod chose Jacob to continue the family line of the faithful because He\nknew his heart was for God...\n\nBUT He did not exclude Esau from knowing and loving Him.\n\nWe need to keep in mind the kind of God we worship: He is sovereign; \nHe is not arbitary; in all things He works for our good; He is trustworthy;\nHe will save all who believe in Him...\n\nWhen we understand these qualities of God, we know that His choices\nare good even if we do not understand all His reasons...\n\nOur Prayer for Today:\nDear Heavenly Father, I surely don't understand all that You\ndo, for if I did You would not be God. But I do accept Your\nreasoning by faith seeking to follow You daily. Forgive me\nwhen I stumble...Amen.\n\nKeep looking up in faith, He knows what is best...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11598dc7371c23d6",
    "date_utc": "Fri, 12 Oct 2007 11:36:54 -0600",
    "subject": "thoughts to live by",
    "verse": "For the Scripture says to Pharaoh: \"I raised you up for this very purpose, that I might display My power in you and that My name might be proclaimed in all the earth.\" Therefore God has mercy on whom He wants to have mercy, and He hardens whom He wants to harden. (Ro. 9:17, 18) NIV",
    "reflection": "Paul quotes from Ex. 8:16 where God foretold how Pharaoh would be used to declare God's power. Paul uses this argument to show that salvation was God's work, not people's. God's judgment on Pharaoh's sin was to harden his heart, to confirm his disobedience, so that the consequences of his rebellion would be his own punishment. Don't allow rebellion be the cause of separation between you and God.",
    "prayer": "Dear Heavenly Father, do to our sinful flesh I have often sinned against You. Forgive me for these sins so that I do not become separated from You. I pray that our Nation would once again seek to put You first in all that it does. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~God looks at the heart, not the\nouter appearance...\n\nOur Meditation for Today:\n\nFor the Scripture says to Pharaoh: \"I raised you up for this very purpose,\nthat I might display My power in you and that My name might be proclaimed \nin all the earth.\"\n\nTherefore God has mercy on whom He wants to have mercy, and He hardens \nwhom He wants to harden...(Ro. 9:17, 18) NIV\n\nOur Lesson for Today:\n\nPaul quotes from Ex. 8:16 where God foretold how Pharaoh would be \nused to declare God's power...\n\nPaul uses this argument to show that salvation was God's work, not \npeople's.\n\nGod's judgment on Pharaoh's sin was to harden his heart, to confirm\nhis disobedience, so that the consequences of his rebellion would be\nhis own punishment...\n\nDon't allow rebellion be the cause of separation between you and God...\n\nOur Prayer for Today:\nDear Heavenly Father, do to our sinful flesh I have often \nsinned against You. Forgive me for these sins so that I\ndo not become separated from You. I pray that our Nation\nwould once again seek to put You first in all that it does...Amen.\n\nKeep looking up, and seek His grace...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115a31960c992f49",
    "date_utc": "Sat, 13 Oct 2007 16:58:19 -0600",
    "subject": "thoughts to live by",
    "verse": "One of you will say to me, Then why does God still blame? For who resists His will? But who are you, O man, to talk back to God? Shall what is formed say to Him who formed it, 'Why did You make me like this? Does not the potter have the right to make out of the same lump of clay some pottery for noble purposes and some for common use? (Romans 9:19)",
    "reflection": "With this illustration, Paul is not saying that some of us are worth more than others, but that the Creator has control over the created object. The created object, therefore, has no right to demand anything from its Creator~~its very existence depends on Him. Keeping this perspective removes any temptation to have pride in any personal achievement.",
    "prayer": "Dear Heavenly Father, forgive me for complying that others have far more talent than I. I should be very thankful for the gifts You have given me. If I were to truly examine my life I would have to confess that I have so much to be thankful for. Thank You Lord for those blessings. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~Serve the purpose for which \nyou were created...\n\nOur Meditation for Today:\n\nOne of you will say to me, \"Then why does God still blame? For who\nresists His will?\"\n\nBut who are you, O man, to talk back to God? \"Shall what is formed \nsay to Him who formed it, 'Why did You make me like this?\n\nDoes not the potter have the right to make out of the same lump of\nclay some pottery for noble purposes and some for common use?\n\nHere Is What We Should Learn From These Verses:\n\nWith this illustration, Paul is not saying that some of us are worth more \nthan others, but that the Creator has control over the created object...\n\nThe created object, therefore, has no right to demand anything from its\nCreator~~its very existence depends on Him...\n\nKeeping this perspective removes any temptation to have pride in any\npersonal achievement...\n\nOur Prayer for Today:\nDear Heavenly Father, forgive me for complying that others\nhave far more talent than I. I should be very thankful for the\ngifts You have given me. If I were to truly examine my life I\nwould have to confess that I have so much to be thankful for...\nThank You Lord for those blessings...Amen.\n\nKeep looking up, with thanksgiving...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115a83e1fa5533ea",
    "date_utc": "Mon, 15 Oct 2007 22:22:56 -0600",
    "subject": "thoughts to live by",
    "verse": "What then shall we say? That the Gentiles, who did not pursue righteousness, have obtained it, a righteousness that is by faith; But Israel, who pursued a law of righteousness, has not attained it. Why not? Because they pursued it not by faith but as if it were by works. They stumbled over the \"stumbling stone.\" As it is written: \"See, I lay in Zion a stone that causes men to stumble and a rock that makes them fall, and the one who trusts in Him will never be put to shame.\" (Ro. 9:30-33) NIV",
    "reflection": "Sometimes we are like these people, trying to get right with God by keeping His laws. We may think that attending church, doing church work, giving offerings, and being nice will be enough. After all, we've played by the rules, haven't we? But Paul's words sting~~this approach never succeeds. Paul explains that God's plan is not for those who try to earn His favor by being good; it is for those who realize that they can never be good enough and so must depend on Christ. We can be saved only by putting our faith in what Jesus has done. If we do that we will never be disappointed.",
    "prayer": "Dear Heavenly Father, I thank You for the Love of Your Son, who took my place on the cross for my sins. I thank You that even my faith is a gift from You. Forgive me for the times I have strive to be a better person with the idea that, that would merit eternal life. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~We will never merit eternal life...\n\nOur Meditation for Today:\n\nWhat then shall we say? That the Gentiles, who did not pursue \nrighteousness, have obtained it, a righteousness that is by faith;\n\nBut Israel, who pursued a law of righteousness, has not attained it.\n\nWhy not? Because they pursued it not by faith but as if it were by \nworks. They stumbled over the \"stumbling stone.\"\n\nAs it is written: \"See, I lay in Zion a stone that causes men to stumble\nand a rock that makes them fall, and the one who trusts in Him will\nnever be put to shame.\" (Ro. 9:30-33) NIV\n\nOur Thought for Today:\n\nSometimes we are like these people, trying to get right with God\nby keeping His laws.\n\nWe may think that attending church, doing church work, giving\nofferings, and being nice will be enough. After all, we've played\nby the rules, haven't we?\n\nBut Paul's words sting~~this approach never succeeds. Paul\nexplains that God's plan is not for those who try to earn His favor\nby being good; it is for those who realize that they can never be\ngood enough and so must depend on Christ...\n\nWe can be saved only by putting our faith in what Jesus has done.\nIf we do that we will never be disappointed...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the Love of Your Son,\nwho took my place on the cross for my sins. I thank You that \neven my faith is a gift from You. Forgive me for the times I \nhave strive to be a better person with the idea that, that would \nmerit eternal life...Amen.\n\nKeep looking up, your salvation draws near...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115ad717e7e453ad",
    "date_utc": "Tue, 16 Oct 2007 10:05:59 -0600",
    "subject": "thoughts to live by",
    "verse": "Brothers, my heart's desire and prayer to God for the Israelites is that they may be saved. For I can testify about them that they are zealous for God, but their zeal is not based on knowledge. (Ro. 10:1, 2) NIV",
    "reflection": "A question which may come to mind is, what will happen to the Jewish people who believed in God but not Christ? Since they believe in the same God, won't they be saved? If that were true, Paul would not have had to work so hard and sacrificed so much to teach them about Christ. Because Christ is the most complete revelation of God, we cannot fully know God apart from Christ; and because God appointed Jesus to bring God and people together, we cannot come to God by another way. The Jews, like everyone else, must find salvation through Jesus Christ (Jn. 14:6; Acts 4:12). Like Paul, we should pray that all Jews might be saved and lovingly share the Good News with them.",
    "prayer": "Dear Heavenly Father, forgive me for not praying as I should for the Jews, I know they are Your chosen people, so it goes without saying that You would wish for them all to be saved. Instill in me a heart for the lost. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!~~~(food for thought)~~~Always honor God...\n\nOur Meditation for Today:\n\nBrothers, my heart's desire and prayer to God for the Israelites\nis that they may be saved...\n\nFor I can testify about them that they are zealous for God, but\ntheir zeal is not based on knowledge...(Ro. 10:1, 2) NIV\n\nHere Is What We should Learn From This:\n\nA question which may come to mind is, what will happen to the\nJewish people who believed in God but not Christ?\n\nSince they believe in the same God, won't they be saved?\n\nIf that were true, Paul would not have had to work so hard and\nsacrificed so much to teach them about Christ...\n\nBecause Christ is the most complete revelation of God, we\ncannot fully know God apart from Christ; and because God\nappointed Jesus to bring God and people together, we cannot\ncome to God by another way...\n\nThe Jews, like everyone else, must find salvation through Jesus\nChrist (Jn. 14:6; Acts 4:12)...\n\nLike Paul, we should pray that all Jews might be saved and lovingly\nshare the Good News with them...\n\nOur Prayer for Today:\nDear Heavenly Father, forgive me for not praying as I should for\nthe Jews, I know they are Your chosen people, so it goes without \nsaying that You would wish for them all to be saved...Instill in me\na heart for the lost...Amen.\n\nKeep looking up, for your guidance...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115b289cc3eca4a2",
    "date_utc": "Wed, 17 Oct 2007 20:15:14 -0600",
    "subject": "thoughts to live by",
    "verse": "The Jews did not know the righteousness that comes from God and sought to establish their own, they did not submit to God's righteousness. Christ is the end of the law so that there may be righteousness for everyone who believes. Moses describes in this way the righteousness that is by the law: \"The man who does these things will live by them.\" (Ro 10:3-5) NIV",
    "reflection": "Rather than living by faith in God, the Jews established customs and traditions (in addition to God's law) to try to make themselves acceptable in God's sight. But human effort, no matter how sincere, can never substitute for the righteousness God offers us by faith. The only way to earn salvation is to be perfect ~~ and that is impossible. We can only hold out our empty hands and receive salvation as a gift.",
    "prayer": "Dear Heavenly Father, I know that the cost that was paid for the gift of eternal life is beyond anything I could ever be capable of repaying. So I give thanks for that gift with a humble heart, accepting Your love and mercy. Amen.",
    "reading": "",
    "original_content": "God's Blessing to You!!!~~~(food for thought)~~~The will of God will never take you, where \nthe grace of God will not protect you...\n\nOur Meditation for Today:\n\nThe Jews did not know the righteousness that comes from God\nand sought to establish their own, they did not submit to God's\nrighteousness...\n\nChrist is the end of the law so that there may be righteousness \nfor everyone who believes...\n\nMoses describes in this way the righteousness that is by the law:\n\"The man who does these things will live by them.\" (Ro 10:3-5) NIV\n\nThe Lesson To Be Learned:\n\nRather than living by faith in God, the Jews established customs\nand traditions (in addition to God's law) to try to make themselves\nacceptable in God's sight...\n\nBut human effort, no matter how sincere, can never substitute\nfor the righteousness God offers us by faith. The only way to \nearn salvation is to be perfect ~~ and that is impossible. We\ncan only hold out our empty hands and receive salvation as a \ngift...\n\nOur Prayer for Today\nDear Heavenly Father, I know that the cost that was paid for \nthe gift of eternal life is beyond anything I could ever be \ncapable of repaying. So I give thanks for that gift with a humble \nheart, accepting Your love and mercy...Amen\n\nKeep looking up, He wants to shower you with His love...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115b7ae1a7b951c0",
    "date_utc": "Thu, 18 Oct 2007 13:53:24 -0600",
    "subject": "thoughts to live by",
    "verse": "The righteousness that is by faith says: \"Do not say in your heart, 'Who will ascend into heaven?' (that is to bring Christ down) \"or 'Who will descend into the deep?' (that is, to bring Christ up from the dead). But what does it say? \"The word is near you; it is in your mouth and in your heart, \" that is, the word of faith we are proclaiming. (Ro. 10:6-8) NIV",
    "reflection": "Paul adapts Moses' farewell challenge from Deut. 30:11-14 to apply to Christ. Christ has provided our salvation through His incarnation (God in human form) and resurrection. God's salvation is right in front of us. He will come to you wherever we are. All we need to do is to respond and accept His gift of salvation.",
    "prayer": "Dear Heavenly Father, I thank You for the gift of all gifts, the gift of salvation that is ours merely by faith. Lord I believe, help my faith to grow to where I leave all things in Your hands. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~He is but a prayer away\n\nOur Meditation for Today:\n\nThe righteousness that is by faith says: \"Do not say in your heart,\n'Who will ascend into heaven?' (that is to bring Christ down)\n\n\"or 'Who will descend into the deep?' (that is, to bring Christ up \nfrom the dead)...\n\nBut what does it say? \"The word is near you; it is in your mouth \nand in your heart,\" that is, the word of faith we are proclaiming...\n(Ro. 10:6-8) NIV\n\nOur Lesson for Today:\n\nPaul adapts Moses' farewell challenge from Deut. 30:11-14\nto apply to Christ...\n\nChrist has provided our salvation through His incarnation\n(God in human form) and resurrection...\n\nGod's salvation is right in front of us. He will come to you wherever\nwe are. All we need to do is to respond and accept His gift of \nsalvation...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the gift of all gifts,\nthe gift of salvation that is ours merely by faith. Lord I\nbelieve, help my faith to grow to where I leave all things\nin Your hands...Amen.\n\nKeep looking up, in Him all things are possible...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115bcc1f8461d935",
    "date_utc": "Fri, 19 Oct 2007 12:48:54 -0600",
    "subject": "thoughts to live by",
    "verse": "But what does it say? \"The word is near you; it is in your mouth and in your heart, \" that is, the word of faith we are proclaiming: That if you confess with your mouth, \"Jesus is Lord, \" and believe in your heart that God raised Him from the dead, you will be saved. For it is with your heart that you believe and are justified, and it is with your mouth that you confess and are saved. As the Scripture says, \"Anyone who trusts in Him will never be put to shame. For there is no difference between Jew and Gentile ~~ The same Lord is Lord of all and richly blesses all who call on Him. (Ro. 10:8-12) NIV",
    "reflection": "Have you ever been asked.\"How do I become a Christian?\" Well these verses give you the beautiful answer ~~ Salvation is as close as your lips and heart. People often think it must be a complicated process, but it is not. If we believe in our heart and say with our mouth that Christ is the risen Lord, we will be saved.",
    "prayer": "Dear Heavenly Father, I thank You for the simplicity of receiving eternal life. Lord I pray that more people would accept this way of Salvation. I ask Your blessing upon all my e-mail friends this day. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~There is no shame in trusting in Him\n\nOur Meditation for Today:\n\nBut what does it say? \"The word is near you; it is in your mouth\nand in your heart,\" that is, the word of faith we are proclaiming:\n\nThat if you confess with your mouth, \"Jesus is Lord,\" and believe \nin your heart that God raised Him from the dead, you will be saved.\n\nFor it is with your heart that you believe and are justified, and it is\nwith your mouth that you confess and are saved...\n\nAs the Scripture says, \"Anyone who trusts in Him will never be put \nto shame...\n\nFor there is no difference between Jew and Gentile ~~ The same \nLord is Lord of all and richly blesses all who call on Him...(Ro. 10:8-12) NIV\n\nOur Lesson for Today:\n\nHave you ever been asked.\"How do I become a Christian?\"\n\nWell these verses give you the beautiful answer ~~ Salvation\nis as close as your lips and heart...\n\nPeople often think it must be a complicated process, but\nit is not. If we believe in our heart and say with our mouth \nthat Christ is the risen Lord, we will be saved...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the simplicity of\nreceiving eternal life. Lord I pray that more people would\naccept this way of Salvation. I ask Your blessing upon all\nmy e-mail friends this day...Amen.\n\nKeep looking up, He is the Way the Truth and the Life...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115cc4310650a34d",
    "date_utc": "Mon, 22 Oct 2007 16:15:49 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul's sermon-net was, \"Everyone who calls on the name of the Lord will be saved.\" Now we have these question. How, then, can they call on the one they have not believed in? And how can they believe in the one of whom they have not heard? And how can they hear without someone preaching to them? And how can they preach unless they are sent? as it is written, \"How beautiful are the feet of those who bring good news!\" (Ro. 10:14, 15) NIV",
    "reflection": "We who do believe are to take God's great message of salvation to others so they can respond to the Good News. How will your loved ones and neighbors hear unless someone tells them? Is God calling you to take a part in making His message known to your community. Do you know someone who needs to hear the Good News? Now ask God for a way that you can share so that they can hear it. then do it as soon as possible.",
    "prayer": "Dear Heavenly Father, I have this friend who is seeking a new way of life, help me to share with him the message you want him to hear. Guide me so that I do not scare him off or confuse him. Amen.",
    "reading": "",
    "original_content": "Have a Blessed Day!!!~~~(food for thought)~~~Be an encourager...\n\nOur Meditation for Today:\n\nPaul's sermon-net was, \"Everyone who calls on the name of\nthe Lord will be saved.\" Now we have these question...\n\nHow, then, can they call on the one they have not believed \nin? And how can they believe in the one of whom they have \nnot heard? And how can they hear without someone\npreaching to them?\n\nAnd how can they preach unless they are sent? as it is written,\n\"How beautiful are the feet of those who bring good news!\"\n(Ro. 10:14, 15) NIV\n\nOur Lesson for Today:\n\nWe who do believe are to take God's great message of\nsalvation to others so they can respond to the Good News.\n\nHow will your loved ones and neighbors hear unless someone \ntells them?\n\nIs God calling you to take a part in making His message known \nto your community...\n\nDo you know someone who needs to hear the Good News?\n\nNow ask God for a way that you can share so that they can\nhear it...then do it as soon as possible...\n\nOur Prayer for Today:\nDear Heavenly Father, I have this friend who is seeking\na new way of life, help me to share with him the message\nyou want him to hear. Guide me so that I do not scare him\noff or confuse him...Amen.\n\nKeep looking up, for your guidance...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115d173e87b27f72",
    "date_utc": "Tue, 23 Oct 2007 09:29:50 -0600",
    "subject": "thoughts to live by",
    "verse": "Consequently, faith comes from hearing the message, and the message is heard through the Word of Christ. But I asked: Did they not hear? of course the did: \"Their voice has gone out into all the earth, their words to the ends of the world.\" Again I asked: Did Israel not understand? First, Moses says, \"I will make you envious by those who are not a nation; I will make you angry by a nation that has no understanding.\" And Isaiah boldly says, \"I was found by those who did not seek Me; I revealed Myself to those who did not ask Me. (Ro. 10:17-20) NIV",
    "reflection": "Many Jews who looked for the Messiah refused to believe in Him when He came. God offered His salvation to the Gentiles (\"other nations\" and \"people who were not looking for Me\"); We need to remember that many Gentiles didn't even know about a Messiah, but they found Him and believed in Him. There are some religious people who are spiritually blind, while those who have never been in a church are sometimes the most responsive to God's message. Because appearances are deceiving, and we can't see into people's hearts, beware of judging beforehand, who will respond to the God News and who will not.",
    "prayer": "Dear Heavenly Father, forgive me when I judge unfairly. Help me to turn that over to You. Open my eyes that I may see glimpses of truth you have for me. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~\n\nOur Meditation for Today:\n\nConsequently, faith comes from hearing the message, and the\nmessage is heard through the Word of Christ...\n\nBut I asked: Did they not hear? of course the did: \"Their voice\nhas gone out into all the earth, their words to the ends of the\nworld.\"\n\nAgain I asked: Did Israel not understand? First, Moses says, \n\"I will make you envious by those who are not a nation; I will\nmake you angry by a nation that has no understanding.\"\n\nAnd Isaiah boldly says, \"I was found by those who did not seek Me; \nI revealed Myself to those who did not ask Me...(Ro. 10:17-20) NIV\n\nOur Lesson for Today:\n\nMany Jews who looked for the Messiah refused to believe in Him \nwhen He came...\n\nGod offered His salvation to the Gentiles (\"other nations\" and \n\"people who were not looking for Me\");\n\nWe need to remember that many Gentiles didn't even know about a \nMessiah, but they found Him and believed in Him...\n\nThere are some religious people who are spiritually blind, while those\nwho have never been in a church are sometimes the most responsive\nto God's message...\n\nBecause appearances are deceiving, and we can't see into people's\nhearts, beware of judging beforehand, who will respond to the God \nNews and who will not...\n\nOur Prayer for Today:\nDear Heavenly Father, forgive me when I judge unfairly.\nHelp me to turn that over to You. Open my eyes that I \nmay see glimpses of truth you have for me...Amen.\n\nKeep looking up, and receive showers of blessing...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather...",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115d88e1f58b6880",
    "date_utc": "Wed, 24 Oct 2007 15:41:32 -0600",
    "subject": "thoughts to live by",
    "verse": "I ask then: Did God reject His people? By no means! I am an Israelite myself, a descendent of Abraham, from the tribe of Benjamin. God did not reject His people, whom He foreknew. Don't you know what the Scripture says in the passage about Elijah, how he appealed to God against Israel: \"Lord, they have killed Your prophets and torn down Your altars; I am the only one left, and they are trying to kill me\"? And what was God's answer to him? \"I have reserved for Myself seven thousand who have not bowed the knee to Baal.\" So to at the present time there is a remnant chosen by grace. (Ro. 11:1-5) NIV",
    "reflection": "Yes God chose the Jews (\"His own people\") to be the people through whom the rest of the world could find salvation. But this did not mean that the entire Jewish nation would be saved; only those who were faithful to God were considered true Jews (Ro. 11:5). We are save through faith in Christ, not because we are part of a nation, religion, or family. The question is, on whom or what are you trusting for salvation???",
    "prayer": "Dear Heavenly Father, forgive me for not always putting You first in my life. Help to become more Christ-like in my attitude and life. Bless our nation, citizens and troops and keep them safe. Amen.",
    "reading": "",
    "original_content": "HAVE A BLESSED DAY!!!~~~(food for thought)~~~It is by grace that we are saved...\n\nOur Bible Verses for Today:\n\nI ask then: Did God reject His people? By no means! I am an\nIsraelite myself, a descendent of Abraham, from the tribe of \nBenjamin...\n\nGod did not reject His people, whom He foreknew. Don't you know\nwhat the Scripture says in the passage about Elijah, how he appealed\nto God against Israel:\n\n\"Lord, they have killed Your prophets and torn down Your altars; I am \nthe only one left, and they are trying to kill me\"?\n\nAnd what was God's answer to him? \"I have reserved for Myself seven\nthousand who have not bowed the knee to Baal.\"\n\nSo to at the present time there is a remnant chosen by grace...(Ro. 11:1-5) NIV\n\nThe Lesson To Be Learned:\n\nYes God chose the Jews (\"His own people\") to be the people through\nwhom the rest of the world could find salvation...\n\nBut this did not mean that the entire Jewish nation would be saved; only\nthose who were faithful to God were considered true Jews (Ro. 11:5)...\n\nWe are save through faith in Christ, not because we are part of a nation,\nreligion, or family...\n\nThe question is, on whom or what are you trusting for salvation???\n\nOur Prayer for Today:\nDear Heavenly Father, forgive me for not always putting You first \nin my life. Help to become more Christ-like in my attitude and life...\nBless our nation, citizens and troops and keep them safe...Amen.\n\nKeep looking up, He wants to be first in your life...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115dbc213aa4c56d",
    "date_utc": "Thu, 25 Oct 2007 17:45:29 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul has just told us in verse 5 that there is a remnant chosen by grace. Then he says: And if by grace, then it is no longer by works; if it were, grace would no longer be grace. (Ro 11:6) NIV",
    "reflection": "Think about this, do you think it's easier for God to love you when you're good? Do you secretly suspect that God chose you because you deserved it? Do you think that some people's behavior is so bad that God couldn't possibly save them? If you ever think this way, you don't entirely understand that salvation is by grace, a free gift. It can not be earned, in whole or in part; it can only be accepted with thankfulness and praise.",
    "prayer": "Dear Heavenly Father, I do thank you for the free gift that You have provide in Christ Jesus Your Son. Guide us by Your grace I pray in Jesus Name. Amen.",
    "reading": "",
    "original_content": "HAVE A BLESSED DAY!!!~~~(food for thought)~~~Salvation can never be earned...\n\n\nOur Bible Verse for Today:\n\nPaul has just told us in verse 5 that there is a remnant chosen by grace.\n\nThen he says: And if by grace, then it is no longer by works; if it were,\ngrace would no longer be grace...(Ro 11:6) NIV\n\nWhat is the Message?\n\nThink about this, do you think it's easier for God to love you when you're good?\n\nDo you secretly suspect that God chose you because you deserved it?\n\nDo you think that some people's behavior is so bad that God couldn't possibly\nsave them?\n\nIf you ever think this way, you don't entirely understand that salvation is by grace,\na free gift. It can not be earned, in whole or in part; it can only be accepted with\nthankfulness and praise...\n\nOur Prayer for Today:\nDear Heavenly Father, I do thank you for the free gift\nthat You have provide in Christ Jesus Your Son. Guide \nus by Your grace I pray in Jesus Name...Amen.\n\nKeep looking up, God loves you...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115eb3c5ffbb77d4",
    "date_utc": "Sun, 28 Oct 2007 15:02:29 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul says: \"I am talking to you Gentiles in-as-much as I am the apostle to the Gentiles, I make much of my ministry in the hope that I may somehow arouse my own people to envy and save some of them. For if their rejection is the reconciliation of the world, what will their acceptance be but life from the dead.\" (Ro. 11:13-15) NIV",
    "reflection": "Paul was an appointed apostle to the Gentiles. Here he reminds his Jewish brothers and sisters of this fact. He was hoping that they too would want to be saved. The Jews had rejected God's offer, and so the Gentiles were offered salvation ~~ But when a Jews comes to Christ, there is great rejoicing, as if a dead person had come back to life.",
    "prayer": "Dear Heavenly Father, I thank You for the offer of eternal life. Help me to always remember to give thanks for this wonderful gift. I pray for the safety of our nation, its citizens and our troops. Bless my friends with good health and safety. Amen.",
    "reading": "",
    "original_content": "HAVE A BLESSED DAY!!!~~~(food for thought)~~~Those who are last will be first...\n\nOur Bible Verses for Today:\n\nPaul says: \"I am talking to you Gentiles in-as-much as I am the apostle \nto the Gentiles, I make much of my ministry\n\nin the hope that I may somehow arouse my own people to envy and \nsave some of them.\n\nFor if their rejection is the reconciliation of the world, what will their\nacceptance be but life from the dead...\" (Ro. 11:13-15) NIV\n\nHere Is What We Should Realize From This:\n\nPaul was an appointed apostle to the Gentiles. Here he reminds \nhis Jewish brothers and sisters of this fact...\n\nHe was hoping that they too would want to be saved...\n\nThe Jews had rejected God's offer, and so the Gentiles were offered\nsalvation ~~ But when a Jews comes to Christ, there is great rejoicing,\nas if a dead person had come back to life...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the offer of eternal life.\nHelp me to always remember to give thanks for this wonderful \ngift. I pray for the safety of our nation, its citizens and our troops.\nBless my e-mail friends with good health and safety...Amen.\n\nKeep looking up, He is the light of the world...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115f0513b3b9afb4",
    "date_utc": "Mon, 29 Oct 2007 09:59:54 -0600",
    "subject": "thoughts to live by",
    "verse": "(you will probably need to go to your bible and read the preceding verses to understand this portion) Paul says, If the part of the dough offered as firstfruits is holy, then the whole batch is holy; if the root is holy, so are the branches. If some of the branches have been broken off, and you, though a wild olive shoot, have been grafted in among the others and now share the same nourishing sap from the olive root, do not boast over those branches. If you do, consider this: You do not support the root, by the root supports you. You will say then, \"Branches were broken off so that I could be grafted in.\" Granted. But they were broken off because of unbelief, and you stand by faith. Do not be arrogant, but be afraid. For if God did not spare the natural branches, He will not spare you either. (Ro. 11:16-21) NIV",
    "reflection": "Speaking to Gentile Christians of his day, as well as us, Paul warns not to feel superior because some Jews were rejected. Abraham's faith is like the root of a productive tree, and the Jewish people are the tree's natural branches. BUT because of faithlessness, some of the Jews have been broken off and the Gentile believers, who were branch from a wild olive tree, have been grated in. Both Jew and Gentiles share the tree's nourishment based on faith in God; neither can rest on heritage or culture for salvation.",
    "prayer": "Dear Heavenly Father help me to remain humble in the fact that I have a place in Your Kingdom, not because of any merit of my own, but strictly because of faith in Jesus Christ. Amen.",
    "reading": "",
    "original_content": "HAVE A BLESSED DAY!!!~~~(food for thought)~~~You are only part of God's Kingdom by faith...\n\nOur Bible Verses For Today:\n\n(you will probably need to go to your bible and read \nthe preceding verses to understand this portion)\n\nPaul says, If the part of the dough offered as firstfruits \nis holy, then the whole batch is holy; if the root is holy, \nso are the branches...\n\nIf some of the branches have been broken off, and you, \nthough a wild olive shoot, have been grafted in among\nthe others and now share the same nourishing sap from\nthe olive root,\n\ndo not boast over those branches. If you do, consider this:\nYou do not support the root, by the root supports you.\n\nYou will say then, \"Branches were broken off so that I could \nbe grafted in.\"\n\nGranted. But they were broken off because of unbelief, and \nyou stand by faith. Do not be arrogant, but be afraid...\n\nFor if God did not spare the natural branches, He will not spare \nyou either... (Ro. 11:16-21) NIV\n\nHere Is What We Should Glean From This:\n\nSpeaking to Gentile Christians of his day, as well as us, Paul warns \nnot to feel superior because some Jews were rejected...\n\nAbraham's faith is like the root of a productive tree, and the\nJewish people are the tree's natural branches. BUT because \nof faithlessness, some of the Jews have been broken off and\nthe Gentile believers, who were branch from a wild olive tree,\nhave been grated in...\n\nBoth Jew and Gentiles share the tree's nourishment based on\nfaith in God; neither can rest on heritage or culture for salvation.\n\nOur Prayer for Today:\nDear Heavenly Father help me to remain humble in the fact\nthat I have a place in Your Kingdom, not because of any\nmerit of my own, but strictly because of faith in Jesus Christ...Amen.\n\nKeep looking up, Jesus saves...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115f59f6793a8561",
    "date_utc": "Tue, 30 Oct 2007 06:41:28 -0600",
    "subject": "thoughts to live by",
    "verse": "Consider therefore the kindness and sternness of God: sternness to those who fell, but kindness to you, provided that you continue in His kindness. Otherwise you also will be cut off. And if they do not persist in unbelief, they will be grafted in, for God is able to graft them in again. After all, if you were cut out of an olive tree that is wild by nature, and contrary to nature were grafted into a cultivated olive tree, how much more readily will these, the natural branches be grafted into there own olive tree! (Ro. 11:22-24) NIV",
    "reflection": "To \"continue to trust in His kindness\" refers to steadfast perseverance in faith. Steadfastness is a proof of the reality of faith and by-product of salvation ~~ not a means to it.",
    "prayer": "Dear Heavenly Father, I thank You for Your loving-kindness. Help me to remain steadfast in trust and faith in You. Help me to have a Christ-like love for all man-kind. Help me to be a better witness for You. Amen.",
    "reading": "",
    "original_content": "HAVE A BLESSED DAY!!!~~~(food for thought)~~~You have been adopted into \nthe family of God.\n\nOur Bible Verses for Today:\n\nConsider therefore the kindness and sternness of God: sternness to those who\nfell, but kindness to you, provided that you continue in His kindness. Otherwise\nyou also will be cut off.\n\nAnd if they do not persist in unbelief, they will be grafted in, for God is able to\ngraft them in again...\n\nAfter all, if you were cut out of an olive tree that is wild by nature, and contrary\nto nature were grafted into a cultivated olive tree, how much more readily will\nthese, the natural branches be grafted into there own olive tree! (Ro. 11:22-24) NIV\n\nWhat We Should Glean From This:\n\nTo \"continue to trust in His kindness\" refers to steadfast perseverance in faith...\n\nSteadfastness is a proof of the reality of faith and by-product of salvation ~~\nnot a means to it...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for Your loving-kindness.\nHelp me to remain steadfast in trust and faith in You. Help\nme to have a Christ-like love for all man-kind. Help me to\nbe a better witness for You...Amen.\n\nKeep looking up, He cares for you...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "115fa8f010f190c7",
    "date_utc": "Wed, 31 Oct 2007 07:46:47 -0600",
    "subject": "thoughts to live by",
    "verse": "I don't want you to be ignorant of this mystery, brothers, so that you may not be conceited: Israel has experienced a hardening in part until the full number of Gentiles has come in. And so all Israel will be saved, as it is written: \"The deliver will come from Zion; He will turn godlessness away from Jacob. (Romans 11:25)",
    "reflection": "Some say the phrase \"and so all Israel will be saved\" means that the majority of the Jew in the final generation before Christ's return will turn to Christ for salvation. Others say that Paul is using the term Israel to refer to the \"Spiritual\" nation of Israel, which is comprised of Jews and Gentiles who have received salvation through faith in Christ. AND so, \"all Israel\" (or all believers) will receive God's promised gift of salvation. Still others say that \"all Israel\" means Israel as a whole will have a role in Christ's Kingdom. The Jews' identity as a people won't be discarded. God chose the nation of Israel, and He has never rejected it. He also chose the church, through Jesus Christ and He will never reject it either. This does not mean, of course, that all Jews or all church members will be saved. It is possible to be Jewish or to belong to a church without ever responding in faith. But just because some people have rejected Christ does not mean that God stops working with either Israel or the church. He continues to offer salvation freely to all. Still others say that the phrase \"and so\" means \"in this way\" or \"this is how, \" referring to the necessity of faith in Christ.",
    "prayer": "Dear Heavenly Father, Give me wisdom to sort out the truth about salvation, that I would glean from Your Word Your will. Open my heart that I may see glimpses of truth You have for me. Amen.",
    "reading": "",
    "original_content": "HAVE A BLESSED DAY!!!~~~(food for thought)~~~He is just a prayer away...\n\nOur Bible Verses for Today:\n\nI don't want you to be ignorant of this mystery, brothers, so that you \nmay not be conceited: Israel has experienced a hardening in part\nuntil the full number of Gentiles has come in...\n\nAnd so all Israel will be saved, as it is written: \"The deliver will\ncome from Zion; He will turn godlessness away from Jacob...\n\nHere Is What We Should Glean From This:\n\nSome say the phrase \"and so all Israel will be saved\" means that\nthe majority of the Jew in the final generation before Christ's return \nwill turn to Christ for salvation...\n\nOthers say that Paul is using the term Israel to refer to the \"Spiritual\"\nnation of Israel, which is comprised of Jews and Gentiles who have\nreceived salvation through faith in Christ...\n\nAND so, \"all Israel\" (or all believers) will receive God's promised gift \nof salvation...\n\nStill others say that \"all Israel\" means Israel as a whole will have a role\nin Christ's Kingdom. The Jews' identity as a people won't be discarded.\nGod chose the nation of Israel, and He has never rejected it...\n\nHe also chose the church, through Jesus Christ and He will never reject \nit either...\n\nThis does not mean, of course, that all Jews or all church members will\nbe saved. It is possible to be Jewish or to belong to a church without \never responding in faith. But just because some people have rejected \nChrist does not mean that God stops working with either Israel or the \nchurch...\n\nHe continues to offer salvation freely to all.\n\nStill others say that the phrase \"and so\" means \"in this way\" or\n\"this is how,\" referring to the necessity of faith in Christ...\n\nOur Prayer for Today:\nDear Heavenly Father, Give me wisdom to sort out the truth\nabout salvation, that I would glean from Your Word Your will.\nOpen my heart that I may see glimpses of truth You have for me...Amen\n\nKeep looking up, He is the truth, the light, and the way...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]