[
  {
    "messageid": "11f367a6bca0f906",
    "dateutc": "Mon, 2 Feb 2009 04:11:58 -0600",
    "subject": "thoughts to live by",
    "verse": "Call to Me and I will answer you and tell you great and unsearchable things you do not know. (Jer. 33:3) The Lord is far from the wicked but He hears the prayer of the righteous. (Pro. 15:29)",
    "reflection": "The Biblical Christian can only pray empty-handed, as the thirteenthcentury Dominican preacher William Peraldus expressed it. Our hope depends not on the right technique or the proper phrase or gesture, which borders on magic, but on the promises of God. As I see it, true prayer is neither mystical or some ritual observance nor some philosophical reflection. What it should be is an outpouring of the soul before a living God, a crying to God \"out of the depths.\" Such a prayer can only be uttered by one who has been convicted of sin by the grace of God and moved to confession by the Holy Spirit. True prayer is an encounter with our Holy God in which we realize not only our creatureliness and our guilt but also the joy of knowing that our sins are forgiven through the atoning death of the divine Savior, Jesus Christ. In such an encounter, we are impelled not only to bow before God and seek His mercy but also to offer thanksgiving for grace that goes out to undeserving sinners.",
    "prayer": "Let us continually give thanks for His grace and mercy to such as we. Amen.",
    "reading": "",
    "originalcontent": "Mon. 02/09~~~(food for thought)~~~Before they call I will answer; while they\nare still speaking, I will hear...(Isa. 65:24)\n\nOur Bible Verses for Today:\n\nCall to Me and I will answer you and tell you great and unsearchable\nthings you do not know...(Jer. 33:3)\n\nThe Lord is far from the wicked but He hears the prayer of the\nrighteous...(Pro. 15:29)\n\nOur Lesson for Today:\n\nThe Biblical Christian can only pray empty-handed, as the thirteenthcentury Dominican preacher William Peraldus expressed it...\n\nOur hope depends not on the right technique or the proper phrase\nor gesture, which borders on magic, but on the promises of God...\n\nAs I see it, true prayer is neither mystical or some ritual observance\nnor some philosophical reflection. What it should be is an outpouring\nof the soul before a living God, a crying to God \"out of the depths.\"\n\nSuch a prayer can only be uttered by one who has been convicted of \nsin by the grace of God and moved to confession by the Holy Spirit...\n\nTrue prayer is an encounter with our Holy God in which we realize not\nonly our creatureliness and our guilt but also the joy of knowing that our \nsins are forgiven through the atoning death of the divine Savior, Jesus\nChrist...\n\nIn such an encounter, we are impelled not only to bow before God and\nseek His mercy but also to offer thanksgiving for grace that goes out\nto undeserving sinners...\n\nPrayer Suggestion:\nLet us continually give thanks for His grace and mercy\nto such as we...\n\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.9 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f3bdd0fa8f9307",
    "dateutc": "Mon, 2 Feb 2009 05:17:42 -0600",
    "subject": "thoughts to live by",
    "verse": "The fear of the Lord is to hate evil; I (the Lord) hate pride and arrogance, evil behavior and perverse speech. (Pro. 8:13) When pride comes, then come disgrace, but with humility comes wisdom. (Pro. 11:2)",
    "reflection": "Very often when some people begin to experience a bit of success, they become overly confident of their own abilities. They began to behave as if no one else in the world can do what they do. That is to say, they get an exaggerated sense of their own importance and are puffed up with pride, making it difficult for most people to work with them. It becomes difficult for these swollen-head types to continue learning. Why should they? Don't they already know everything in their field (or so they assume)? Despite their talent, they lose their usefulness. They tend to do little but think about themselves. Instead of singing the hymn \"How Great Thou Art, \" their words sound like \"How Great I Am.\" Just below I think you will find a simple formula for humility. IF WE RECOGNIZE THAT:  God created the universe, including us, and  God shows that He is much more powerful than we are by what He does and has done in our world, and  God give each of us abilities that we cannot supply to ourselves or explain our worthiness of, THEN WE ARE HUMBLED.",
    "prayer": "Help me not to think more highly of myself than I should. Help me to remember that everything I have is a gift from God. Amen.",
    "reading": "",
    "originalcontent": "Tue. 3?09~~~food for thought~~~Pride only breeds quarrels, but wisdom is found\nin those who take advice...(Pro. 13:10)\n\nOur Bible Verses for Today:\n\nThe fear of the Lord is to hate evil; I (the Lord) hate pride and arrogance,\nevil behavior and perverse speech...(Pro. 8:13)\n\nWhen pride comes, then come disgrace, but with humility comes wisdom.\n(Pro. 11:2)\n\nOur Lesson for Today:\n\nVery often when some people begin to experience a bit of success,\nthey become overly confident of their own abilities.They began to behave \nas if no one else in the world can do what they do...\n\nThat is to say, they get an exaggerated sense of their own importance\nand are puffed up with pride, making it difficult for most people to work\nwith them...\n\nIt becomes difficult for these swollen-head types to continue learning.\nWhy should they? Don't they already know everything in their field (or\nso they assume)?\n\nDespite their talent, they lose their usefulness. They tend to do little \nbut think about themselves...\n\nInstead of singing the hymn \"How Great Thou Art,\" their words sound\nlike \"How Great I Am.\" Just below I think you will find a simple formula\nfor humility.\n\nIF WE RECOGNIZE THAT:\n\n God created the universe, including us, and\n God shows that He is much more powerful than we are by what He does\nand has done in our world, and\n God give each of us abilities that we cannot supply to ourselves or explain\nour worthiness of,\nTHEN WE ARE HUMBLED...\n\nPrayer Suggestion:\nHelp me not to think more highly of myself than I should.\nHelp me to remember that everything I have is a gift from God...\n\nPastor Al & Marcie Sather\n\n\n\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.9 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f41258c20e46d2",
    "dateutc": "Tue, 3 Feb 2009 05:54:27 -0600",
    "subject": "thoughts to live by",
    "verse": "Let the peace of Christ rule in your hearts, since as members of one body you were called to peace. And be thankful. Let the word of Christ dwell in you richly as you teach and admonish one another with all wisdom, and as you sing psalms, hymns and spiritual songs with gratitude in your hearts to God. And whatever you do, whether in word or deed, do it all in the name of the Lord Jesus, giving thanks to God the Father through Him. (Col. 3:15-17)",
    "reflection": "You receive what you give out. You want a loving God? Then be loving. You want a merciful God? Then be merciful. Want God to forgive you? Then be forgiving. Want God to condemn you? The be a judgmental person. Want to put yourself above the rest of the world? Then get ready for a God who is going to strain out every judgmental thought you've ever had and measure all the thoughts and intents of your hidden heart by the same standard. We need to realize as Christians that however acceptable our lives may be for the general audience, we still posses an R-rated heart, and we are as good as dead if we want God to meet us on any other ground than His grace and forgiveness. The Joy of this truth is that once I can believe that forgiveness for myself, then I can believe it for anybody. I have new eyes to see beyond my neighbor's sin and love him or her with the love of Christ.",
    "prayer": "Let us continue to pray for a more loving heart so as not to be so judgmental. Amen.",
    "reading": "",
    "originalcontent": "Wed. 04/09~~~food for thought~~~Love one another deeply, from the heart...(1 Pet. 1:22)\n\nOur Bible Verses for Today:\n\nLet the peace of Christ rule in your hearts, since as members of\none body you were called to peace. And be thankful...\n\nLet the word of Christ dwell in you richly as you teach and admonish\none another with all wisdom, and as you sing psalms, hymns and spiritual\nsongs with gratitude in your hearts to God...\n\nAnd whatever you do, whether in word or deed, do it all in the name of the \nLord Jesus, giving thanks to God the Father through Him... (Col. 3:15-17)\n\nOur Lesson for Today:\n\nYou receive what you give out. You want a loving God? Then be loving.\nYou want a merciful God? Then be merciful. Want God to forgive you?\nThen be forgiving...\n\nWant God to condemn you? The be a judgmental person. Want to\nput yourself above the rest of the world? Then get ready for a God \nwho is going to strain out every judgmental thought you've ever had \nand measure all the thoughts and intents of your hidden heart by the \nsame standard...\n\nWe need to realize as Christians that however acceptable our lives \nmay be for the general audience, we still posses an R-rated heart, \nand we are as good as dead if we want God to meet us on any other \nground than His grace and forgiveness...\n\nThe Joy of this truth is that once I can believe that forgiveness for \nmyself, then I can believe it for anybody. I have new eyes to see \nbeyond my neighbor's sin and love him or her with the love of Christ...\n\nPrayer Suggestion:\nLet us continue to pray for a more loving heart\nso as not to be so judgmental...\n\nPastor Al & Marcie Sather\n\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.9 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f461c16fac93c9",
    "dateutc": "Wed, 4 Feb 2009 06:37:27 -0600",
    "subject": "thoughts to live by",
    "verse": "Do your best to present yourself to God as one approve, a workman who does not need to be ashamed and who correctly handles the word of truth. (2 Tim. 3:15) Being confident of this, that He who began a good work in you will carry it on to completion until the day of Christ Jesus. (Phil. 1:6)",
    "reflection": "Very few Believers choose to drift; seldom do Christians plan to be lukewarm. BUT poor performance undermines confidence and failure causes discouragement. Temptation, even when overcome, leaves us battle-scared and weary. sometimes it is difficult to tell the difference between victory and defeat because issues are never clear-cut and our successes never total. When one has struggled through the testing time and finally has endured, it seldom feels like triumph. Someone has to help us at our time of struggle. We need a brother in our hour of trial, and especially when we fail. Otherwise we will fall into the discouragement of trying harder or of never quite measuring up. The subtle shift from trusting Christ to our own self-efforts will rob us of hope and joy. We need to know that we are known, understood and love by someone who has marked out the path, has won the victory and is with us on the way. That someone is Jesus.",
    "prayer": "Pray that the love of knowledge of Christ would abound more and more in you day by day. Pray that you become able to discern what is best and be pure and blameless until the day of Christ. Amen.",
    "reading": "",
    "originalcontent": "Thur. 05/09~~~food for thought~~~Blessed are those who hunger and thirst for \nrighteousness, for they will be filled...(Mt. 5:6)\n\nOur Bible Verses for Today:\n\nDo your best to present yourself to God as one approve, a workman\nwho does not need to be ashamed and who correctly handles the word \nof truth...(2 Tim. 3:15)\n\nBeing confident of this, that He who began a good work in you will\ncarry it on to completion until the day of Christ Jesus...(Phil. 1:6)\n\nOur Lesson for Today:\n\nVery few Believers choose to drift; seldom do Christians plan to be\nlukewarm. BUT poor performance undermines confidence and failure\ncauses discouragement...\n\nTemptation, even when overcome, leaves us battle-scared and weary.\nsometimes it is difficult to tell the difference between victory and defeat\nbecause issues are never clear-cut and our successes never total...\n\nWhen one has struggled through the testing time and finally has endured,\nit seldom feels like triumph. Someone has to help us at our time of\nstruggle. We need a brother in our hour of trial, and especially when \nwe fail...\n\nOtherwise we will fall into the discouragement of trying harder or of\nnever quite measuring up. The subtle shift from trusting Christ to our \nown self-efforts will rob us of hope and joy...\n\nWe need to know that we are known, understood and love by someone\nwho has marked out the path, has won the victory and is with us on the\nway...That someone is Jesus...\n\nPrayer Suggestion:\nPray that the love of knowledge of Christ would abound more and more\nin you day by day. Pray that you become able to discern what is best and\nbe pure and blameless until the day of Christ...\n\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.9 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f4b41e0fb5dc30",
    "dateutc": "Thu, 5 Feb 2009 06:26:19 -0600",
    "subject": "thoughts to live by",
    "verse": "Let us not love with words or tongue but with actions and in truth. (1 Jn. 3:18) Jesus said, \"I have set you an example that you should do as I have done for you.\" (Jn. 13:15)",
    "reflection": "(being role models) Little boys are most generally the hope of the next generation. Because they are the fathers of tomorrow. They must know who they are and what they are to do. they must see their role model in action. That is how they will know what it means to be a male. That puts the ball in my court and yours. Its our job to save the boys. So the question is, How are we going to do that??? Lets ask ourselves, What do I specifically need to do in order to train them to become leaders of their families? Here are some suggestions as to being a model for them. First we need to model the importance of: Knowing and obeying Jesus Christ, knowing and displaying godly character, knowing and loving my wife, knowing and loving my children, and knowing my gifts and abilities. Then we can work hard and effectively in an area of strength, rather than weakness, and contribute effectively to the lives of others, and have a little fun at the same time.",
    "prayer": "Pray for the ability to live up to the examples listed above. Amen.",
    "reading": "",
    "originalcontent": "Fri. 06/09~~~food for thought~~~What would your life look like to you, \nif some else copied it...\n\nOur Bible Verses for Today:\n\nLet us not love with words or tongue\nbut with actions and in truth...(1 Jn. 3:18)\n\nJesus said, \"I have set you an example\nthat you should do as I have done for you.\"\n(Jn. 13:15)\n\nOur Lesson for Today: (being role models)\n\nLittle boys are most generally the hope of the next generation.\nBecause they are the fathers of tomorrow. They must know who \nthey are and what they are to do. they must see their role model \nin action...\n\nThat is how they will know what it means to be a male. That puts \nthe ball in my court and yours...\n\nIts our job to save the boys. So the question is, How are we going\nto do that???\n\nLets ask ourselves, What do I specifically need to do in order to \ntrain them to become leaders of their families?\n\nHere are some suggestions as to being a model for them...\n\nFirst we need to model the importance of:\n\nKnowing and obeying Jesus Christ,\nknowing and displaying godly character,\nknowing and loving my wife,\nknowing and loving my children, and\nknowing my gifts and abilities...\n\nThen we can work hard and effectively in an area of strength,\nrather than weakness, and contribute effectively to the lives\nof others, and have a little fun at the same time...\n\nPrayer Suggestion:\nPray for the ability to live up to the examples listed above...\n\nPastor Al & Marcie Sather\n\n\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.9 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": false,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f60d9b1a1b34c0",
    "dateutc": "Tue, 10 Feb 2009 06:07:20 -0600",
    "subject": "thoughts to live by",
    "verse": "I will refresh the weary and satisfy the faint. (Jer. 41:10) Therefore, since the promise of entering His rest still stands, let us be careful that none of you be found to have fallen short of it. (Heb. 4:1)",
    "reflection": "Too much stress, especially stress that is not relieved by times of rest and renewal, can harm us physically, mentally, and spiritually. To a great extent Christians are caught up in the same rat race as everyone else. To often we let our values become distorted and we don't see life clearly from God's point of perspective. To often we lose some of our distinctiveness; and our lives almost become identical to those people who are not committed to Christ. as a result, I believe we are violating the very basic laws that God has set down for our bodies. The sad thing is we may be doing all this in the name of the One who came to save us from our need to earn salvation. Christian must wake up to the fact that they are burning themselves out just as quickly as every one else. So let us return to Him and receive His promise to refresh us.",
    "prayer": "Let us pray that He would refresh us with His sustaining power. Amen.",
    "reading": "",
    "originalcontent": "Tue. 02/09~~~food for thought~~~Be strong in the Lord and His mighty power...(Eph 6:10)\n\nOur Bible Verses for Today:\n\nI will refresh the weary and satisfy the faint...(Jer. 41:10)\n\nTherefore, since the promise of entering His rest still stands,\nlet us be careful that none of you be found to have fallen \nshort of it...(Heb. 4:1)\n\nOur Lesson for Today:\n\nToo much stress, especially stress that is not relieved by times\nof rest and renewal, can harm us physically, mentally, and spiritually...\n\nTo a great extent Christians are caught up in the same rat race as\neveryone else. To often we let our values become distorted and \nwe don't see life clearly from God's point of perspective...\n\nTo often we lose some of our distinctiveness; and our lives almost\nbecome identical to those people who are not committed to Christ.\nas a result, I believe we are violating the very basic laws that God\nhas set down for our bodies...\n\nThe sad thing is we may be doing all this in the name of the One who\ncame to save us from our need to earn salvation...\n\nChristian must wake up to the fact that they are burning themselves out\njust as quickly as every one else...\n\nSo let us return to Him and receive His promise to refresh us...\n\nPrayer Suggestion:\nLet us pray that He would refresh us with His sustaining power...\n\nPastor Al & Marcie Sather\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.9 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f6505de589dd28",
    "dateutc": "Tue, 10 Feb 2009 10:18:06 -0600",
    "subject": "thoughts to live by",
    "verse": "May He give you the desire of your heart and make all your plans succeed. We will shout for joy when you are victorious and will lift up our banners in the name of our God. May the LORD grant all your requests. (Ps. 20:4, 5)",
    "reflection": "With everything working in his favor, it seemed Solomon would gratefully follow God. His prayer of dedication for the temple in 1 Kg. 8 is one of the most majestic ever prayed. Yet by the end of his reign Solomon had squandered away nearly every advantage. Along the way he lost sight of the original vision to which God had called him. Success in the kingdom of this world had crowded out interest in the kingdom of God. The brief shinning vision of a covenant nation faded away, and God withdrew His sanction. Yes Solomon got what ever he wanted, especially when it came to symbols of power and status. Gradually he depended less on God and more on the props around him: The world's largest harem a house twice the size of the temple an army well-stocked with chariotsa strong economy. His problems came as he enjoyed the world's good gifts more thus he thought less about the Giver.",
    "prayer": "Let us pray for a greater focus on the Giver and less on the gifts. Amen.",
    "reading": "",
    "originalcontent": "Wed. 11/09~~~food for thought~~~Success should be measurey by God's yard-stick...\n\nOur Bible Verses for Today:\n\nMay He give you the desire of your heart and make all your\nplans succeed...\n\nWe will shout for joy when you are victorious and will lift up\nour banners in the name of our God. May the LORD grant\nall your requests...(Ps. 20:4, 5)\n\nOur Lesson for Today:\n\nWith everything working in his favor, it seemed Solomon would\ngratefully follow God. His prayer of dedication for the temple in\n1 Kg. 8 is one of the most majestic ever prayed...\n\nYet by the end of his reign Solomon had squandered away nearly \nevery advantage. Along the way he lost sight of the original vision\nto which God had called him...\n\nSuccess in the kingdom of this world had crowded out interest in\nthe kingdom of God. The brief shinning vision of a covenant nation \nfaded away, and God withdrew His sanction...\n\nYes Solomon got what ever he wanted, especially when it came to\nsymbols of power and status. Gradually he depended less on God \nand more on the props around him:\nThe world's largest harem a house twice the size of the temple an army well-stocked with chariotsa strong economy...\n\nHis problems came as he enjoyed the world's good gifts more\nthus he thought less about the Giver...\n\nPrayer Suggestion:\nLet us pray for a greater focus on the Giver \nand less on the gifts...\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f6a22c9cfb9add",
    "dateutc": "Wed, 11 Feb 2009 05:44:14 -0600",
    "subject": "thoughts to live by",
    "verse": "Give thanks to the Lord, call upon His name; make known among the nations what He has done. (1 Chron. 16:8) Enter His gates with thanksgiving and His courts with praise; give thanks to Him and praise His name. (Ps. 100:4)",
    "reflection": "The magic of a thankful spirit is that it has the power to replace:  Anger with love  Resentment with happiness  Fear with faith  Worry with peace  The desire to dominate with the wish to play on a team  Self-preoccupation with concern for the needs of others  Guilt with an open door to forgiveness  Jealousy with joy at another's success  Lack of creativity with inspired productivity  Inferiority's with dignity  A lack of love with an abundance of self-sharing. When we feel down we may find it hard to give thanks. But we can take heart, because in all things God works for the good of those who love Him. We don't need to thank God for our problems, but for the strength He is building in us through the difficult experiences of our life. We can be sure that God's perfect love will see us through.",
    "prayer": "Let us continue to pray for the magic of a thankful spirit. Ps. Sorry about you not getting last weeks devotionals but I was having computer problems. It would forward messages but not send out new messages. Amen.",
    "reading": "",
    "originalcontent": "Fri. 13/09~~~food for thought~~~Always give thanks to God for His indescribable gift...\n\nOur Bible Verses for Today:\n\nGive thanks to the Lord, call upon His name; make known among the nations\nwhat He has done...(1 Chron. 16:8)\n\nEnter His gates with thanksgiving and His courts with praise; give thanks to\nHim and praise His name...(Ps. 100:4)\n\nOur Lesson for Today:\n\nThe magic of a thankful spirit is that it has the power to replace:\n\n Anger with love\n Resentment with happiness\n Fear with faith\n Worry with peace\n The desire to dominate with the wish to play on a team\n Self-preoccupation with concern for the needs of others\n Guilt with an open door to forgiveness\n Jealousy with joy at another's success\n Lack of creativity with inspired productivity\n Inferiority's with dignity\n A lack of love with an abundance of self-sharing...\n\nWhen we feel down we may find it hard to give thanks.\nBut we can take heart, because in all things God works\nfor the good of those who love Him...\n\nWe don't need to thank God for our problems, but for the strength \nHe is building in us through the difficult experiences of our life...\n\nWe can be sure that God's perfect love will see us through...\n\nPrayer suggestion:\nLet us continue to pray for the magic of a thankful spirit...\n\nPs. Sorry about you not getting last weeks devotionals\nbut I was having computer problems...It would forward\nmessages but not send out new messages...\n\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f6f62ce9fef35b",
    "dateutc": "Thu, 12 Feb 2009 05:47:13 -0600",
    "subject": "thoughts to live by",
    "verse": "Those who trust in the Lord are like Mount Zion, which cannot be shaken but endures forever. (Ps. 125:1) The Lord's unfailing love surrounds the man who trusts in Him. (Ps. 32:10)",
    "reflection": "Have you ever played a game where you are blindfolded and then have to run through the woods with someone giving you directions??? It is funny to watch how some will just shuffle their feet and others will wave their arms feeling for trees, some will just stop and continue to listen, not quiet trusting the one giving directions. As Christians, we sometimes feel like blindfolded children. But we are not alone in the woods, God will direct us. O yes quite often His leading sounds illogical and irrational. Sometimes He is so challenging that I say, \"No I think I'll just crawl back into my shell and play it safe.\" BUT then a voice inside me says, \"Where's your courage Sather? Get up and walk, You can trust God.\" It takes enormous courage to follow God's leading in the Christian life. Some of His callings demand just a bit more trust than we can muster. I believe that is because, spiritual courage or trust is on the endangered character-quality list.",
    "prayer": "Let us remember to pray for a greater trust in the One who wants to give us instructions for a safe walk through life. Amen.",
    "reading": "",
    "originalcontent": "Fri. 13/09~~~food for thought~~~I suppose you noticed that I had the wrong date on \nyesterdays Devo. and are wondering if I have lost it.\nDon't feel bad I am wondering too!!!\n\nOur Bible Verses for Today:\n\nThose who trust in the Lord are like Mount Zion, which cannot\nbe shaken but endures forever...(Ps. 125:1)\n\nThe Lord's unfailing love surrounds the man who trusts in Him.\n(Ps. 32:10)\n\nOur Lesson for Today:\n\nHave you ever played a game where you are blindfolded and then have to \nrun through the woods with someone giving you directions???\n\nIt is funny to watch how some will just shuffle their feet and others will wave\ntheir arms feeling for trees, some will just stop and continue to listen, not\nquiet trusting the one giving directions...\n\nAs Christians, we sometimes feel like blindfolded children. But we are not \nalone in the woods, God will direct us. O yes quite often His leading sounds \nillogical and irrational...\n\nSometimes He is so challenging that I say, \"No I think I'll just crawl back\ninto my shell and play it safe.\" BUT then a voice inside me says, \"Where's\nyour courage Sather? Get up and walk, You can trust God.\"\n\nIt takes enormous courage to follow God's leading in the Christian life.\nSome of His callings demand just a bit more trust than we can muster.\n\nI believe that is because, spiritual courage or trust is on the endangered\ncharacter-quality list...\n\nPrayer Suggestion:\nLet us remember to pray for a greater trust in the\nOne who wants to give us instructions for a safe\nwalk through life...\n\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.9 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f74813c9d6a8e9",
    "dateutc": "Fri, 13 Feb 2009 06:19:35 -0600",
    "subject": "thoughts to live by",
    "verse": "Six days do your work, but on the seventh day do not work, so that your ox and your donkey may rest and the slave born in your household, and the alien as well, may be refreshed. (Ex. 23:12) Now when a man works, his wages are not credited to him as a gift, but as an obligation. (Ro. 3:4)",
    "reflection": "I feel that many people today are sacrificing themselves on the alter of work. What they bring upon themselves is symptoms such as anger, chemical dependencies and loneliness in a pursuit of selffulfillment through career success. In this pursuit one begins to worship his/her career as though it were a god. But like all other idols, work is important in the face of a true human need. Now I have sat with people on there last days here on earth, who had done exceptionally well in business, yet I watched them cry as they told me their tragic stories, some with personal lives shattered, others with families in a shambles. None of their professional accomplishments, none of the machinery of their companies, none of their wealth was of the slightest help. They were all in trouble and their god was impotent. I felt sorry for these people. BUT I also respected the fact that only by the grace of God, the same thing could have happened to me as it had to these people. My conclusion is that this will always happen when we take God's gift of work and serve it rather than Christ.",
    "prayer": "Let us pray that we focus our attention more on the One who gives us the strength and health to hold a job to support ourselves. Amen.",
    "reading": "",
    "originalcontent": "Sat. 14/09~~~food for thought~~~Love your neighbor as thyself...Happy Valentine's Day\n\nOur Bible Verses for Today:\n\nSix days do your work, but on the seventh day do not work,\nso that your ox and your donkey may rest and the slave born \nin your household, and the alien as well, may be refreshed...\n(Ex. 23:12)\n\nNow when a man works, his wages are not credited to him\nas a gift, but as an obligation...(Ro. 3:4)\n\nOur Lesson for Today:\n\nI feel that many people today are sacrificing themselves on the \nalter of work...\n\nWhat they bring upon themselves is symptoms such as anger,\nchemical dependencies and loneliness in a pursuit of selffulfillment through career success...\n\nIn this pursuit one begins to worship his/her career as though it were\na god...But like all other idols, work is important in the face of a true \nhuman need... \n\nNow I have sat with people on there last days here on earth, who had\ndone exceptionally well in business, yet I watched them cry as they \ntold me their tragic stories, some with personal lives shattered, others \nwith families in a shambles...\n\nNone of their professional accomplishments, none of the machinery\nof their companies, none of their wealth was of the slightest help. They \nwere all in trouble and their god was impotent...\n\nI felt sorry for these people. BUT I also respected the fact that only by\nthe grace of God, the same thing could have happened to me as it had \nto these people...\n\nMy conclusion is that this will always happen when we take God's gift \nof work and serve it rather than Christ...\n\nPrayer Suggestion:\nLet us pray that we focus our attention more on the One who\ngives us the strength and health to hold a job to support ourselves...\n\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.9 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f7e7c1019c21c5",
    "dateutc": "Sat, 14 Feb 2009 06:32:38 -0600",
    "subject": "thoughts to live by",
    "verse": "Have nothing to do with the fruitless deeds of darkness, but rather expose them. For it is shameful even to mention what the disobedient do in secret. But everything exposed by the light becomes visible, for it is light that makes everything visible. this is why it is said: \"Wake up, O sleeper, rise from the dead, and Christ will shine on you.\" (Eph. 5:11-14)",
    "reflection": "Not all initiative, (in other words) the willingness to take the first step, is inspired by God. Someone may say to you, \"Get up and get going! Just do what needs to be done!\" This is just plain or ordinary human initiative. But when the Spirit of God comes to us and says, in effect, \"Get up and get going, \" suddenly we find that the initiative is inspired. We all have many dreams and inspirations when we are young, but sooner or latter we realize we have no power to accomplish them. We cannot do the things we long to do, so our tendency is to think that our dreams and aspirations are dead. But God comes and says to us, \"Arise from the dead. .\" When God sends His inspiration, it comes to us with such miraculous power that we are able to \"arise from the dead\" and do the impossible. The remarkable thing about spiritual initiative is that the life and power comes after we \"get up and get going.\" God does not give us over coming life. He gives us life as we over come. Remember what our Lord said to the man with the withered hand, \"stretch out your hand\" (Mt 12:13). As soon as the man did his hand was healed, not before. The man took the initiative by stretching out his hand. If we will take the initiative to overcome we will find that we have the inspiration of God, because He immediately gives us the power of life.",
    "prayer": "When we begin to feel useless, dead as it were, say, \"Lord here is my hand, use me as You will.\" Amen.",
    "reading": "",
    "originalcontent": "Mon. 16/09~~~food for thought~~~Today lets examine \"The inspiration of spiritual initiative...\n\nOur Bible Verses for Today:\n\nHave nothing to do with the fruitless deeds of darkness,\nbut rather expose them.\nFor it is shameful even to mention what the disobedient \ndo in secret.\nBut everything exposed by the light becomes visible,\nfor it is light that makes everything visible. this is why it is said:\n\"Wake up, O sleeper, rise from the dead, and Christ will shine\non you.\" (Eph. 5:11-14)\n\nOur Lesson for Today:\n\nNot all initiative, (in other words) the willingness to take the first\nstep, is inspired by God. Someone may say to you, \"Get up and\nget going! Just do what needs to be done!\"\n\nThis is just plain or ordinary human initiative... But when the Spirit\nof God comes to us and says, in effect, \"Get up and get going,\"\nsuddenly we find that the initiative is inspired...\n\nWe all have many dreams and inspirations when we are young,\nbut sooner or latter we realize we have no power to accomplish them.\nWe cannot do the things we long to do, so our tendency is to think\nthat our dreams and aspirations are dead...\n\nBut God comes and says to us, \"Arise from the dead....\" When God \nsends His inspiration, it comes to us with such miraculous power \nthat we are able to \"arise from the dead\" and do the impossible...\n\nThe remarkable thing about spiritual initiative is that the life and power \ncomes after we \"get up and get going.\" God does not give us over \ncoming life...He gives us life as we over come...\n\nRemember what our Lord said to the man with the withered hand,\n\"stretch out your hand\" (Mt 12:13). As soon as the man did his hand\nwas healed, not before. The man took the initiative by stretching out\nhis hand...\n\nIf we will take the initiative to overcome we will find that we have the\ninspiration of God, because He immediately gives us the power of life...\n\nPrayer Suggestion:\nWhen we begin to feel useless, dead as it were, say, \"Lord\nhere is my hand, use me as You will.\"\n\nPastor Al & Marcie Sather\n\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.9 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f83c43a9d30ce7",
    "dateutc": "Mon, 16 Feb 2009 04:44:17 -0600",
    "subject": "thoughts to live by",
    "verse": "(Elijah was afraid and depressed so) He said, \"Take my life, for I am no better than my ancestors.\" Then he laid down under a single broom tree. But as he was sleeping an angel touched him and told him, \"Get up and eat!\" (I Kgs. 19:4b, 5)",
    "reflection": "The angel in this passage did not give Elijiah a vision, or explain the Scriptures to him, or do anything remarkable. He simply told Elijiah to do a very simple thing, which was, to get up and eat. If we were never depressed, we would not be alive, only material things don't ever suffer depression. If human beings were not capable of depression, we would have no capacity for happiness. There are things in life that are designed to depress us; for example, things that are associated with death. Whenever you examine yourself, always take into account your capacity for depression. When the Spirit of God comes to us, He does not give us glorious visions, but He tells us to do the most ordinary things imaginable. Depression tends to turn us away from the everyday things of God's creation. BUT when ever God steps in, His inspiration is to do the most natural, simple things, things we would never have imagined God was in, but as we do them we find an initiative against depression. BUT we must take the first step and do it in the inspiration of God. If however, we do something simply to overcome our depression, we will only deepen it. BUT when the Spirit of God leads us instinctively to do something, the moment we do it depression is gone. As soon as we arise and obey, we enter into a higher plain of life.",
    "prayer": "Pray that you would be sensitive and obedient to God's inspiration. Amen.",
    "reading": "",
    "originalcontent": "Tue. 17/09~~~food for thought~~~Taking the initiative against depression\n\nOur Bible Verses for Today:\n\n(Elijah was afraid and depressed so) He said, \"Take my life, for I\nam no better than my ancestors.\"\n\nThen he laid down under a single broom tree. But as he was\nsleeping an angel touched him and told him, \"Get up and eat!\"\n(I Kgs. 19:4b, 5)\n\nOur Lesson for Today:\n\nThe angel in this passage did not give Elijiah a vision, or explain the\nScriptures to him, or do anything remarkable. He simply told Elijiah\nto do a very simple thing, which was, to get up and eat...\n\nIf we were never depressed, we would not be alive, only material \nthings don't ever suffer depression. If human beings were not capable\nof depression, we would have no capacity for happiness...\n\nThere are things in life that are designed to depress us; for example,\nthings that are associated with death. Whenever you examine yourself,\nalways take into account your capacity for depression...\n\nWhen the Spirit of God comes to us, He does not give us glorious visions,\nbut He tells us to do the most ordinary things imaginable. Depression tends\nto turn us away from the everyday things of God's creation...\n\nBUT when ever God steps in, His inspiration is to do the most natural, simple\nthings, things we would never have imagined God was in, but as we do them\nwe find an initiative against depression...\n\nBUT we must take the first step and do it in the inspiration of God. If however,\nwe do something simply to overcome our depression, we will only deepen it. \nBUT when the Spirit of God leads us instinctively to do something, the moment\nwe do it depression is gone. As soon as we arise and obey, we enter into a\nhigher plain of life...\n\nA Prayer Suggestion:\nPray that you would be sensitive and obedient to\nGod's inspiration...\n\nPastor Al & Marcie Sather\n\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 5.9 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f8563ecd447c77",
    "dateutc": "Tue, 17 Feb 2009 08:17:40 -0600",
    "subject": "thoughts to live by",
    "verse": "Then He came to His disciples and said, \"Still sleeping? Still resting? Look, the time has come. I the Son of Man, am betrayed into the hands of sinners. Up, lets be going. See My betrayer is here!\"",
    "reflection": "In the Garden of Gethsemane, the disciples went to sleep when they should have stayed awake, and once they realized what they had done it produced despair. The sense of having done something irreversible tends to make us despair. We say, \"Well, it's all over and ruined now; what's the point in trying anymore?\" If we think this kind of despair is an exception we are mistaken. Its a very ordinary human experience. But Jesus comes and lovingly says to us, in essence, \"Sleep on now. That opportunity is lost forever and you can't change that. But get up, and lets go on to the next thing.\" In other words, let the past sleep, BUT let it sleep in the sweet embrace of Christ, and let us go on into the invincible future with Him. Never let the sense of past failure defeat your next step.",
    "prayer": "Pray that you can dismiss past failures but be able to learn from them. Amen.",
    "reading": "",
    "originalcontent": "Wed. 18/09~~~food for thought~~~Take the Initiative against despair\n\nOur Bible Verses for Today:\n\nThen He came to His disciples and said, \"Still sleeping? Still resting?\nLook, the time has come. I the Son of Man, am betrayed into the\nhands of sinners...\n\nUp, lets be going. See My betrayer is here!\"\n\nOur Lesson for Today:\n\nIn the Garden of Gethsemane, the disciples went to sleep when they\nshould have stayed awake, and once they realized what they had done\nit produced despair...\n\nThe sense of having done something irreversible tends to make us despair.\nWe say, \"Well, it's all over and ruined now; what's the point in trying anymore?\"\n\nIf we think this kind of despair is an exception we are mistaken. Its a very \nordinary human experience...\n\nBut Jesus comes and lovingly says to us, in essence, \"Sleep on now. That\nopportunity is lost forever and you can't change that. But get up, and lets go\non to the next thing.\"\n\nIn other words, let the past sleep, BUT let it sleep in the sweet embrace of\nChrist, and let us go on into the invincible future with Him...\n\nNever let the sense of past failure defeat your next step...\n\nPrayer Suggestion:\nPray that you can dismiss past failures but be able to learn from them...\n\nPastor Al & Marcie Sather\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 6 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f8e4883c53620e",
    "dateutc": "Thu, 19 Feb 2009 05:24:36 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Arise, shine, for your light has come, and the glory of the Lord arises upon you. See darkness covers the earth and thick darkness is over the peoples, but the Lord rises upon you and His glory appears over you. (Isa. 60:1, 2)",
    "reflection": "When it comes to taking the initiative against drudgery, we have to take the first step as though there were no God. There is no point in waiting for God to help us, He will not. BUT once we arise, immediately we will find He is there. Whenever God gives us His inspiration, suddenly taking the initiative becomes a moral issue, a matter of obedience. Then we must act to be obedient and not lie down and do nothing. If we arise and shine, drudgery will be divinely transformed. When the Lord does something through us, He always transforms it. Our Lord takes our human flesh and transforms it, and now every believer's body has become \"the temple of the Holy Spirit.\"",
    "prayer": "Our prayer should be, \"Take my life and let it be consecrated Lord to Thee. Amen.",
    "reading": "",
    "originalcontent": "Thur. 19/09~~~food for thought~~~Taking the initiative against drudgery\n\nOur Bible Verses for Today:\n\n\"Arise, shine, for your light has come, and the glory of the Lord arises\nupon you...\n\nSee darkness covers the earth and thick darkness is over the peoples,\nbut the Lord rises upon you and His glory appears over you...(Isa. 60:1, 2)\n\nOur Lesson for Today:\n\nWhen it comes to taking the initiative against drudgery, we have to take\nthe first step as though there were no God. There is no point in waiting \nfor God to help us, He will not...\n\nBUT once we arise, immediately we will find He is there. Whenever God \ngives us His inspiration, suddenly taking the initiative becomes a moral issue,\na matter of obedience...\n\nThen we must act to be obedient and not lie down and do nothing. If we\narise and shine, drudgery will be divinely transformed...\n\nWhen the Lord does something through us, He always transforms it. Our\nLord takes our human flesh and transforms it, and now every believer's body\nhas become \"the temple of the Holy Spirit.\"\n\nA Prayer Suggestion.\nOur prayer should be, \"Take my life and let it be consecrated\nLord to Thee...\n\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 6 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f935ddfb5d4634",
    "dateutc": "Thu, 19 Feb 2009 06:04:15 -0600",
    "subject": "thoughts to live by",
    "verse": "I will not speak with you much longer, for the prince of this world is coming. He has no hold on Me, BUT the world must learn that I love the Father and that I do exactly what my Father has commanded Me.\"Come now; let us leave.\"",
    "reflection": "Day-dreaming about something in order to do it properly is right, BUT day-dreaming about it when we should be doing it is wrong. In this passage, after having said these wonderful things to His disciples, we might have expected our Lord to tell them to go away and meditate over them all. BUT Jesus never allowed idle day-dreaming. When our purpose is to seek God and to discover His will for us. day-dreaming is right and acceptable. BUT when our inclination is to spend time day-dreaming over what we have already been told to do, it is unacceptable and God's blessing is never on it. If we are quietly waiting before God after He has said to us \"Come aside by yourselves.\" then that is meditation before Him to seek His will (Mk 6:31). We need to be cautious, though, of giving in to mere day-dreaming once God has spoken. Allow Him to be the source of all your dreams, joys, and delights, and be careful to go and obey what He has said. Day-dreaming after God has spoken is an indication that we do not trust Him.",
    "prayer": "Pray for Christ-like obedience and love. Amen.",
    "reading": "",
    "originalcontent": "Fri. 20/09~~~food for thought~~~Taking the initiative against daydreaming...\n\nOur Bible Verses for Today:\n\nI will not speak with you much longer, for the prince of this world is coming.\nHe has no hold on Me,\n\nBUT the world must learn that I love the Father and that I do exactly what\nmy Father has commanded Me.\"Come now; let us leave.\"\n\nOur Lesson for Today:\n\nDay-dreaming about something in order to do it properly is right,\nBUT day-dreaming about it when we should be doing it is wrong...\n\nIn this passage, after having said these wonderful things to His\ndisciples, we might have expected our Lord to tell them to go\naway and meditate over them all. BUT Jesus never allowed idle\nday-dreaming...\n\nWhen our purpose is to seek God and to discover His will for us.\nday-dreaming is right and acceptable. BUT when our inclination\nis to spend time day-dreaming over what we have already been\ntold to do, it is unacceptable and God's blessing is never on it...\n\nIf we are quietly waiting before God after He has said to us \n\"Come aside by yourselves...\" then that is meditation before Him\nto seek His will (Mk 6:31)...\n\nWe need to be cautious, though, of giving in to mere day-dreaming\nonce God has spoken...\n\nAllow Him to be the source of all your dreams, joys, and delights,\nand be careful to go and obey what He has said...\n\nDay-dreaming after God has spoken is an indication that we do \nnot trust Him...\n\nPrayer Suggestion:\nPray for Christ-like obedience and love...\n\nPastor Al & Marcie Sather\n\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 6 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11f987a24ad6a573",
    "dateutc": "Fri, 20 Feb 2009 06:06:56 -0600",
    "subject": "thoughts to live by",
    "verse": "While Jesus was in Bethany reclining at the table in the home of a man known as Simon the Leper, a woman came with an alabaster jar of very expensive perfume made of pure nard. She broke the jar and poured the perfume on His head. Some of those present were saying indignantly to one another, \"Why this waste of perfume? \"Leave her alone, \" Jesus said, \"Why are you bothering her? She has done a beautiful thing to Me.\" (Mk. 14:2, 4, 6)",
    "reflection": "If what we call love doesn't take us beyond ourselves, it is not really love. If we have the idea that love is characterized as cautious, wise, sensible, shrewd, and never taken to extremes, we have missed the true meaning. Have you ever been driven to do something for God not because you felt that it was useful or your duty to do so, or that there was anything in it for you, but simply because you love Him? Have you ever realized you can give things to God that are of value to Him? Or are you just sitting around day-dreaming about the greatness of His redemption, while neglecting all the things you could be doing for Him? There are times when it seems as if God watches to see if we will give Him even small gifts of surrender, just to show how genuine our love is for Him. To be surrendered to God is of more value than our personal holiness. Concern over our personal holiness causes us to focus our eyes on ourselves, and we become overly concerned about the way we walk, talk, and look, out of fear of offending God.\". but perfect love casts out fear.\" once we surrender to God (I Jn. 4:18). Once we are totally surrendered to God, He will work through us all the time.",
    "prayer": "Let us pray that our love for the Lord is always genuine. Amen.",
    "reading": "",
    "originalcontent": "Sat. 21/09~~~food for thought~~~Do you really love Him?\n\nOur Bible Verses for Today:\n\nWhile Jesus was in Bethany reclining at the table in the home of a \nman known as Simon the Leper, a woman came with an alabaster \njar of very expensive perfume made of pure nard. She broke the jar\nand poured the perfume on His head...\n\nSome of those present were saying indignantly to one another,\n\"Why this waste of perfume?\n\n\"Leave her alone,\" Jesus said, \"Why are you bothering her?\nShe has done a beautiful thing to Me.\" (Mk. 14:2, 4, 6)\n\nOur Lesson for Today:\n\nIf what we call love doesn't take us beyond ourselves, it is not really\nlove. If we have the idea that love is characterized as cautious, wise,\nsensible, shrewd, and never taken to extremes, we have missed the\ntrue meaning...\n\nHave you ever been driven to do something for God not because you \nfelt that it was useful or your duty to do so, or that there was anything in\nit for you, but simply because you love Him?\n\nHave you ever realized you can give things to God that are of value to\nHim? Or are you just sitting around day-dreaming about the greatness\nof His redemption, while neglecting all the things you could be doing for\nHim?\n\nThere are times when it seems as if God watches to see if we will give \nHim even small gifts of surrender, just to show how genuine our love is\nfor Him...\n\nTo be surrendered to God is of more value than our personal holiness.\nConcern over our personal holiness causes us to focus our eyes on \nourselves, and we become overly concerned about the way we walk, talk,\nand look, out of fear of offending God.\"...but perfect love casts out fear...\"\nonce we surrender to God (I Jn. 4:18)...\n\nOnce we are totally surrendered to God, He will work through us all the\ntime...\n\nPrayer Suggestion:\nLet us pray that our love for the Lord is always genuine...\n\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 6 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11fa2f8196ced218",
    "dateutc": "Mon, 23 Feb 2009 05:42:20 -0600",
    "subject": "thoughts to live by",
    "verse": "\"The Son of Man did not come to be served, but to serve.\" (Mt. 20:28) Jesus also said, \"Yet I am among you as the One who serves.\" (Lk. 22:27)",
    "reflection": "Paul's idea of service was the same as our Lord's, \". ourselves your bondservants for Jesus sake\" (2 Cor. 4:5). Somehow we have the idea that a person called to the ministry is called to be different and above other people. BUT according to Jesus Christ, he is called to be a doormat\" for other, called to be their spiritual leader, but never their superior. Paul said, \"I know how to be abased.\" (Phil. 4:12). Paul's idea of service was to pour his life out to the last drop for others. AND whether he received praise or blame made no difference. Once we realize that Jesus has served us even to the depths of our meagerness, our selfishness, and our sin, nothing we encounter from others will be able to exhaust our determination to serve others for Christ's sake.",
    "prayer": "Pray that you would be determined to stand fast in your service to Christ. Amen.",
    "reading": "",
    "originalcontent": "Mon. 23/09~~~food for thought~~~How determined are you to serve...\n\nOur Bible Verses for Today:\n\n\"The Son of Man did not come to be served, but to serve.\"\n(Mt. 20:28)\n\nJesus also said, \"Yet I am among you as the One who serves.\"\n(Lk. 22:27) \n\nOur Lesson for Today:\n\nPaul's idea of service was the same as our Lord's,\n\"...ourselves your bondservants for Jesus sake\" (2 Cor. 4:5)...\n\nSomehow we have the idea that a person called to the ministry\nis called to be different and above other people. BUT according\nto Jesus Christ, he is called to be a doormat\" for other, called to \nbe their spiritual leader, but never their superior...\n\nPaul said, \"I know how to be abased...\" (Phil. 4:12). Paul's idea \nof service was to pour his life out to the last drop for others. AND\nwhether he received praise or blame made no difference...\n\nOnce we realize that Jesus has served us even to the depths of\nour meagerness, our selfishness, and our sin, nothing we encounter\nfrom others will be able to exhaust our determination to serve others\nfor Christ's sake...\n\nPrayer Suggestion:\nPray that you would be determined to stand fast \nin your service to Christ...\n\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 6 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11fa7f5e8396bd03",
    "dateutc": "Mon, 23 Feb 2009 08:37:02 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul says: \"I will very gladly spend and be spent for your souls.\" (2 Cor. 12:15)",
    "reflection": "Once \"the love of God has been poured out in our hearts by the Holy Spirit, \" we should deliberately begin to identify ourselves with Jesus Christ's interests and purposes in the lives others (Ro. 5:5). Let us never forget that Jesus has an interest in every individual person. We have no right in our Christian service to be guided by our own interests and desires. In fact, this is one of the greatest tests in our relationship with Jesus Christ. The delight of sacrifice is that we lay down our life for our friend Jesus, (look at Jn. 15:13). We don't throw our life away, but we should willingly and deliberately lay it down for Him and His interests in other people. When someone thinks that to develop a holy life he/she must always be alone with God, he/she is no longer of any use to others. This is like putting ones self on a pedestal and isolating ones self from the rest of society. So, are you willing to sacrifice your earthly life for eternal life with Christ?",
    "prayer": "Before praying read (1 Cor. 9:22 then pray that you would be willing to lay down your life for Christ's interests. Amen.",
    "reading": "",
    "originalcontent": "Tue. 24/09~~~food for thought~~~Are you willing to make sacrifices for your Lord?\n\nOur Bible Verse for Today:\n\nPaul says: \"I will very gladly spend and be spent for\nyour souls...\" (2 Cor. 12:15)\n\nOur Lesson for Today:\n\nOnce \"the love of God has been poured out in our hearts by the \nHoly Spirit,\" we should deliberately begin to identify ourselves \nwith Jesus Christ's interests and purposes in the lives others (Ro. 5:5).\n\nLet us never forget that Jesus has an interest in every individual\nperson. We have no right in our Christian service to be guided by\nour own interests and desires...\n\nIn fact, this is one of the greatest tests in our relationship with Jesus Christ.\n\nThe delight of sacrifice is that we lay down our life for our friend Jesus,\n(look at Jn. 15:13). We don't throw our life away, but we should willingly\nand deliberately lay it down for Him and His interests in other people...\n\nWhen someone thinks that to develop a holy life he/she must always \nbe alone with God, he/she is no longer of any use to others. This is like \nputting ones self on a pedestal and isolating ones self from the rest of\nsociety...\n\nSo, are you willing to sacrifice your earthly life for eternal life with Christ?\n\nPrayer Suggestion:\nBefore praying read (1 Cor. 9:22 then pray that you would be willing\nto lay down your life for Christ's interests.\n\nPastor Al & Marcie Sather\n\n-I am using the free version of SPAMfighter.\nWe are a community of 6 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11fad0831cb5d81d",
    "dateutc": "Tue, 24 Feb 2009 05:53:30 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Be still, and know that I am God.\" (Ps. 46:10)",
    "reflection": "Perseverance is more than endurance. It is endurance combined with absolute assurance and certainty that what we are looking for is going to happen. Perseverance means more than just hanging on, which may be only exposing fear of letting go and falling. Perseverance is our supreme effort of refusing to believe that our hero is going to be conquered. Remember that our call to perseverance is not to merely hang on and do nothing, but to work deliberately, knowing with certainty that God will never be defeated. If our hopes seem to be experiencing disappointment right now, it simply means that our hopes are being purified. Every hope or dream of the human mind will be fulfilled if it is noble and of God. BUT one of the greatest stresses in life is the stress of waiting for God. He brings fulfillment, \"because you have kept My commandment to persevere.\" (Rev. 3:10) Prayer for Today: Pray that you will be able to continue to persevere spiritually.",
    "prayer": "Pray that you will be able to continue to persevere spiritually. Amen.",
    "reading": "",
    "originalcontent": "Wed. 25/09~~~food for thought~~~How deep is your spiritual perseverance...\n\nOur Bible Verse for Today:\n\n\"Be still, and know that I am God...\" (Ps. 46:10)\n\nOur Lesson for Today:\n\nPerseverance is more than endurance. It is endurance combined with absolute\nassurance and certainty that what we are looking for is going to happen...\n\nPerseverance means more than just hanging on, which may be only exposing fear\nof letting go and falling...\n\nPerseverance is our supreme effort of refusing to believe that our hero is going to\nbe conquered...\n\nRemember that our call to perseverance is not to merely hang on and do nothing,\nbut to work deliberately, knowing with certainty that God will never be defeated...\n\nIf our hopes seem to be experiencing disappointment right now, it simply means\nthat our hopes are being purified...\n\nEvery hope or dream of the human mind will be fulfilled if it is noble and of God.\nBUT one of the greatest stresses in life is the stress of waiting for God.\n\nHe brings fulfillment, \"because you have kept My commandment to persevere.\"\n(Rev. 3:10)\n\nPrayer for Today:\nPray that you will be able to continue to persevere spiritually.\n\nPastor Al & Marcie Sather\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 6 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11fb23b8ccda5d11",
    "dateutc": "Wed, 25 Feb 2009 05:28:07 -0600",
    "subject": "thoughts to live by",
    "verse": "The woman said to Him, \"Sir, you have nothing to draw [water] with, and the well is deep.\" (Jn. 4:11)",
    "reflection": "Have you ever said to yourself, \"I am impressed with the wonderful truths of God's word, but He can't really expect me to live up to that and work all those details into my life!\" When it comes to confronting Jesus Christ on the basis of His qualities and abilities, our attitudes reflect religious superiority. We are thinking His ideals are lofty and they impress us, but we think He is not in touch with reality, and that what He says cannot actually be done. If we are honest with ourselves I believe, each of us has thought this about Jesus in one area of our life or another. These doubts or misgivings about Jesus begin as we consider questions that divert our focus away from God. Our misgivings arise from the fact that we search within and find how He will do what He says. Our doubts actually spring from the depths of our own inferiority. Now if we detect these misgivings in ourselves, we should bring them into the light and confess them openly.",
    "prayer": "\"Lord, I have had misgivings about You. I have not trusted in Your abilities, but only in mine. And I have not believed in Your almighty power apart from my finite understanding of it. Amen.",
    "reading": "",
    "originalcontent": "Thur. 26/09~~~food for thought~~~Have you ever questioned the power of God?\n\nOur Bible Verse for Today:\n\nThe woman said to Him, \"Sir, you have nothing to \ndraw [water] with, and the well is deep.\" (Jn. 4:11)\n\nOur Lesson for Today:\n\nHave you ever said to yourself, \"I am impressed with the wonderful truths\nof God's word, but He can't really expect me to live up to that and work\nall those details into my life!\"\n\nWhen it comes to confronting Jesus Christ on the basis of His qualities\nand abilities, our attitudes reflect religious superiority. We are thinking\nHis ideals are lofty and they impress us, but we think He is not in touch \nwith reality, and that what He says cannot actually be done...\n\nIf we are honest with ourselves I believe, each of us has thought this\nabout Jesus in one area of our life or another. These doubts or misgivings\nabout Jesus begin as we consider questions that divert our focus away \nfrom God...\n\nOur misgivings arise from the fact that we search within and find how He \nwill do what He says. Our doubts actually spring from the depths of our\nown inferiority. Now if we detect these misgivings in ourselves, we should\nbring them into the light and confess them openly...\n\nPrayer Suggestion: \n\"Lord, I have had misgivings about You. \nI have not trusted in Your abilities, but only in mine.\nAnd I have not believed in Your almighty power apart \nfrom my finite understanding of it...\n\nPastor Al & Marcie Sather\n\n\n\n-I am using the free version of SPAMfighter.\nWe are a community of 6 million users fighting spam.\nSPAMfighter has removed 20 of my spam emails to date.\nGet the free SPAMfighter here: http://www.spamfighter.com/len\n\nThe Professional version does not have this message",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11fb777add76ca65",
    "dateutc": "Thu, 26 Feb 2009 05:58:26 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Where then do you get that living water?\" (Jn. 4:11)",
    "reflection": "\"The well is deep\" Yes even deeper than the Samaritan woman realized! Just think about the depths of human nature and human life; 'think' of the depth of the \"wells\" in you. Have you been limiting, the ministry of Jesus to the point that He is unable to work in your life? Suppose that you have a deep \"well\" of hurt and trouble inside your heart, and Jesus comes and says to you, \"Let not your heart be troubled.\" (Jn. 14:1) Would your response be to shrug your shoulders and say, \"But, Lord, the well is to deep, and even You can not draw up quietness and comfort out of it.\" Actually, that is correct. Jesus does not bring anything up from the wells of human nature, He brings them down from above. The thing that approaches the very limits of His power is the very thing we as His followers ought to believe He will do. We impoverish and weaken His ministry in us the moment we forget He is the Almighty. The reason some of us are such poor examples of Christianity is that we have failed to recognize that Christ is the Almighty. Oh yes we have so many Christian attributes and experiences, BUT we cling too much to our earthly cares and do not surrender to Jesus Christ as we should. Yes our 'well' of incompleteness runs deep, but we need to make every effort to look away from ourselves and look toward the Almighty.",
    "prayer": "Admit that you can't do it, but all things are possible with Christ, 'The Almighty'. Amen.",
    "reading": "",
    "originalcontent": "Fri. 27/09~~~food for thought~~~The well of our incompleteness is deep...\n\nOur Bible Verse for Today: \n(I know this is the same vs. as yesterday but there is more I want to say)\n\n\"Where then do you get that living water?\" (Jn. 4:11)\n\nOur lesson for Today:\n\n\"The well is deep\" Yes even deeper than the Samaritan woman realized!\n\nJust think about the depths of human nature and human life; 'think' of the depth\nof the \"wells\" in you...\n\nHave you been limiting, the ministry of Jesus to the point that He is unable to \nwork in your life? Suppose that you have a deep \"well\" of hurt and trouble inside\nyour heart, and Jesus comes and says to you, \"Let not your heart be troubled...\"\n(Jn. 14:1)\n\nWould your response be to shrug your shoulders and say, \"But, Lord, the well is\nto deep, and even You can not draw up quietness and comfort out of it.\"\n\nActually, that is correct. Jesus does not bring anything up from the wells of human \nnature, He brings them down from above...\n\nThe thing that approaches the very limits of His power is the very thing we as His \nfollowers ought to believe He will do. We impoverish and weaken His ministry in\nus the moment we forget He is the Almighty...\n\nThe reason some of us are such poor examples of Christianity is that we have\nfailed to recognize that Christ is the Almighty. Oh yes we have so many Christian\nattributes and experiences, BUT we cling too much to our earthly cares and do not\nsurrender to Jesus Christ as we should...\n\nYes our 'well' of incompleteness runs deep, but we need to make every effort\nto look away from ourselves and look toward the Almighty...\n\nPrayer Suggestion:\nAdmit that you can't do it, but all things are possible with\nChrist, 'The Almighty'...\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11fbc98079197da3",
    "dateutc": "Fri, 27 Feb 2009 13:17:14 -0600",
    "subject": "thoughts to live by",
    "verse": "(Jesus' disciples) Now we see that You know all things and that You don't even need to have anyone ask you questions. This makes us believe that You came from God. You believe as last!!! Jesus answered. (Jn. 16:30, 31)",
    "reflection": "The Disciples say, \"Now we Believe.\" But Jesus asks, \"Do you. ?\" Indeed an hour is coming. that you. will leave Me alone.\" (Jn. 16:31, 32) Many Christians have left Jesus Christ alone but have still tried to serve Him out of a sense of duty, OR because they sense a need as a result of their own discernment. The reason for this is actually the absence of the resurrection life of Jesus. This is what happens when our soul has gotten out of intimate contact with God by leaning on our own religious understanding. (check out Pro. 3:5, 6). This is not necessarily a deliberate sin and once a person realizes how he has hindered his understanding of Jesus Christ, and caused uncertainties, sorrows, and difficulties for himself, it is with same and remorse that he has to return. We need to rely on the resurrection life of Jesus on a much deeper level than we do now. We should get in the habit of continually seeking His counsel on everything, instead of making our own commonsense decisions and then asking Him to bless them. Remember we are not told to \"walk in the light\" of our conscience or in the light of a sense of duty, but to \"walk in the light as He is in the light.\" (I Jn. 1:7)",
    "prayer": "Help me to continually walk in Your Light, in obedience to You. Amen.",
    "reading": "",
    "originalcontent": "Sat. 28/09~~~food for thought~~~Do you really believe?\n\nOur Bible Verse for Today: (Jesus' disciples)\n\n\"Now we see that You know all things and that You don't \neven need to have anyone ask you questions. This makes\nus believe that You came from God.\"\n\n\"You believe as last!!!\" Jesus answered...(Jn. 16:30, 31)\n\nOur Lesson for Today:\n\nThe Disciples say, \"Now we Believe...\" But Jesus asks, \"Do you...?\"\nIndeed an hour is coming...that you...will leave Me alone.\" (Jn. 16:31, 32)\n\nMany Christians have left Jesus Christ alone but have still tried to serve\nHim out of a sense of duty, OR because they sense a need as a result\nof their own discernment...\n\nThe reason for this is actually the absence of the resurrection life of Jesus.\n\nThis is what happens when our soul has gotten out of intimate contact with \nGod by leaning on our own religious understanding. (check out Pro. 3:5, 6).\n\nThis is not necessarily a deliberate sin and once a person realizes how\nhe has hindered his understanding of Jesus Christ, and caused uncertainties, \nsorrows, and difficulties for himself, it is with same and remorse that he has \nto return...\n\nWe need to rely on the resurrection life of Jesus on a much deeper level than\nwe do now. We should get in the habit of continually seeking His counsel\non everything, instead of making our own commonsense decisions and\nthen asking Him to bless them...\n\nRemember we are not told to \"walk in the light\" of our conscience or in the\nlight of a sense of duty, but to \"walk in the light as He is in the light.\" (I Jn. 1:7)\n\nPrayer Suggestion:\nHelp me to continually walk in Your Light, \nin obedience to You... \n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "11fc6b0f7719b6f8",
    "dateutc": "Sat, 28 Feb 2009 16:38:23 -0600",
    "subject": "thoughts to live by",
    "verse": "The third time He said to him, \"Simon son of John, do you love Me?\" Peter was hurt because Jesus asked him the third time, \"Do you love Me?\" He said, \"Lord You know all things; you know I love You.\"",
    "reflection": "Have you ever felt pain, inflicted by the Lord, at the very center of your being, deep down in the most sensitive area of your life??? The devil never inflicts pain there, and neither can sin nor human emotions. Nothing can cut through to that part of our being but the Word of God. Peter was grieved because He said to him the third time, 'Do you love Me? Yet he was awakened to the fact that at the center of his personal life he was devoted to Jesus. AND then he began to see what Jesus' patient questioning meant. There was not the slightest bit of doubt left in Peter's mind; he could never be deceived again. AND there was no need for an impassioned response; NO need for immediate OR an emotional display. It was a revelation to him to realize how much he did love the Lord, and with amazement he simply said, \"Lord, You know all things.\" Oh, the wonder of the patient directness and skill of Jesus Christ with Peter!!!",
    "prayer": "Pray that you will be ready to answer Jesus in the affirmative when He backs you into a corner with the question, \"Do you love Me?\" Amen.",
    "reading": "",
    "originalcontent": "Mon. 2/09~~~food for thought~~~Have you felt the pain inflicted by the Lord?\n\nOur Bible Verse for Today:\n\nThe third time He said to him, \"Simon son of John, do you love Me?\"\nPeter was hurt because Jesus asked him the third time, \"Do you love Me?\"\nHe said, \"Lord You know all things; you know I love You.\"\n\nOur Lesson for Today:\n\nHave you ever felt pain, inflicted by the Lord, at the very center of your being,\ndeep down in the most sensitive area of your life???\n\nThe devil never inflicts pain there, and neither can sin nor human emotions...\n\nNothing can cut through to that part of our being but the Word of God. Peter was \ngrieved because He said to him the third time, 'Do you love Me? Yet he was \nawakened to the fact that at the center of his personal life he was devoted to Jesus...\n\nAND then he began to see what Jesus' patient questioning meant. There was not \nthe slightest bit of doubt left in Peter's mind; he could never be deceived again.\nAND there was no need for an impassioned response; NO need for immediate OR\nan emotional display...\n\nIt was a revelation to him to realize how much he did love the Lord, and with \namazement he simply said, \"Lord, You know all things.\" Oh, the wonder of the \npatient directness and skill of Jesus Christ with Peter!!!\n\nPrayer Suggestion:\nPray that you will be ready to answer Jesus in the affirmative\nwhen He backs you into a corner with the question, \"Do you love Me?\"\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  }
]