[
  {
    "message_id": "1631e763b5d8aa86",
    "date_utc": "Tue, 01 May 2018 20:27:35 -0500",
    "subject": "thoughts to live by",
    "verse": "\"The Lord will not let the godly starve to death, but He refuses to satisfy the craving of the wicked. \" (Pro. 10:3)",
    "reflection": "These statements are not intended to apply universally to all people in every situation. For example, some good people do go hungry. Rather they are intended to communicate the general truth that the life of the person who seeks God is better in the long run than the life of the wicked person---a life that leads to ruin. A proverb like this assumes a just government that cares for the poor and needy.",
    "prayer": "Dear Heavenly Father, I thank You for the practical wisdom for godly living at every stage of life, that is found in these proverbs. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"The Lord will not let the godly starve to death, but He refuses_\n\n_to satisfy the craving of the wicked.\" _(Pro. 10:3)\n\nTHOUGHT FOR TODAY:\n\nThese statements are not intended to apply universally to all people\n\nin every situation. For example, some good people do go hungry.\n\nRather they are intended to communicate the general truth that the\n\nlife of the person who seeks God is better in the long run than the\n\nlife of the wicked person---a life that leads to ruin. A proverb like\n\nthis assumes a just government that cares for the poor and needy.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for the practical wisdom for\n\ngodly living at every stage of life, that is found in these proverbs.\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16323ac2e65f78c0",
    "date_utc": "Wed, 02 May 2018 20:44:37 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Lazy people are soon poor, hard workers get rich. A wise youth works hard all summer; a youth who sleeps away the hour of opportunity brings shame. \" (Pro. 10:4-5)",
    "reflection": "Very day has 24 hours of opportunity, to grow, serve, and be productive. Yet it is so easy to waste time, letting life slip from our grasp. Let us refuse to be a lazy person, sleeping or flittering away the hours meant for productive work. Let us see time as God's gift, and seize every opportunity to live diligently for Him.",
    "prayer": "Dear Lord, I pray that I would seek to grasp every opportunity to grow and serve You in a productive way. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Lazy people are soon poor, hard workers get rich._\n\n_A wise youth works hard all summer; a youth who_\n\n_sleeps away the hour of opportunity brings shame.\" _(Pro. 10:4-5)\n\nTHOUGHT FOR TODAY:\n\nVery day has 24 hours of opportunity, to grow, serve, and be\n\nproductive. Yet it is so easy to waste time, letting life slip\n\nfrom our grasp. Let us refuse to be a lazy person, sleeping\n\nor flittering away the hours meant for productive work. Let\n\nus see time as God's gift, and seize every opportunity to live\n\ndiligently for Him.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would seek to grasp every opportunity\n\nto grow and serve You in a productive way. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16328d82d891138e",
    "date_utc": "Thu, 03 May 2018 20:50:46 -0500",
    "subject": "thoughts to live by",
    "verse": "\"People with integrity have firm footing, but those who follow crooked paths will slip and fall. \" (Pro. 10:9)",
    "reflection": "This refers to all lies, especially those told under oath. God truly honors honesty! DISHONESTY cones easily, especially when complete honesty could, cost us something, make us uncomfortable, or put us in an unfavorable light.",
    "prayer": "Dear Lord, I pray that Your Holy Spirit would guide me to be honest under all circumstances, I pray this in the name of our Lord and Savior Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n\"People with integrity have firm footing, but those who follow\n\ncrooked paths will slip and fall.\" (Pro. 10:9)\n\nTHOUGHT FOR TODAY:\n\nThis refers to all lies, especially those told under oath. God truly\n\nhonors honesty! DISHONESTY cones easily, especially when complete\n\nhonesty could, cost us something, make us uncomfortable, or put us\n\nin an unfavorable light.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that Your Holy Spirit would guide me to be honest\n\nunder all circumstances, I pray this in the name of our Lord and\nSavior\n\nJesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1632e0a645c58348",
    "date_utc": "Fri, 04 May 2018 21:03:43 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Hatred stirs up quarrels, but love covers all offenses. \" (Pro. 10:12)",
    "reflection": "Our society confuses love and lust. Unlike lust, God's kind of love is directed outward toward others, not inward toward ourselves. God's love is utterly unselfish. This kind of love goes against our natural inclination.",
    "prayer": "Dear Heavenly Father, I pray that You would help me set aside my natural desires so that I can love without expecting anything in return. I pray that I would become more like Christ, so that I would have more love for others. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Hatred stirs up quarrels, but love covers all offenses.\"_\n\n(Pro. 10:12)\n\nTHOUGHT FOR TODAY:\n\nOur society confuses love and lust. Unlike lust, God's\n\nkind of love is directed outward toward others, not\n\ninward toward ourselves. God's love is utterly unselfish.\n\nThis kind of love goes against our natural inclination.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that You would help me set aside\n\nmy natural desires so that I can love without expecting anything\n\nin return. I pray that I would become more like Christ, so that I\n\nwould have more love for others. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16332fc3e2d499bf",
    "date_utc": "Sat, 05 May 2018 20:06:22 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Wise people treasure knowledge, but the babbling of a fool invites trouble. (Pro. 10:14)",
    "reflection": "What you say and what you don't say are both important. To use proper speech you must NOT only say the right words at the right time but also not say what you shouldn't.",
    "prayer": "Dear Lord, I pray that before I speak, I would always ask, is what I want to say true? Is it necessary? Is it kind?. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Wise people treasure knowledge, but the babbling of a fool_\n\n_invites trouble. _(Pro. 10:14)\n\nTHOUGHT FOR TODAY:\n\nWhat you say and what you don't say are both important. To use\n\nproper speech you must NOT only say the right words at the right\n\ntime but also not say what you shouldn't.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that before I speak, I would always ask, is what\n\nI want to say true? Is it necessary? Is it kind? . . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163382a0ccd3427c",
    "date_utc": "Sun, 06 May 2018 20:14:30 -0500",
    "subject": "thoughts to live by",
    "verse": "\"People who accept correction are on the pathway to life, but those who ignore it will lead others astray. \" (Pro. 10:17)",
    "reflection": "This teaching is a lamp to light the way ahead of you. Allow this advice to guide you to the way to eternal life.",
    "prayer": "Dear Lord, I pray that I would always accept the correction from Your Holy Word, so that I may never stray form the path that leads to eternal life. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"People who accept correction are on the pathway to life,_\n\n_but those who ignore it will lead others astray.\" _(Pro. 10:17)\n\nTHOUGHT FOR TODAY:\n\nThis teaching is a lamp to light the way ahead of you. Allow\n\nthis advice to guide you to the way to eternal life.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would always accept the correction\n\nfrom Your Holy Word, so that I may never stray form the\n\npath that leads to eternal life. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1633d58e91b2bf94",
    "date_utc": "Mon, 07 May 2018 20:23:47 -0500",
    "subject": "thoughts to live by",
    "verse": "\"To hide hatred is to be a liar, to slander is to be a fool. Don't talk to much, for it fosters sin. Be sensible and turn off the flow!' (Pro. 10:18, 19)",
    "reflection": "If you try to conceal your hatred, you end up being a liar. You can solve the problem only by, admitting your hateful feelings to God. Ask Him to change your heart, to help you love instead of hate.",
    "prayer": "Dear Lord, help me correct my attitude so that I would become a more loving person. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"To hide hatred is to be a liar, to slander is to be a fool._\n\n_Don't talk to much, for it fosters sin. Be sensible and turn_\n\n_off the flow!' _(Pro. 10:18, 19)\n\nTHOUGHT FOR TODAY:\n\nIf you try to conceal your hatred, you end up being a liar. You\n\ncan solve the problem only by, admitting your hateful feelings\n\nto God. Ask Him to change your heart, to help you love instead\n\nof hate.\n\nPRAYER FOR TODAY:\n\nDear Lord, help me correct my attitude so that I would become\n\na more loving person. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163427db2e06e74d",
    "date_utc": "Tue, 08 May 2018 20:22:04 -0500",
    "subject": "thoughts to live by",
    "verse": "\"The words of the godly are like sterling sliver; the heart of a fool is worthless. \" (Pro. 10:20)",
    "reflection": "A lot of poor advice is worth less than a little good advice. It is easy to get opinions from people who will tell you only what they think will please us, but such advice is not helpful. Instead we should look to those who will tell us the truth, even when it hurts. Think about the people to whom you go for advice. What do you expect to hear from them?",
    "prayer": "Dear Heavenly Father, I pray that when I am asked to give someone advice I would look to You for wisdom, and the right words to share. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"The words of the godly are like sterling sliver; _\n\n_the heart of a fool is worthless.\"_ (Pro. 10:20)\n\nTHOUGHT FOR TODAY:\n\nA lot of poor advice is worth less than a little good advice.\n\nIt is easy to get opinions from people who will tell you only\n\nwhat they think will please us, but such advice is not helpful.\n\nInstead we should look to those who will tell us the truth,\n\neven when it hurts. Think about the people to whom you go\n\nfor advice. What do you expect to hear from them?\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that when I am asked to give\n\nsomeone advice I would look to You for wisdom, and the\n\nright words to share. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16347a93ba194278",
    "date_utc": "Wed, 09 May 2018 20:27:43 -0500",
    "subject": "thoughts to live by",
    "verse": "\"The blessings of the Lord makes a man rich, and he adds no sorrow with it. \" (Pro. 10:22)",
    "reflection": "God supplies most people with the personal and financial abilities to respond to the needs of others. If we all realize how God has blessed us, and if we all used our resources to do God's will, hunger and poverty would be wiped out. Wealth is a blessing ONLY if we use it in the way God intended.",
    "prayer": "Dear Heavenly Father, I thank You for Your many blessings, I pray that I would be faithful in sharing them as You intended me to use them. Help me to realize the needs of those who are less fortunate. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n\"_The blessings of the Lord mak__es a man rich, and _\n\n_he adds no sorrow with it.\" _(Pro. 10:22)\n\nTHOUGHT FOR TODAY:\n\nGod supplies most people with the personal and financial abilities\n\nto respond to the needs of others. If we all realize how God has\n\nblessed us, and if we all used our resources to do God's will,\n\nhunger and poverty would be wiped out. Wealth is a blessing\n\nONLY if we use it in the way God intended.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for Your many blessings, I pray\n\nthat I would be faithful in sharing them as You intended me to use\n\nthem. Help me to realize the needs of those who are less fortunate.\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1634ce0e85caad46",
    "date_utc": "Thu, 10 May 2018 20:46:38 -0500",
    "subject": "thoughts to live by",
    "verse": "\"The fears of the wicked will all come true; so will the hopes of the godly. \" (Pro. 10:24)",
    "reflection": "The wicked person dreads death. Those who do not believe in God usually fear death, and with good reason. By contrast, believers desire eternal life and God's salvation---Their hopes will be rewarded. This verse offers a choice. You can have either your fears or your hopes come true. You make that choice by rejecting God and living your own way or by accepting God and following Him.",
    "prayer": "Dear Heavenly Father, I pray that this world will come to realize that their only hope is in accepting You as their Savior and follow You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"The fears of the wicked will all come true; _\n\n_so will the hopes of the godly.\" _(Pro. 10:24)\n\nTHOUGHT FOR TODAY:\n\nThe wicked person dreads death. Those who do not believe\n\nin God usually fear death, and with good reason. By contrast,\n\nbelievers desire eternal life and God's salvation---Their hopes\n\nwill be rewarded. This verse offers a choice. You can have\n\neither your fears or your hopes come true. You make that choice\n\nby rejecting God and living your own way or by accepting God\n\nand following Him.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that this world will come to\n\nrealize that their only hope is in accepting You as their Savior\n\nand follow You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16351d6fc72e30c7",
    "date_utc": "Fri, 11 May 2018 19:53:54 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Disaster strikes like a cyclone, whirling the wicked away, but the godly have a lasting foundation. \" (Pro. 10:25)",
    "reflection": "God calls His people to be morally upright, but we live among evil people whose standards and morals are eroding. Our standard for living should not come from our evil society, but from God.",
    "prayer": "Dear heavenly Father, I pray that I would follow the path of righteousness so that I would not fall into the standards of society. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Disaster strikes like a cyclone, whirling the wicked away,_\n\n_but the godly have a lasting foundation.\" _(Pro. 10:25)\n\nTHOUGHT FOR TODAY:\n\nGod calls His people to be morally upright, but we live\n\namong evil people whose standards and morals are eroding.\n\nOur standard for living should not come from our evil\n\nsociety, but from God.\n\nPRAYER FOR TODAY:\n\nDear heavenly Father, I pray that I would follow the path\n\nof righteousness so that I would not fall into the standards\n\nof society. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1635728515939a02",
    "date_utc": "Sat, 12 May 2018 20:40:50 -0500",
    "subject": "thoughts to live by",
    "verse": "\"The hopes of the godly results in happiness, but the expectations of the wicked are all in vain. \" (Pro. 10:28)",
    "reflection": "The reason for the happiness of the godly is that the Lord promises an eternal reward in the presence of Him. But the reward of the ungodly is an eternal separation from Him.",
    "prayer": "Dear Heavenly Father, I thank You for Your love and mercy, which gives all who believe a result of eternal reward and happiness. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"The hopes of the godly results in happiness, but the_\n\n_expectations of the wicked are all in vain.\" _(Pro. 10:28)\n\nTHOUGHT FOR TODAY:\n\nThe reason for the happiness of the godly is that the Lord\n\npromises an eternal reward in the presence of Him. But\n\nthe reward of the ungodly is an eternal separation from\n\nHim.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for Your love and\n\nmercy, which gives all who believe a result of eternal\n\nreward and happiness. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1635c33cc807b469",
    "date_utc": "Sun, 13 May 2018 20:11:29 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Riches won't help on the day of judgment, but right living is a safeguard against death. \" (Pro. 11:4)",
    "reflection": "\"The day of judgment\" refers to when we die or to the time when God settles accounts with all people. On judgment day, each of us will stand alone, accountable for all our deeds. At that time, no amount of riches will by reconciliation with God. Only our love for God and obedience to Him will count.",
    "prayer": "Dear Lord, and Savior, my prayer is that You will wipe away all my sins, so that I may stand before You reconciled in Your sight. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Riches won't help on the day of judgment, but right _\n\n_living is a __safeguard against death.\" _ (Pro. 11:4)\n\nTHOUGHT FOR TODAY:\n\n\"The day of judgment\" refers to when we die or to the time\n\nwhen God settles accounts with all people. On judgment day,\n\neach of us will stand alone, accountable for all our deeds. At\n\nthat time, no amount of riches will by reconciliation with God.\n\nOnly our love for God and obedience to Him will count.\n\nPRAYER FOR TODAY:\n\nDear Lord, and Savior, my prayer is that You will wipe away\n\nall my sins, so that I may stand before You reconciled in Your\n\nsight. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1636354d8fa4ca37",
    "date_utc": "Tue, 15 May 2018 05:24:55 -0500",
    "subject": "thoughts to live by",
    "verse": "\"When the wicked die, their hopes all perish, for they rely on their own strength. God recues the godly from danger, but He lets the wicked fall into trouble. \" (Pro. 11:7, 8)",
    "reflection": "These verses contrast two paths in life but are not intended to apply universally to all people in all circumstances. God's people are not excluded from problems or struggles. If a person follows God's wisdom, however, God can rescue them from trouble. But a wicked person will fall into his or her own traps. The good person may suffer, but they can be sure they will ultimately be rescued from eternal death.",
    "prayer": "Thank You Lord, for the promise of a better place for those who follow You, even though they may go through difficult situations on this earth. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"When the wicked die, their hopes all perish, for they rely _\n\n_on their own strength. God recues the godly from danger, _\n\n_but He lets the wicked fall into trouble.\" _(Pro. 11:7, 8)\n\nTHOUGHT FOR TODAY:\n\nThese verses contrast two paths in life but are not intended\n\nto apply universally to all people in all circumstances. God's\n\npeople are not excluded from problems or struggles. If a person\n\nfollows God's wisdom, however, God can rescue them from\n\ntrouble. But a wicked person will fall into his or her own traps.\n\nThe good person may suffer, but they can be sure they will\n\nultimately be rescued from eternal death.\n\nPRAYER FOR TODAY:\n\nThank You Lord, for the promise of a better place for those who\nfollow\n\nYou, even though they may go through difficult situations on this\nearth.\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16366872cef43d0d",
    "date_utc": "Tue, 15 May 2018 20:18:45 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Evil words destroy one's friends; wise discernment rescues to godly. \" (Pro. 11:9)",
    "reflection": "The mouth can be used in two ways, either as a weapon or a tool, hurting relationships or building them up. Sadly it seems easier to destroy than to build up, and most people have received more destructive comments than those that build up. Remember that your words today will make a difference. will they be words that destroy or words that build up?",
    "prayer": "Dear Heavenly Father, I pray that You would bridal my tongue today, so that the words I speak to others would build them up rather than tear them down. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Evil words destroy one's friends; wise discernment _\n\n_rescues to godly.\" _(Pro. 11:9)\n\nTHOUGHT FOR TODAY:\n\nThe mouth can be used in two ways, either as a weapon\n\nor a tool, hurting relationships or building them up. Sadly\n\nit seems easier to destroy than to build up, and most people\n\nhave received more destructive comments than those that\n\nbuild up. Remember that your words today will make a\n\ndifference. will they be words that destroy or words that\n\nbuild up?\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that You would bridal my\n\ntongue today, so that the words I speak to others would\n\nbuild them up rather than tear them down. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1636bee11d19a46e",
    "date_utc": "Wed, 16 May 2018 21:29:14 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Without wise leadership, a nation falls, with many counselors, there is safety. \" (Pro. 11:14)",
    "reflection": "A good leader needs and uses wise counselors. One person's perspective and understanding is severely limited. He or she may not have all the facts or may be blinded by bias, emotions, or wrong impressions. To be a wise leader at home, at church, or at work seek the counsel of others and be open to their advice.",
    "prayer": "Dear Lord, I pray that I would always be sensitive to the good advice or others and the leadership of Your Holy Spirit. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Without wise leadership, a nation falls, with many _\n\n_counselors, __there is safety.\" _(Pro. 11:14)\n\nTHOUGHT FOR TODAY:\n\nA good leader needs and uses wise counselors. One person's\n\nperspective and understanding is severely limited. He or she\n\nmay not have all the facts or may be blinded by bias, emotions,\n\nor wrong impressions. To be a wise leader at home, at church,\n\nor at work seek the counsel of others and be open to their advice.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would always be sensitive to the good\n\nadvice or others and the leadership of Your Holy Spirit. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1636bf3762137efe",
    "date_utc": "Wed, 16 May 2018 21:35:08 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Godly people find life; evil people find death. \" (Pro. 11:19)",
    "reflection": "Godly people find life because they live life more fully each day. They also find life because people usually live longer when they live right, with proper diet, exercise, and rest. In addition they need not fear death because eternal life is God's gift to them (Jn. 11:25) By contrast, evil people not only find eternal death but also miss out on real life on earth.",
    "prayer": "Dear Lord, I thank you for the gift of eternal life that You have promised to all who believe in You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Godly people find life; evil people find death.\" _(Pro. 11:19)\n\nTHOUGHT FOR TODAY:\n\nGodly people find life because they live life more fully\n\neach day.They also find life because people usually live\n\nlonger when they live right, with proper diet, exercise, and\n\nrest. In addition they need not fear death because eternal life\n\nis God's gift to them (Jn. 11:25) By contrast, evil people not\n\nonly find eternal death but also miss out on real life on earth.\n\nPRAYER FOR TODAY:\n\nDear Lord, I thank you for the gift of eternal life that You\n\nhave promised to all who believe in You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1637584fc552e7d4",
    "date_utc": "Fri, 18 May 2018 18:10:40 -0500",
    "subject": "thoughts to live by",
    "verse": "\"The generous prosper and are satisfied; those who refresh others will themselves be refreshed. \" (Pro. 11:25)",
    "reflection": "God supplies us with more so we can give more. In addition, giving helps us gain a right perspective of our possessions. We should come to realize they were never ours to begin with, but they were given to us BY God to be used to help others. So what do we gain by giving? Freedom from enslavement to our possessions, the joy of helping others, AND GOD'S APPROVAL!",
    "prayer": "Dear Heavenly Father, I have to confess that I have complained, about lean times in my life, but when I look at many others, I have to admit, You have blest me in ways that I have not used wisely. I ask for Your forgiveness. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"The generous prosper and are satisfied; those who refresh _\n\n_others will themselves be refreshed.\" _(Pro. 11:25)\n\nTHOUGHT FOR TODAY:\n\nGod supplies us with more so we can give more. In addition, giving\n\nhelps us gain a right perspective of our possessions. We should come\n\nto realize they were never ours to begin with, but they were given to\n\nus BY God to be used to help others. So what do we gain by giving?\n\nFreedom from enslavement to our possessions, the joy of helping\n\nothers, AND GOD'S APPROVAL!\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I have to confess that I have complained,\n\nabout lean times in my life, but when I look at many others, I have\n\nto admit, You have blest me in ways that I have not used wisely.\n\nI ask for Your forgiveness. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1637b171e48bd650",
    "date_utc": "Sat, 19 May 2018 20:08:23 -0500",
    "subject": "thoughts to live by",
    "verse": "\"If you search for good, you will find favor, but if you search for evil, it will find you!\" (Pro. 11:27)",
    "reflection": "Sometimes God intervenes and stops evil doers in their tracks in order to protect His followers. At other times, for reasons known only to Him, God allows evil to continue even though innocent people are hurt. It is during these times that we must ask God to protect us. Remember that God will execute final justice, although it may not be during our life time.",
    "prayer": "Dear Lord, for those times that we are surround by evil, I pray that I will continue to trust in You. May I remain sensitive to Your Holy Spirit's leading. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"If you search for good, you will find favor, but if you_\n\n_search for evil, it will find you!\" _(Pro. 11:27)\n\nTHOUGHT FOR TODAY:\n\nSometimes God intervenes and stops evil doers in their tracks\n\nin order to protect His followers. At other times, for reasons\n\nknown only to Him, God allows evil to continue even though\n\ninnocent people are hurt. It is during these times that we must\n\nask God to protect us. Remember that God will execute final\n\njustice, although it may not be during our life time.\n\nPRAYER FOR TODAY:\n\nDear Lord, for those times that we are surround by evil, I\n\npray that I will continue to trust in You. May I remain\n\nsensitive to Your Holy Spirit's leading. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1638036ffa17cf7d",
    "date_utc": "Sun, 20 May 2018 20:01:18 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Trust in your money and down you go! But the godly",
    "reflection": "Those who have money must be generous, but they must not be arrogant just because they have been given a lot to give. They must be careful not to put their hope in money instead of in the living God for their security. Even if we don't have material wealth, we can be rich in good deeds. No matter how poor we are, we have something to share with someone.",
    "prayer": "Dear Heavenly Father, help me realize when I am putting to much faith in things. Help me to trust You more, and share a good deed with someone who is needy. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Trust in your money and down you go! But the godly_\n\n_ flourish __like leaves in spring.\" _(Pro. 11:28)THOUGHT FOR TODAY:\n\nThose who have money must be generous, but they must not\n\nbe arrogant just because they have been given a lot to give.\n\nThey must be careful not to put their hope in money instead\n\nof in the living God for their security. Even if we don't have\n\nmaterial wealth, we can be rich in good deeds. No matter how\n\npoor we are, we have something to share with someone.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me realize when I am putting to\n\nmuch faith in things. Help me to trust You more, and share\n\na good deed with someone who is needy. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16385b293bb499b9",
    "date_utc": "Mon, 21 May 2018 21:34:23 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Those who bring trouble on their families inherit only the wind. the fool will be a servant to the wise. \" (Pro. 11:29)",
    "reflection": "One of the greatest resources God gives us is the family. Families provide acceptance, encouragement, guidance, and counsel. Bringing trouble on your family-----whether through anger or through an exaggerated desire for independence----is foolish because you cut yourself off from all they provide. In your family strive for healing, communication, and understanding.",
    "prayer": "I thank You Lord, for all that You provide for us, forgive me when I take the many blessing for granted, and not give You thanks as I should. I thank You Lord for the freedoms we have in this country I pray in Jesus name. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Those who bring trouble on their families inherit only the _\n\n_wind. the fool will be a servant to the wise.\" _(Pro. 11:29)\n\nTHOUGHT FOR TODAY:\n\nOne of the greatest resources God gives us is the family. Families\n\nprovide acceptance, encouragement, guidance, and counsel. Bringing\n\ntrouble on your family-----whether through anger or through an\n\nexaggerated desire for independence----is foolish because you cut\n\nyourself off from all they provide. In your family strive for\nhealing,\n\ncommunication, and understanding.\n\nPRAYER FOR TODAY:\n\nI thank You Lord, for all that You provide for us, forgive me when\n\nI take the many blessing for granted, and not give You thanks as I\n\nshould. I thank You Lord for the freedoms we have in this country\n\nI pray in Jesus name. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1638a9d3e206470d",
    "date_utc": "Tue, 22 May 2018 20:29:11 -0500",
    "subject": "thoughts to live by",
    "verse": "\"the godly are like trees that bear life-giving fruit, and those who save lives are wise. \" (Pro. 11:30)",
    "reflection": "The godly person is a model of a meaningful life. like a tree that attracts people to its shade, a godly person's sense of purpose attracts others who want to know how they, TOO, can find meaning. Gaining wisdom yourself can be the first step in leading people to God.",
    "prayer": "Dear Lord of Wisdom, Love, and Mercy, I pray that You would instill in me a Christ like love for others that would attract them to a meaningful life in You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"the godly are like trees that bear life-giving fruit, and _\n\n_those who save lives are wise.\" _(Pro. 11:30)\n\nTHOUGHT FOR TODAY:\n\nThe godly person is a model of a meaningful life. like a\n\ntree that attracts people to its shade, a godly person's sense\n\nof purpose attracts others who want to know how they, TOO,\n\ncan find meaning. Gaining wisdom yourself can be the first\n\nstep in leading people to God.\n\nPRAYER FOR TODAY:\n\nDear Lord of Wisdom, Love, and Mercy, I pray that You\n\nwould instill in me a Christ like love for others that would attract\n\nthem to a meaningful life in You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1638fe5a48bdd694",
    "date_utc": "Wed, 23 May 2018 21:06:22 -0500",
    "subject": "thoughts to live by",
    "verse": "If the righteous are rewarded here on earth, how much more true that the wicked and the sinners will get what they deserve! (Pro. 11:31)",
    "reflection": "Contrary to popular opinion, no one sins and gets away with it. The righteous are rewarded for their faith. The wicked are punished for their sins. Don't think for a moment that \"it won't matter. \" or \"nobody will know, \" or \"we won't get caught. \" For more information check (I Pet. 4:18)",
    "prayer": "Dear heavenly Father, I pray that every chance I get You would give me THE COURAGE to correct the misbelief of those who believe they can continue in the ways of the world with no consequences. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_If the righteous are rewarded here on earth, how much more _\n\n_true that the wicked and the sinners will get what they deserve!_\n\n(Pro. 11:31)\n\nTHOUGHT FOR TODAY:\n\nContrary to popular opinion, no one sins and gets away with it.\n\nThe righteous are rewarded for their faith. The wicked are\n\npunished for their sins. Don't think for a moment that _\"it won't_\n\n_matter.\"_ or _\"nobody will know,\"_ or _\"we won't get caught.\" _\n\nFor more information check (I Pet. 4:18)\n\nPRAYER FOR TODAY:\n\nDear heavenly Father, I pray that every chance I get You would\n\ngive me THE COURAGE to correct the misbelief of those who\n\nbelieve they can continue in the ways of the world with no\n\nconsequences. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163950798a9365fa",
    "date_utc": "Thu, 24 May 2018 21:01:33 -0500",
    "subject": "thoughts to live by",
    "verse": "To learn, you must love discipline; it is stupid to hate correction. (Pro. 12:1)",
    "reflection": "If you don't want to learn, years of schooling will teach you very little. But if you want to be taught, there is no end to what you can learn. This includes being willing to accept discipline and correction and to learn from the wisdom of others. A person who refuses corrective criticism has a problem with pride. Such a person is unlikely to learn very much.",
    "prayer": "Dear Lord, instill in me a willingness to accept Your Holy Spirit's guidance. I pray for a sensitive spirit. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_To learn, you must love discipline; it is stupid to hate _\n\n_correction. _(Pro. 12:1)\n\nTHOUGHT FOR TODAY:\n\nIf you don't want to learn, years of schooling will teach you very\n\nlittle. But if you want to be taught, there is no end to what you can\n\nlearn. This includes being willing to accept discipline and\ncorrection\n\nand to learn from the wisdom of others. A person who refuses\ncorrective\n\ncriticism has a problem with pride. Such a person is unlikely to\nlearn\n\nvery much.\n\nPRAYER FOR TODAY:\n\nDear Lord, instill in me a willingness to accept Your Holy Spirit's\n\nguidance. I pray for a sensitive spirit. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16399e974ceabed9",
    "date_utc": "Fri, 25 May 2018 19:46:44 -0500",
    "subject": "thoughts to live by",
    "verse": "wickedness never brings stability, only the godly have deep roots. (Pro. 12:3)",
    "reflection": "God calls His people to be morally upright. Our standards for living should not come from our evil society but from God. To have deep roots and to be stable means to be successful. Real success comes only to those who do what is right. Their efforts stand the test of time.",
    "prayer": "Dear Heavenly Father, I pray that my standard of living would always come from You Help me not be tempted by our evil society. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_wickedness never brings stability, only the godly have deep roots._\n\n(Pro. 12:3)\n\nTHOUGHT FOR TODAY:\n\nGod calls His people to be morally upright. Our standards for living\n\nshould not come from our evil society but from God. To have deep\n\nroots and to be stable means to be successful. Real success comes\n\nonly to those who do what is right. Their efforts stand the test of\ntime.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that my standard of living would\n\nalways come from You Help me not be tempted by our evil\n\nsociety. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1639f5922a92d497",
    "date_utc": "Sat, 26 May 2018 21:06:49 -0500",
    "subject": "thoughts to live by",
    "verse": "\"The plans of the godly are just, the advice of the wicked is treacherous. (Pro. 12:5)",
    "reflection": "In Mt. 12:34 Jesus reminds us that what we say reveals what we HAVE in our heart. So the question is, what are your words revealing about you? The only cure is, we must allow the Holy Spirit to fill us with new attitudes and new motives, then our speech will be cleansed at its source.",
    "prayer": "Dear Lord, I pray that Your Holy Spirit will cleanse my heart, instilling in me a new attitude and new motives. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"The plans of the godly are just, the advice of the wicked is_\n\n_treacherous. _(Pro. 12:5)\n\nTHOUGHT FOR TODAY:\n\nIn Mt. 12:34 Jesus reminds us that what we say reveals what we\n\nHAVE in our heart. So the question is, what are your words revealing\n\nabout you? The only cure is, we must allow the Holy Spirit to fill\n\nus with new attitudes and new motives, then our speech will be\n\ncleansed at its source.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that Your Holy Spirit will cleanse my heart,\n\ninstilling in me a new attitude and new motives. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163a4564aae24f39",
    "date_utc": "Sun, 27 May 2018 20:21:49 -0500",
    "subject": "thoughts to live by",
    "verse": "The wicked perish and are gone, but the children of the godly stand firm. (Pro. 12:7)",
    "reflection": "In the middle of this gloomy message, God gives hope. Eventually the righteous will receive God's reward, and the wicked will receive their punishment. Let us keep on holding to God's truth and take heart! God will bring about justice in the end, and He will reward those who have been faithful.",
    "prayer": "Dear Lord, forgive me when I become disheartened when see the wicked prosper. Help me to remember that You are the Judge, and each person will receive their due reward. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The wicked perish and are gone, but the children_\n\n_of the godly stand firm. _(Pro. 12:7)\n\nTHOUGHT FOR TODAY:\n\nIn the middle of this gloomy message, God gives hope. Eventually the\n\nrighteous will receive God's reward, and the wicked will receive\ntheir\n\npunishment. Let us keep on holding to God's truth and take heart!\n\nGod will bring about justice in the end, and He will reward those who\n\nhave been faithful.\n\nPRAYER FOR TODAY:\n\nDear Lord, forgive me when I become disheartened when_ _see the\nwicked\n\nprosper. Help me to remember that You are the Judge, and each person\n\nwill receive their due reward. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163a98634a654636",
    "date_utc": "Mon, 28 May 2018 20:32:15 -0500",
    "subject": "thoughts to live by",
    "verse": "Every one admires a person with good sense, but a warped mind is despised.",
    "reflection": "Wisdom is the ability to see life from God's perspective and then to know the best course of action to take. Most people would agree that wisdom is a valuable asset, but how can we acquire it? (Pro. 9:10) teaches that the fear of the Lord (respect and honor) is the beginning of Wisdom.",
    "prayer": "Dear Heavenly Father, help me to always take the advice of, Proverbs 9:10. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nEvery one admires a person with good sense, but a warped\n\nmind is despised.\n\nTHOUGHT FOR TODAY:\n\nWisdom is the ability to see life from God's perspective and\n\nthen to know the best course of action to take. Most people\n\nwould agree that wisdom is a valuable asset, but how can we\n\nacquire it? (Pro. 9:10) teaches that the fear of the Lord (respect\n\nand honor) is the beginning of Wisdom.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me to always take the advice of,\n\nProverbs 9:10. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163ae93aa1dee228",
    "date_utc": "Tue, 29 May 2018 20:05:03 -0500",
    "subject": "thoughts to live by",
    "verse": "It is better to be a nobody with a servant than to be self-important but have no food. (Pro. 12:9)",
    "reflection": "How can we humble ourselves? Some people try to give the appearance of humility in order to manipulate others. Some think that humility means putting themselves down. Truly humble people compare themselves only with Christ, they realize their sinfulness, and understand their limitations. Humility is not self-degradation; it is realistic self-assessment and commitment to serve.",
    "prayer": "Dear Heavenly Father, I pray that I will always make an honest self-assessment of my self and an honest commitment to serve others. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_It is better to be a nobody with a servant than to be_\n\n_self-important but have no food. _(Pro. 12:9)\n\nTHOUGHT FOR TODAY:\n\nHow can we humble ourselves? Some people try to give\n\nthe appearance of humility in order to manipulate others.\n\nSome think that humility means putting themselves down.\n\nTruly humble people compare themselves only with Christ,\n\nthey realize their sinfulness, and understand their limitations.\n\nHumility is not self-degradation; it is realistic self-assessment\n\nand commitment to serve.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I will always make an honest\n\nself-assessment of my self and an honest commitment to serve\n\nothers. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163b3d95c8c757fb",
    "date_utc": "Wed, 30 May 2018 20:39:17 -0500",
    "subject": "thoughts to live by",
    "verse": "The wicked are trapped by their own words, but the godly escape such trouble. (Pro. 12:13)",
    "reflection": "Sinful people twist the facts to support their claims. Those who do this will eventually be trapped by their own lies. But for those who always tell the truth, the facts, plain and unvarnished, give an unshakable defense. If you find you always have to defend yourself to others, may be a sign that you are not always being honest.",
    "prayer": "Dear Heavenly Father, I pray that Your Spirit would always guide me in the way of the truth. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The wicked are trapped by their own words, but the godly escape _\n\n_such trouble. _(Pro. 12:13)\n\nTHOUGHT FOR TODAY:\n\nSinful people twist the facts to support their claims. Those who do\n\nthis will eventually be trapped by their own lies. But for those who\n\nalways tell the truth, the facts, plain and unvarnished, give an\nunshakable\n\ndefense. If you find you always have to defend yourself to others,\nmay\n\nbe a sign that you are not always being honest.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that Your Spirit would always guide me\n\nin the way of the truth. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163b8cdacbabc868",
    "date_utc": "Thu, 31 May 2018 19:44:37 -0500",
    "subject": "thoughts to live by",
    "verse": "People can get many good things by the words they say; the works of their hands also give them many benefits.",
    "reflection": "In the middle of what has been a gloomy message, God gives hope. Eventually the righteous will receive God's reward, and the wicked will receive their punishment. So let us keep holding on to God's truth and take heart! God will bring about justice in the end, and He will reward those who have been faithful.",
    "prayer": "Dear Heavenly Father, I thank You for the reward that You have promised to those who are faithful. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_People can get many good things by the words they say; the works_\n\n_of their hands also give them many benefits. _\n\nTHOUGHT FOR TODAY:\n\nIn the middle of what has been a gloomy message, God gives hope.\n\nEventually the righteous will receive God's reward, and the wicked\n\nwill receive their punishment. So let us keep holding on to God's\n\ntruth and take heart! God will bring about justice in the end, and He\n\nwill reward those who have been faithful.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for the reward that You have\n\npromised to those who are faithful. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]
