[
  {
    "message_id": "1663c4c72dbef31f",
    "date_utc": "Wed, 03 Oct 2018 18:38:55 -0500",
    "subject": "thoughts to live by",
    "verse": "I know that whatever God does is final. Nothing can be added to it or taken from it. God's purpose is this that people should fear Him. (Ec. 3:14)",
    "reflection": "So what is the purpose of life? It is that we should fear the all-powerful God. To FEAR God means to respect and stand in awe of Him because of who He is. 'Purpose' in life starts with whom we know, NOT with what we know or how good we are. It is IMPOSSIBLE to fulfill our God-given purpose UNLESS we revere God and give Him first place in our life.",
    "prayer": "Dear Lord, I thank You that everything was created by You with a purpose. I pray that you will forgive me for not living accordingly. I pray that You will forgive me for living selfishly and not thinking about the needs of others. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_I know that whatever God does is final. Nothing can be added to it_\n\n_or taken from it. God's purpose is this that people should fear\nHim._\n\n(Ec. 3:14)\n\nTHOUGHT FOR TODAY:\n\nSo what is the purpose of life? It is that we should fear the\nall-powerful\n\nGod. To FEAR God means to respect and stand in awe of Him because of\n\nwho He is. 'Purpose' in life starts with whom we know, NOT with what\n\nwe know or how good we are. It is IMPOSSIBLE to fulfill our God-given\n\npurpose UNLESS we revere God and give Him first place in our life.\n\nPRAYER FOR TODAY:\n\nDear Lord, I thank You that everything was created by You with a\npurpose.\n\nI pray that you will forgive me for not living accordingly. I pray\nthat You\n\nwill forgive me for living selfishly and not thinking about the needs\nof\n\nothers. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16641f0c8bd5eb8e",
    "date_utc": "Thu, 04 Oct 2018 20:56:31 -0500",
    "subject": "thoughts to live by",
    "verse": "That which is, has already been, that which IS to be, already has been; and God seeks what has been driven away. (Ec. 3:15)",
    "reflection": "The complaining we often hear is: There is nothing new under the sun! Lets not be negative today and focus on what God's Word says FOR TODAY: \"God seeks for what has been driven way. The one searching for meaning in life, should read this verse again. To avoid a meaningless life one needs to seek a closer relationship with God, justification based on God's favor toward us is on account of Christ and received through faith in Him.",
    "prayer": "Dear Heavenly Father, prepare me for Your judgment through Your Word and the marvelous news that You have already judged me as worthy of eternal life through the death and resurrection of Your Son, our Savior. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY\n\n_That which is, has already been, that which __IS __to be, already\nhas been;_\n\n_and God seeks what has been driven away. _(Ec. 3:15)\n\n_THOUGHT FOR TODAY:_\n\nThe complaining we often hear is: There is nothing new under the sun!\n\nLets not be negative today and focus on what God's Word says FOR\nTODAY:\n\n_\"God seeks for what has been driven way. _The one searching for\nmeaning\n\nin life, should read this verse again. To avoid a meaningless life\none needs\n\nto seek a closer relationship with God, justification based on God's\nfavor\n\ntoward us is on account of Christ and received through faith in Him.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, prepare me for Your judgment through Your Word\n\nand the marvelous news that You have already judged me as worthy of\n\neternal life through the death and resurrection of Your Son, our\nSavior.\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16646bc99cfdd749",
    "date_utc": "Fri, 05 Oct 2018 19:17:37 -0500",
    "subject": "thoughts to live by",
    "verse": "I also noticed that throughout the world there is evil in the courtroom, Yes even the courts of law are corrupt! (Ec. 3:16)",
    "reflection": "I don't thing I have to remind you of this fact that there is evil and corruption in the place where there should be justice. It even affects the legal system. Solomon asked how God's plan can be perfect when there is so much injustice and oppression in the world (4:1). He concluded that God does not ignore injustice but will bring it to an end at His appointed time (12:13, 14).",
    "prayer": "Dear Heavenly Father, we are seeing so much evil in our day. Because of this, there are people who find it easy to not believe in You. Help us remember that this life is not all there is, so please forgive us when we pass judgment on You, because we do not know everything. Your plan is to live with You forever, so help us to give thanks always. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_I also noticed that throughout the world th__ere is evil in the\ncourtroom,_\n\n_Yes even the courts of law are corrupt! _(Ec. 3:16)\n\nTHOUGHT FOR TODAY:\n\nI don't thing I have to remind you of this fact that there is evil\nand corruption\n\nin the place where there should be justice. It even affects the legal\nsystem.\n\nSolomon asked how God's plan can be perfect when there is so much\ninjustice\n\nand oppression in the world (4:1). He concluded that God does not\nignore\n\ninjustice but will bring it to an end at His appointed time\n(12:13,14).\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, we are seeing so much evil in our day. Because\n\nof this, there are people who find it easy to not believe in You.\nHelp us\n\nremember that this life is not all there is, so please forgive us\nwhen we\n\npass judgment on You, because we do not know everything. Your plan\n\nis to live with You forever, so help us to give thanks always. . .\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1664be76dc135f3b",
    "date_utc": "Sat, 06 Oct 2018 19:22:30 -0500",
    "subject": "thoughts to live by",
    "verse": "In due season God will judge everyone, both good and bad, for all their deeds. (Ec. 3:17)",
    "reflection": "Although God does not punish us immediately for our sins, His eventual judgment is certain. We do not know exactly when it will happen, but we know that no one will escape the final encounter with the Creator.",
    "prayer": "Dear Heavenly Father, as I deal with the problems of this life, I pray that Your Holy Spirit will guide me in my faith so that I will never drift from my faith in You. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_In due season God will judge everyone,_\n\n_both good and bad, for all their deeds. _(Ec. 3:17)\n\nTHOUGHT FOR TODAY:\n\nAlthough God does not punish us immediately for our sins,\n\nHis eventual judgment is certain. We do not know exactly\n\nwhen it will happen, but we know that no one will escape\n\nthe final encounter with the Creator.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, as I deal with the problems of\n\nthis life, I pray that Your Holy Spirit will guide me in\n\nmy faith so that I will never drift from my faith in You.\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1665106dfa1d4213",
    "date_utc": "Sun, 07 Oct 2018 19:14:57 -0500",
    "subject": "thoughts to live by",
    "verse": "I realize that God allows people to continue in their sinful ways so He can test them. That way, they can see for themselves that they are no better than animals. (Ec. 3:18)",
    "reflection": "Solomon makes an observance of mankind that is very judgmental, when he says mankind is no better then animals. But what do we hear and see when watching the news. Remember Scripture tells we were created as rational beings, BUT MANY have lost their true rationality, and so many are living irrationally, opposed to the righteousness of God.",
    "prayer": "Dear Lord, I pray that I would always be mindful of the path You want me to follow, I pray this in the name of Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_I realize that God allows people to continue in their sinful_\n\n_ways so He can test them. That way, they can see for themselves _\n\n_that they are no better than animals. _(Ec. 3:18)\n\nTHOUGHT FOR TODAY:\n\nSolomon makes an observance of mankind that is very judgmental,\n\nwhen he says mankind is no better then animals. But what do we hear\n\nand see when watching the news. Remember Scripture tells we were\n\ncreated as rational beings, BUT MANY have lost their true\nrationality, and\n\nso many are living irrationally, opposed to the righteousness of God.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would always be mindful of the path You\n\nwant me to follow, I pray this in the name of Jesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1665624a8299a315",
    "date_utc": "Mon, 08 Oct 2018 19:05:35 -0500",
    "subject": "thoughts to live by",
    "verse": "Solomon said \"I saw that there is nothing better for people than to be happy in their work. That is why they are here! No one will bring them back from death to enjoy life in the future. \"",
    "reflection": "Independent of God's revelation, we cannot know the future. Even when we are called into the majesty of heaven, it is unlikely that we shall see what is after us, but in the midst of eternal blessedness, would we really care?",
    "prayer": "Dear Heavenly Father, we have not kept Your Law as we should. We continually sin and fear death. We know through Your Holy Gospel by faith that all Your merits are ours freely through Christ. Death cannot harm us, for it will be swallowed up in victory. Praise be to You, O Lord. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nSolomon said _\"I saw that there is nothing better for people than_\n\n_to be happy in their work. That is why they are here! No one will_\n\n_bring them back from death to enjoy life in the future.\"_\n\nTHOUGHT FOR TODAY:\n\nIndependent of God's revelation, we cannot know the future. Even\n\nwhen we are called into the majesty of heaven, it is unlikely that\n\nwe shall see what is after us, but in the midst of eternal\nblessedness,\n\nwould we really care?\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, we have not kept Your Law as we should.We\n\ncontinually sin and fear death. We know through Your Holy Gospel\n\nby faith that all Your merits are ours freely through Christ. Death\n\ncannot harm us, for it will be swallowed up in victory. Praise be to\n\nYou, O Lord. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1665be5c16db1f75",
    "date_utc": "Tue, 09 Oct 2018 21:54:36 -0500",
    "subject": "thoughts to live by",
    "verse": "Solomon says; \"Then I observed that most people are motivated to success by their envy of their neighbors. But this, too, is meaningless, like chasing the wind\". . (Ec. 4:4)",
    "reflection": "The answer IS to work hard but with moderation. Take time to enjoy the other gifts God has given, and realize that it is God who gives out the assignments and the rewards, not us.",
    "prayer": "Dear Heavenly Father, I pray that I will always keep my focus on Your plan for me that is provided in Scriptures. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nSolomon says; \"_Then I observed that most people are motivated_\n\n_to success by their envy of their neighbors. But this, too, is _\n\n_meaningless, like chasing the wind\" . . _(Ec. 4:4)\n\nTHOUGHT FOR TODAY:\n\nThe answer IS to work hard but with moderation. Take time to\n\nenjoy the other gifts God has given, and realize that it is God\n\nwho gives out the assignments and the rewards, not us.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I will always keep my focus\n\non Your plan for me that is provided in Scriptures. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16660b6969ddd0b9",
    "date_utc": "Wed, 10 Oct 2018 20:21:11 -0500",
    "subject": "thoughts to live by",
    "verse": "It is better to be a poor but wise youth then to be an old and foolish king who refuses all advise. (Ec. 4:13)",
    "reflection": "Advancement or getting to the top is meaningless. Position, popularity, and prestige are poor goals for a life's work. Although many seek them, they are shadows without substance. How much better to seek God's approval. His love never changes.",
    "prayer": "Dear Heavenly Father, I pray that my goal in life would always meet with Your approval. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_It is better to be a poor but wise youth then to be an old and _\n\n_foolish king who refuses all advise. _(Ec. 4:13)\n\nTHOUGHT FOR TODAY:\n\nAdvancement or getting to the top is meaningless. Position,\n\npopularity, and prestige are poor goals for a life's work.\n\nAlthough many seek them, they are shadows without substance.\n\nHow much better to seek God's approval. His love never changes.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that my goal in life would\n\nalways meet with Your approval. . .Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16665e56ec459a06",
    "date_utc": "Thu, 11 Oct 2018 20:30:27 -0500",
    "subject": "thoughts to live by",
    "verse": "(The importance of fearing God) So when your make a promise to God, don't delay in following through, for God takes no pleasure in fools. Keep all the promises you make to Him. (Ec. 5:4)",
    "reflection": "Solomon warns his readers about making foolish promises to God. In Israelite culture, making vows was a serious matter. It is foolish to make a vow you cannot keep or to play games with God by only partially fulfilling your vow. (Pro. 20:25) It is better NOT TO vow than to make a vow to God and break it. If you make a vow keep it. (Mt. 5:33ff)",
    "prayer": "Dear Heavenly Father, I thank You for hearing my prayers, help me to remember the seriousness of making promises that I cannot keep Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY: (The importance of fearing God)\n\n_So when your make a promise to God, don't delay in following_\n\n_through, for God takes no pleasure in fools. Keep all the promises_\n\n_ you make to Him. _(Ec. 5 :4)\n\nTHOUGHT FOR TODAY:\n\nSolomon warns his readers about making foolish promises to God.\n\nIn Israelite culture, making vows was a serious matter. It is foolish\n\nto make a vow you cannot keep or to play games with God by only\n\npartially fulfilling your vow. (Pro. 20:25) It is better NOT TO vow\n\nthan to make a vow to God and break it. If you make a vow keep it.\n\n(Mt. 5:33ff)\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for hearing my prayers, help me\n\nto remember the seriousness of making promises that I cannot keep\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1666afac27841689",
    "date_utc": "Fri, 12 Oct 2018 20:11:51 -0500",
    "subject": "thoughts to live by",
    "verse": "THE FUTURE DETERMINED AND UNKNOWN: Everything has already been decided. It was known long ago what each person would be. So there is no use arguing what each person would be. So there is no use arguing with God about your destine. (Ec. 5:10)",
    "reflection": "God knows and directs everything that happens, and He is in complete control over our lives, even though at times it may not seem like it. How foolish it is for us to contend with our Creator, who knows us completely, and can see the future. SEE (Ro. 9:19-23)",
    "prayer": "Dear Lord, I thank You for being in control even though at times it seems hard to believe it. I pray that You will forgive me for sometimes doubting You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY: THE FUTURE DETERMINED AND UNKNOWN:\n\n_Everything has already been decided. It was known long_\n\n_ago what each person would be. So there is no use arguing _\n\nwhat each person would be._ So there is no use arguing with _\n\n_God about your destine._ (Ec. 5:10)\n\nTHOUGHT FOR TODAY:\n\nGod knows and directs everything that happens, and He is in\n\ncomplete control over our lives, even though at times it may\n\nnot seem like it. How foolish it is for us to contend with our\n\nCreator, who knows us completely, and can see the future.\n\nSEE (Ro. 9:19-23)\n\nPRAYER FOR TODAY:\n\nDear Lord, I thank You for being in control even though at\n\ntimes it seems hard to believe it. I pray that You will forgive\n\nme for sometimes doubting You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]
