[
  {
    "message_id": "10e086ba19cacdbb",
    "date_utc": "Mon, 2 Oct 2006 04:46:31 -0500",
    "subject": "thoughts to live by",
    "verse": "The disciples were wondering what Jesus meant when he said, 'in a little while you will see Me no more, and then after a little while you will see Me. ' Jesus saw that they wanted to ask Him about this, so He said to them, \"Are you asking one another what I meant when I said, 'In a little while you will see Me no more, and then after a little while you will see Me?' I tell you the truth you will weep and mourn while the world rejoices. You will grieve, but your grief will turn to joy.\" (John 16:19, 20) NIV",
    "reflection": "Our Meditation for Today: What a contrast between the disciples and the world! The world rejoiced while the disciples wept, but the disciple would see Jesus again (in three days) and rejoice. The world's values are often the opposite of God's values. This can cause Christians to feel like misfits. BUT even if life is difficult now, one day we will rejoice. Keep your eye on the future and on God's promises!!!",
    "prayer": "Dear Heavenly Father, I thank You for Your comforting presence. I thank You for Your promise to always be with us and Your promise to hear our prayers. Help me to be more patient with my eye on the future in expectation of Your return. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...Even a woodpecker owes his success \nto the fact that he uses his head...(2 Tim 4:5)\n\nOur Meditation for Today:\n\nThe disciples were wondering what Jesus meant when he said, 'in a little while\nyou will see Me no more, and then after a little while you will see Me.' \n\nJesus saw that they wanted to ask Him about this, so He said to them, \"Are\nyou asking one another what I meant when I said, 'In a little while you will see\nMe no more, and then after a little while you will see Me?' I tell you the truth\nyou will weep an mourn while the world rejoices. You will grieve, but your grief\nwill turn to joy.\"...(Jn. 16:19, 20) NIV \n\nOur Meditation for Today:\n\nWhat a contrast between the disciples and the world! The world rejoiced while \nthe disciples wept, but the disciple would see Jesus again (in three days) and\nrejoice...\n\nThe world's values are often the opposite of God's values. This can cause Christians\nto feel like misfits...BUT even if life is difficult now, one day we will rejoice...\n\nKeep your eye on the future and on God's promises!!!\n\nOur Prayer for Today:\n\nDear Heavenly Father, I thank You for Your comforting presence.\nI thank You for Your promise to always be with us and Your promise\nto hear our prayers. Help me to be more patient with my eye on\nthe future in expectation of Your return...Amen.\n\nKeep looking up, with your eye on the future...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e0d835e1fd5251",
    "date_utc": "Mon, 2 Oct 2006 18:20:54 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus said to His disciples, \"Though I have been speaking figuratively, a time is coming when I will no longer use this kind of language but will tell you plainly about My Father. In that day you will ask in My name. I am not saying that I will ask the Father on your behalf. No, the Father Himself loves you because you have loved Me and have believed that I came from God.\" (John 16:25-27) NIV",
    "reflection": "Jesus is talking about a new relationship between the believer and God. Before this people approached God through priests. After Jesus' resurrection. Any believer could approach God directly. A New day has dawned and now all believers are priests, talking with God personally and directly. This is what we see in Hebrews 10:17-23. We approach God, not because of our own merit, but because Jesus, our great High Priest, has made us acceptable to God.",
    "prayer": "Dear Heavenly Father, I thank You for the love we see described in John 3:16. I thank You for the Sacrifice Jesus was willing to make on my behalf on the cross. I thank You that because of that sacrifice we can now approach You without going before a worldly priest. I thank You for, that one on one relationship that is ours because of Christ. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...The poorest of all men is not the man without\na cent but the man without a dream...Pro. 29:18a\n\nOur Meditation for Today:\n\nJesus said to His disciples, \"Though I have been speaking figuratively, a time is coming\nwhen I will no longer use this kind of language but will tell you plainly about My Father...\n\nIn that day you will ask in My name. I am not saying that I will ask the Father on your\nbehalf...\n\nNo, the Father Himself loves you because you have loved Me and have believed that \nI came from God... (Jn. 16:25-27) NIV\n\nOur Thought for Today:\n\nJesus is talking about a new relationship between the believer and God. Before this\npeople approached God through priests...\n\nAfter Jesus' resurrection. any believer could approach God directly. A New day has \ndawned and now all believers are priests, talking with God personally and directly.\nThis is what we see in Heb. 10:17-23.\n\nWe approach God, not because of our own merit, but because Jesus, our great \nHigh Priest, has made us acceptable to God...\n\nOur Prayer for Today:\n\nDear Heavenly Father, I thank You for the love we see described in John 3:16.\nI thank You for the Sacrifice Jesus was willing to make on my behalf on the cross.\nI thank You that because of that sacrifice we can now approach You without \ngoing before a worldly priest...I thank You for, that one on one relationship that\nis ours because of Christ...Amen.\n\nKeep looking up, we have a true friend who cares for us...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e12add581b5d96",
    "date_utc": "Tue, 3 Oct 2006 18:49:04 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus said, \"A time is coming, and has come, when you will be scattered, each to his own home. You will leave Me alone. Yet I am not alone, for My Father is with Me. I have told you these things, so that in Me, you may have peace. In this world you will have trouble. But take heart! I have overcome the world.\" (John 16:32, 33) NIV",
    "reflection": "As Christians, we should expect continuing tension with an unbelieving world that is \"out of sync\" with Christ, His Good News, and His people. But we can take courage because He will not abandon us. We can expect our relationship with Christ to produce peace and comfort because we are \"in sync\" with Him. Let us remember the ultimate victory has already been won, we can claim the peace of Christ in the most troublesome times.",
    "prayer": "Dear Lord, I thank you for the promise that You will never leave us nor forsake us. I thank You for the peace that passeth all understanding. I thank You for the victory that You won for us on the cross. Search my heart O God and see if their be any wicked way in me. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...You can accomplish more in one hour with \nGod than one lifetime with out Him...Mt. 19:26b\n\nOur Meditation for Today:\n\nJesus said, \"A time is coming, and has come, when you will be scattered,\neach to his own home. You will leave Me alone. Yet I am not alone, for My \nFather is with Me.\n\nI have told you these things, so that in Me you may have peace. In this world\nyou will have trouble. But take heart! I have overcome the world...(Jn. 16:32, 33) NIV\n\nOur Thought for Today:\n\nAs Christians, we should expect continuing tension with an unbelieving\nworld that is \"out of sync\" with Christ, His Good News, and His people.\n\nBut we can take courage because He will not abandon us...\n\nWe can expect our relationship with Christ to produce peace and comfort \nbecause we are \"in sync\" with Him...\n\nLet us remember the ultimate victory has already been won, we can claim \nthe peace of Christ in the most troublesome times...\n\n\nOur Prayer for Today:\n\nDear Lord, I thank you for the promise that You will never leave us \nnor forsake us. I thank You for the peace that passeth all understanding.\nI thank You for the victory that You won for us on the cross...Search\nmy heart O God and see if their be any wicked way in me...Amen.\n\nKeep looking up, and receive His peace...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather...",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e17fba72929f71",
    "date_utc": "Wed, 4 Oct 2006 18:59:05 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus prays for Himself \"Father, the time has come. Glorify Your Son, that Your Son may glorify You. For You granted Him authority over all people that He might give eternal life to all those You have given to Him. Now this is eternal life: that they may know You, the only true God, and Jesus Christ, whom You have sent. (John 17:1-3) NIV",
    "reflection": "I do not know how many times I have been asked, \"How do we get eternal life?\" Here Jesus tells us clearly--by knowing God the Father Himself through His Son, Jesus Christ. Eternal life requires entering into a personal relationship with God in Jesus Christ. When we admit our sin and turn away from it, Christ's love lives in us by the Holy Spirit.",
    "prayer": "Dear Heavenly Father, I thank You that there is no more need for sacrifices. Lord I ask that you would forgive me for the sins I have committed and ask that You would help me to turn from them. Thank You once again for the gift of eternal life. I pray these things in Jesus name. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...The only preparation for tomorrow\nis the right use of today...Mt. 6:34\n\nOur Meditation for Today:\n\nJesus prays for Himself \"Father, the time has come. Glorify Your Son,\nthat Your Son may glorify You...\n\nFor You granted Him authority over all people that He might give eternal \nlife to all those You have given to Him...\n\nNow this is eternal life: that they may know You, the only true God, and \nJesus Christ, whom You have sent...(Jn 17:1-3) NIV\n\nOur Thought for Today:\n\nI do not know how many times I have been asked, \"How do we get eternal life?\"\n\nHere Jesus tells us clearly--by knowing God the Father Himself through His Son,\nJesus Christ...\n\nEternal life requires entering into a personal relationship with God in Jesus Christ.\n\nWhen we admit our sin and turn away from it, Christ's love lives in us by the Holy Spirit.\n\nOur Prayer for Today:\n\nDear Heavenly Father, I thank You that there is no more need for sacrifices.\nLord I ask that you would forgive me for the sins I have committed and ask \nthat You would help me to turn from them...Thank You once again for the gift \nof eternal life. I pray these things in Jesus name...Amen.\n\nKeep looking up, that you may grow in your relationship with Him...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e1af368692bef0",
    "date_utc": "Thu, 5 Oct 2006 19:07:36 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus' prayer: \"I have brought You glory on earth by completing the work You gave Me to do. And now, Father, glorify Me in Your presence with the glory I had with You before the world began.\" (John 17:4, 5) NIV",
    "reflection": "Before Jesus came to earth, He was one with God. At this point when His mission on earth was almost finished, Jesus was asking His Father to restore Him to His original place of honor and authority. Jesus resurrection and ascension--and Steven's dying exclamation (Acts 7:56) gives evidence to the fact that Jesus did return to His exalted position at the right hand of God. The fact that this took place is the assurance that a believer will one day inherit eternal life.",
    "prayer": "Dear Heavenly Father, I thank You for the work that was completed on Calvary. I thank You that the debt for my sins were paid in full. Forgive me for my sins of thought word and deed, my sins of omission and my sins of commission. Help me Lord to walk the paths of righteousness. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...\n\nJesus' prayer: \"I have brought You glory on earth by \ncompleting the work You gave Me to do...\n\nAnd now, Father, glorify Me in Your presence with the glory \nI had with You before the world began.\"...(Jn 17:4, 5) NIV\n\nOur Thought for Today:\n\nBefore Jesus came to earth, He was one with God...\n\nAt this point when His mission on earth was almost finished,\nJesus was asking His Father to restore Him to His original\nplace of honor and authority...\n\nJesus resurrection and ascension--and Steven's dying exclamation\n(Acts 7:56) gives evidence to the fact that Jesus did return to His\nexalted position at the right hand of God...\n\nThe fact that this took place is the assurance that a believer will one day\ninherit eternal life...\n\nOur Prayer for Today:\n\nDear Heavenly Father, I thank You for the work that was completed\non Calvary...I thank You that the debt for my sins were paid in full.\nForgive me for my sins of thought word and deed, my sins of omission\nand my sins of commission. Help me Lord to walk the paths of righteousness...Amen.\n\nKeep looking up, one day He will return the same way He left...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e222aac33d843e",
    "date_utc": "Fri, 6 Oct 2006 15:35:39 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus prays for His disciples, \"I pray for them. I am not praying for the world, but for those You have given me, for they are Yours. All I have is Yours, and all you have is mine. And glory has come to Me through them. (John 17:9, 10) NIV",
    "reflection": "Have you ever given any thought to what Jesus meant when He said, \"They are My glory\". God's glory is the revelation of His character and presence. The lives of Jesus' disciples reveal His character, and He is present to the world through them. What does your life reveal to those around you??? Does your live reveal Jesus' character and presence???",
    "prayer": "Dear Heavenly father, I pray that Your likeness would be visible in my life. Forgive me for drifting away from your presence, Help me to remain steadfast in Your will. Bless all my e-mail friends today. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...Two things are hard on the heart, running up stairs,\nand running down people...(see Eph. 4:29)\n\nOur Meditation for Today:\n\nJesus prays for His disciples, \"I pray for them. I am not praying for the world,\nbut for those You have given me, for they are Yours. All I have is Yours, and \nall you have is mine. And glory has come to Me through them... (Jn.17:9, 10) NIV\n\n\nOur Thought for Today:\n\nHave you ever given any thought to what Jesus meant when He said, \"They are My glory\".\n\nGod's glory is the revelation of His character and presence...\n\nThe lives of Jesus' disciples reveal His character, and He is present to the world through them.\n\nWhat does your life reveal to those around you???\n\nDoes your live reveal Jesus' character and presence???\n\nOur Prayer for Today:\n\nDear Heavenly father, I pray that Your likeness would be visible in my life...\nForgive me for drifting away from your presence, Help me to remain steadfast\nin Your will...Bless all my e-mail friends today...Amen.\n\nKeep looking up, and He will guide your way...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e2c7db9afe3509",
    "date_utc": "Sun, 8 Oct 2006 06:50:42 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus continues to pray for His disciples, as His followers we are included.\"While I was with them, I protected them and kept them safe by that name You gave Me. None has been lost except the one doomed for destruction so that Scriptures would be fulfilled. I am coming to You now, but I say these things while I am still in the world, so that 'they' (His followers) may have a full measure of My joy within them. (John 17:12-13) NIV",
    "reflection": "Jesus knew all along who would be the one to betray Him. Judas was the \"one headed for destruction, \" who was lost because he betrayed Jesus and never sought forgiveness. Judas chose his own path and suffered the consequences, just as we will if we chose not to seek forgiveness. One of the most common themes of Jesus' teachings is 'joy'. He wants us to be joyful--I think the saddest thing is to see Christians walk around with long faces. What kind of witness is that??? The key to immeasurable joy is living in intimate contact with Christ, the source of all joy. If we have an intimate relationship with Christ, we will experience God's special care and protection and see the victory He brings even when defeat seems certain. Do you want to be a better witness??? \"SMILE\"",
    "prayer": "Dear Heavenly Father, I pray that I would always have a smiley attitude while witnessing for You. Help me to always have a Christ-like attitude. Help me to go forth this week praising You. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...The best way to get even is to forget...\n(see Lk. 6:35)\n\nOur Meditation for Today:\n\nJesus continues to pray for His disciples, as His followers we are included...\n\"While I was with them, I protected them and kept them safe by that name\nYou gave Me. None has been lost except the one doomed for destruction\nso that Scriptures would be fulfilled...\n\nI am coming to You now, but I say these things while I am still in the world,\nso that 'they' (His followers) may have a full measure of My joy within them.\n(Jn. 17:12-13) NIV\n\nOur Thought for Today:\n\nJesus knew all along who would be the one to betray Him. Judas was the \n\"one headed for destruction,\" who was lost because he betrayed Jesus\nand never sought forgiveness...\n\nJudas chose his own path and suffered the consequences, just as we will\nif we chose not to seek forgiveness...\n\nOne of the most common themes of Jesus' teachings is 'joy'...\n\nHe wants us to be joyful--I think the saddest thing is to see Christians walk \naround with long faces...What kind of witness is that???\n\nThe key to immeasurable joy is living in intimate contact with Christ, \nthe source of all joy...\n\nIf we have an intimate relationship with Christ, we will experience God's special \ncare and protection and see the victory He brings even when defeat seems certain...\n\nDo you want to be a better witness??? \"SMILE\"\n\nOur Prayer for Today:\n\nDear Heavenly Father, I pray that I would always have a smiley attitude\nwhile witnessing for You. Help me to always have a Christ-like attitude.\nHelp me to go forth this week praising You...Amen.\n\nKeep looking up, and your joy will be complete...\nYou're in the prayers of two who care...\nPastor AL & Marcie Sather\n\nSMILE GOD LOVES YOU!!!",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e31a455a7af3fe",
    "date_utc": "Mon, 9 Oct 2006 13:17:52 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus continues to pray: \"I have given them Your Word, and the world has hated them, for they are not of the world any more than I am of the world.\" (John 17:14) NIV",
    "reflection": "The world has actually hated Christians, since they have come to realize the one true God. The reason the world hates Christians is because Christian values differ from the wold. Because Christ's followers don't cooperate with the world by joining in on their sins, they are living accusations against the world's immorality. The world follows Satan's agenda, and Satan is the avowed enemy of Jesus and His people.",
    "prayer": "Dear Heavenly Father, I pray for the ability to always avoid Satan's sly tricks. Give me a discerning heart, that I may never stray from the truth, so that I would always be a living example to each person I come into contact with. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...People don't care how much you know\nuntil they know how much you care...(see Phil. 2:3)\n\nOur Meditation for Today:\n\nJesus continues to pray: \"I have given them Your Word, and the world has hated them, \nfor they are not of the world any more than I am of the world.\" (Jn 17:14) NIV\n\nOur Thought for Today:\n\nThe world has actually hated Christians, since they have come to realize the one true God...\n\nThe reason the world hates Christians is because Christian values differ from the wold.\n\nBecause Christ's followers don't cooperate with the world by joining in on their sins,\nthey are living accusations against the world's immorality...\n\nThe world follows Satan's agenda, and Satan is the avowed enemy of Jesus and His people...\n\nOur Prayer for Today:\n\nDear Heavenly Father, I pray for the ability to always avoid Satan's\nsly tricks...Give me a discerning heart, that I may never stray from\nthe truth, so that I would always be a living example to each person \nI come into contact with...Amen.\n\nKeep Looking Up, He is seeking faithful followers...\nYou're in the prayers of two who care....\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e36cd5d48e765e",
    "date_utc": "Tue, 10 Oct 2006 15:15:40 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus continues to pray for His disciples, \"Sanctify them by the truth, Your Word is truth.\" John 17:17) NIV",
    "reflection": "A follower of Christ becomes pure and holy through believing the Word of God (Hebrews 4:12). He or she has already accepted forgiveness through Christ's sacrificial death (Hebrews 4:12). Yes daily application for God's Word will have a purifying effect on our minds and hearts. Scripture points out sin, it motivates us to confess, it renews our relationship with Christ, and it guides us back to the right path.",
    "prayer": "Dear Heavenly Father I thank You for the life changing power of Your Word. I pray that I would always be sensitive to You Holy Spirit's working in my heart. Awaken in me a greater hunger for Your Word, I pray ithese things in Jesus name. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought...Humor is to life what shock absorbers\nare to automobiles...(see Pro. 17:22)\n\nOur Meditation for Today:\n\nJesus continues to pray for His disciples, \"Sanctify them by the truth, \nYour Word is truth.\" Jn. 17:17) NIV\n\nOur Thought for Today:\n\nA follower of Christ becomes pure and holy through believing the Word of God (Heb. 4:12).\n\nHe or she has already accepted forgiveness through Christ's sacrificial death (Heb. 4:12).\n\nYes daily application for God's Word will have a purifying effect on our minds and hearts...\n\nScripture points out sin, it motivates us to confess, it renews our relationship with Christ,\nand it guides us back to the right path...\n\nOur Prayer for Today:\n\nDear Heavenly Father I thank You for the life changing power of Your Word...\nI pray that I would always be sensitive to You Holy Spirit's working in my heart...\nAwaken in me a greater hunger for Your Word, I pray ithese things in Jesus name...Amen.\n\nKeep looking up, for His protection today...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e3bbf651ad44d9",
    "date_utc": "Wed, 11 Oct 2006 16:12:28 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus continues with His prayer, \"As You sent Me into the world, I have sent them into the world. For them I sanctify Myself, that they too may be truly sanctified.\" (John 17:18, 19) NIV",
    "reflection": "Jesus didn't ask the Father to take believers out of the world, but instead to use them in the world. Because Jesus gives us the command to go out into the world, we should not try to escape from the world, nor should we avoid all relationships with non-Christians. We are called to be the salt and light (Matthew 5:13-16), and we are to do the work that God sent us to do. One of His greatest wishes is that we would be truly sanctified, in other words made truly holy.",
    "prayer": "Dear Heavenly Father, Going out into the world to minister to the unbelieving seems like an awesome task, when we leave You out, but all things are possible when we include You. . Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...A man wrapped up in himself makes\na very small package...(see Pro. 18:2)\n\nOur Meditation for Today:\n\nJesus continues with His prayer, \"As You sent Me into the world, I have sent them \ninto the world. For them I sanctify Myself, that they too may be truly sanctified.\" (Jn 17:18, 19) NIV\n\nOur Thought for Today:\n\nJesus didn't ask the Father to take believers out of the world, but instead to use them in the world.\n\nBecause Jesus gives us the command to go out into the world, we should not try to escape from\nthe world, nor should we avoid all relationships with non-Christians...\n\nWe are called to be the salt and light (Mt. 5:13-16), and we are to do the work that God sent us to do...\n\nOne of His greatest wishes is that we would be truly sanctified, in other words made truly holy...\n\nOur Prayer for Today:\n\nDear Heavenly Father, Going out into the world to minister to the\nunbelieving seems like an awesome task, when we leave You out,\nbut all things are possible when we include You....Amen.\n\nKeep looking up, and pray for His sanctifying power...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e4125b97f164a5",
    "date_utc": "Thu, 12 Oct 2006 16:07:50 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus prays for all believers, \"My prayer is not for them alone. I pray also for those who will believe in Me through their message.\" (John 17:20) NIV",
    "reflection": "The unity that Jesus is praying for is not organizational unity but spiritual unity. His prayer is for all those who will follow Him, including you and others you know. He also prayed for unity in (17:11), protection from the evil one (17:15), and holiness (17:17). Knowing that Jesus prayed for us should give us confidence as we work for the Kingdom. \\",
    "prayer": "Dear Heavenly Father, I thank You for this intercessory prayer. I thank You for the assurance it brings that you truly love us. I thank You for the confidence it gives that You care and are watching over us and that we have protection from the evil one. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...It isn't your position that makes you happy or\nunhappy, it's your disposition. (see I Tim 6:6, 7)\n\nOur Meditation for Today:\n\nJesus prays for all believers, \"My prayer is not for them alone. I pray also for those who\nwill believe in Me through their message.\" (Jn. 17:20) NIV\n\nOur Thought for Today:\n\nThe unity that Jesus is praying for is not organizational unity but spiritual unity...\n\nHis prayer is for all those who will follow Him, including you and others you know...\n\nHe also prayed for unity in (17:11), protection from the evil one (17:15), and holiness (17:17)...\n\nKnowing that Jesus prayed for us should give us confidence as we work for the Kingdom...\\\n\nOur Prayer for Today:\n\nDear Heavenly Father, I thank You for this intercessory prayer.\nI thank You for the assurance it brings that you truly love us.\nI thank You for the confidence it gives that You care and are\nwatching over us and that we have protection from the evil one...Amen.\n\nKeep looking up, He wants to bless you today...\nYou're in the prayers of Two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e4639e650746f1",
    "date_utc": "Fri, 13 Oct 2006 18:39:30 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus is arrested, \"Then Simon Peter, who had a sword, drew it and struck the high priest's servant, cutting off his right ear. (the servants name was Malchus. ) Jesus commanded Peter, \"Put your sword away! Shall I not drink the cup the Father has given Me?\" (John 18:10, 11) NIV",
    "reflection": "Trying to protect Jesus, Peter pulled a sword and wounded the high priest's servant. But Jesus told Peter to put away his sword and allow God's plan to unfold. At times it is tempting to take matters into our own hands, to force the issue. Most often such moves lead to sin. Instead, we must trust God to work out His plan. Think about it, if Peter had his way, Jesus would not have went to the cross, and God's plan of redemption would have been thwarted.",
    "prayer": "Dear heavenly Father, how great it is when we allow Your plans to run the course. Help me Lord to be more patient, that I may see Your plan unfold. Help me to put full trust in You. Forgive me for my impatience and weak faith. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...It takes more to plow a field than merely turning \nit over in your mind. (see 1 Thess. 4:11, 12)\n\nOur Meditation for Today:\n\nJesus is arrested, \"Then Simon Peter, who had a sword, drew it and struck \nthe high priest's servant, cutting off his right ear. (the servants name was Malchus.) \n\nJesus commanded Peter, \"Put your sword away! Shall I not drink the cup the Father \nhas given Me?\" (Jn 18:10, 11) NIV\n\nOur Thought for Today:\n\nTrying to protect Jesus, Peter pulled a sword and wounded the high priest's servant.\nBut Jesus told Peter to put away his sword and allow God's plan to unfold...\n\nAt times it is tempting to take matters into our own hands, to force the issue.\nMost often such moves lead to sin...\n\nInstead, we must trust God to work out His plan. Think about it, if Peter had had his \nway, Jesus would not have went to the cross, and God's plan of redemption would\nhave been thwarted...\n\nOur Prayer for Today:\n\nDear heavenly Father, how great it is when we allow Your plans\nto run the course. Help me Lord to be more patient, that I may\nsee Your plan unfold. Help me to put full trust in You. Forgive me\nfor my impatience and weak faith...Amen.\n\nKeep looking up, put your trust in Him...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e507ef46b467c2",
    "date_utc": "Sun, 15 Oct 2006 21:44:02 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus before the High priest: Meanwhile, the high priest questioned Jesus about His disciple and His teaching.\"I have spoken openly to the world, \" Jesus replied.\"I always taught in the synagogue, or at the temple, where all the Jews come together. I said nothing in secret. Why question Me? ask those who heard Me. Surely they know what I said.\" (John 18:19-21) NIV",
    "reflection": "Jesus had been teaching, preaching, and healing. These were the three main aspects of His ministry. Teaching showed Jesus' concern for understanding; preaching showed His concern for commitment; and healing showed His concern for wholeness. His miracles of healing authenticated His teaching and preaching, proving He was from God. Jesus is the authentic Christ--the Savior of the world. Everything He accomplished Him to be all that the Bible says He is.",
    "prayer": "Dear Heavenly Father, As I think about Jesus' ordeal and the humiliation that He endured, the pain that he suffered that the whole world may have their sins forgive by the sacrifice that He made, it tugs at my heart. to think that He would take my sins upon Himself for my redemption; it is hard to phantom such love. and so I can only accept by faith this great gift and merely say thank You Lord. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought...Men are like fish. Neither would get in trouble\nif they would keep their mouth shut...(Pro. 21:23)\n\nOur Meditation for Today:\n\nJesus before the High priest: Meanwhile, the high priest questioned Jesus \nabout His disciple and His teaching. \n\n\"I have spoken openly to the world,\" Jesus replied.\"I always taught in the synagogue, \nor at the temple, where all the Jews come together. I said nothing in secret. \nWhy question Me? ask those who heard Me. Surely they know what I said.\" (Jn 18: 19-21) NIV\n\nOur Thought for Today:\n\nJesus had been teaching, preaching, and healing. These were the three main aspects\nof His ministry. \n\nTeaching showed Jesus' concern for understanding; preaching showed His concern\nfor commitment; and healing showed His concern for wholeness...His miracles of healing \nauthenticated His teaching and preaching, proving He was from God...\n\nJesus is the authentic Christ--the Savior of the world...Everything He accomplished Him \nto be all that the Bible says He is...\n\nOur Prayer for Today:\n\nDear Heavenly Father, As I think about Jesus' ordeal and the humiliation that\nHe endured, the pain that he suffered that the whole world may have their sins \nforgive by the sacrifice that He made, it tugs at my heart. to think that He would\ntake my sins upon Himself for my redemption; it is hard to phantom such love.\nand so I can only accept by faith this great gift and merely say thank You Lord...Amen.\n\nKeep looking up, there is no friend like Jesus...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e5ff4d63b7af2e",
    "date_utc": "Wed, 18 Oct 2006 17:15:40 -0500",
    "subject": "thoughts to live by",
    "verse": "Then the Jews led Jesus from Caiaphas to the palace of the Roman Governor. By now it was early morning, and to avoid ceremonial uncleanness the Jews did not enter the palace; they wanted to be able to eat the Pass Over. So Pilate came out to them and asked, \"what charges are you bring against this man?\" \"If He were not a criminal, \" they said, \"we would not have handed Him over to you.\" (John 18:28-30) NIV",
    "reflection": "It is strange how these Jewish leaders were more concerned about their ceremonial laws than the were about putting to death an innocent person. They kept the ceremonial requirements of their religion while harboring murder and treachery in their hearts. When asked what the charges were, they couldn't even give an answer. But is our sin any less, when we neglect to attend worship--or when we neglect to give thanks, or when we neglect to give to the poor??? Didn't Jesus Himself say whatever you do onto the least of these you do to Me??? When we neglect to do these things we are really disobeying our Lord, We may not have outright murder in our heart. But being disobedient is the same as saying the Lord's will is unimportant.",
    "prayer": "Dear Heavenly Father, cleanse my heart of all unrighteousness. Help me to be more faithful. Restore a right heart in me, that I may not sin against you. Bless all my friends and keep them safe. Keep looking up, bring your requests to Him. Amen. ",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...You can easily determine the caliber of a person by the\namount of opposition it takes to discourage him...(see Pro. 24:10)\n\nOur Meditation for Today:\n\nThen the Jews led Jesus from Caiaphas to the palace of the Roman Governor.\nBy now it was early morning, and to avoid ceremonial uncleanness the Jews did \nnot enter the palace; they wanted to be able to eat the Pass Over...\n\nSo Pilate came out to them and asked, \"what charges are you bring against this \nman?\"\n\n\"If He were not a criminal,\" they said, \"we would not have handed Him over to you.\"\n(Jn. 18:28-30) NIV\n\nOur Thought for Today:\n\nIt is strange how these Jewish leaders were more concerned about their ceremonial\nlaws than the were about putting to death an innocent person...\n\nThey kept the ceremonial requirements of their religion while harboring murder and\ntreachery in their hearts...\n\nWhen asked what the charges were, they couldn't even give an answer...\n\nBut is our sin any less, when we neglect to attend worship--or when we neglect to give\nthanks, or when we neglect to give to the poor??? Didn't Jesus Himself say what-ever\nyou do onto the least of these you do to Me???\n\nWhen we neglect to do these things we are really disobeying our Lord, We may not have \noutright murder in our heart...But being disobedient is the same as saying the Lord's will\nis unimportant...\n\nOur Prayer for Today:\n\nDear Heavenly Father, cleanse my heart of all unrighteousness.\nHelp me to be more faithful...Restore a right heart in me, that I\nmay not sin against you...Bless all my e-mail friends and keep\nthem safe...\n\nKeep looking up, bring your requests to Him...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e6517b13a2bd2d",
    "date_utc": "Thu, 19 Oct 2006 16:31:25 -0500",
    "subject": "thoughts to live by",
    "verse": "Pilate asked Jesus, \"Are you the king of the Jews?\" Jesus answered, \"Is that your own idea, or did others talk to you about Me.\" Pilate answered, \"Am I a Jew? It was Your people and Your chief priest who handed You over to me. What is it You have done?\" Jesus said, \"My kingdom is not of this world. If it were My servant would fight to prevent My arrest by the Jews. But now My kingdom is from another place.\" (John 18:33-36) NIV",
    "reflection": "Pilate asked Jesus a straight forward question, and Jesus answer clearly. Jesus is a King, but whose Kingdom is not of this world. There seems to be no question in Pilate's mind that Jesus spoke the truth and was innocent of any crime. It also seems apparent that while recognizing the truth, Pilate chose to reject it. It is a tragedy when we fail to recognize the truth. It is even a greater tragedy when we recognize the truth but fail to heed it.",
    "prayer": "Dear Lord, Help me to always recognize the truth and then act upon it. guide me in Your path of righteousness for Your name sake. Protect me from any and all doubts. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...People know what you are by what they see,\nnot by what they hear. (See Mt. 5:16)\n\nOur Meditation for Today:\n\nPilate asked Jesus, \"Are you the king of the Jews?\" Jesus answered, \"Is that your\nown idea, or did others talk to you about Me.\"\n\nPilate answered, Am I a Jew?\" It was Your people and Your chief priest who handed\nYou over to me. What is it You have done?\"\n\nJesus said, \"My kingdom is not of this world. If it were My servant would fight to\nprevent My arrest by the Jews. But now My kingdom is from another place. (Jn. 18:33-36) NIV\n\nOur Thought for Today:\n\nPilate asked Jesus a straight forward question, and Jesus answer clearly. Jesus is\na King, but whose Kingdom is not of this world.\n\nThere seems to be no question in Pilate's mind that Jesus spoke the truth and was \ninnocent of any crime. It also seems apparent that while recognizing the truth, Pilate\nchose to reject it.\n\nIt is a tragedy when we fail to recognize the truth. It is even a greater tragedy when \nwe recognize the truth but fail to heed it.\n\nOur Prayer for Today:\n\nDear Lord, Help me to always recognize the truth and then act upon it.\nguide me in Your path of righteousness for Your name sake. Protect \nme from any and all doubts...Amen.\n\nKeep looking up, and He will guide you...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e6a352332b808f",
    "date_utc": "Fri, 20 Oct 2006 19:30:44 -0500",
    "subject": "thoughts to live by",
    "verse": "\"What is truth?\" Pilate asked. With this he went out again to the Jews and said, \"I find no basis for a charge against him.\" (John 18:38) NIV",
    "reflection": "Pilate was cynical; he thought that all truth was relative. To many government officials, truth was whatever the majority of people agreed with or whatever helped advance their personal power and political goal. When there is no basis for truth, there is no basis for moral right or wrong. Justice becomes whatever works or whatever helps those in power. In Jesus and His Word we have a standard for truth and for our moral behavior.",
    "prayer": "Dear Heavenly Father, I thank You for Your Word, for Your Word is Truth, sanctify me in Your truth. Continue to guide me in all truth, that I might be a better witness for You. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...People who try to whittle you down are only\ntrying to reduce you to their size...(see Lk. 6:22, 23a)\n\nOur Meditation for Today:\n\n\"What is truth?\" Pilate asked. With this he went out again to the \nJews and said, \"I find no basis for a charge against him.\" (Jn. 18:38) NIV\n\nOur Thought for Today:\n\nPilate was cynical; he thought that all truth was relative. To many government \nofficials, truth was whatever the majority of people agreed with or whatever \nhelped advance their personal power and political goal...\n\nWhen there is no basis for truth, there is no basis for moral right or wrong.\nJustice becomes whatever works or whatever helps those in power...\n\nIn Jesus and His Word we have a standard for truth and for our moral behavior...\n\nOur Prayer for Today:\n\nDear Heavenly Father, I thank You for Your Word, for Your Word is Truth, \nsanctify me in Your truth. Continue to guide me in all truth, that I might be\na better witness for You...Amen.\n\nKeep looking up, for all truth comes from Him...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather\n\nHave a blessed weekend!!!",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e74794429033fd",
    "date_utc": "Sun, 22 Oct 2006 16:09:10 -0500",
    "subject": "thoughts to live by",
    "verse": "The Jews insisted, \"We have a law, and according to that law he must die, because he claimed to be the Son of God.\" When Pilate heard this, he was even more afraid, and he went back inside the palace. \"Where do you come from?\" he asked Jesus, but Jesus gave him no answer. \"Do you refuse to speak to me?\" Pilate said. \"Don't you realize I have the power either to free you or to crucify you?\" Jesus answered, \"You would have no power over Me if it were not given to you from above. Therefore the one who handed Me over to you is guilty of a greater sin.\" (John 19:8-11) NIV",
    "reflection": "Throughout the trail we see that Jesus was in control, not Pilate or the religious leaders. Throughout the trial Pilate wavered in his opinion of Jesus, the Jewish leaders reacted out of hatred and anger, but Jesus remained composed. He knew the truth, He knew God's plan, and He knew the reason for His trial. Despite the pressure and the persecution, Jesus remained unmoved. It was really Pilate and the religious leaders who were on trial, not Jesus. . If you are ever questioned or ridiculed because of your faith, remember that while you may be on trial before your accusers, they are on trial before God.",
    "prayer": "Dear Heavenly Father, I am so thankful that I have never been ridiculed for my faith, but if the time ever comes when I am, I pray that I would remain faithful no matter what the consequences. I pray that I would remember what You went through for Me. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...Quite often when a man thinks his mind is getting broader,\nIt's only his conscience stretching...(see Titus 1:15)\n\nOur Meditation for Today:\n\nThe Jews insisted, \"We have a law, and according to that law he must die,\"\nbecause he claimed to be the Son of God.\"\n\nWhen Pilate heard this, he was even more afraid, and he went back inside\nthe palace.\"Where do you come from?\" he asked Jesus, but Jesus gave \nhim no answer.\n\n\"Do you refuse to speak to me?\" Pilate said.\"Don't you realize I have the \npower either to free you or to crucify you?\"\n\nJesus answered, \"You would have no power over Me if it were not given to\nyou from above. Therefore the one who handed Me over to you is guilty of\na greater sin.\" (Jn. 19:8-11) NIV\n\nOur Thought for Today:\n\nThroughout the trail we see that Jesus was in control, not Pilate or the religious leaders.\n\nThroughout the trial Pilate wavered in his opinion of Jesus, the Jewish leaders reacted \nout of hatred and anger, but Jesus remained composed. He knew the truth, He knew God's\nplan, and He knew the reason for His trial...\n\nDespite the pressure and the persecution, Jesus remained unmoved. It was really Pilate \nand the religious leaders who were on trial, not Jesus....\n\nIf you are ever questioned or ridiculed because of your faith, remember that while you may \nbe on trial before your accusers, they are on trial before God...\n\nOur Prayer for Today:\n\nDear Heavenly Father, I am so thankful that I have never been ridiculed for my faith,\nbut if the time ever comes when I am, I pray that I would remain faithful no matter what\nthe consequences. I pray that I would remember what You went through for Me...Amen.\n\nKeep looking up, for strength in times of trial and tribulation...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e79b82dc0c113e",
    "date_utc": "Mon, 23 Oct 2006 16:25:02 -0500",
    "subject": "thoughts to live by",
    "verse": "In vs. 11 Jesus assured Pilate that he had no power over Him were it not given to him from above. From then on, Pilate tried to set Jesus free, but the Jews kept on shouting, \"If you let this man go, you are no friend of Caesar. Anyone who claims to be a king opposes Caesar.\" When Pilate heard this, he brought Jesus out and sat down on the judge's seat at a place known as the Stone Pavement (which in Aramaic\" is Gabbatha) (John 19:12, 13) NIV",
    "reflection": "These words spoken by the Jews pressured Pilate into allowing Jesus to be crucified. As the Roman Governor of the area, Pilate was expected to keep the peace. Because Rome could not afford to keep large numbers of troops in the outlying regions, they maintained control by crushing rebellions immediately with brute force. Pilate was afraid that reports to Caesar of insurrection in his region would cost him his job and perhaps even his life. When we face a tough decision, we can take the easy way out, or we can stand up for what is right regardless of the cost. If we know the good we ought to do and don't do it, we sin (James 4:17).",
    "prayer": "Dear Heavenly Father, help me to always make the right decisions, and not take the easy way out. Help me to always stand up for what is right no matter what the cost. Bless and keep my e-mail friends safe, let no temptation befall them that is uncommon to man. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...Temper is what gets most of us in trouble.\nPride is what keeps us there...(see Pro. 16:18, 19)\n\nOur Meditation for Today:\n\nIn vs. 11 Jesus assured Pilate that he had no power over Him were it not \ngiven to him from above...\n\nFrom then on, Pilate tried to set Jesus free, but the Jews kept on shouting,\n\"If you let this man go, you are no friend of Caesar. Anyone who claims to \nbe a king opposes Caesar.\"\n\nWhen Pilate heard this, he brought Jesus out and sat down on the judge's \nseat at a place known as the Stone Pavement (which in Aramaic\" is Gabbatha) \n(Jn. 19:12, 13) NIV\n\nOur Thought for Today:\n\nThese words spoken by the Jews pressured Pilate into allowing Jesus to be\ncrucified. As the Roman Governor of the area, Pilate was expected to keep\nthe peace...\n\nBecause Rome could not afford to keep large numbers of troops in the outlying\nregions, they maintained control by crushing rebellions immediately with brute\nforce...\n\nPilate was afraid that reports to Caesar of insurrection in his region would cost him \nhis job and perhaps even his life...\n\nWhen we face a tough decision, we can take the easy way out, or we can stand up\nfor what is right regardless of the cost. If we know the good we ought to do and\ndon't do it, we sin (James 4:17)...\n\nOur Prayer for Today:\n\nDear Heavenly Father, help me to always make the right decisions,\nand not take the easy way out. Help me to always stand up for what\nis right no matter what the cost. Bless and keep my e-mail friends\nsafe, let no temptation befall them that is uncommon to man...Amen.\n\nKeep looking up, we have no truer friend then Jesus...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e7edb42735a750",
    "date_utc": "Tue, 24 Oct 2006 16:17:24 -0500",
    "subject": "thoughts to live by",
    "verse": "It was the day of Preparation of the Passover; it was about noon. Here is your king, Pilate said to the Jews. But they shouted, Take him away! Take him away! Crucify him! Shall I crucify your king? Pilate asked. We have no king but Caesar, the chief priests answered. (John 19:14, 15) NIV",
    "reflection": "The Jewish leaders were so desperate to get rid of Jesus that, despite their intense hatred for Rome, they shouted \"We have no king but Caesar.\" How ironic that they claimed that their allegiance was to Rome, rejecting their own Messiah! Their own words condemned them, for God was to be their only true King, and they had abandoned every trace of loyalty to Him. The priests had truly lost their reason for existence, instead of turning people to God, they claimed allegiance to Rome in order to kill the Messiah.",
    "prayer": "Dear Heavenly Father, I pray for the strength to always remain faithful to You. I pray that at the end times when the persecution of all believers takes place, I would not go with the crowd, but that I would remain in the light. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...We make a living by what we get, we make\na life by what we give...(see Acts 20:35).\n\nOur Meditation for Today:\n\nIt was the day of preparation of Passover Week, about the sixth hour.\n\"Here is your king,\" Pilate said to the Jews.\n\nBut they shouted, \"Take him away! Take Him away! Crucify him!\"\n\nShall I crucify your king?\" Pilate asked.\n\n\"We have no king but Caesar,\" the chief priests answered...(Jn 19:14, 15) NIV\n\nOur Thought for Today:\n\nThe Jewish leaders were so desperate to get rid of Jesus that, despite their \nintense hatred for Rome, they shouted \"We have no king but Caesar.\"\n\nHow ironic that they claimed that their allegiance was to Rome, rejecting their \nown Messiah! Their own words condemned them, for God was to be their only \ntrue King, and they had abandoned every trace of loyalty to Him...\n\nThe priests had truly lost their reason for existence, instead of turning people to God,\nthey claimed allegiance to Rome in order to kill the Messiah...\n\nOur Prayer for Today:\n\nDear Heavenly Father, I pray for the strength to always remain faithful to You.\nI pray that at the end times when the persecution of all believers takes place, \nI would not go with the crowd, but that I would remain in the light...Amen.\n\nKeep looking up, He will return one day as He said He would...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e83f80dd2eefc1",
    "date_utc": "Wed, 25 Oct 2006 15:33:15 -0500",
    "subject": "thoughts to live by",
    "verse": "Finally Pilate handed Him over to them to be crucified. so the soldiers took charge of Jesus. Carrying His own cross, He went out to the place of the Skull (which in Aramaic is called Golgotha). Here they crucified him, and with Him two others, one on each side and Jesus in the middle. Pilate had a notice prepared and fastened to the cross. It read: JESUS OF NAZARETH, THE KING OF THE JEWS. (John 19:16-19) NIV",
    "reflection": "Yes He was crucified, the most horrible death that was ever afflicted upon another human being The sign that Pilate had placed about Jesus' head, read, JESUS OF NAZARETH, THE KING OF THE JEWS, was meant to be a mockery. A king stripped nearly naked and executed in public view, would seemingly cause most to believe that He had lost His kingdom forever. BUT Jesus, who turns the worlds wisdom upside down, was just coming into His Kingdom. His death and resurrection would strike the deathblow to Satan's rule and would establish Jesus' eternal authority over the earth. Few people reading the sign that bleak afternoon understood it's real meaning, but the sign was absolutely true. All was not lost. Jesus was King of the Jews, and the Gentiles, and of the whole world. Have you accepted Him as your king???",
    "prayer": "Dear Heavenly Father, It is hard to phantom the kind of love You showed the day You took my place on the cross. May my love for You be evident each and every day. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...Our days are identical suitcases, all the same size, but some \npeople can pack more into them than others...(see Eph. 5:15, 16)\n\nOur Meditation for Today:\n\nFinally Pilate handed Him over to them to be crucified. \nso the soldiers took charge of Jesus...\n\nCarrying His own cross, He went out to the place of the \nSkull (which in Aramaic is called Golgotha). Here they \ncrucified him, and with Him two others, one on each side \nand Jesus in the middle.\n\nPilate had a notice prepared and fastened to the cross.\nIt read: JESUS OF NAZARETH, THE KING OF THE \nJEWS...(Jn.19:16-19) NIV\n\nOur Thought for Today:\n\nYes He was crucified, the most horrible death that was ever afflicted\nupon another human being\n\nThe sign that Pilate had placed about Jesus' head, read, JESUS OF \nNAZARETH, THE KING OF THE JEWS, was meant to be a mockery.\n\nA king stripped nearly naked and executed in public view, would seemingly\ncause most to believe that He had lost His kingdom forever...\n\nBUT Jesus, who turns the worlds wisdom upside down, was just coming into\nHis Kingdom. His death and resurrection would strike the deathblow to \nSatan's rule and would establish Jesus' eternal authority over the earth...\n\nFew people reading the sign that bleak afternoon understood it's real meaning,\nbut the sign was absolutely true...\n\nAll was not lost. Jesus was King of the Jews, and the Gentiles, and of the \nwhole world...Have you accepted Him as your king???\n\nOur Prayer for Today:\n\nDear Heavenly Father, It is hard to phantom the kind of love You showed\nthe day You took my place on the cross...May my love for You be evident\neach and every day...Amen.\n\nKeep looking up and keep plugging away for Jesus...\nYou're in the Prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e892946a77322a",
    "date_utc": "Thu, 26 Oct 2006 12:59:38 -0500",
    "subject": "thoughts to live by",
    "verse": "When the soldiers crucified Jesus, they took His clothes, divided them into four shares, one for each of them, with the undergarment remaining. This garment was seamless, woven in one piece from top to bottom.\"Let's not tear it, \" they said to one another.\"\"Let's decide by lot who will get it.\" This happened that the scriptures might be fulfill which said, \"They divided my garments among them, and cast lots for my clothing.\" So this is what the soldiers did. (John 19:23, 24) NIV",
    "reflection": "Roman soldiers in charge of the crucified customarily took for themselves the clothes of the condemned men. They divided Jesus' clothing, throwing dice to determine who would get His seamless garment, the most valuable piece of clothing. This fulfilled the prophecy in Psalms 22:18. Are you gambling away your eternal life, by saying \"one day\" when I get older? What will happen if the Lord calls before you get any older? What happens is, you will spend eternity separated from the Lord. Isaiah 55:6 tells us: Seek the Lord while He may be found; call upon Him while He is near.",
    "prayer": "Dear Lord, I do not wish to gamble away the home You have prepared for those who are faithful and just. Forgive me all my sins, and wash me white as snow. Guide me in paths of righteousness, for Your name sake. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...Living would be easier if men showed as much patience \nat home as they do when they are fishing...(see 1 Pet. 3:7b)\n\nOur Meditation for Today:\n\nWhen the soldiers crucified Jesus, they took His clothes, divided them into\nfour shares, one for each of them, with the undergarment remaining. This\ngarment was seamless, woven in one piece from top to bottom...\n\n\"Let's not tear it,\" they said to one another.\"\"Let's decide by lot who will get it.\"\nThis happened that the scriptures might be fulfill which said,\n\n\"They divided my garments among them,\nand cast lots for my clothing.\"\n\nSo this is what the soldiers did... (Jn 19:23, 24) NIV\n\nOur Thought for Today:\n\nRoman soldiers in charge of the crucified customarily took for themselves\nthe clothes of the condemned men...\n\nThey divided Jesus' clothing, throwing dice to determine who would get His\nseamless garment, the most valuable piece of clothing. This fulfilled the prophecy \nin Ps. 22:18.\n\nAre you gambling away your eternal life, by saying \"one day\" when I get older?\nWhat will happen if the Lord calls before you get any older?\n\nWhat happens is, you will spend eternity separated from the Lord...\n\nIsa. 55:6 tells us : Seek the Lord while He may be found;\ncall upon Him while He is near... \n\nOur Prayer for Today:\n\nDear Lord, I do not wish to gamble away the home \nYou have prepared for those who are faithful and just.\nForgive me all my sins, and wash me white as snow.\nGuide me in paths of righteousness, for Your name \nsake...Amen.\n\nKeep look up, keep plugging away for Jesus...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e8e5ef811a300c",
    "date_utc": "Fri, 27 Oct 2006 15:24:14 -0500",
    "subject": "thoughts to live by",
    "verse": "Near the cross of Jesus stood His mother, His mother's sister, Mary the wife of Clopas, and Mary Magdalene. When Jesus saw His mother there, and the disciple whom He loved standing nearby, He said to His mother, \"Dear woman, here is your son, \" and to the disciple, \"here is your mother.\" From that time on, this disciple took her into his home. (John 19:25-27) NIV",
    "reflection": "Even while He was dying on the cross, Jesus was concerned about His family. He instructed John to care for Mary, His mother. Our families are precious gifts from God, and we should value and care for them under all circumstances. Neither Christian work nor key responsibilities in any job or position excuse us from caring for our families. As you finish your morning devotion, take some time to plan something special that you can do for your family today.",
    "prayer": "Dear Lord, forgive me for not considering my family as precious as I should. Often I place job, and material things at a higher priority than my family, not necessarily by choice but by the busyness of scheduling. Help me to always put them on my priority list, right below You. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...Some people succeed because they are destined to, but most people \nsucceed because they are determined to...(see Eph. 6:13, 14a)\n\nOur Meditation for Today:\n\nNear the cross of Jesus stood His mother, His mother's sister, Mary the wife of\nClopas, and Mary Magdalene...When Jesus saw His mother there, and the \ndisciple whom He loved standing nearby, He said to His mother, \"Dear woman,\nhere is your son,\" and to the disciple, \"here is your mother.\" From that time on,\nthis disciple took her into his home...(Jn. 19:25-27) NIV\n\nOur Thought for Today:\n\nEven while He was dying on the cross, Jesus was concerned about His family.\nHe instructed John to care for Mary, His mother...\n\nOur families are precious gifts from God, and we should value and care for them\nunder all circumstances...\n\nNeither Christian work nor key responsibilities in any job or position excuse us\nfrom caring for our families...\n\nAs you finish your morning devotion, take some time to plan something special\nthat you can do for your family today...\n\nOur Prayer for Today:\n\nDear Lord, forgive me for not considering my family as precious as I should.\nOften I place job, and material things at a higher priority than my family, not\nnecessarily by choice but by the busyness of scheduling. Help me to always\nput them on my priority list, right below You...Amen.\n\nKeep looking up, never allow the busyness of \nthe day cause you to neglect God and family...\nYou're in the Prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e98cf961856fb7",
    "date_utc": "Sun, 29 Oct 2006 17:21:00 -0600",
    "subject": "thoughts to live by",
    "verse": "When He had received the drink, Jesus said, \"It is finished.\" With that He bowed His head and gave up His spirit. (John 19:30)",
    "reflection": "Until this time a complicated system of sacrifices had atoned for sins. Sin separates people from God, and only through the sacrifice of an animal, a substitute, could people be forgiven and become clean before God. But people sin continually, so frequent sacrifices were required. Jesus however, became the final and ultimate sacrifice for sin. The word (finished) Is the same as (paid in full). Jesus came to finish God's work of salvation (John 4:34; 17:4) to pay the full penalty for our sins. With His death, the complex sacrificial system ended because Jesus took all sin upon Himself. Now we can freely approach God because of what Jesus did for us. Those who believe in Jesus' death and resurrection can live eternally with God and escape the penalty that comes from sin. If you have not as of yet personally accepted what Christ did for you on the cross, you could be playing Russian Roulette with your life. Let us seek the Lord while He may be found; let us call upon Him while He is near. Le us forsake our evil ways and thoughts. Let us turn to the Lord and He will have mercy us, and our God will freely pardon.",
    "prayer": "Dear Heavenly Father, the creator of all that exists, seen and unseen, create in me a pure and loving spirit, that I may not sin against thee. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...A man is rich according to what he is, \nnot according to what he has...(see Pro. 13:7)\n\nOur Meditation for Today:\n\nWhen He had received the drink, Jesus said, \"It is finished.\"\nWith that He bowed His head and gave up His spirit. (Jn. 19:30)\n\nOur Thought for Today:\n\nUntil this time a complicated system of sacrifices had atoned for sins...\n\nSin separates people from God, and only through the sacrifice of an animal,\na substitute, could people be forgiven and become clean before God...\n\nBut people sin continually, so frequent sacrifices were required. Jesus however, \nbecame the final and ultimate sacrifice for sin...\n\nThe word (finished) Is the same as (paid in full). Jesus came to finish God's \nwork of salvation (Jn. 4:34; 17:4) to pay the full penalty for our sins...\n\nWith His death, the complex sacrificial system ended because Jesus took all \nsin upon Himself. Now we can freely approach God because of what Jesus did for us...\n\nThose who believe in Jesus' death and resurrection can live eternally with God and\nescape the penalty that comes from sin...\n\nIf you have not as of yet personally accepted what Christ did for you on the cross,\nyou could be playing Russian Roulette with your life...\n\nLet us seek the Lord while He may be found; let us call upon Him while He is near.\nLe us forsake our evil ways and thoughts. Let us turn to the Lord and He will have \nmercy us, and our God will freely pardon...\n\nOur Prayer for Today:\n\nDear Heavenly Father, the creator of all that exists, seen and unseen,\ncreate in me a pure and loving spirit, that I may not sin against thee...Amen.\n\nKeep looking up, keep plugging away for Jesus...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10e9df288efeb2c3",
    "date_utc": "Mon, 30 Oct 2006 16:47:02 -0600",
    "subject": "thoughts to live by",
    "verse": "Now it was the day of Preparation, and the next day was to be a special Sabbath. Because the Jews did not want the bodies left on the crosses during the Sabbath, they asked Pilate to have the legs broken and the bodies taken down. The soldiers therefore came and broke the legs of the first man who had been crucified with Jesus, and then those of the other. But when they came to Jesus and found that He was already dead, they did not break His legs. (John 19:31-33) NIV",
    "reflection": "It was against God's law to leave the body of a dead person exposed overnight (see Deut. 21:23), and it was also against the law to work after Sundown on Friday, when the Sabbath began. This is why the religious leaders urgently wanted to get Jesus' body down off the cross and buried by sundown. Now these Roman soldiers had lots of experience from many previous crucifixions, so they knew when a man was dead or alive. So they did not need to break His legs. The reason for the breaking of the legs was so they could not hold themselves up, because when they could no longer hold themselves up death came by suffocation in just minutes. Jesus went through this ordeal so that our sins would be paid in full--That is why He said \"It is finished.\" There was no longer any need for the sacrifice of animals or anything else. Jesus' shed blood was sufficient for all time.",
    "prayer": "Dear Heavenly Father, once again I am reminded of Your wonderful love. I thank You for the assurance of my salvation through faith in Your finished work on the cross. Forgive me for my sin's of thought, word, and deed. Help me to walk in the paths of righteousness, for Jesus sake Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...The difference between ordinary and\nextraordinary is that little extra. (see Eccl. 9:10)\n\nOur Meditation for Today:\n\nNow it was the day of Preparation, and the next day was to be a special Sabbath.\nBecause the Jews did not want the bodies left on the crosses during the Sabbath,\nthey asked Pilate to have the legs broken and the bodies taken down.\n\nThe soldiers therefore came and broke the legs of the first man who had been\ncrucified with Jesus, and then those of the other.\n\nBut when they came to Jesus and found that He was already dead, they did not \nbreak His legs...(Jn. 19:31-33) NIV\n\nOur Thought for Today:\n\nIt was against God's law to leave the body of a dead person exposed overnight (see\nDeut. 21:23), and it was also against the law to work after Sundown on Friday, when\nthe Sabbath began...\n\nThis is why the religious leaders urgently wanted to get Jesus' body down off the cross\nand buried by sundown...\n\nNow these Roman soldiers had lots of experience from many previous crucifixions, so\nthey knew when a man was dead or alive. So they did not need to break His legs. The\nreason for the breaking of the legs was so they could not hold themselves up, because\nwhen they could no longer hold themselves up death came by suffocation in just minutes...\n\nJesus went through this ordeal so that our sins would be paid in full--That is why He said\n\"It is finished.\" There was no longer any need for the sacrifice of animals or anything else.\n\nJesus' shed blood was sufficient for all time...\n\nOur Prayer for Today:\n\nDear Heavenly Father, once again I am reminded of Your wonderful love.\nI thank You for the assurance of my salvation through faith in Your finished\nwork on the cross. Forgive me for my sin's of thought, word, and deed. Help\nme to walk in the paths of righteousness, for Jesus sake Amen...\n\nKeep looking up, He is the light of the world...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "10ea31f1fab87c4a",
    "date_utc": "Tue, 31 Oct 2006 17:28:57 -0600",
    "subject": "thoughts to live by",
    "verse": "These things happened so that the scripture would be fulfilled: \"Not one of His bones will be broken, \" and as another scripture says \"They will look on the one they have pierced.\" (John 19:36, 37) NIV",
    "reflection": "The graphic details of Jesus' death are especially important in John's record because he was an eye witness. Jesus died as the lambs for the Passover meal were being slain. Not a bone was to be broken in these sacrificial lambs, as we see by Exodus 12:46. Jesus, the Lamb of God, was the perfect sacrifice for the sins of the whole world.",
    "prayer": "Dear Heavenly Father, The thought of the suffering Your Son was willing to endure in my place, is much more than I can understand. My prayer is that I would be willing to accept any persecution that may come my way as a result of being a Christian. Amen.",
    "reading": "",
    "original_content": "GOOD MORNING!!!...(food for thought)...Swallowing angry words is much better \nthan having to eat them...(see Pro. 29:11)\n\nOur Meditation for Today:\n\nThese things happened so that the scripture would be fulfilled: \"Not one of His bones\nwill be broken,\" and as another scripture says \"They will look on the one they have \npierced.\" (Jn. 19:36, 37) NIV\n\nOur Thought for Today:\n\nThe graphic details of Jesus' death are especially important in John's \nrecord because he was an eye witness...\n\nJesus died as the lambs for the Passover meal were being slain. Not\na bone was to be broken in these sacrificial lambs, as we see by Ex. 12:46.\n\nJesus, the Lamb of God, was the perfect sacrifice for the sins of the whole\nworld...\n\nOur Prayer for Today:\n\nDear Heavenly Father, The thought of the suffering Your Son was \nwilling to endure in my place, is much more than I can understand.\nMy prayer is that I would be willing to accept any persecution that\nmay come my way as a result of being a Christian...Amen.\n\nKeep looking up, for the strength to remain faithful...\nYou're in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]