[
  {
    "message_id": "163be179b765418b",
    "date_utc": "Fri, 01 Jun 2018 20:23:28 -0500",
    "subject": "Devo. for June 2",
    "verse": "A fool is quick-tempered, but a wise person stays clam when insulted. (Pro. 12:16)",
    "reflection": "When someone annoys or insults you, it is natural to retaliate. But this solves nothing and only encourages trouble, instead answer slowly and quietly. Your response will achieve positive results. Pro. 15:1 says, \"A gentle answer turns away wrath. \"",
    "prayer": "Dear Lord, forgive me for loosing control when I have been annoyed by someone. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A fool is quick-tempered, but a wise person stays clam_\n\n_when insulted. _(Pro. 12:16)\n\nTHOUGHT FOR TODAY:\n\nWhen someone annoys or insults you, it is natural to\n\nretaliate. But this solves nothing and only encourages\n\ntrouble, instead answer slowly and quietly. Your\n\nresponse will achieve positive results. Pro. 15:1 says,\n\n\"A gentle answer turns away wrath.\"\n\nPRAYER FOR TODAY:\n\nDear Lord, forgive me for loosing control when I have\n\nbeen annoyed by someone. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163c2e9d677437f1",
    "date_utc": "Sat, 02 Jun 2018 18:51:35 -0500",
    "subject": "Devo. for May 3",
    "verse": "Truth stands the test of time; lies are soon exposed, (Pro. 12:19)",
    "reflection": "Truth is always timely, it applies today and in the future. Because it is connected with God's changeless character, IT is also changeless. Think for a moment about the centuries that have passed since these proverbs were written. Consider the countless hours that have been carefully spent studding every sentence of Scriptures. The Bible has withstood the test of time. Because God is truth, you can trust His Word to guide you.",
    "prayer": "Dear Heavenly Father, I thank You for Your Word which is the same yesterday, today, and for ever. I thank You that it has withstood the test of time, and that it is a guiding light to all who believe. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Truth stands the test of time; lies are soon exposed,_ (Pro. 12:19)\n\nTHOUGHT FOR TODAY:\n\nTruth is always timely, it applies today and in the future. Because\nit\n\nis connected with God's changeless character, IT is also changeless.\n\nThink for a moment about the centuries that have passed since these\n\nproverbs were written. Consider the countless hours that have been\n\ncarefully spent studding every sentence of Scriptures. The Bible has\n\nwithstood the test of time. Because God is truth, you can trust His\n\nWord to guide you.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for Your Word which is\n\nthe same yesterday, today, and for ever. I thank You that it\n\nhas withstood the test of time, and that it is a guiding light to\n\nall who believe. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163c8351d3986fdd",
    "date_utc": "Sun, 03 Jun 2018 19:31:54 -0500",
    "subject": "Devo. for May 4",
    "verse": "No real harm befalls the godly, but the wicked have their share of trouble. (Pro. 12:21)",
    "reflection": "This is general, but not a universal truth. Although harm does befall the godly, they are able to see opportunities in their problems and move ahead. The wicked, without God's wisdom, are ill-equipped to handle their problems.",
    "prayer": "Dear Lord, I thank You for the benefits of wisdom, including long life, wealth, honor, and peace. I thank You that when You return the blessings that have been delayed will come into being. So help me to live by believing and not by seeing. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_No real harm befalls the godly, but the wicked have their _\n\n_share of trouble. (Pro. 12:21)_\n\nTHOUGHT FOR TODAY:\n\nThis is general, but not a universal truth. Although harm does\n\nbefall the godly, they are able to see opportunities in their\n\nproblems and move ahead. The wicked, without God's wisdom,\n\nare ill-equipped to handle their problems.\n\nPRAYER FOR TODAY:\n\nDear Lord, I thank You for the benefits of wisdom, including\n\nlong life, wealth, honor, and peace. I thank You that when You\n\nreturn the blessings that have been delayed will come into being.\n\nSo help me to live by believing and not by seeing. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163cd6489cf8f309",
    "date_utc": "Mon, 04 Jun 2018 19:41:48 -0500",
    "subject": "Devo. for June 5",
    "verse": "The Lord hates those who do not keep their word, but He delights in those who do. (Pro. 12:22)",
    "reflection": "What is really being said here is, don't make promises to God in heaven that you can't keep. So be sure to let your words be few and true.",
    "prayer": "Dear Heavenly Father, help me remember to always be careful when I make promises to You, and others. I pray that Your Spirit would guide me in the truth so that I won't make promises I can't keep. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The Lord hates those who do not keep their word, but He _\n\n_delights in those who do. _(Pro. 12:22)\n\nTHOUGHT FOR TODAY:\n\nWhat is really being said here is, don't make promises to God\n\nin heaven that you can't keep. So be sure to let your words be\n\nfew and true.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me remember to always be careful\n\nwhen I make promises to You, and others. I pray that Your Spirit\n\nwould guide me in the truth so that I won't make promises I can't\n\nkeep. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163d2c941c0a7f96",
    "date_utc": "Tue, 05 Jun 2018 20:49:55 -0500",
    "subject": "Devo for June 6",
    "verse": "Wise people don't make a show of their knowledge. But fools broadcast their folly (Pro. 12:23)",
    "reflection": "Wise people have a quiet confidence. Insecure or unstable people feel the need to prove themselves, but wise people don't have to prove anything. They know they are capable, so they can get on with their work. Beware of showing off. If you are modest, people may not notice you at first, but they will respect you latter.",
    "prayer": "Dear Heavenly Father, instill in me a quiet confidence, so that I may get on with my work assured of the fact I have nothing to prove. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Wise people don't make a show of their knowledge. But fools\nbroadcast_\n\n_their folly _(Pro. 12:23)\n\nTHOUGHT FOR TODAY:\n\nWise people have a quiet confidence. Insecure or unstable people feel\nthe\n\nneed to prove themselves, but wise people don't have to prove\nanything.\n\nThey know they are capable, so they can get on with their work.\nBeware\n\nof showing off. If you are modest, people may not notice you at\nfirst, but\n\nthey will respect you latter.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, instill in me a quiet confidence, so that I may\nget\n\non with my work assured of the fact I have nothing to prove. . .\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163d7c3173f629ef",
    "date_utc": "Wed, 06 Jun 2018 20:01:17 -0500",
    "subject": "Devo. for May 7",
    "verse": "Worry weighs a person down, an encouraging word cheers a person up. (Pro. 12:25)",
    "reflection": "The human spirit can endure a sick body, but who can endure it if the spirit is crushed? Intelligent people are always open to new ideas. In fact, they look for them.",
    "prayer": "Dear Heavenly Father, forgive me when I am weighed down by worries, for I know better because we are told in Your Word to place our trust in You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Worry weighs a person down, an encouraging word _\n\n_cheers a person up. _(Pro. 12:25)\n\nTHOUGHT FOR TODAY:\n\nThe human spirit can endure a sick body, but who can\n\nendure it if the spirit is crushed? Intelligent people are\n\nalways open to new ideas. In fact, they look for them.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, forgive me when I am weighed\n\ndown by worries, for I know better because we are told\n\nin Your Word to place our trust in You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163dd10f88c3ac14",
    "date_utc": "Thu, 07 Jun 2018 20:44:27 -0500",
    "subject": "Devo. for June 8",
    "verse": "The way of the godly leads to life; their path does not lead to death. (Pro. 12:28)",
    "reflection": "Needless to say that death for many is a darkened door at the end of life, a passage way to an unknown destiny. But for God's people, death is a bright pathway to a new and better life. So friends why do we fear death? Is it fear of pain we expect, the separation from loved ones, or the unknown? God can help us with those fears. He has shown us that death is not final but just another step in the eternal life we received when we follow Him.",
    "prayer": "Dear Lord, I pray that we would always look at death as bright pathway to a better life, a life where there will be no more tears, suffering or pain, but a life of eternal bliss with You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The way of the godly leads to life; their path does not lead _\n\n_to death. _(Pro. 12: 28)\n\nTHOUGHT FOR TODAY:\n\nNeedless to say that death for many is a darkened door at the\n\nend of life, a passage way to an unknown destiny. But for God's\n\npeople, death is a bright pathway to a new and better life. So\n\nfriends why do we fear death? Is it fear of pain we expect, the\n\nseparation from loved ones, or the unknown? God can help us\n\nwith those fears. He has shown us that death is not final but just\n\nanother step in the eternal life we received when we follow Him.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that we would always look at death as bright\npathway\n\nto a better life, a life where there will be no more tears, suffering\nor pain,\n\nbut a life of eternal bliss with You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163e21f632db0ac7",
    "date_utc": "Fri, 08 Jun 2018 20:18:18 -0500",
    "subject": "Devo. for June 9",
    "verse": "Those who control their tongue will have a long life; a quick retort can rune everything. (Pro. 13:3)",
    "reflection": "You have not mastered self-control if you do not control what you say. Words can cut and destroy. James recognized this truth when he stated, \"The tongue is a small thing, but what enormous damage it can do. (Jm. 3:5) If you want to be self-controlled, begin with your tongue. Stop and think before you react or speak.",
    "prayer": "Dear Heavenly Father, help me to always remember to put my brain in gear before putting my tongue in gear. I confess I often end up with one foot in my mouth. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Those who control their tongue will have a long life;_\n\n_a quick retort can rune everything. _(Pro. 13:3)\n\nTHOUGHT FOR TODAY:\n\nYou have not mastered self-control if you do not control\n\nwhat you say. Words can cut and destroy. James recognized\n\nthis truth when he stated, \"The tongue is a small thing, but\n\nwhat enormous damage it can do. (Jm. 3:5) If you want to\n\nbe self-controlled, begin with your tongue. Stop and think\n\nbefore you react or speak.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me to always remember to put\n\nmy brain in gear before putting my tongue in gear. I confess\n\nI often end up with one foot in my mouth. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163e79585e3306fd",
    "date_utc": "Sat, 09 Jun 2018 21:45:26 -0500",
    "subject": "Devo. for June 10",
    "verse": "Lazy people want much but get little, but those who work hard will prosper and be satisfied. (Pro. 13:4)",
    "reflection": "Pride leads us to conclude that we deserve all we can see, touch, or imagine. It creates greedy appetites for far more than we need. We can be released from our self centered desires by humbling ourselves before God, realizing that all we really need is His approval.",
    "prayer": "Dear Heavenly Father, I pray that Your Holy Spirit would help me see that the world's attractions are only cheap substitutes for what You have to offer. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Lazy people want much but get little, but those who work_\n\n_hard will prosper and be satisfied. _(Pro. 13:4)\n\nTHOUGHT FOR TODAY:\n\nPride leads us to conclude that we deserve all we can see, touch, or\n\nimagine. It creates greedy appetites for far more than we need. We\n\ncan be released from our self centered desires by humbling ourselves\n\nbefore God, realizing that all we really need is His approval.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that Your Holy Spirit would help me\n\nsee that the world's attractions are only cheap substitutes for what\n\nYou have to offer. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163ec5c208fb5b51",
    "date_utc": "Sun, 10 Jun 2018 20:00:51 -0500",
    "subject": "Devo. for June 11",
    "verse": "Godliness help people all through life, while the evil are destroyed by their wickedness. (Pro. 13:6)",
    "reflection": "Godly living safeguards your life. Every choice for good sets into motion other opportunities for good. Evil choices follow the same pattern, but in the opposite direction. Each decision you make to obey God's Word will make a greater sense of order to your life, while each decision to disobey will bring confusion and destruction. The right choices you make reflect your integrity. Obedience brings the greatest safeguard and security.",
    "prayer": "Dear Lord, I pray that I would always be obedient to Your Holy Spirit's leading in my life. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Godliness help people all through life, while the evil are_\n\n_destroyed by their wickedness. _(Pro. 13:6)\n\nTHOUGHT FOR TODAY:\n\nGodly living safeguards your life. Every choice for good sets\n\ninto motion other opportunities for good. Evil choices follow\n\nthe same pattern, but in the opposite direction. Each decision\n\nyou make to obey God's Word will make a greater sense of\n\norder to your life, while each decision to disobey will bring\n\nconfusion and destruction. The right choices you make reflect\n\nyour integrity. Obedience brings the greatest safeguard and\n\nsecurity.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would always be obedient to Your\n\nHoly Spirit's leading in my life. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163f18cae1bbee90",
    "date_utc": "Mon, 11 Jun 2018 20:11:59 -0500",
    "subject": "Devo. for June 12",
    "verse": "Some who are poor pretend to be rich, others who are rich pretend to be poor. (Pro. 13:7)",
    "reflection": "Let's be honest with ourselves: WHY do we save money? Are we saving for retirement? Is it to buy more expensive cars or toys? IS it to be secure? In Lk. 12:18ff Jesus challenges us to think beyond earthbound goals and to use what we have been given for God's Kingdom. Faith, service, and obedience are the way to become rich toward God.",
    "prayer": "Dear Heavenly Father, forgive me when I fall into the trap of worshiping riches. Help me focus on the eternal riches You have promised to those who are faithful to You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Some who are poor pretend to be rich, others who are rich pretend _\n\n_to be poor. _(Pro. 13:7)\n\nTHOUGHT FOR TODAY:\n\nLet's be honest with ourselves: WHY do we save money? Are we\n\nsaving for retirement? Is it to buy more expensive cars or toys? IS\n\nit to be secure? In Lk. 12:18ff Jesus challenges us to think beyond\n\nearthbound goals and to use what we have been given for God's\n\nKingdom. Faith, service, and obedience are the way to become rich\n\ntoward God.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, forgive me when I fall into the trap of\nworshiping\n\nriches. Help me focus on the eternal riches You have promised to\nthose\n\nwho are faithful to You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163f6bf28705ddba",
    "date_utc": "Tue, 12 Jun 2018 20:25:13 -0500",
    "subject": "Devo. for June 13",
    "verse": "Pride leads to arguments; those who take advice are wise. (Pro. 13:10)",
    "reflection": "\"I was wrong\" or \"I need advice\" are difficult phrases to otter because they require humility. Pride is an ingredient in every quarrel. It stirs up conflict and divides people. Humility, by contrast, heals. Guard against pride. If you find yourself constantly arguing, examine your life for pride. be open to the advice of others, ask for help when you need it, and be willing to admit your mistakes.",
    "prayer": "Dear Heavenly Father, forgive me when I am prideful. Help me to be more humble, when I need to ask for advice. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Pride leads to arguments; those who take advice are wise. _\n\n(Pro. 13:10)\n\nTHOUGHT FOR TODAY:\n\n\"I was wrong\" or \"I need advice\" are difficult phrases to\n\notter because they require humility. Pride is an ingredient\n\nin every quarrel. It stirs up conflict and divides people.\n\nHumility, by contrast, heals. Guard against pride. If you\n\nfind yourself constantly arguing, examine your life for\n\npride. be open to the advice of others, ask for help when\n\nyou need it, and be willing to admit your mistakes.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, forgive me when I am prideful.\n\nHelp me to be more humble, when I need to ask for advice.\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "163fbf62b0ab45bb",
    "date_utc": "Wed, 13 Jun 2018 20:43:24 -0500",
    "subject": "Devo for June 14",
    "verse": "People who advise advice will find themselves in trouble; those who respect it will succeed. (Pro. 13:13)",
    "reflection": "God created us, knows us, and loves us. It only make sense, then to listen to His instruction, and do what He says. The Bible is His unfailing word to us.",
    "prayer": "Dear Heavenly Father, I thank You for Your instruction Book, I pray that I would always be faithful in applying Your instructions to my life. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_People who advise advice will find themselves in trouble;_\n\n_those who respect it will succeed_. (Pro. 13:13)\n\nTHOUGHT FOR TODAY:\n\nGod created us, knows us, and loves us. It only make sense, then\n\nto listen to His instruction, and do what He says. The Bible is His\n\nunfailing word to us.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for Your instruction Book,\n\nI pray that I would always be faithful in applying Your instructions\n\nto my life. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16400aaf0db92e9d",
    "date_utc": "Thu, 14 Jun 2018 18:39:20 -0500",
    "subject": "Devo. for June 15",
    "verse": "A person with good sense is respected; a treacherous person walks a rocky road. (Pro. 13:15)",
    "reflection": "The only way to become truly wise is to fear (revere) God. This same thought is expressed in (Pro. 1:7-9). to often people want to skip this step, thinking they can become wise by life experiences and academic knowledge alone. But if we do not acknowledge God as the source of wisdom, then our foundation of making wise decisions is shaky, and we are prone to mistakes and foolish choices.",
    "prayer": "Dear Lord, I pray that I would always take the advice of the wise. Help me remember to always think before making any decisions. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nA person with good sense is respected; a treacherous person\n\nwalks a rocky road. (Pro. 13:15)\n\nTHOUGHT FOR TODAY:\n\nThe only way to become truly wise is to fear (revere) God.\n\nThis same thought is expressed in (Pro. 1:7-9). to often\n\npeople want to skip this step, thinking they can become wise\n\nby life experiences and academic knowledge alone. But if\n\nwe do not acknowledge God as the source of wisdom, then\n\nour foundation of making wise decisions is shaky, and we\n\nare prone to mistakes and foolish choices.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would always take the advice of the\n\nwise. Help me remember to always think before making any\n\ndecisions. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16405e62ea2e540a",
    "date_utc": "Fri, 15 Jun 2018 19:02:09 -0500",
    "subject": "Devo. for June 16",
    "verse": "Wise people think before they act; fools don't and even brag about it. (Pro. 13:16)",
    "reflection": "Wise people don't have to prove anything. Beware of showing off. If you are modest, people may not notice at first, but they will respect you later.",
    "prayer": "Dear Heavenly Father, I pray that I would not think that I have to prove anything, but merely live according to Your Spirit's guidance. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Wise people think before they act; fools don't and even brag_\n\n_about it. _(Pro. 13:16)\n\nTHOUGHT FOR TODAY:\n\n_Wise people don't have to prove anything. Beware of showing_\n\n_off. If you are modest, people may not notice at first, but they_\n\n_will respect you later._\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I would not think that I\n\nhave to prove anything, but merely live according to Your\n\nSpirit's guidance. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1640fe3ede1c78a9",
    "date_utc": "Sun, 17 Jun 2018 17:35:53 -0500",
    "subject": "Devo. for June 18",
    "verse": "If you ignore criticism, you will end up in poverty and disgrace; if you accept criticism you will be honored. (Pro. 13:18)",
    "reflection": "It has been said that, if you listen to corrective criticism you will be at home with the wise. If you reject criticism you are only harming yourself.",
    "prayer": "Dear heavenly Father, I pray for humility, so that if I receive criticism I will accept it a grow from it. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_If you ignore criticism, you will end up in poverty and disgrace; _\n\n_if you accept criticism you will be honored. _(Pro. 13:18)\n\nTHOUGHT FOR TODAY:\n\nIt has been said that, if you listen to corrective criticism you will\nbe\n\nat home with the wise. If you reject criticism you are only harming\n\nyourself.\n\nPRAYER FOR TODAY:\n\nDear heavenly Father, I pray for humility, so that if I receive\ncriticism\n\nI will accept it a grow from it. . . Amen.\n\nPs. The reason you did not receive a devo. on Father's day is that my\n\ncomputer started doing it's own thing and my daughter have to\nstraighten\n\nit out. . . GOD BLESS HAVE A GOOD WEEK.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16415928e19ec3c9",
    "date_utc": "Mon, 18 Jun 2018 20:04:44 -0500",
    "subject": "Devo for June 19",
    "verse": "It is pleasant to see dreams come true, but fools will not turn from evil to attain them. (Pro. 13:19)",
    "reflection": "Whether a \"dream come true\" is good or bad depending on the nature of the dream or desire. It is pleasant to achieve worthwhile goals, but all goals are not worth pursuing. When you set your heart on something, you may loose your ability to assess it objectively. With your desire blinding your judgment, you may proceed with an unwise relationship, a wasteful purchase, or a poorly conceived plan. Faithfulness is a virtue, but stubbornness is not.",
    "prayer": "Dear heavenly Father, I pray that I would follow Your Holy Spirit's guidance in this life. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_It is pleasant to see dreams come true, but fools will not turn from\nevil _\n\n_to attain them. _(Pro. 13:19)\n\nTHOUGHT FOR TODAY:\n\nWhether a \"dream come true\" is good or bad depending on the nature\n\nof the dream or desire. It is pleasant to achieve worthwhile goals,\nbut\n\nall goals are not worth pursuing. When you set your heart on\nsomething,\n\nyou may loose your ability to assess it objectively. With your desire\n\nblinding your judgment, you may proceed with an unwise relationship,\n\na wasteful purchase, or a poorly conceived plan. Faithfulness is a\nvirtue,\n\nbut stubbornness is not.\n\nPRAYER FOR TODAY:\n\nDear heavenly Father, I pray that I would follow Your Holy Spirit's\n\nguidance in this life. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1641ad596624af3f",
    "date_utc": "Tue, 19 Jun 2018 20:36:03 -0500",
    "subject": "Devo. for June 20",
    "verse": "Whoever walks with the wise will become wise; whoever walks with fools will suffer harm. (Pro. 13:20)",
    "reflection": "The old saying \"A rotten apple spoils the whole barrel\" is often applied to friendships, and with good reason. our friends and associates affect us, sometimes profoundly. We need to be careful who we choose as our closest friends. We need to spend time with people who we would like to be like, because we and our friends will surely grow to resemble each other.",
    "prayer": "Dear Heavenly Father, help me to be more Christ-like in my walk through life. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nWhoever walks with the wise will become wise; whoever\n\nwalks with fools will suffer harm. (Pro. 13:20)\n\nTHOUGHT FOR TODAY:\n\nThe old saying \"A rotten apple spoils the whole barrel\" is\n\noften applied to friendships, and with good reason. our\n\nfriends and associates affect us, sometimes profoundly.\n\nWe need to be careful who we choose as our closest friends.\n\nWe need to spend time with people who we would like to be\n\nlike, because we and our friends will surely grow to resemble\n\neach other.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me to be more Christ-like in my\n\nwalk through life. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16424ad8ddd6281b",
    "date_utc": "Thu, 21 Jun 2018 18:28:31 -0500",
    "subject": "Devo. for June 20",
    "verse": "Trouble chases sinners, while blessings chase the righteous! (Pro. 13 20)",
    "reflection": "All will be well for those who are godly. Tell them, \"You will receive a wonderful reward. \" But we need to remind the wicked, \"Your destruction is sure. You surely will get what you deserve. Your well earned punishment is on the way. \"",
    "prayer": "Dear Lord, give me the guidance to use godly wisdom when warnings to those who have gone astray, and need godly guidance. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Trouble chases sinners, while blessings chase the righteous! _\n\n(Pro. 13 20)\n\nTHOUGHT FOR TODAY:\n\nAll will be well for those who are godly. Tell them, \"You will\n\nreceive a wonderful reward.\" But we need to remind the wicked,\n\n\"Your destruction is sure. You surely will get what you deserve.\n\nYour well earned punishment is on the way.\"\n\nPRAYER FOR TODAY:\n\nDear Lord, give me the guidance to use godly wisdom when\n\nwarnings to those who have gone astray, and need godly\n\nguidance. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1642a573f5903e7c",
    "date_utc": "Fri, 22 Jun 2018 20:51:58 -0500",
    "subject": "Devo. for June 23",
    "verse": "A poor person's farm may produce much food, but injustice sweeps it all away. (Pro. 13:23)",
    "reflection": "The poor are often victims of an unjust society. A poor man's soil may be good but unjust laws may rob him of his own produce. This proverb does not take poverty lightly or wink at injustice, it simply describes what often occurs. We should do what we can to fight injustice of every sort. Our efforts may seem inadequate, but it is comforting to know that in the end God's justice will prevail.",
    "prayer": "Dear heavenly Father of all grace and mercy, I thank you that in the end of this life, Your justice will prevail. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A poor person's farm may produce much food, but injustice _\n\n_sweeps it all away. _(Pro. 13:23)\n\nTHOUGHT FOR TODAY:\n\nThe poor are often victims of an unjust society. A poor man's soil\n\nmay be good but unjust laws may rob him of his own produce.\n\nThis proverb does not take poverty lightly or wink at injustice, it\n\nsimply describes what often occurs. We should do what we can to\n\nfight injustice of every sort. Our efforts may seem inadequate, but\n\nit is comforting to know that in the end God's justice will prevail.\n\nPRAYER FOR TODAY:\n\nDear heavenly Father of all grace and mercy, I thank you that in the\n\nend of this life, Your justice will prevail. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1642f40274600684",
    "date_utc": "Sat, 23 Jun 2018 19:44:51 -0500",
    "subject": "Devo. for June 24",
    "verse": "If you refuse to discipline your children, it proves you don't love them; If you love your children, you will promptly discipline them. (Pro. 13:24)",
    "reflection": "It is not easy for a loving parent to discipline a child, but it is necessary. The greatest responsibility God gives parents is the nurturing and guidance of their children. Lack of discipline puts parents love in question because it shows a lack of concern for the character development of their children. Disciplining children averts long range disaster. Without correction, children grow up with no clear understanding of right and wrong.",
    "prayer": "Dear Heavenly Father, please remind us that we have been given a great blessing, but also a great responsibility in disciplining our children. In that responsibility our children will learn to become good parents. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_If you refuse to discipline your children, it proves you don't love\nthem; _\n\n_If you love your children, you will promptly discipline them. _(Pro.\n13:24)\n\nTHOUGHT FOR TODAY:\n\nIt is not easy for a loving parent to discipline a child, but it is\nnecessary.\n\nThe greatest responsibility God gives parents is the nurturing and\nguidance\n\nof their children. Lack of discipline puts parents love in question\nbecause\n\nit shows a lack of concern for the character development of their\nchildren.\n\nDisciplining children averts long range disaster. Without correction,\nchildren\n\ngrow up with no clear understanding of right and wrong.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, please remind us that we have been given a\ngreat\n\nblessing, but also a great responsibility in disciplining our\nchildren. In\n\nthat responsibility our children will learn to become good parents. .\n. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16434332272acd1a",
    "date_utc": "Sun, 24 Jun 2018 18:48:44 -0500",
    "subject": "Devo. for June 25",
    "verse": "The godly eat to their heart's content, but the belly of the wicked goes hungry. (Pro. 13:25)",
    "reflection": "Even strong young lions sometimes go hungry, but those who trust in the Lord will never lack any GOOD thing.",
    "prayer": "Dear Lord, I thank You for knowing what I need, I pray that Your Holy Spirit would remind me daily, that my greatest needs are spiritual. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The godly eat to their heart's content, but the belly of the wicked\n_\n\n_goes hungry. _(Pro. 13:25)\n\nTHOUGHT FOR TODAY:\n\nEven strong young lions sometimes go hungry, but those who trust\n\nin the Lord will never lack any GOOD thing.\n\nPRAYER FOR TODAY:\n\nDear Lord, I thank You for knowing what I need, I pray that\n\nYour Holy Spirit would remind me daily, that my greatest needs\n\nare spiritual. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16439b529c18c1f7",
    "date_utc": "Mon, 25 Jun 2018 20:28:51 -0500",
    "subject": "Devo. for June 26",
    "verse": "Those who follow the right path fear the Lord; those who take the wrong path despise Him. (Pro. 14:2)",
    "reflection": "I believe what we should recognize is a call for Christian maturity. Christian maturity means making Christ the being and ending of our faith. To grow in maturity we must center our lives on Christ. not depending on some religious ritual, not falling back into sin, or trusting in ourselves, and not letting anything come between us and Christ.",
    "prayer": "Dear Lord, I pray that Your Holy Spirit would keep me always focused on You. Keep me from becoming prideful, so that I will not let any material thing come between myself and You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Those who follow the right path fear the Lord; those who take the_\n\n_wrong path despise Him._ (Pro. 14:2)\n\nTHOUGHT FOR TODAY:\n\nI believe what we should recognize is a call for Christian maturity.\n\nChristian maturity means making Christ the being and ending of\n\nour faith. To grow in maturity we must center our lives on Christ.\n\nnot depending on some religious ritual, not falling back into sin,\n\nor trusting in ourselves, and not letting anything come between us\n\nand Christ.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that Your Holy Spirit would keep me always\n\nfocused on You. Keep me from becoming prideful, so that I will\n\nnot let any material thing come between myself and You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1643eb89778cf9cf",
    "date_utc": "Tue, 26 Jun 2018 19:50:42 -0500",
    "subject": "Devo. for June 27",
    "verse": "An empty stable stays clean, but no income comes from an empty stable. (Pro. 14:4)",
    "reflection": "When a farmer has no cattle, the stable will be clean, but he will be unable to make a living. The only way to keep your life clean of people problems, is to keep it free from of people. But if your life is empty of people, it is useless, and if you live only for yourself, your life loses its meaning. Instead of avoiding people, we should serve others, share our faith, and work for justice. Is your life free but empty? Or does it give evidence of your serving God wholeheartedly.",
    "prayer": "Dear heavenly Father, help me to be a truthful witness in all that I say and do. May my words always be words of praise in Your name. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_An empty stable stays clean, but no income comes from an empty_\n\n_stable._ (Pro. 14:4)\n\nTHOUGHT FOR TODAY:\n\nWhen a farmer has no cattle, the stable will be clean, but he will\n\nbe unable to make a living. The only way to keep your life clean\n\nof people problems, is to keep it free from of people. But if your\n\nlife is empty of people, it is useless, and if you live only for\nyourself, your life loses its meaning. Instead of avoiding people, we\n\nshould serve others, share our faith, and work for justice. Is your\n\nlife free but empty? Or does it give evidence of your serving God\n\nwholeheartedly.\n\nPRAYER FOR TODAY:\n\nDear heavenly Father, help me to be a truthful witness in all that\n\nI say and do. May my words always be words of praise in Your\n\nname. . .Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1644404ed2eff4e5",
    "date_utc": "Wed, 27 Jun 2018 20:32:11 -0500",
    "subject": "Devo. for June 28",
    "verse": "A truthful witness does not lie, a falls witness breaths lies. (Pro. 14:5)",
    "reflection": "Lies just seem to pour out of some people, and what happens is that it sow discord among many in the congregation. God warns us against deception. Even though deception is a way of life for many people, God's people must not give into it.",
    "prayer": "Dear Heavenly Father, I pray that You would bridle my tongue when I am tempted to share a half truth. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A truthful witness does not lie, a falls witness breaths lies.\n_(Pro. 14:5)\n\nTHOUGHT FOR TODAY:\n\nLies just seem to pour out of some people, and what happens is that\n\nit sow discord among many in the congregation. God warns us against\n\ndeception. Even though deception is a way of life for many people,\n\nGod's people must not give into it.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that You would bridle my tongue when\n\nI am tempted to share a half truth. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164490571e6ec6d6",
    "date_utc": "Thu, 28 Jun 2018 19:50:51 -0500",
    "subject": "Devo. for June 29",
    "verse": "Mockers seek wisdom but never find it, but knowledge comes easily to those with understanding. (Pro. 14:6)",
    "reflection": "We all know mockers, (people who seem to have nothing better to do but ridicule people who have done a little bit better then themselves. ) The reason they do not find wisdom is they do not seek it seriously. Wisdom comes to those who apply God's Word to their lives and seek out godly counselors. If the wisdom you seek does not come easily to you perhaps your attitude is the barrier.",
    "prayer": "Dear Heavenly Father, I pray that my attitude would never become a barrier in my ability to learn more about You. I pray that there would be an earnest effort in our country to draw closer to You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Mockers seek wisdom but never find it, but knowledge comes easily_\n\n_to those with understanding. _(Pro. 14:6)\n\nTHOUGHT FOR TODAY:\n\nWe all know mockers, (people who seem to have nothing better to do\n\nbut ridicule people who have done a little bit better then\nthemselves.)\n\nThe reason they do not find wisdom is they do not seek it seriously.\n\nWisdom comes to those who apply God's Word to their lives and seek\n\nout godly counselors. If the wisdom you seek does not come easily to\n\nyou perhaps your attitude is the barrier.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that my attitude would never become a\n\nbarrier in my ability to learn more about You. I pray that there\nwould\n\nbe an earnest effort in our country to draw closer to You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1644e1d0c5d199ae",
    "date_utc": "Fri, 29 Jun 2018 19:34:44 -0500",
    "subject": "Devo. for June 30",
    "verse": "If you plot evil, you will be lost, but if you plan good, you will be granted love and faithfulness. (Pro. 14:22)",
    "reflection": "Don't be miss led. Remember you can't ignore God and get away with it. It's a natural law you will always reap what you sow. Every action has results. The Holy Spirit is in constant opposition to our sinful desires.",
    "prayer": "Dear Lord, I pray that I would always be sensitive and obedient to Your Holy Spirit's guidance in my life. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_If you plot evil, you will be lost, but if you plan good, you will\nbe _\n\n_granted love and faithfulness. _(Pro. 14:22)\n\nTHOUGHT FOR TODAY:\n\nDon't be miss led. Remember you can't ignore God and get away\n\nwith it.It's a natural law you will always reap what you sow. Every\n\naction has results.The Holy Spirit is in constant opposition to our\n\nsinful desires.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would always be sensitive and obedient to\n\nYour Holy Spirit's guidance in my life. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16453800970efe25",
    "date_utc": "Sat, 30 Jun 2018 20:40:57 -0500",
    "subject": "Devo. for July 1",
    "verse": "Those who fear the Lord are secure; he will be a place of refuge for his children. (Pro. 14:26)",
    "reflection": "Even in our troubled world those who live in the fear of the Lord, usually results in obvious blessings--but not always. Sometimes sin intervenes, and some blessings must be delayed until Jesus returns to establish His eternal kingdom. that's why we must live by faith not seeing (2 Cor. 5:7)",
    "prayer": "Dear Heavenly Father, instill in me a faith such as Paul had, trusting in You while waiting for Your promises. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Those who fear the Lord are secure; he will be a place of refuge_\n\n_for his children. _(Pro. 14:26)\n\nTHOUGHT FOR TODAY:\n\nEven in our troubled world those who live in the fear of the Lord,\n\nusually results in obvious blessings--but not always. Sometimes\n\nsin intervenes, and some blessings must be delayed until Jesus\n\nreturns to establish His eternal kingdom. that's why we must live\n\nby faith not seeing (2 Cor. 5:7)\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, instill in me a faith such as Paul had,\ntrusting\n\nin You while waiting for Your promises. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]