[
  {
    "message_id": "115ffb21c04f7ee2",
    "date_utc": "Thu, 1 Nov 2007 06:10:37 -0600",
    "subject": "thoughts to live by",
    "verse": "As far as the gospel is concerned, they are enemies on your account; but as far as election is concerned, they are loved, on account of the patriarchs, for God's gifts and His call are irrevocable. Just as you were at one time disobedient to God have now received mercy as a result of their disobedience, so they too have now become disobedient in order that they too may now receive mercy as a result of God's mercy to you. For God has bound all men over to disobedience so that He may have mercy on them all. (Romans 11:28-32) NIV",
    "reflection": " Here Is What We Are To Glean From This: In this passage Paul shows how the Jews and the Gentiles benefit from each other. When ever God shows mercy to one group, the other shares the blessing. In God's original plan, the Jews would be the source of God's blessing to the Gentiles (Genesis 12:3). When the Jews neglected this mission, God blessed the Gentiles anyway through the Jewish Messiah. He still maintained His love for the Jews because of His promises to Abraham, Isaac, and Jacob. But someday all faithful Jews will share in God's mercy. God's plan will not be thwarted: He will have mercy on everyone.",
    "prayer": "Dear Heavenly Father, I thank You for You mercies which are new everyday. Help me to love as You do, Help me to be merciful as You are merciful. Bless and keep all my friends safe. Keep our nation, its citizens and our troops save today I pray. Amen.",
    "reading": "",
    "original_content": "God's Blessing on You Today!!!~~~(food for thought)~~~God loves us all, even though \nwe do not deserve it...\n\nOur Bible Verses for Today:\n\nAs far as the gospel is concerned, they are enemies on your\naccount; but as far as election is concerned, they are loved, on\naccount of the patriarchs,\n\nfor God's gifts and His call are irrevocable...\n\nJust as you were at one time disobedient to God have now\nreceived mercy as a result of their disobedience,\n\nso they too have now become disobedient in order that they \ntoo may now receive mercy as a result of God's mercy to you...\n\nFor God has bound all men over to disobedience so that He\nmay have mercy on them all...(Ro. 11:28-32) NIV\n\nHere Is What We Are To Glean From This:\n\nIn this passage Paul shows how the Jews and the Gentiles benefit\nfrom each other. When ever God shows mercy to one group, the \nother shares the blessing...\n\nIn God's original plan, the Jews would be the source of God's blessing\nto the Gentiles (Gen. 12:3). When the Jews neglected this mission, \nGod blessed the Gentiles anyway through the Jewish Messiah...\n\nHe still maintained His love for the Jews because of His promises to \nAbraham, Isaac, and Jacob. But someday all faithful Jews will share \nin God's mercy...\n\nGod's plan will not be thwarted: He will \"have mercy on everyone.\"\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for You mercies which are new everyday.\nHelp me to love as You do, Help me to be merciful as You are merciful. \nBless and keep all my e-mail friends safe. Keep our nation, its citizens and \nour troops save today I pray...Amen.\n\nKeep looking up, He loves us one and all...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11604f58c5e6befa",
    "date_utc": "Fri, 2 Nov 2007 04:42:05 -0600",
    "subject": "thoughts to live by",
    "verse": "Oh, the depth of the riches of the wisdom and knowledge of God! How unsearchable His judgments, and His paths beyond tracing out! (Romans 11:33) NIV",
    "reflection": "We should notice that this doxology is a prayer of praise to God for the wisdom of His plan. Even though God's methods and means are beyond our comprehension, God Himself is not arbitrary. He governs the universe and our life in perfect wisdom, justice, and love. He governs us by His love ~~ that is why we don't receive what we deserve.",
    "prayer": "Dear Heavenly Father, great are Your ways and beyond understanding. Take my life and let it be consecrated Lord to Thee: take my moments and my days, ~~ let them flow in ceaseless praise. Amen.",
    "reading": "",
    "original_content": "God's Blessings on You Today!!!~~~(food for thought)~~~\n\nOur Bible Verse for Today:\n\nOh, the depth of the riches of the wisdom and knowledge of God!\nHow unsearchable His judgments, and His paths beyond tracing out!\n(Ro. 11:33) NIV\n\nOur Lesson Here:\n\nWe should notice that this doxology is a prayer of praise to God for \nthe wisdom of His plan...\n\nEven though God's methods and means are beyond our comprehension,\nGod Himself is not arbitrary. He governs the universe and our life in \nperfect wisdom, justice, and love...\n\nHe governs us by His love ~~ that is why we don't receive what we deserve...\n\nOur Prayer for Today:\nDear Heavenly Father, great are Your ways and beyond understanding.\nTake my life and let it be consecrated Lord to Thee: take my moments\nand my days, ~~ let them flow in ceaseless praise...Amen.\n\nKeep looking up, that the Lord may guide your way...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1160f487767a113a",
    "date_utc": "Sat, 3 Nov 2007 14:58:16 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul says: Who has known the mind of the Lord? Or who has been His counselor?\" \"Who has ever given to God, that God should repay him?\" (Romans 11:34, 35) NIV",
    "reflection": " Here Is What We Should Glean From These Verses: Really the implication of these verses is that no one has fully understood the mind of the Lord. No one has been His counselor ~~ and God owes nothing to any one of us. Isaiah and Jeremiah asked similar questions to show that we are unable to give advice to God or criticize His ways (Isaiah 40:13; Jeremiah 23:18). God alone is the possessor of absolute power and absolute wisdom.",
    "prayer": "Dear Heavenly Father, I pray today for godly wisdom, that I might walk in righteousness and truth. Forgive me for my sins of thought, word, and deed. Instill in me a clean heart O God. Amen.",
    "reading": "",
    "original_content": "God Bless You Real Good Today!!!~~~(food for thought)~~~With God all things are possible...\n\nOur Bible Verses for Today:\n\nPaul says: Who has known the mind of the Lord? Or who has\nbeen His counselor?\"\n\n\"Who has ever given to God, that God should repay him?\" (Ro. 11:34, 35) NIV\n\nHere Is What We Should Glean From These Verses:\n\nReally the implication of these verses is that no one has fully understood\nthe mind of the Lord...\n\nNo one has been His counselor ~~ and God owes nothing to any one of us.\n\nIsaiah and Jeremiah asked similar questions to show that we are unable to\ngive advice to God or criticize His ways (Isa. 40:13; Jer. 23:18)...\n\nGod alone is the possessor of absolute power and absolute wisdom...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray today for godly wisdom,\nthat I might walk in righteousness and truth. Forgive me\nfor my sins of thought, word, and deed. Instill in me a \nclean heart O God...Amen.\n\nKeep looking up, He waits to guide you in all things...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11614aefcdcb1b09",
    "date_utc": "Mon, 5 Nov 2007 05:17:31 -0600",
    "subject": "thoughts to live by",
    "verse": "From Him and through Him and to Him are all things, To Him be the glory forever! Amen. (Romans 11:36) NIV",
    "reflection": "This Is What We Should Glean From This Verse: In the final analysis, all of us are absolutely dependent on God. He is the source of all things, including ourselves. He is the power that sustains and rules the world that we live in. And God works out all things to bring glory to Himself. The all-powerful God deserves our praise.",
    "prayer": "Dear Heavenly Father, Creator and sustained of all that exists, we praise Your holy name. By Your will all things exist. By Your mercy and love my sins have been forgiven, thank You Lord for this great and wonderful gift. Amen.",
    "reading": "",
    "original_content": "God's Blessing On You Today!!!~~~(food for thought)~~~He's got the whole world in His hands...\n\nOur Bible Verse for Today:\n\nFrom Him and through Him and to Him are all things,\nTo Him be the glory forever! Amen...(Ro. 11:36) NIV\n\nThis Is What We Should Glean From This Verse:\n\nIn the final analysis, all of us are absolutely dependent\non God. He is the source of all things, including ourselves...\n\nHe is the power that sustains and rules the world that we\nlive in. And God works out all things to bring glory to\nHimself...\n\nThe all-powerful God deserves our praise...\n\nOur Prayer for Today:\nDear Heavenly Father, Creator and sustainer of all that \nexists, we praise Your holy name. By Your will all things \nexist. By Your mercy and love my sins have been forgiven, \nthank You Lord for this great and wonderful gift...Amen.\n\nKeep looking up, all good things come from Him...\nYour are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11619ccd5b825c71",
    "date_utc": "Tue, 6 Nov 2007 07:41:06 -0600",
    "subject": "thoughts to live by",
    "verse": "Therefore, I urge you, brothers, in view of God's mercy, to offer your bodies as living sacrifices, holy and pleasing to God~~This is your spiritual act of worship. (Romans 12:1) NIV",
    "reflection": "When sacrificing an animal according to God's law, a priest would kill the animal, cut it in pieces, and place it on the altar. Sacrifice was important, but even in the Old Testament God made it clear that obedience from the heart was much more important. God wants us to offer ourselves, not animals as living sacrifices, daily laying aside our own desires to follow Him, putting our energy and resources at His disposal and trusting Him to guide us. We are to do this out of gratitude that our sins have been forgiven.",
    "prayer": "Dear Heavenly Father, I pray that the life I live would be pleasing to You. I do thank You for all that You have done for me, guide me so as to do more for You. Keep our nation, its citizens, and our troops safe today. Bless all who read this devotion today. Amen.",
    "reading": "",
    "original_content": "God Bless You Today!!!~~~(food for thought)~~~A song in your heart puts a smile on your face...\n\nOur Bible Verse for Today:\n\nTherefore, I urge you, brothers, in view of God's mercy, \nto offer your bodies as living sacrifices, holy and pleasing\nto God~~This is your spiritual act of worship...(Ro. 12:1) NIV\n\nHere Is What We Should Glean From This:\n\nWhen sacrificing an animal according to God's law, a priest would\nkill the animal, cut it in pieces, and place it on the altar. Sacrifice was\nimportant, but even in the Old Testament God made it clear that\nobedience from the heart was much more important...\n\nGod wants us to offer ourselves, not animals as living sacrifices,\ndaily laying aside our own desires to follow Him, putting our energy \nand resources at His disposal and trusting Him to guide us...\n\nWe are to do this out of gratitude that our sins have been forgiven...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that the life I live would\nbe pleasing to You. I do thank You for all that You have\ndone for me, guide me so as to do more for You.\nKeep our nation, its citizens, and our troops safe today.\nBless all who read this devotion today...Amen.\n\nKeep looking up, He will put a smile on your face...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1161ed7f5878ec29",
    "date_utc": "Wed, 7 Nov 2007 09:35:56 -0600",
    "subject": "thoughts to live by",
    "verse": "Do not conform any longer to the pattern of this world, but be transformed by the renewing of your mind. Then you will be able to test and approve what God's will is, His good, pleasing and perfect will. For by the grace given me I say to every one of you: Do not think of your self more highly than you ought, but rather think of yourself with sober judgment, in accordance with the measure of faith God has given you. (Romans 12:2, 3) NIV",
    "reflection": "Healthy self-esteem is important because some of us think to little of ourselves; on the other hand, some overestimate themselves. The key to an honest and accurate self-evaluation is, knowing the basis of our self-worth ~~ our identity in Christ. Apart from Him, we aren't capable of very much by eternal standards; in Him we are valuable and capable of worthy service. Evaluating yourself by the worldly standards of success and achievement can cause you to think too much about your worth in the eyes of others and so miss your true value in God's eyes.",
    "prayer": "Dear Heavenly Father, help me to always evaluate my self-worth in your eyes. Help me to judge others in like manner. Keep our nation its citizens, and our troops safe today. I thank you for our troops and ask that You would bless them for protecting our way of life. Amen.",
    "reading": "",
    "original_content": "God Bless You Today!!!~~~(food for thought)~~~Focusing on Christ puts everything in perspective...\n\nOur Bible Verses For Today:\n\nDo not conform any longer to the pattern of this world, but be \ntransformed by the renewing of your mind. Then you will be \nable to test and approve what God's will is, His good, pleasing \nand perfect will...\n\nFor by the grace given me I say to every one of you: Do not think \nof your self more highly than you ought, but rather think of yourself \nwith sober judgment, in accordance with the measure of faith God \nhas given you...(Ro. 12:2, 3) NIV\n\nHere Is What We Should Learn From These Verses:\n\nHealthy self-esteem is important because some of us think to little of ourselves; \non the other hand, some overestimate themselves...\n\nThe key to an honest and accurate self-evaluation is, knowing the basis of our \nself-worth ~~ our identity in Christ...\n\nApart from Him, we aren't capable of very much by eternal standards; in Him we \nare valuable and capable of worthy service...\n\nEvaluating yourself by the worldly standards of success and achievement can \ncause you to think too much about your worth in the eyes of others and so miss \nyour true value in God's eyes...\n\nOur Prayer for Today:\nDear Heavenly Father, help me to always evaluate my self-worth\nin your eyes. Help me to judge others in like manner. Keep our \nnation its citizens, and our troops safe today. I thank you for our \ntroops and ask that You would bless them for protecting our way \nof life...Amen.\n\nKeep looking up, He thinks you are worthy enough to die for...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11623fc1c39cbd07",
    "date_utc": "Thu, 8 Nov 2007 05:45:49 -0600",
    "subject": "thoughts to live by",
    "verse": "Just as each of us has one body with many members, and these members do not have the same function, so in Christ we who are many form one body, and each member belongs to all the others. (Romans 12:4, 5) NIV",
    "reflection": "Paul uses the concept of the human body to teach how Christians should live and work together. Just as the parts of the body function under the direction of the brain. In like manner Christians are to work together under the command and authority of Jesus Christ. Paul writes in more detail of this in (I Corinthians 12:12-31; and Ephesians 4:1-16)",
    "prayer": "Dear Heavenly Father, Help me to make better use of the gifts You have given me. Help me to do my part when asked, help me to see more clearly my role in witnessing for You. Amen.",
    "reading": "",
    "original_content": "God Bless You Today!!!~~~(food for thought)~~~There is no excuse for saying \"no\" to Christ...\n\nOur Bible Verses for Today:\n\nJust as each of us has one body with many members, and\nthese members do not have the same function, so in\nChrist we who are many form one body, and each member \nbelongs to all the others...(Ro. 12:4, 5) NIV\n\nHere Is What We Should Glean From This:\n\nPaul uses the concept of the human body to teach how\nChristians should live and work together. Just as the parts \nof the body function under the direction of the brain...\n\nIn like manner Christians are to work together under the \ncommand and authority of Jesus Christ...\n\nPaul writes in more detail of this in (I Cor. 12:12-31; and Eph. 4:1-16)\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to make better use of\nthe gifts You have given me. Help me to do my part when\nasked, help me to see more clearly my role in witnessing\nfor You...Amen.\n\nKeep looking up, He will clarify your part in sharing your faith...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "116293de1596f569",
    "date_utc": "Fri, 9 Nov 2007 05:55:10 -0600",
    "subject": "thoughts to live by",
    "verse": "We have different gifts according to the grace given to us. If a man's gift is prophesying, let him use it in proportion to his faith. If it is serving, let him serve; if it is teaching, let him teach; If it is encouraging, let him encourage; if it is contributing, to the needs of others, let him give generously; if it is leadership, let him govern diligently; if it is showing mercy, let him do it cheerfully. (Romans 12:6-8) NIV",
    "reflection": "God's gifts vary in nature, power, and effectiveness according to His wisdom and graciousness, not according to our faith. God will give the special power necessary and appropriate to carry out each responsibility. We can not, by our own effort or willpower, drum up more ability and so be more effective teachers or servants. These are God's gifts to His church, and He gives faith and power as He wills. Our role is to be faithful and to seek ways to serve others with what Christ has give us. When you identify your own gifts (and this list is far from complete), ask how you can use them to build up God's family. At the same time, realize that your gifts can't do the work of the church all alone. Be thankful for people whose gifts are completely different from yours. Let your strengths balance their weaknesses, and be grateful that their abilities make up for your deficiencies. Together you can build Christ's church.",
    "prayer": "Dear Heavenly Father, give me the wisdom and sensitivity to recognize the gifts you have given me that I might help to build up Your church. Help me to recognize that even if my gifts are small they are needed to complete Your work. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~God will guide you through the rapids of change...\n\nOur Bible Verses for Today:\n\nWe have different gifts according to the grace given to us.\nIf a man's gift is prophesying, let him use it in proportion to\nhis faith...\n\nIf it is serving, let him serve; if it is teaching, let him teach;\n\nIf it is encouraging, let him encourage; if it is contributing,\nto the needs of others, let him give generously; if it is\nleadership, let him govern diligently; if it is showing mercy,\nlet him do it cheerfully...(Ro. 12:6-8) NIV\n\nHere Is What We Should Glean From This:\n\nGod's gifts vary in nature, power, and effectiveness according\nto His wisdom and graciousness, not according to our faith...\n\nGod will give the special power necessary and appropriate to\ncarry out each responsibility. We can not, by our own effort or\nwillpower, drum up more ability and so be more effective teachers\nor servants...\n\nThese are God's gifts to His church, and He gives faith and power\nas He wills. Our role is to be faithful and to seek ways to serve others with\nwhat Christ has give us...\n\nWhen you identify your own gifts (and this list is far from complete),\nask how you can use them to build up God's family. At the same time,\nrealize that your gifts can't do the work of the church all alone...\n\nBe thankful for people whose gifts are completely different from yours.\nLet your strengths balance their weaknesses, and be grateful that their \nabilities make up for your deficiencies. Together you can build Christ's\nchurch...\n\nOur Prayer for Today:\nDear Heavenly Father, give me the wisdom and sensitivity to\nrecognize the gifts you have given me that I might help to build\nup Your church. Help me to recognize that even if my gifts are\nsmall they are needed to complete Your work...Amen.\n\nKeep looking up, He has a job for you to do in His church...\nYou are in the prayers of two who care,,,\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "116337ca52821e28",
    "date_utc": "Sun, 11 Nov 2007 06:56:19 -0600",
    "subject": "thoughts to live by",
    "verse": "Love must be sincere. Hate what is evil; cling to what is good. (Romans 12:9) NIV",
    "reflection": "Most of us have learned how to be courteous to others ~~ how to speak kindly ~~ avoid hurting their feelings ~~ and appear to take an interest in them. We may even be skilled in pretending to show compassion when we hear of others' needs, or to become indignant when we learn of injustice. But God calls us to a real sincere love that goes far beyond being hypocritical and polite. Sincere love requires concentration and effort. It means helping others become better people. It demands our time money, and personal involvement. No individual has the capacity to express love to a whole community, but the body of Christ in your town does. Look for people who need your love and look for ways you and your fellow believers can love your community for Christ.",
    "prayer": "Dear Heavenly Father, cleanse my heart that I may be a vessel for You. Instill in me a pure heart that I may be used by You to be a beacon of light and love for my community. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~He who ignores God is a fool...\n\nOur Bible Verse for Today:\n\nLove must be sincere. Hate what is evil; \ncling to what is good...(Ro. 12:9) NIV\n\nOur Lesson for Today:\n\nMost of us have learned how to be courteous to others ~~ how to\nspeak kindly ~~ avoid hurting their feelings ~~ and appear to take\nan interest in them...\n\nWe may even be skilled in pretending to show compassion when\nwe hear of others' needs, or to become indignant when we learn \nof injustice...\n\nBut God calls us to a real sincere love that goes far beyond being\nhypocritical and polite. Sincere love requires concentration and effort.\nIt means helping others become better people. It demands our time \nmoney, and personal involvement...\n\nNo individual has the capacity to express love to a whole community, \nbut the body of Christ in your town does...\n\nLook for people who need your love and look for ways you and your\nfellow believers can love your community for Christ...\n\nOur Prayer for Today:\nDear Heavenly Father, cleanse my heart that I may be\na vessel for You. Instill in me a pure heart that I may be\nused by You to be a beacon of light and love for my\ncommunity...Amen.\n\nKeep looking up, let Him use you today...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "116389f9afd542f3",
    "date_utc": "Mon, 12 Nov 2007 06:10:37 -0600",
    "subject": "thoughts to live by",
    "verse": "Be devoted to one another in brotherly love. Honor one another above yourselves. (Romans 12:10) NIV",
    "reflection": "We can honor others in one of two ways. One involves ulterior motives. We honor our bosses so they will reward us, our employers so they will work harder, the wealthy so they will contribute to our cause, the powerful so they will use their power for us and not against us. God's way involves love. As Christians, We honor people because they have been created in God's image, because they are our brothers and sisters in Christ, and because they have a unique contribution to make to Christ's church. Does God's way of honoring others sound too difficult for your competitive nature? Why not try to outdo one another in showing honor? Put others first!",
    "prayer": "Dear Heavenly Father, I try to honor You as I should ~~ But I often put others down ~~ Forgive me for not honoring others as I should ~~ Forgive me for not honoring You as I should. Amen.",
    "reading": "",
    "original_content": "God Bless You Today!!!~~~(food for thought)~~~To fear the Lord means giving Him\nour reverence, trust, and awe...\n\nOur Bible Verse for Today:\n\nBe devoted to one another in brotherly love. Honor one another\nabove yourselves...(Ro. 12:10) NIV\n\nOur Lesson for Today:\n\nWe can honor others in one of two ways. One involves ulterior motives.\n\nWe honor our bosses so they will reward us, \nour employers so they will work harder, \nthe wealthy so they will contribute to our cause, \nthe powerful so they will use their power for us and not against us.\n\nGod's way involves love. As Christians,\n\nWe honor people because they have been created in God's image,\nbecause they are our brothers and sisters in Christ,\nand because they have a unique contribution to make to Christ's church.\n\nDoes God's way of honoring others sound too difficult for your competitive nature?\n\nWhy not try to outdo one another in showing honor? Put others first!\n\nOur Prayer for Today:\nDear Heavenly Father, I try to honor You as I should ~~ \nBut I often put others down ~~ Forgive me for not honoring\nothers as I should ~~ Forgive me for not honoring You as I should...Amen.\n\nKeep looking up, with honor and praise...\nYour are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1163de5a06163864",
    "date_utc": "Tue, 13 Nov 2007 06:51:48 -0600",
    "subject": "thoughts to live by",
    "verse": "Be joyful in hope, patient in affliction, faithful in prayer. (Romans 12:12, 13) NIV",
    "reflection": "Verse 12 seems like a tall order in our troubled world today: \"Be joyful in hope, patient in affliction.\" But the next three words hold the answer to how this is possible: \"Be faithful in Prayer.\" Yes we can to take of problems to the Lord. But there is one important lesson we need to learn; we need to learn to leave them there. How often have we taken a certain problem to God, but then have picked it up again and taken with us? The Bible says: \"Cast all your cares upon Him [God]; for He careth for you.\" Are you among the people who believe in the latter part of this verse but never do the first??? What ever your problem, it is not to big for God to handle.",
    "prayer": "Dear Heavenly Father I have this problem which I bring to You today. I know in my heart that You care for me and want only the best for me, so here I lay my burden down and leave it for You to take care of. Amen.",
    "reading": "",
    "original_content": "God Bless You Today!!!~~~(food for thought)~~~Living for Christ brings true freedom...\n\nOur Bible Verse for Today:\n\nBe joyful in hope, patient in affliction, faithful in prayer.\n(Ro. 12:12, 13) NIV\n\nOur Lesson for Today:\n\nVerse 12 seems like a tall order in our troubled world today: \n\"Be joyful in hope, patient in affliction.\" But the next three words\nhold the answer to how this is possible: \"Be faithful in Prayer.\"\n\nYes we can to take of problems to the Lord...\n\nBut there is one important lesson we need to learn; \nwe need to learn to leave them there.\n\nHow often have we taken a certain problem to God,\nbut then have picked it up again and taken with us?\n\nThe Bible says: \"Cast all your cares upon Him [God];\nfor He careth for you.\"\n\nAre you among the people who believe in the latter part\nof this verse but never do the first???\n\nWhat ever your problem, it is not to big for God to handle...\n\nOur Prayer for Today:\nDear Heavenly Father I have this problem ____________\nwhich I bring to You today. I know in my heart that You care\nfor me and want only the best for me, so here I lay my burden \ndown and leave it for You to take care of...Amen.\n\nKeep looking up, He cares for you...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11642ed06877a069",
    "date_utc": "Wed, 14 Nov 2007 06:51:55 -0600",
    "subject": "thoughts to live by",
    "verse": "Do not repay anyone evil for evil. Be careful to do what is right in the eyes of everybody. If it is possible, as far as it depends on you, live at peace with everyone. do not take revenge, my friends, but leave room for God's wrath, for it is written: \"It is mine to avenge; I will repay, \" Says the Lord. On the contrary: \"If your enemy is hungry, feed him; if he is thirsty, give him something to drink. In doing this, you will heap burning coals on his head.\" Do not be overcome by evil, but overcome evil with good. (John 12:17-21)",
    "reflection": "These verses summarize the core of Christian living. if we love someone the way Christ loves us, we will be willing to forgive. If we have experienced God's grace, we will want to pass it on to others. Remember, grace is undeserved favor. By giving an enemy a drink, we are not excusing his misdeeds. We are recognizing him, forgiving him, and loving him in-spit of his sins, just as Christ did for us.",
    "prayer": "Dear Heavenly Father, instill in me a more forgiving heart. When I am wronged help me to forgive and remember that wrong no more. Instill in me a Christ-like heart. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~Remember, Christ Died for you...\n\nOur Bible Verses for Today:\n\nDo not repay anyone evil for evil. Be careful to do what is right \nin the eyes of everybody...\n\nIf it is possible, as far as it depends on you, live at peace with everyone...\n\ndo not take revenge, my friends, but leave room for God's wrath, \nfor it is written: \"It is mine to avenge; I will repay,\" Says the Lord.\n\nOn the contrary: \"If your enemy is hungry, feed him; if he is thirsty,\ngive him something to drink. In doing this, you will heap burning\ncoals on his head.\"\n\nDo not be overcome by evil, but overcome evil with good...(Jn. 12:17-21)\n\nOur Lesson for Today:\n\nThese verses summarize the core of Christian living. if we love someone\nthe way Christ loves us, we will be willing to forgive...\n\nIf we have experienced God's grace, we will want to pass it on to others.\nRemember, grace is undeserved favor...\n\nBy giving an enemy a drink, we are not excusing his misdeeds...\n\nWe are recognizing him, forgiving him, and loving him in-spit of his sins,\njust as Christ did for us...\n\nOur Prayer for Today:\nDear Heavenly Father, instill in me a more forgiving heart.\nWhen I am wronged help me to forgive and remember\nthat wrong no more. Instill in me a Christ-like heart...Amen.\n\nKeep looking up, He will forgive you...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "116480c476f5f649",
    "date_utc": "Thu, 15 Nov 2007 07:08:38 -0600",
    "subject": "thoughts to live by",
    "verse": "Everyone must submit Himself to the governing authorities, for there is no authority except that which God has established. The authorities that exist have been established by God. (Romans 13:1) NIV",
    "reflection": "Are there times when you should not obey the government? Well we should never allow government to force us to disobey God. Jesus and His disciples never disobeyed the government for personal reasons; when they disobeyed, it was in order to follow God's moral standards. Their disobedience was not cheap: They were threatened, beaten, thrown into jail, tortured, and executed for their convictions. Like them, if we are compelled to disobey, we must be ready to accept the consequences.",
    "prayer": "Dear Heavenly Father, help me to remain true to Your Word, even in the probability of suffering for my stance. I pray that You wold give me godly wisdom so that I might know Your truth more fully. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~Sorry about yesterdays devo. I typed in (Jn. 12:17-21)\nwhen it really was Ro. 12:17-21.\n\nOur Bible Verse for Today:\n\nEveryone must submit Himself to the governing authorities,\nfor there is no authority except that which God has established.\nThe authorities that exist have been established by God...(Ro 13:1) NIV\n\nOur Lesson for Today:\n\nAre there times when you should not obey the government?\n\nWell we should never allow government to force us to disobey\nGod.\n\nJesus and His disciples never disobeyed the government for \npersonal reasons; when they disobeyed, it was in order to follow\nGod's moral standards...\n\nTheir disobedience was not cheap: They were threatened, beaten, \nthrown into jail, tortured, and executed for their convictions...\n\nLike them, if we are compelled to disobey, we must be ready to\naccept the consequences...\n\nOur Prayer for Today:\nDear Heavenly Father, help me to remain true to Your Word,\neven in the probability of suffering for my stance. I pray that\nYou wold give me godly wisdom so that I might know Your\ntruth more fully...Amen.\n\nKeep looking up, seeking godly wisdom...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1164d46f22eca4b3",
    "date_utc": "Fri, 16 Nov 2007 09:16:39 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul says: those who refuse to obey the laws of the land are refusing to obey God, and punishment will follow. For the authorities do not frighten people who are doing right, but they frighten those who are doing wrong. So do what they say, and you will get along well. The authorities are sent by God to help you, but if you are doing something wrong, of course you should be afraid, for you will be punished. The authorities are established for that very purpose, to punish those who do wrong. (Romans 13:2-4) NIV",
    "reflection": "When authorities are unjust, upright people are afraid. In these verse, Paul is talking about authorities who are doing their duty. When these officials are just, people who are doing right have nothing to fear. Christians understand Romans 13 in different ways. All Christians agree that we are to live at peace with the state as long as the state allows us to live by our religious convictions. Let us not forget God has placed our countries leaders in charge of keeping peace in the country. Oh yes the country has had some corrupt leaders because they have allowed Satan to corrupt them.",
    "prayer": "Dear Heavenly Father, I pray today for godly wisdom for our countries leaders both federal, state and local officials. Help me to submit to these authorities as long as they do not overstep Your will. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~Jesus says, \"Do not fear for I am with you...\"\n\nOur Bible Verses for Today:\n\nPaul says: those who refuse to obey the laws of the land are\nrefusing to obey God, and punishment will follow...\n\nFor the authorities do not frighten people who are doing right,\nbut they frighten those who are doing wrong. So do what they \nsay, and you will get along well...\n\nThe authorities are sent by God to help you, but if you are doing \nsomething wrong, of course you should be afraid, for you will be\npunished. The authorities are established for that very purpose,\nto punish those who do wrong...(Ro. 13:2-4) NIV\n\nOur Lesson for Today:\n\nWhen authorities are unjust, upright people are afraid. In these \nverse, Paul is talking about authorities who are doing their duty.\n\nWhen these officials are just, people who are doing right have \nnothing to fear...\n\nChristians understand Ro. 13 in different ways. All Christians \nagree that we are to live at peace with the state as long as the \nstate allows us to live by our religious convictions...\n\nLet us not forget God has placed our countries leaders in\ncharge of keeping peace in the country...\n\nOh yes the country has had some corrupt leaders because \nthey have allowed Satan to corrupt them...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray today for godly wisdom for\nour countries leaders both federal, state and local officials.\nHelp me to submit to these authorities as long as they do\nnot over-step Your will...Amen.\n\nKeep looking up, do not anxiously look around you...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "116577ba685db725",
    "date_utc": "Sun, 18 Nov 2007 13:18:08 -0600",
    "subject": "thoughts to live by",
    "verse": "Let no debt remain outstanding except the continuing debt to love one another, for he who loves his fellowman has fulfilled the law. (Romans 13:8) NIV",
    "reflection": "Why is love for others called a debt??? We need to remember we are permanently in debt to Christ for the lavish love He has poured out on us. The only way we can even begin to repay this debt is by loving others in turn. Because Christ's love will always be infinitely greater than ours, we will always have the obligation to love our neighbors.",
    "prayer": "Dear Lord, teach me to be more loving toward others. Help me to always be ready to offer a loving hand to those on need. Help me to have a Christ-like love. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~Helping someone in Jesus' name is your\nmost important work for the day...\n\nOur Bible Verse for Today:\n\nLet no debt remain outstanding except the continuing \ndebt to love one another, for he who loves his fellowman\nhas fulfilled the law...(Ro 13:8) NIV\n\nOur Lesson for Today:\n\nWhy is love for others called a debt???\n\nWe need to remember we are permanently in debt to Christ for\nthe lavish love He has poured out on us...\n\nThe only way we can even begin to repay this debt is by loving\nothers in turn...\n\nBecause Christ's love will always be infinitely greater than ours,\nwe will always have the obligation to love our neighbors...\n\nOur Prayer for Today:\nDear Lord, teach me to be more loving toward others.\nHelp me to always be ready to offer a loving hand to\nthose on need...Help me to have a Christ-like love...Amen.\n\nKeep looking up, He says He will help us...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1165c8ffae4cdc9e",
    "date_utc": "Mon, 19 Nov 2007 11:17:16 -0600",
    "subject": "thoughts to live by",
    "verse": "The commandments, \"Do not commit adultery, \" \"Do not murder, \" \"Do not steal, \" \"Do not covet, \" and whatever other commandment there may be, are summed up in this one rule: \"Love your neighbor as yourself.\" (Romans 13:9) NIV",
    "reflection": "Somehow many of us have gotten the idea that self-love is wrong. But if this were the case, it would be pointless to love our neighbor as ourselves. But Paul explains what he means by self-love. Even if you have low self esteem, you probably don't willingly let yourself go hungry. You take care of your body and may even exercise. You cloth yourself reasonably well. You make sure there is a roof over your head. You try not to let yourself be cheated or injured. This is the kind of love we need to have for our neighbors. Do we see that others are fed, clothed, and housed as well as they can be? Are we concerned about issues of social justice? Loving others as ourselves means actively working to see that their needs are met. It is interesting that people who focus on others rather than themselves rarely suffer from low self-esteem.",
    "prayer": "Dear Heavenly Father, help me to be sensitive to the needs of others. Help me to lend a helping hand to those less fortunate then I. open the doors of opportunity for me to be of assistance to those in need. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~God has promised not to leave us helpless...\n\nOur Bible Verse for Today:\n\nThe commandments, \"Do not commit adultery,\" \"Do not murder,\"\n\"Do not steal,\" \"Do not covet,\" and whatever other commandment\nthere may be, are summed up in this one rule: \"Love your neighbor \nas yourself.\" (Ro. 13:9) NIV\n\nOur Lesson for Today:\n\nSomehow many of us have gotten the idea that self-love is wrong.\nBut if this were the case, it would be pointless to love our neighbor\nas ourselves...\n\nBut Paul explains what he means by self-love. Even if you have low\nself esteem, you probably don't willingly let yourself go hungry. You\ntake care of your body and may even exercise...\n\nYou cloth yourself reasonably well. You make sure there is a roof \nover your head. You try not to let yourself be cheated or injured...\n\nThis is the kind of love we need to have for our neighbors. Do we \nsee that others are fed, clothed, and housed as well as they can be?\n\nAre we concerned about issues of social justice? Loving others as \nourselves means actively working to see that their needs are met.\n\nIt is interesting that people who focus on others rather than themselves\nrarely suffer from low self-esteem...\n\nOur Prayer for Today:\nDear Heavenly Father, help me to be sensitive to the needs \nof others. Help me to lend a helping hand to those less fortunate \nthen I. open the doors of opportunity for me to be of assistance\nto those in need...Amen.\n\nKeep looking up, to the one who is steadfast and sure...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11661d7d238797ed",
    "date_utc": "Tue, 20 Nov 2007 05:02:31 -0600",
    "subject": "thoughts to live by",
    "verse": "Love does no harm to its neighbor. Therefore love is the fulfillment of the law. (Romans 13:10) NIV",
    "reflection": "Christians must obey the law of love, which supersedes both religious and civil laws. How easy it is to excuse our indifference to others merely because we have no legal obligation to help them and even justify harming them if our actions are technically legal! But Jesus does not leave loopholes in the law of love. Whenever love demands it, we are to go beyond human legal requirements and imitate the God of love.",
    "prayer": "Dear Heavenly Father I thank You for Your love and mercy. Instill in me a Christ-like love, so that I may not sin against You. Forgive me for not always being as loving as I should be. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~In all things ~ give thanks...\n\nOur Bible Verse for Today:\n\nLove does no harm to its neighbor. Therefore love is the\nfulfillment of the law...(Ro. 13:10) NIV\n\nOur Lesson for Today:\n\nChristians must obey the law of love, which supersedes\nboth religious and civil laws. How easy it is to excuse our\nindifference to others merely because we have no legal\nobligation to help them and even justify harming them if\nour actions are technically legal!\n\nBut Jesus does not leave loopholes in the law of love.\nWhenever love demands it, we are to go beyond human\nlegal requirements and imitate the God of love...\n\nOur Prayer for Today:\nDear Heavenly Father I thank You for Your love and mercy.\nInstill in me a Christ-like love, so that I may not sin against \nYou. Forgive me for not always being as loving as I should\nbe...Amen.\n\nKeep looking up, we have a forgiving God...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "116671ede8b26e23",
    "date_utc": "Wed, 21 Nov 2007 10:15:21 -0600",
    "subject": "thoughts to live by",
    "verse": "The night is nearly over; the day is almost here. so let us put aside the deeds of darkness and put on the armor of light. Let us behave decently, as in the daytime, not in orgies and drunkenness, not in sexual immorality and debauchery, not in dissension and jealousy. Rather, clothe yourselves with the Lord Jesus Christ, and do not think about how to gratify the desires of the sinful nature. (Romans, 13:12-14) NIV",
    "reflection": "The \"night\" refers to the present evil time. The \"day\" refers to the time of Christ's return. When Christ returns He wants to find His people clean on the inside as well as on the outside. Now the only way that can become possible is to let Christ take control of us. So how do we let Christ take control of our life??? (first) we identify with Christ by being baptized (Galatians 3:27). This shows our solidarity with other Christians and with the death, burial, and resurrection of Jesus Christ. (second) we exemplify the qualities Jesus showed while He was here on earth (love, humility, truth, service). In a sense, we roleplay what Jesus would do in our situation. We must also avoid those situations that open the door to gratifying sinful desires.",
    "prayer": "Dear Heavenly Father, I pray for Your guidance so that I would always exemplify Your qualities. I pray that through Your guidance love, humility, truth, and service for the kingdom would become a natural part of my life. Help me to always avoid those situations that would open the door to gratifying sinful desires. Amen.",
    "reading": "",
    "original_content": "Happy Thanksgiving!!!~~~(food for thought)~~~Always be thankful...\n\nOur Bible Verses for Today:\n\nThe night is nearly over; the day is almost here. so let us\nput aside the deeds of darkness and put on the armor of\nlight.\n\nLet us behave decently, as in the daytime, not in orgies and \ndrunkenness, not in sexual immorality and debauchery, not \nin dissension and jealousy...\n\nRather, clothe yourselves with the Lord Jesus Christ, and do\nnot think about how to gratify the desires of the sinful nature.\n(Ro, 13:12-14) NIV\n\nOur Lesson for Today:\n\nThe \"night\" refers to the present evil time. The \"day\" refers to\nthe time of Christ's return...\n\nWhen Christ returns He wants to find His people clean on the\ninside as well as on the outside...\n\nNow the only way that can become possible is to let Christ take\ncontrol of us. So how do we let Christ take control of our life???\n\n(first) we identify with Christ by being baptized (Gal. 3:27).\nThis shows our solidarity with other Christians and with the death,\nburial, and resurrection of Jesus Christ...\n\n(second) we exemplify the qualities Jesus showed while He was \nhere on earth (love, humility, truth, service). In a sense, we roleplay what Jesus would do in our situation...\n\nWe must also avoid those situations that open the door to\ngratifying sinful desires...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray for Your guidance so that I would\nalways exemplify Your qualities. I pray that through Your guidance\nlove, humility, truth, and service for the kingdom would become a\nnatural part of my life. Help me to always avoid those situations\nthat would open the door to gratifying sinful desires...Amen.\n\nKeep looking up, with an attitude of thankfulness...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1166c036ab5e94ff",
    "date_utc": "Thu, 22 Nov 2007 10:25:11 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul says: Accept him whose faith is weak, without passing judgment on disputable matters. (Romans 14:1) NIV",
    "reflection": "This verse assumes there will be differences of opinion in the church about what is right or wrong. Paul says we are not to quarrel about issues that are matters of opinion. Differences should not be feared or avoided but accepted and handled with love. Don't expect everyone, even in the best possible church, to agree on every subject. Through the sharing of ideas we can come to a fuller understanding of what the Bible teaches. Accept, listen to, and respect others. Differences of opinion need not cause division. they can be a source of learning and richness in our relationships.",
    "prayer": "Dear Heavenly Father, Help me to always be open to the opinions of others, without becoming judgmental. For I know You are the final judge. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~Thankfulness should not be limited to one day\n\nOur Bible Verse for Today:\n\nPaul says: Accept him whose faith is weak, without passing\njudgment on disputable matters...(Ro. 14:1) NIV\n\nOur Lesson for Today:\n\nThis verse assumes there will be differences of opinion in\nthe church about what is right or wrong. Paul says we are \nnot to quarrel about issues that are matters of opinion...\n\nDifferences should not be feared or avoided but accepted \nand handled with love. Don't expect everyone, even in the\nbest possible church, to agree on every subject...\n\nThrough the sharing of ideas we can come to a fuller understanding of what the Bible teaches. Accept, listen to, and\nrespect others...\n\nDifferences of opinion need not cause division. they can be\na source of learning and richness in our relationships...\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to always be open\nto the opinions of others, without becoming judgmental.\nFor I know You are the final judge...Amen.\n\nKeep looking up, for Godly-wisdom...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1167147c028becda",
    "date_utc": "Fri, 23 Nov 2007 13:02:44 -0600",
    "subject": "thoughts to live by",
    "verse": "One man's faith allows him to eat everything, but another man, whose faith is weak, eats only vegetables. The man who eats everything must not look down on him who does not, and the man who does not eat everything must not condemn the man who does, for God has accepted him. (Romans 14:2, 3) NIV",
    "reflection": "Eating \"anything\" may refer to a strong Christian being free from dietary restrictions, or it may refer to his eating meat offered to idols. The person weaker in the faith, however may eat only vegetables and refuse to eat meat that has been offered to idols. But how would Christians end up eating meat that had been offered to idols? The ancient system of sacrifice was at the center of the religious, social, and domestic life of the Roman world. After a sacrifice was presented to a god in a pagan temple, only part of it was burned. The remainder was often sent to the market to be sold. Thus, a Christian might easily ~ even unknowingly ~ Buy such meat in the market place or eat it at the home of a friend. Should a friend question the source of the meat? Some thought there was nothing wrong with eating meat that had been offered to idols because idols were worthless. Others carefully checked the source of their meat or gave up meat altogether, in order to avoid a guilty conscience. What does this have to do with us today? Well whether your conscience bothers you because of something you eat or possibly because of certain conduct, you should seek a clearer understanding of what you are doing ~ It just could be the Holy Spirit speaking to you. He may want you to pray for direction.",
    "prayer": "Dear Heavenly Father, I pray for a deeper sensitivity to Your Holy Spirit's guidance in my life. Help me to live within Your will each day. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for thought)~~~Always Kneel before the Lord in\nan attitude of gratitude...\n\nOur Bible Verses for Today:\n\nOne man's faith allows him to eat everything, but another man, \nwhose faith is weak, eats only vegetables...\n\nThe man who eats everything must not look down on him who \ndoes not, and the man who does not eat everything must not\ncondemn the man who does, for God has accepted him. (Ro. 14:2, 3) NIV \n\nOur Lesson for Today:\n\nEating \"anything\" may refer to a strong Christian being free from dietary \nrestrictions, or it may refer to his eating meat offered to idols...\n\nThe person weaker in the faith, however may eat only vegetables and \nrefuse to eat meat that has been offered to idols...\n\nBut how would Christians end up eating meat that had been offered \nto idols?\n\nThe ancient system of sacrifice was at the center of the religious, social, \nand domestic life of the Roman world...\n\nAfter a sacrifice was presented to a god in a pagan temple, only part of \nit was burned. The remainder was often sent to the market to be sold...\n\nThus, a Christian might easily ~ even unknowingly ~ Buy such meat in the \nmarket place or eat it at the home of a friend...\n\nShould a friend question the source of the meat? Some thought there was \nnothing wrong with eating meat that had been offered to idols because \nidols were worthless...\n\nOthers carefully checked the source of their meat or gave up meat altogether, \nin order to avoid a guilty conscience...\n\nWhat does this have to do with us today?\n\nWell whether your conscience bothers you because of something you eat or \npossibly because of certain conduct, you should seek a clearer understanding\nof what you are doing ~ It just could be the Holy Spirit speaking to you...\n\nHe may want you to pray for direction...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray for a deeper sensitivity to Your\nHoly Spirit's guidance in my life. Help me to live within Your \nwill each day...Amen.\n\nKeep looking up, He wants to direct your path...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1167b95413511419",
    "date_utc": "Sat, 24 Nov 2007 15:08:33 -0600",
    "subject": "thoughts to live by",
    "verse": "You, then, why do you judge your brother? or why do you look down on your brother? For we will stand before God's judgment seat. It is written, \"As surely as I live, \" says the Lord, \"Every knee will bow before me; Every tongue will confess to God.\" So then each of us will give an account of himself to God. Therefore let us stop passing judgment on one another. instead, make up your mind not to put any stumbling block or obstacle in your brothers ways. As one who is in the Lord Jesus, I am fully convinced that no food is unclean in itself. But if anyone regards something as unclean, it is unclean. (Romans 14:10-14) NIV",
    "reflection": "Each person is accountable to Christ, not to others. While the church has to be uncompromising in its stand against activities that are expressly forbidden by the scripture (adultery, homosexuality, murder, theft), it should not create additional rules and regulations and give them equal standing with God's law.",
    "prayer": "Dear Heavenly Father, forgive me for my sins of thought, word, or deed. Create in me a pure heart that I may not become a slave to sin. Amen.",
    "reading": "",
    "original_content": "Have A Blessed Day!!!~~~(food for though)~~~Your most important work is helping\nsomeone in Jesus name...\n\nOur Bible Verses for Today:\n\nYou, then, why do you judge your brother? or why do you\nlook down on your brother? For we will stand before God's\njudgment seat.\n\nIt is written, \"As surely as I live,\" says the Lord, \"Every knee will\nbow before me; Every tongue will confess to God.\" \n\nSo then each of us will give an account of himself to God...\n\nTherefore let us stop passing judgment on one another. instead,\nmake up your mind not to put any stumbling block or obstacle in\nyour brothers ways...\n\nAs one who is in the Lord Jesus, I am fully convinced that no food \nis unclean in itself. But if anyone regards something as unclean, it is\nunclean...(Ro. 14:10-14) NIV\n\nOur Lesson for Today:\n\nEach person is accountable to Christ, not to others...\n\nWhile the church has to be uncompromising in its stand against\nactivities that are expressly forbidden by the scripture (adultery,\nhomosexuality, murder, theft), it should not create additional\nrules and regulations and give them equal standing with God's\nlaw...\n\nOur Prayer for Today:\nDear Heavenly Father, forgive me for my sins of thought, word,\nor deed. Create in me a pure heart that I may not become a\nslave to sin...Amen.\n\nKeep looking up, you are accountable to Him...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11680c8be2c54396",
    "date_utc": "Mon, 26 Nov 2007 08:49:05 -0600",
    "subject": "thoughts to live by",
    "verse": "Do not destroy the work of God for the sake of food, all food is clean, but it is wrong for a man to eat anything that causes someone else to stumble. It is better not to eat meat or drink wine or to do anything else that will cause your brother to fall. (Romans 14:20, 21) NIV",
    "reflection": "Remember, sin is not a private matter. Everything we do affects others, and we have to think of them constantly. God created us to be interdependent, not independent. We who are strong in our faith must, without pride or condescension, treat others with love, patience, and self-restraint.",
    "prayer": "Dear Heavenly Father help me to always be mindful of the feeling of others. Help me to refrain from doing anything that may cause someone to stumble. Help me to be sensitive to the feelings of others. Amen.",
    "reading": "",
    "original_content": "Have a Blessed Day!!!~~~(food for thought)~~~Run the race of life with eternity in view...\n\nOur Bible Verses for Today:\n\nDo not destroy the work of God for the sake of food, all food\nis clean, but it is wrong for a man to eat anything that causes \nsomeone else to stumble...\n\nIt is better not to eat meat or drink wine or to do anything else\nthat will cause your brother to fall...(Ro. 14:20, 21) NIV\n\nOur Lesson for Today:\n\nRemember, sin is not a private matter. Everything we do\naffects others, and we have to think of them constantly...\n\nGod created us to be interdependent, not independent...\n\nWe who are strong in our faith must, without pride or\ncondescension, treat others with love, patience, and\nself-restraint...\n\nOur Prayer for Today:\nDear Heavenly Father help me to always be mindful\nof the feeling of others. Help me to refrain from doing\nanything that may cause someone to stumble...Help \nme to be sensitive to the feelings of others...Amen.\n\nKeep looking up, for His guidance...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11685c93cda88db2",
    "date_utc": "Tue, 27 Nov 2007 06:12:38 -0600",
    "subject": "thoughts to live by",
    "verse": "The man who has doubts is condemned if he eats, because his eating is not from faith; and everything that does not come from faith is sin. (Romans 14:23) NIV",
    "reflection": "We try to stay clear of actions forbidden by the Scripture of course, but sometimes Scripture is silent. That is when we need to follow our conscience.\"If you do anything you believe is not right you are sinning\" means that to go against conviction will leave a person with a guilty or uneasy conscience. When God shows that something is wrong for us, we should avoid it. But we should not look down on other Christian who exercise their freedom in those areas.",
    "prayer": "Dear Heavenly Father, Help me to always be sensitive to my conscience. Help me to keep from being judgmental. Help me to walk the path of our Savior. Amen.",
    "reading": "",
    "original_content": "Have a Blessed Day!!!~~~(food for thought)~~~The church's one foundation is Jesus Christ our Lord...\n\nOur Bible Verse for Today:\n\nThe man who has doubts is condemned if he eats, because \nhis eating is not from faith; and everything that does not come \nfrom faith is sin...(Ro. 14:23) NIV\n\nOur Lesson for Today:\n\nWe try to stay clear of actions forbidden by the Scripture of course,\nbut sometimes Scripture is silent. That is when we need to follow\nour conscience. \n\n\"If you do anything you believe is not right you are sinning\" means\nthat to go against conviction will leave a person with a guilty or uneasy \nconscience...\n\nWhen God shows that something is wrong for us, we should avoid it. \nBut we should not look down on other Christian who exercise their \nfreedom in those areas...\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to always be sensitive \nto my conscience. Help me to keep from being judgmental.\nHelp me to walk the path of our Savior...Amen.\n\nKeep looking up, don't become a doubter...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1168afb326946ebb",
    "date_utc": "Wed, 28 Nov 2007 05:27:55 -0600",
    "subject": "thoughts to live by",
    "verse": "We who are strong ought to bear with the failings of the weak and not to please ourselves. Each of us should please his neighbor for his good, to build him up. (Romans 15:1, 2) NIV",
    "reflection": "If we merely set out to please our neighbor, we will be people pleases (Galatians 1:10). We are to set aside willfulness and self-pleasing actions for the sake of building others up. Our Christian convictions must not be a disguise for cold-hearted treatment of our neighbors. Paul says: (Galatians 1:10) \"Am I now trying to win the approval of men, or of God? Or am I trying to please men? If I were trying to please men, I would not be a servant of Christ.\"",
    "prayer": "Dear Heavenly Father, help me to correct my priorities, help me to put You first in all that I do, but also help me to be a good neighbor. Forgive me for putting self first. Amen.",
    "reading": "",
    "original_content": "Have a Blessed Day!!!~~~(food for thought)~~~The church to attend is where Christ is preached...\n\nOur Bible Verses for Today:\n\nWe who are strong ought to bear with the failings of the weak\nand not to please ourselves...\n\nEach of us should please his neighbor for his good, to build\nhim up...(Ro. 15:1, 2) NIV\n\nOur Lesson for Today:\n\nIf we merely set out to please our neighbor, we will be people\npleasers (Gal 1:10)...\n\nWe are to set aside willfulness and self-pleasing actions for\nthe sake of building others up. Our Christian convictions must \nnot be a disguise for cold-hearted treatment of our neighbors...\n\nPaul says: (Gal. 1:10) \"Am I now trying to win the approval of \nmen, or of God? Or am I trying to please men? If I were trying \nto please men, I would not be a servant of Christ.\"\n\nOur Prayer for Today:\nDear Heavenly Father, help me to correct my priorities, \nhelp me to put You first in all that I do, but also help me\nto be a good neighbor. Forgive me for putting self first...Amen.\n\nKeep looking up, He should always be first in your mind...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1169029e6f1f6fde",
    "date_utc": "Thu, 29 Nov 2007 07:01:07 -0600",
    "subject": "thoughts to live by",
    "verse": "For even Christ did not please Himself but, as it is written: \"The insults of those who insult you have fallen on Me.\" For everything that was written in the past was written to teach us, so that through endurance and the encouragement of the Scriptures we might have hope. (Romans 15:3, 4) NIV",
    "reflection": "If we seek a sensitivity to the Lord's will, true knowledge of the Scriptures will affect our attitude toward the present and the future. The more we know about what God has done in years past, the greater the confidence we will have about what He will do in the days ahead. We need to diligently read our Bible so we have the confidence that God's will is best for us.",
    "prayer": "Dear Heavenly Father, forgive me for not always trusting in You to lead me in the best way. Forgive me when I hesitate to step out in faith. Help me Lord to trust You more. Amen.",
    "reading": "",
    "original_content": "Have a Blessed Day!!!~~(food for thought)~~What does Jesus think about my thoughts and actions?\n\nOur Bible Verses for Today:\n\nFor even Christ did not please Himself but, as it is written:\n\"The insults of those who insult you have fallen on Me.\"\n\nFor everything that was written in the past was written to \nteach us, so that through endurance and the encouragement \nof the Scriptures we might have hope...(Ro.15:3, 4) NIV\n\nOur Lesson for Today:\n\nIf we seek a sensitivity to the Lord's will, true knowledge of the \nScriptures will affect our attitude toward the present and the future.\n\nThe more we know about what God has done in years past, the\ngreater the confidence we will have about what He will do in the \ndays ahead...\n\nWe need to diligently read our Bible so we have the confidence\nthat God's will is best for us...\n\nOur Prayer for Today:\nDear Heavenly Father, forgive me for not always trusting\nin You to lead me in the best way. Forgive me when I hesitate\nto step out in faith. Help me Lord to trust You more...Amen.\n\nKeep looking up, He will make the way clear...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "116954d5806cd6d3",
    "date_utc": "Fri, 30 Nov 2007 06:34:31 -0600",
    "subject": "thoughts to live by",
    "verse": "May the God who gives endurance and encouragement give you a spirit of unity among yourselves as you follow Christ Jesus, so that with one heart and mouth you may glorify the God and Father of our Lord Jesus Christ. Accept one another, then. just as Christ accepted you, in order to bring praise to God. (Romans 15:5-7) NIV",
    "reflection": "Just as we take Jesus' view on the authority of Scripture, the nature of heaven, and the resurrection, we are to have His attitude of love toward other Christians as well. As we grow in faith and come to know Jesus better, we will become more capable of maintaining His attitude of loving unity throughout each day. If you wish to know more about Christ's attitude read (Phi. 2)",
    "prayer": "Dear Heavenly Father, help me to make an attitude adjustment. Help me to have a Christ-like attitude ~ one of loving concern for other people. Help me not to judge people on first impressions. Amen.",
    "reading": "",
    "original_content": "Have a Blessed Day!!! ~ (food for thought) ~ First impressions often lead to wrong conclusions...\n\nOur Bible Verses for Today:\n\nMay the God who gives endurance and encouragement give you\na spirit of unity among yourselves as you follow Christ Jesus,\n\nso that with one heart and mouth you may glorify the God and\nFather of our Lord Jesus Christ...\n\nAccept one another, then. just as Christ accepted you, in order \nto bring praise to God...(Ro 15:5-7) NIV\n\nOur Lesson for Today:\n\nJust as we take Jesus' view on the authority of Scripture, the \nnature of heaven, and the resurrection, we are to have His \nattitude of love toward other Christians as well...\n\nAs we grow in faith and come to know Jesus better, we will\nbecome more capable of maintaining His attitude of loving\nunity throughout each day...\n\nIf you wish to know more about Christ's attitude read (Phi. 2)\n\nOur Prayer for Today:\nDear Heavenly Father, help me to make an attitude adjustment.\nHelp me to have a Christ-like attitude ~ one of loving concern\nfor other people. Help me not to judge people on first impressions...Amen.\n\nKeep looking up, He will help you with your flawed impressions...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]
