[
  {
    "message_id": "1645847f19d5e54c",
    "date_utc": "Sun, 01 Jul 2018 18:57:47 -0500",
    "subject": "Devo. for July 2",
    "verse": "Those who control their anger have great understanding; Those who have a hasty temper will make mistakes. (Pro. 14:29)",
    "reflection": "Anger divides people. It pushes them into hasty decisions that only cause bitterness and guilt. But anger can be a legitimate reaction to injustice and sin. When you feel yourself getting angry, look for the cause. Or are you reacting to a personal insult? Pray that God will help you control a Quick temper. Pray for humility and repentance.",
    "prayer": "Dear Heavenly Father, I pray that You would give me a spirit of humiliation so that I will not lose my temper over the least little thing. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Those who control their anger have great understanding; Those who_\n\n_have a hasty temper will make mistakes. _ (Pro. 14:29)\n\nTHOUGHT FOR TODAY:\n\nAnger divides people. It pushes them into hasty decisions that only\n\ncause bitterness and guilt. But anger can be a legitimate reaction to\n\ninjustice and sin. When you feel yourself getting angry, look for the\n\ncause. Or are you reacting to a personal insult? Pray that God will\n\nhelp you control a Quick temper. Pray for humility and repentance.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that You would give me a spirit of\n\nhumiliation so that I will not lose my temper over the least little\n\nthing. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1645de71a7be1c6d",
    "date_utc": "Mon, 02 Jul 2018 21:09:44 -0500",
    "subject": "Devo. for July 3",
    "verse": "Those who oppress the poor insult their Maker, but those who help the poor honor Him. (Pro. 14:31)",
    "reflection": "God cares for the weak and the needy. In Ps. 12:5 He promises to protect the downtrodden and confront their oppressors. We should follow God's attitude. His works are not done until we care for the needs of the poor.",
    "prayer": "Dear Heavenly Father, help me to develop a greater Christ like attitude in regards to the needy, I pray in Jesus name. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Those who oppress the poor insult their Maker, but those who _\n\n_help the poor honor Him. _ (Pro. 14:31)\n\nTHOUGHT FOR TODAY:\n\nGod cares for the weak and the needy. In Ps. 12:5 He promises to\n\nprotect the downtrodden and confront their oppressors. We should\n\nfollow God's attitude. His works are not done until we care for the\n\nneeds of the poor.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me to develop a greater Christ like\nattitude\n\nin regards to the needy, I pray in Jesus name. . . Amen.\n\n_ _",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16462f3a4b135bbe",
    "date_utc": "Tue, 03 Jul 2018 20:41:32 -0500",
    "subject": "Devo. for July 4",
    "verse": "Godliness exalts a nation, but sin is a disgrace to any people. (Pro. 14:34)",
    "reflection": "(Righteousness exalts a nation) Here we have a reminder aimed especially at rulers and other public servants, that their good example is beneficial to the entire nation. Their sin, likewise, affects and disgraces all who live under their rule, My main thought here, is I wonder if other nations think that all citizens in this country can not be trusted because of the behavior of the leaders of this country?",
    "prayer": "Dear Heavenly Father, I pray that other nations would not loose their trust in this nation because of the disgraceful behavior of our leaders. I pray that our leaders would be convicted by Your Holy Spirit so that they would turn form their sinful ways. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Godliness exalts a nation, but sin is a disgrace to any people.\n_(Pro. 14:34)\n\nTHOUGHT FOR TODAY:\n\n(_Righteousness exalts a nation_) Here we have a reminder aimed\nespecially\n\nat rulers and other public servants, that their good example is\nbeneficial to the\n\nentire nation. Their sin, likewise, affects and disgraces all who\nlive under\n\ntheir rule, My main thought here, is I wonder if other nations think\nthat all\n\ncitizens in this country can not be trusted because of the behavior\nof the\n\nleaders of this country?\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that other nations would not loose their\ntrust\n\nin this nation because of the disgraceful behavior of our leaders. I\npray that\n\nour leaders would be convicted by Your Holy Spirit so that they would\nturn\n\nform their sinful ways. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164681796596108a",
    "date_utc": "Wed, 04 Jul 2018 20:38:54 -0500",
    "subject": "Devo. for July 5",
    "verse": "A king rejoices in servants who know what they are doing; he is angry with those who cause trouble. (Pro. 14:35)",
    "reflection": "Now being a retired pastor, I am reminded of the times I prayed that there were people in the church that knew what they were doing so I could call upon them to correct people who were causing trouble. If you don't the pastor can become over-whelmed with the task of trying to do it all.",
    "prayer": "Dear Lord give strength and wisdom to those who are trying to build up the church, and help them to realize when the pastor is being overwhelmed. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A king rejoices in servants who know what they are doing;_\n\n_he is angry with those who cause trouble. _(Pro. 14:35)\n\nTHOUGHT FOR TODAY:\n\nNow being a retired pastor, I am reminded of the times I\n\nprayed that there were people in the church that knew what\n\nthey were doing so I could call upon them to correct people\n\nwho were causing trouble. If you don't the pastor can become\n\nover-whelmed with the task of trying to do it all.\n\nPRAYER FOR TODAY:\n\nDear Lord give strength and wisdom to those who are trying\n\nto build up the church, and help them to realize when the\n\npastor is being overwhelmed. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1646d1e432f0e0d2",
    "date_utc": "Thu, 05 Jul 2018 20:04:17 -0500",
    "subject": "Devo. for July 6",
    "verse": "A gentile answer turns away wrath, but harsh words turn up anger. (Pro. 15:1)",
    "reflection": "Have you ever tried to argue in a whisper? It is equally hard to argue with one who insists on answering gently. On the other hand, a rising voice and harsh words almost always trigger an angry response. If we turn away wrath and seek peace, we need to use gentle words.",
    "prayer": "Dear Heavenly Father, create in me a gentle spirit, and patients to remain clam when approached by someone who insists on being antagonist. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A gentile answer turns away wrath, but harsh words _\n\n_turn up anger. _(Pro. 15:1)\n\nTHOUGHT FOR TODAY:\n\nHave you ever tried to argue in a whisper? It is equally\n\nhard to argue with one who insists on answering gently.\n\nOn the other hand, a rising voice and harsh words almost\n\nalways trigger an angry response. If we turn away wrath\n\nand seek peace, we need to use gentle words.\n\nPRAYER FOR TODAY;\n\nDear Heavenly Father, create in me a gentle spirit, and\n\npatients to remain clam when approached by someone\n\nwho insists on being antagonist. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164725efd8ae1ea7",
    "date_utc": "Fri, 06 Jul 2018 20:33:05 -0500",
    "subject": "Devo. for July 7",
    "verse": "The Lord is watching everywhere, keeping His eye on both evil and good. (Pro. 15:3)",
    "reflection": "At times it seem like God has let evil run rampant in the world, and we wonder if He even notices it. But God sees everything clearly--both the evil actions and the evil intentions lying behind them. He is not an indifferent observer. He cares and is active in the world. Right now, His work may be unseen and unfelt, but don't give up. One day He will wipe out evil and punish evil doers.",
    "prayer": "Dear Heavenly Father, I thank You that You have Your eye on everything and that nothing can be hidden from You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The Lord is watching everywhere, keeping His eye on both_\n\n_evil and good. _(Pro. 15:3)\n\nTHOUGHT FOR TODAY:\n\nAt times it seem like God has let evil run rampant in the world,\n\nand we wonder if He even notices it. But God sees everything\n\nclearly--both the evil actions and the evil intentions lying\n\nbehind them. He is not an indifferent observer. He cares and\n\nis active in the world. Right now, His work may be unseen and\n\nunfelt, but don't give up. One day He will wipe out evil and\n\npunish evil doers.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You that You have Your eye on\n\neverything and that nothing can be hidden from You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16477656cb5bd7f8",
    "date_utc": "Sat, 07 Jul 2018 19:58:13 -0500",
    "subject": "Devo. for July 8",
    "verse": "The Lord hates the sacrifice of the wicked, but He delights in the Prayers of the upright. (Pro. 15:8)",
    "reflection": "In Eccl Solomon wants us to test our faith, challenging us to find true and lasting meaning in God alone. As you take a hard look at your life as Solomon did his, you will see how important serving God is over all other options. Perhaps God is asking you to rethink your purpose and direction in life.",
    "prayer": "Dear Heavenly Father, give me the strength to accept the challenge to center my life in You alone. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The Lord hates the sacrifice of the wicked, but He delights_\n\n_in the Prayers of the upright. _(Pro. 15:8)\n\nTHOUGHT FOR TODAY:\n\nIn Eccl Solomon wants us to test our faith, challenging us to\n\nfind true and lasting meaning in God alone. As you take a\n\nhard look at your life as Solomon did his, you will see how\n\nimportant serving God is over all other options. Perhaps\n\nGod is asking you to rethink your purpose and direction in\n\nlife.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, give me the strength to accept the\n\nchallenge to center my life in You alone. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1647ca0eb8033e37",
    "date_utc": "Sun, 08 Jul 2018 20:21:18 -0500",
    "subject": "Devo. for Today:",
    "verse": "Even the depths of Death and Destruction are known by the Lord. How much more does He know the human heart! (Pro. 15:11)",
    "reflection": "Have you ever felt far from God, separated by feelings of failure and personal problems? Remember God stands ready to hear His people, to forgive their sins, and restore their relationship with Him. God is waiting and listening for our confession of guilt and our RE-commitment to obey Him. He hears us when we pour out our needs and problems to Him and is ready to forgive us and restore us to fellowship with Him. Don't wait to experience His loving forgiveness. . .",
    "prayer": "Dear Lord, forgive me when I forget to ask that I would be restored to a better relationship with You, when I have drifted far from You by the busyness of this life. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Even the depths of Death and Destruction are known by the Lord._\n\n_How much more does He know the human heart! _(Pro. 15:11)\n\nTHOUGHT FOR TODAY:\n\nHave you ever felt far from God, separated by feelings of failure\n\nand personal problems? Remember God stands ready to hear His\n\npeople, to forgive their sins, and restore their relationship with\n\nHim. God is waiting and listening for our confession of guilt and\n\nour RE-commitment to obey Him. He hears us when we pour out\n\nour needs and problems to Him and is ready to forgive us and\n\nrestore us to fellowship with Him. Don't wait to experience His\n\nloving forgiveness. . .\n\nPRAYER FOR TODAY:\n\nDear Lord, forgive me when I forget to ask that I would be restored\n\nto a better relationship with You, when I have drifted far from You\n\nby the busyness of this life. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16481d8f755482c4",
    "date_utc": "Mon, 09 Jul 2018 20:40:37 -0500",
    "subject": "Devo. for July 10",
    "verse": "A glad heart makes a happy face; a broken heart crushes the spirit. (Pro. 15:13)",
    "reflection": "Wisdom is the ability to see life from God's perspective and then will know the best course of action to take. Most people would agree that wisdom is a valuable asset, but how can we acquire it? Pro. 9:10 teaches that the fear of the Lord (respect and honor) is the beginning of wisdom. Wisdom comes from knowing and trusting God, it is not merely the way to find God. God will lead to understanding and then sharing this knowledge with others.",
    "prayer": "Dear Lord, of all wisdom and knowledge, instill in me some of your godly wisdom so that I might see life from Your perspective and then be able to know the course of action to take that will be pleasing to You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A glad heart makes a happy face; a broken heart crushes the_\n\n_spirit. _(Pro. 15:13)\n\nTHOUGHT FOR TODAY:\n\nWisdom is the ability to see life from God's perspective and then\nwill\n\nknow the best course of action to take. Most people would agree that\n\nwisdom is a valuable asset, but how can we acquire it? Pro. 9:10\n\nteaches that the fear of the Lord (respect and honor) is the\nbeginning of\n\nwisdom. Wisdom comes from knowing and trusting God, it is not merely\n\nthe way to find God. God will lead to understanding and then sharing\nthis\n\nknowledge with others.\n\nPRAYER FOR TODAY:\n\nDear Lord, of all wisdom and knowledge, instill in me some of your\n\ngodly wisdom so that I might see life from Your perspective and\n\nthen be able to know the course of action to take that will be\npleasing\n\nto You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16486e1fb99b2d1f",
    "date_utc": "Tue, 10 Jul 2018 20:08:34 -0500",
    "subject": "Devo. for July 11",
    "verse": "A wise person is hungry for truth, while the fool feeds on trash. (Pro. 15:14)",
    "reflection": "What we feed our mind is just as important as what we feed our body. The kinds of books we read, the people we talk with, the music we listen to, and the films we watch are all a part of our mental diet. Be discerning because what you feed your mind influences your total health and well-being. Remember a strong desire to discover knowledge is a mark of wisdom.",
    "prayer": "Dear Lord, I pray that Your Holy Spirit would always give me a hunger for the truth. Forgive me when I brake from that path. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A wise person is hungry for truth, while the fool feeds on trash._\n\n(Pro. 15:14)\n\nTHOUGHT FOR TODAY:\n\nWhat we feed our mind is just as important as what we feed our body.\n\nThe kinds of books we read, the people we talk with, the music we\n\nlisten to, and the films we watch are all a part of our mental diet.\nBe\n\ndiscerning because what you feed your mind influences your total\n\nhealth and well-being. Remember a strong desire to discover knowledge\n\nis a mark of wisdom.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that Your Holy Spirit would always give me a\n\nhunger for the truth. Forgive me when I brake from that path.\n\nAMEN.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1648c3d2dd5d5b63",
    "date_utc": "Wed, 11 Jul 2018 21:06:17 -0500",
    "subject": "Devo. for July 12",
    "verse": "For the poor, every day brings trouble, for the happy heart, is a continual feast. (Pro. 15; 15)",
    "reflection": "It is pretty evident that our attitude colors our whole personality. We cannot always choose what happens to us, but we can choose our attitude towards each situation. The secret to a happy heart is filling our mind with thoughts that are true, pure, and with thoughts that dwell on the good things of life. Is it time to examine your attitude? it just may be time to make some adjustments!",
    "prayer": "Dear Heavenly Father, I pray that You will always keep me alert to any corrections I need to make in regards to my attitude. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_For the poor, every day brings trouble, for the happy heart,_\n\n_is a continual feast. _(Pro. 15;15)\n\nTHOUGHT FOR TODAY:\n\nIt is pretty evident that our attitude colors our whole personality.\n\nWe cannot always choose what happens to us, but we can choose\n\nour attitude towards each situation. The secret to a happy heart is\n\nfilling our mind with thoughts that are true, pure, and with thoughts\n\nthat dwell on the good things of life. Is it time to examine your\n\nattitude? it just may be time to make some adjustments!\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that You will always keep me alert\n\nto any corrections I need to make in regards to my attitude. . .\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164933534ceb7172",
    "date_utc": "Fri, 13 Jul 2018 05:34:55 -0500",
    "subject": "Devo. for July 13",
    "verse": "It is better to have little with fear for the Lord, than to have great treasure with turmoil. (Pro. 15:16)",
    "reflection": "This statement is the key to spiritual growth and personal fulfillment. We should honor God and center our desires on Him (\"True Religion\" see Mt. 6:33), we should be content with what God is doing in our life (see Phil. 4:11-13)",
    "prayer": "Dear Heavenly Father, Forgive me for being spoiled by the abundance of blessings that have come into my life that makes me seek for more. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_It is better to have little with fear for the Lord, than to_\n\n_have great treasure with turmoil. _(Pro. 15:16)\n\nTHOUGHT FOR TODAY:\n\nThis statement is the key to spiritual growth and personal\n\nfulfillment. We should honor God and center our desires\n\non Him (\"True Religion\" see Mt. 6:33), we should be\n\ncontent with what God is doing in our life (see Phil.\n\n4:11-13)\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, Forgive me for being spoiled by\n\nthe abundance of blessings that have come into my life\n\nthat makes me seek for more. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1649683743d5dc18",
    "date_utc": "Fri, 13 Jul 2018 20:59:15 -0500",
    "subject": "Devo. for July 14",
    "verse": "A hot-head starts fights, a cool-tempered person tries to stop them. (Pro. 15:18)",
    "reflection": "The \"path of the upright\" doesn't always seem easy (15:19) but look at the alternatives. Hatred (15:17), dissension (!5:18) and laziness (15:19), all cause problems that an upright person does not have to face. By comparison, his or her life is a smooth, level road because it is built on a solid foundation of love for God,",
    "prayer": "Dear Heavenly Father I pray that You would forgive me for not always keeping my temper in check. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A hot-head starts fights, a cool-tempered person tries_\n\n_to stop them._ (Pro. 15:18)\n\nTHOUGHT FOR TODAY:\n\nThe \"path of the upright\" doesn't always seem easy (15:19)\n\nbut look at the alternatives. Hatred (15:17), dissension (!5:18)\n\nand laziness (15:19), all cause problems that an upright person\n\ndoes not have to face. By comparison, his or her life is a smooth,\n\nlevel road because it is built on a solid foundation of love for\n\nGod,\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father I pray that You would forgive me for\n\nnot always keeping my temper in check. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1649b96bbc72bece",
    "date_utc": "Sat, 14 Jul 2018 20:38:24 -0500",
    "subject": "Devo. for July 15",
    "verse": "Plans go wrong for lack of advice; many counselors bring success. (Pro. 15:22)",
    "reflection": "People with tunnel vision, those who are locked into one way of thinking, are likely to miss the right road because they have closed their minds to any new options. We need the help of those who can enlarge our vision and broadening of our perspective. We need to seek out the advise of those who know us and have a wealth of experience. We need a network of advisors. We also need to open our minds to new ideas, and be willing to weigh their suggestions carefully.",
    "prayer": "Dear Heavenly Father, I pray for Your forgiveness because I often run ahead of You, not praying for guidance as I should, I pray this in the name of Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Plans go wrong for lack of advice; many counselors bring success._\n\n(Pro. 15:22)\n\nTHOUGHT FOR TODAY:\n\nPeople with tunnel vision, those who are locked into one way of\nthinking,\n\nare likely to miss the right road because they have closed their\nminds to\n\nany new options. We need the help of those who can enlarge our vision\n\nand broadening of our perspective. We need to seek out the advise of\nthose\n\nwho know us and have a wealth of experience. We need a network of\n\nadvisors. We also need to open our minds to new ideas, and be willing\nto\n\nweigh their suggestions carefully.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray for Your forgiveness because I often run\n\nahead of You, not praying for guidance as I should, I pray this in\nthe\n\nname of Jesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164a0e531afc2e18",
    "date_utc": "Sun, 15 Jul 2018 21:22:12 -0500",
    "subject": "Devo. for July 16",
    "verse": "The Lord destroys the house of the proud, but He protects the property of widows. (Pro. 15:25)",
    "reflection": "God's plans frustrates the \"plans of the wicked\" because His values are the opposite of society's. Jesus turned society's values upside down when He proclaimed that \"many who seem to be important now will be the least important then, and those who are considered least here will be the greatest then\" (Mt. 19:30). We should not be surprised when others don't understand our Christian values; but let us not give into theirs.",
    "prayer": "Dear Heavenly Father, Help me to be more patient when explaining our Christian values. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The Lord destroys the house of the proud, but He protects the_\n\n_property of widows. _(Pro. 15:25)\n\nTHOUGHT FOR TODAY:\n\nGod's plans frustrates the \"plans of the wicked\" because His\n\nvalues are the opposite of society's. Jesus turned society's\n\nvalues upside down when He proclaimed that \"many who seem\n\nto be important now will be the least important then, and those\n\nwho are considered least here will be the greatest then\"\n\n(Mt. 19:30). We should not be surprised when others don't\n\nunderstand our Christian values; but let us not give into theirs.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, Help me to be more patient when\n\nexplaining our Christian values. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164a5cb3b81ac788",
    "date_utc": "Mon, 16 Jul 2018 20:11:57 -0500",
    "subject": "Devo. for July 17",
    "verse": "The godly think before speaking; The wicked spout evil words. (Pro. 15:28)",
    "reflection": "Some Christians believe that faith is a personal matter that should be kept to oneself. It is true that we shouldn't be boisterous or obnoxious in sharing our faith, but we should always be ready to give an answer, gently and respectfully, when asked about our faith, our life style, or our Christian perspective. Can others see your faith in Christ? Are you prepared to tell them what Christ has done in your life?",
    "prayer": "Dear Heavenly Father, I pray that I will always let my faith in You shine through my life by the help of Your Holy Spirit. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The godly think before speaking; The wicked spout evil words._\n\n(Pro. 15:28)\n\nTHOUGHT FOR TODAY:\n\nSome Christians believe that faith is a personal matter that should\n\nbe kept to oneself. It is true that we shouldn't be boisterous or\n\nobnoxious in sharing our faith, but we should always be ready to\n\ngive an answer, gently and respectfully, when asked about our\n\nfaith, our life style, or our Christian perspective. Can others see\n\nyour faith in Christ? Are you prepared to tell them what Christ\n\nhas done in your life?\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I will always let my faith in\n\nYou shine through my life by the help of Your Holy Spirit. . .\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164aaafcb5d4c43a",
    "date_utc": "Tue, 17 Jul 2018 19:00:05 -0500",
    "subject": "Devo. for July 18",
    "verse": "The Lord is far from the wicked, BUT He hears the prayers of the righteous. (Pro. 15:29)",
    "reflection": "The Lord is close to those who all upon Him, that is to everyone who calls upon Him sincerely. He hears their cries for help and He rescue them.",
    "prayer": "Once again Dear Lord, I thank You for the promise to hear All who sincerely call upon You for help. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The Lord is far from the wicked, BUT He hears the prayers_\n\n_of the righteous. _(Pro. 15:29)\n\nTHOUGHT FOR TODAY:\n\nThe Lord is close to those who all upon Him, that is to everyone who calls upon Him sincerely. He hears their cries for\n\nhelp and He rescue them.\n\nPRAYER FOR TODAY:\n\nOnce again Dear Lord, I thank You for the promise to hear\n\nAll who sincerely call upon You for help. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164b0297ab62099b",
    "date_utc": "Wed, 18 Jul 2018 20:31:06 -0500",
    "subject": "Devo. for July 19",
    "verse": "We can gather our thoughts, but the Lord gives the right answer. (Pro. 16:1)",
    "reflection": "This verse can be understood to mean that the final outcome of our plans that we make are in god's hands. So then the question is WHY MAKE PLANS? Well in doing God's will, there must be a partnership between our efforts and God's control. He wants us to use our minds, to seek the advice of others, in our plans. As you live for Him, ask for guidance as you plan, and then act on your plans you need trust in Him.",
    "prayer": "Dear Heavenly Father, it is my tendency to run out ahead of You, please forgive me for this fault. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_We can gather our thoughts, but the Lord gives the _\n\n_right answer. _(Pro. 16:1)\n\nTHOUGHT FOR TODAY:\n\nThis verse can be understood to mean that the final outcome\n\nof our plans that we make are in god's hands. So then the question\n\nis WHY MAKE PLANS? Well in doing God's will, there must be a\n\npartnership between our efforts and God's control. He wants us\n\nto use our minds, to seek the advice of others, in our plans. As\n\nyou live for Him, ask for guidance as you plan, and then act on\n\nyour plans you need trust in Him.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, it is my tendency to run out ahead of\n\nYou, please forgive me for this fault. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164b5024928cbdf3",
    "date_utc": "Thu, 19 Jul 2018 19:06:23 -0500",
    "subject": "Devo. for July 20",
    "verse": "People may be pure in their own eyes, but the Lord examines their motive. (Pro. 16:20",
    "reflection": "People can rationalize anything if they have no standards for judging right and wrong. We can always prove that we are right. But before putting any plan into action, we should ask our selves these three questions: (1) Is this plan in harmony with God's truth? (2) will it work under real life conditions? (3) Is my attitude pleasing to God?",
    "prayer": "Dear Heavenly Father, once again your Word has cause me to question my actions and motives while making new plans for my life. I pray that I would be sensitive to Your Holy Spirit's guidance. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_People may be pure in their own eyes, but the Lord examines _\n\n_their motive. _(Pro. 16:20\n\nTHOUGHT FOR TODAY:\n\nPeople can rationalize anything if they have no standards for\n\njudging right and wrong. We can always prove that we are\n\nright. But before putting any plan into action, we should ask\n\nour selves these three questions: (1) Is this plan in harmony\n\nwith God's truth? (2) will it work under real life conditions?\n\n(3) Is my attitude pleasing to God?\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, once again your Word has cause me\n\nto question my actions and motives while making new plans\n\nfor my life. I pray that I would be sensitive to Your Holy\n\nSpirit's guidance. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164baab1fe79507c",
    "date_utc": "Fri, 20 Jul 2018 21:28:54 -0500",
    "subject": "Devo. for July 21",
    "verse": "Commit your work to the Lord, and then your plans will succeed. (Pro. 16:3)",
    "reflection": "We must maintain a delicate balance: trusting God as if everything depended upon Him, while working as if everything depended upon us. Think of a specific effort in which you are involved right now. Have you committed it to the Lord?",
    "prayer": "Dear Heavenly Father, help me put (Pro. 16:3) to memory. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Commit your work to the Lord, and then your plans will succeed._\n\n(Pro. 16:3)\n\nThought for Today:\nWe must maintain a delicate balance: trusting God as if everything\n\ndepended upon Him, while working as if everything depended upon\n\nus. Think of a specific effort in which you are involved right now.\n\nHave you committed it to the Lord?\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me put (Pro. 16:3) to memory. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164bf606573f8af8",
    "date_utc": "Sat, 21 Jul 2018 19:25:23 -0500",
    "subject": "Devo. for July 22",
    "verse": "The Lord has made everything for His own purposes, even the wicked for punishment. (Pro. 16:4)",
    "reflection": "This verse doesn't mean that God created some people to be wicked, but God uses even the activities of wicked people for His good purposes (Gen. 50:20). God is infinite, and we are finite. No matter how great our intellects, we will never be able to understand Him completely. But we can accept by faith that He is all powerful, all-loving, and perfectly good (Jm. 1:13, 17); and we can trust that that there are no loose ends in His system of judgment. Evil is a temporary condition in the universe. One Day God will destroy it.",
    "prayer": "Dear Heavenly Father, I thank You for Your all powerful-all-loving-perfectly good character. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The Lord has made everything for His own purposes, even the_\n\n_wicked for punishment. _(Pro. 16:4)\n\nTHOUGHT FOR TODAY:\n\nThis verse doesn't mean that God created some people to be wicked,\n\nbut God uses even the activities of wicked people for His good\npurposes\n\n(Gen. 50:20). God is infinite, and we are finite. No matter how great\n\nour intellects, we will never be able to understand Him completely.\n\nBut we can accept by faith that He is all powerful, all-loving, and\n\nperfectly good_ _(Jm. 1:13, 17); and we can trust that that there are\n\nno loose ends in His system of judgment. Evil is a temporary\ncondition\n\nin the universe. One Day God will destroy it.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for Your all powerful-all-loving-perfectly good character. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164c4d4ddb377cb1",
    "date_utc": "Sun, 22 Jul 2018 20:50:42 -0500",
    "subject": "Devo. for July 23",
    "verse": "The Lord despises pride; be assured that the proud will be punished. (Pro. 16:5)",
    "reflection": "Pride is our inner voice that whispers, \"MY way is best. \" It is resisting God's leadership and believing that you are able to live without His help. When ever you find yourself wanting to do it your way or looking down on other people, you are being controlled by pride. Only when you eliminate pride can God help you become all that you were meant to be.",
    "prayer": "Dear Heavenly Father, I pray that I will allow Your Holy Spirit to always direct my thinking, so that pride will not be able to control my thinking. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The Lord despises pride; be assured that the proud will_\n\n_be punished. _(Pro. 16:5)\n\nTHOUGHT FOR TODAY:\n\nPride is our inner voice that whispers, \"MY way is best.\" It is\n\nresisting God's leadership and believing that you are able to\n\nlive without His help. When ever you find yourself wanting to\n\ndo it your way or looking down on other people, you are being\n\ncontrolled by pride. Only when you eliminate pride can God\n\nhelp you become all that you were meant to be.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I will allow Your Holy Spirit\n\nto always direct my thinking, so that pride will not be able to\n\ncontrol my thinking. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164c9a925791e584",
    "date_utc": "Mon, 23 Jul 2018 19:21:03 -0500",
    "subject": "Devo. for July 24",
    "verse": "When the ways of the people please the Lord, He makes even their enemies live at peace. (Pro. 16:7)",
    "reflection": "We want other people to like us, SO, let us bloom where we are planted. Our effort to be peace makers will usually make us more attractive to those around us, even our enemies. But even if it doesn't, we haven't lost anything. We are still pleasing God, the only One who truly matters.",
    "prayer": "Dear Heavenly Father, I pray that my actions will be pleasing to You, but I am only human, so I pray You will forgive me when my actions are not pleasing to You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_When the ways of the people please the Lord, He makes even_\n\n_their enemies live at peace. _(Pro. 16:7)\n\nTHOUGHT FOR TODAY:\n\nWe want other people to like us, SO, let us bloom where we are\nplanted.\n\nOur effort to be peace makers will usually make us more attractive to\n\nthose around us, even our enemies. But even if it doesn't, we haven't\n\nlost anything. We are still pleasing God, the only One who truly\nmatters.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that my actions will be pleasing to You,\nbut\n\nI am only human, so I pray You will forgive me when my actions are\nnot\n\npleasing to You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164ceef84c894661",
    "date_utc": "Tue, 24 Jul 2018 19:56:01 -0500",
    "subject": "Devo. for July 25",
    "verse": "We can make our plans, but God determines our steps. (Pro. 16:9)",
    "reflection": "We need to remember, God's ability to direct our life is fare superior to our ability. I believe that there are times that we are afraid of God's power and plans because we know that His power could easily crush us if He chose to use it against us. But don't be afraid to let God correct your plans. He will give you wisdom if you are willing.",
    "prayer": "Dear Heavenly Father, again I have to confess that I am guilty of not always being obedient in allowing You to direct my path because of my impatience. I ask You to please forgive me. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_We can make our plans, but God determines our steps._ (Pro. 16:9)\n\nTHOUGHT FOR TODAY:\n\nWe need to remember, God's ability to direct our life is fare\n\nsuperior to our ability. I believe that there are times that we\n\nare afraid of God's power and plans because we know that\n\nHis power could easily crush us if He chose to use it against\n\nus. But don't be afraid to let God correct your plans. He will\n\ngive you wisdom if you are willing.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, again I have to confess that I am guilty\n\nof not always being obedient in allowing You to direct my path\n\nbecause of my impatience. I ask You to please forgive me. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164d405ef758d849",
    "date_utc": "Wed, 25 Jul 2018 19:38:36 -0500",
    "subject": "Devo. for July 26",
    "verse": "The Lord demands fairness in every business deal; HE sets the standard. (Pro. 16:11)",
    "reflection": "Yes the Lord hates cheating, (Pro. 11:1) We should be generous in our giving. (Pro. 22:9) We should place people's needs ahead of profit. (Pro 11:6) We should be aware of the needs of the poor (Pro. 21:13).",
    "prayer": "Dear Heavenly Father, I pray that You will forgive me for falling short of Your expectations of what You expect in my life. I pray that I will be more sensitive of Your Holy Spirit's leading. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The Lord demands fairness in every business deal; HE_\n\n_sets the standard. _(Pro. 16:11)\n\nTHOUGHT FOR TODAY:\n\nYes the Lord hates cheating, (Pro. 11:1) We should be generous\n\nin our giving. (Pro. 22:9) We should place people's needs ahead\n\nof profit. (Pro 11:6) We should be aware of the needs of the poor\n\n(Pro. 21:13).\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that You will forgive me for falling\n\nshort of Your expectations of what You expect in my life. I pray\n\nthat I will be more sensitive of Your Holy Spirit's leading. . .\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164d9101fb448c21",
    "date_utc": "Thu, 26 Jul 2018 19:07:50 -0500",
    "subject": "Devo. for July 27",
    "verse": "A king despises wrongdoing; (Pro. 16:12) The king is pleased with righteous lips; Vs. 13 The anger of the king is a deadly threat; Vs. 14 When the king smiles, there is life; Vs. 15",
    "reflection": "In Acts 24:45-47 Jesus asks us to spend the time of waiting taking care of His people and doing His work here on earth, both within the church and outside it. This is the best way to prepare for Christ's return. Let this be our endeavor each and every day of our life. Including being an obedient citizen.",
    "prayer": "Dear Lord, Help me to live a more Christ like life each day. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A king despises wrongdoing; _(Pro. 16:12)\n\n_The king is pleased with righteous lips; _Vs. 13\n\n_The anger of the king is a deadly threat; _Vs. 14\n\n_When the king smiles, there is life; _Vs. 15\n\nTHOUGHT FOR TODAY:\n\nIn Acts 24:45-47 Jesus asks us to spend the time of waiting taking\ncare\n\nof His people and doing His work here on earth, both within the\nchurch\n\nand outside it. This is the best way to prepare for Christ's return.\nLet\n\nthis be our endeavor each and every day of our life. Including being\nan\n\nobedient citizen.\n\nPRAYER FOR TODAY:\n\nDear Lord, Help me to live a more Christ like life each day. . .\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164de470b222f905",
    "date_utc": "Fri, 27 Jul 2018 19:25:55 -0500",
    "subject": "Devo for July 28",
    "verse": "How much better to get wisdom than gold, AND understanding than sliver! (Pro. 16:16)",
    "reflection": "God helps us on the way to wisdom; OUR RESPONSE SHOULD BE: to fear and reverence God, To obey God's Word, to please God, and to trust in God. . .",
    "prayer": "Dear Lord, Forgive me for not always, reverencing You as I should or obey Your Word as I should NOR always trust You as I should Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_How much better to get wisdom than gold, AND understanding_\n\n_than sliver! _(Pro. 16:16)\n\nTHOUGHT FOR TODAY:\n\nGod helps us on the way to wisdom; OUR RESPONSE SHOULD BE:\n\nto fear and reverence God, To obey God's Word, to please God,\n\nand to trust in God. . .\n\nPRAYER FOR TODAY:\n\nDear Lord, Forgive me for not always, reverencing You as I should\n\nor obey Your Word as I should NOR always trust You as I should\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164e3716855c9f01",
    "date_utc": "Sat, 28 Jul 2018 19:30:18 -0500",
    "subject": "Devo. for July 29",
    "verse": "Pride goes before destruction, and haughtiness before the fall. (Pro. 16:18)",
    "reflection": "Proud people take little account of their weakness and do not anticipate stumbling blocks. They think they are above frailties of common people. In this state of mind they are easily tripped up. It is important that we keep our pride in check. so we should ask someone we trust whether self satisfaction has blinded you to warning signs. He or she may help you avoid a fall.",
    "prayer": "Dear Lord, I pray that I would listen to the warnings of those I have always trusted so that I will not fall into the trap of self pride. I pray this in the name of our Lord Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Pride goes before destruction, and haughtiness before the fall._\n\n(Pro. 16:18)\n\nTHOUGHT FOR TODAY:\n\nProud people take little account of their weakness and do not\n\nanticipate stumbling blocks. They think they are above frailties\n\nof common people. In this state of mind they are easily tripped\n\nup. It is important that we keep our pride in check. so we should\n\nask someone we trust whether self satisfaction has blinded you\n\nto warning signs. He or she may help you avoid a fall.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would listen to the warnings of those I\n\nhave always trusted so that I will not fall into the trap of self\n\npride. I pray this in the name of our Lord Jesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164e766ee60232a5",
    "date_utc": "Sun, 29 Jul 2018 13:57:20 -0500",
    "subject": "Devo. for July 30",
    "verse": "Those who listen to instruction will prosper; those who trust the Lord will be happy. (Pro. 16:20)",
    "reflection": "We must surrender fully and submit to the Son. Christ is not only God's chosen King, He is the rightful King of our hearts and lives. To be ready for His second coming, we must submit to His leadership every day.",
    "prayer": "Oh Lord, forgive me when I become lax in the preparation for Christ's second coming. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Those who listen to instruction will prosper; those _\n\n_who trust the Lord will be happy. _(Pro. 16:20)\n\nTHOUGHT FOR TODAY:\n\nWe must surrender fully and submit to the Son. Christ is\n\nnot only God's chosen King, He is the rightful King of\n\nour hearts and lives. To be ready for His second coming,\n\nwe must submit to His leadership every day.\n\nPRAYER FOR TODAY:\n\nOh Lord, forgive me when I become lax in the preparation\n\nfor Christ's second coming. . . Amen.\n\n(You may be receiving two of these devo. for Monday\n\nbecause the first one disappeared on it's own.)\n\nHave a good day!",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164ed83890b42dc6",
    "date_utc": "Mon, 30 Jul 2018 18:26:18 -0500",
    "subject": "Devo. for July 31",
    "verse": "Discretion is a life-giving fountain to those who possess it, but discipline is wasted on fools. (Pro. 16:22)",
    "reflection": "For centuries people sought a fountain of youth, a spring that promised to give eternal life and vitality. It was never found. But God's wisdom is a LIFE-GIVING fountain that can make a person happy, healthy, and alive forever. HOW? When we live by God's Word, He washes away the deadly effects of sin (see Titus 3:4-8). Here we see the hope of eternal a life with Him that gives us a joyful perspective on our present life.",
    "prayer": "Dear Heavenly Father, I thank You for Your life giving wisdom that we find in Your Word, which gives us the hope of eternal life with You. . . Amen.",
    "reading": "",
    "original_content": "VERSE OR TODAY:\n\n_Discretion is a life-giving fountain to those who possess it,_\n\n_but discipline is wasted on fools. _(Pro. 16:22)\n\nTHOUGHT FOR TODAY:\n\nFor centuries people sought a fountain of youth, a spring that\n\npromised to give eternal life and vitality. It was never found.\n\nBut God's wisdom is a LIFE-GIVING fountain that can make a\n\nperson happy, healthy, and alive forever. HOW? When we live\n\nby God's Word, He washes away the deadly effects of sin\n\n(see Titus 3:4-8). Here we see the hope of eternal a life with\n\nHim that gives us a joyful perspective on our present life.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for Your life giving wisdom\n\nthat we find in Your Word, which gives us the hope of eternal\n\nlife with You. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164f3014cbc0835b",
    "date_utc": "Tue, 31 Jul 2018 20:01:46 -0500",
    "subject": "Devo. for Aug. 1",
    "verse": "Gray hair is a crown of glory, it is gained by living a godly life. (Pro. 16:31)",
    "reflection": "The Hebrews believed that a long life was a sign of God's blessing; so, gray hair and old age were good. While young people glory in their strength, old people can rejoice in their years of experience and practical wisdom. Gray hair is not a disgrace to have, it is a crown of splendor. As you deal with older people, treat them with respect.",
    "prayer": "Dear Heavenly Father, help us to remember to treat one another with respect, old or young. . . Amen.",
    "reading": "",
    "original_content": "DEVO. FOR TODAY:\n\n_Gray hair is a crown of glory, it is gained by living_\n\n_a godly life. _(Pro. 16:31)\n\nTHOUGHT FOR TODAY:\n\nThe Hebrews believed that a long life was a sign of\n\nGod's blessing; so, gray hair and old age were good.\n\nWhile young people glory in their strength, old people\n\ncan rejoice in their years of experience and practical\n\nwisdom. Gray hair is not a disgrace to have, it is a\n\ncrown of splendor. As you deal with older people,\n\ntreat them with respect.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help us to remember to treat one\n\nanother with respect, old or young. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]