[
  {
    "message_id": "121a126fd6e0b213",
    "date_utc": "Tue, 2 Jun 2009 07:26:56 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Some preach Christ of contention, supposing to add affliction to my bonds. For I know this shall turn to my salvation. through your prayer, and the supply of the Spirit of Jesus Christ.\" (Philippians 1:16-19)",
    "reflection": "Our Lesson for the 3rd. Texts like these prove that there were still Christians in the churches under the full power of the Holy Spirit on whom Paul could count for continuous prayer. When we plead with Christians to pray without ceasing, there are a very large number who quietly decide that such a life is not possible for them. They have no specail gift for prayer; they do not have that intense desire for glorifying Christ in the salvation of souls. They haven't learnt what it is, under the power of the constraining love of Christ, to live not unto themselves but unto Him who died for them.",
    "prayer": "Dear Heavenly Father, Help me to hear the call to offer myself for wholehearted surrender to live entirely for Christ. Amen.",
    "reading": "",
    "original_content": "06/03/09~~~food for thought~~~We will be gone June 3 & 4th so I am sending two devotions\n\nOur Bible Verses for Today:\n\"Some preach Christ of contention, supposing to add affliction \nto my bonds. For I know this shall turn to my salvation. through\nyour prayer, and the supply of the Spirit of Jesus Christ.\" (Phil. 1:16-19)\n\nOur Lesson for the 3rd.\n\nTexts like these prove that there were still Christians in the churches \nunder the full power of the Holy Spirit on whom Paul could count for\ncontinuous prayer...\n\nWhen we plead with Christians to pray without ceasing, there are a very\nlarge number who quietly decide that such a life is not possible for them.\nThey have no specail gift for prayer; they do not have that intense desire\nfor glorifying Christ in the salvation of souls...\n\nThey haven't learnt what it is, under the power of the constraining love of \nChrist, to live not unto themselves but unto Him who died for them...\n\nPrayer Suggestion:\nDear Heavenly Father, Help me to hear the call to offer\nmyself for whole-hearted surrender to live entirely for Christ...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": false,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121a13a2f1692915",
    "date_utc": "Tue, 2 Jun 2009 07:47:51 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Christ redeemed us from the curse of the law; having become a curse for us.\" (Galatians 3:13)",
    "reflection": "Scripture teaches us that there are two points of view from which we may regard Christ's death upon the cross. The one is the redemption of the cross: Christ dying for us as our complete deliverance from the curse of sin. (The other) The fellowship of the cross: Christ taking us up to die with Him and making us partakers of the fellowship of His death in our own experience. In our text we have three great unreachable thoughts: The law of God has pronounced a curse on all sin and on all that is sinful. Christ took our curse upon Himself ~ He became a curse and so destroyed its power. (and) In that cross we now have the everlasting redemption from sin and all its power. The cross reveals to us man's sin as under the curse, Christ becoming a curse and so overcoming it, and our full and everlasting deliverance from the curse. In these thoughts the lost and most hopeless sinner finds a sure ground of confidence and of hope.",
    "prayer": "Heavenly Father, I praise You for the redemption of the cross! Amen",
    "reading": "",
    "original_content": "06/04/09~~~food for thought~~~Would you live differently if today were your last?\n\nOur Bible Verse for Today:\n\"Christ redeemed us from the curse of the law;\nhaving become a curse for us.\" (Gal. 3:13)\n\nOur Lesson for Today:\n\nScripture teaches us that there are two points of view from which we\nmay regard Christ's death upon the cross...\n\nThe one is the redemption of the cross: Christ dying for us as our \ncomplete deliverance from the curse of sin. (The other)\n\nThe fellowship of the cross: Christ taking us up to die with Him and\nmaking us partakers of the fellowship of His death in our own experience...\n\nIn our text we have three great unreachable thoughts:\nThe law of God has pronounced a curse on all sin and on all that is sinful.\nChrist took our curse upon Himself ~ He became a curse and so destroyed \nits power. (and)\nIn that cross we now have the everlasting redemption from sin and all its\npower...\n\nThe cross reveals to us man's sin as under the curse, Christ becoming a\ncurse and so overcoming it, and our full and everlasting deliverance from \nthe curse...\n\nIn these thoughts the lost and most hopeless sinner finds a sure ground\nof confidence and of hope...\n\nPrayer Suggestion:\nHeavenly Father, I praise You for the redemption of the cross!\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121aff04f8542e4d",
    "date_utc": "Fri, 5 Jun 2009 04:21:18 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Have this in mind in you, which was also in Christ Jesus.\" (Philippians 2:5)",
    "reflection": "Here Paul tells us to be Christ minded: He emptied Himself; He took the form of a servant; He humbled Himself, even to death on the cross. It is this mind that was in Christ, the deep humility that gave up His life to the very death. That is the spirit that is to be in us. In this we shall prove and enjoy the blessed fellowship of His cross. Paul had said in (vs. 1) \"If there is any comfort in Christ, \" ~ The comforter was to come to reveal His presence in them ~ \"If there is any fellowship of the spirit, \" ~ If was in this power of the Spirit that they were to breathe the Spirit of the crucified Christ and manifest His disposition in the fellowship of the cross in their lives. It is no easy school and no hurried learning ~ this school of the cross. But it will lead to a deeper comprehension and a higher appreciation of the redemption of the cross through the personal experience of the fellowship of the cross.",
    "prayer": "Dear Heavenly Father, may I gain a higher appreciation of the redemption of the cross through the personal experience of the fellowship of the cross. Amen.",
    "reading": "",
    "original_content": "06/05/09~~~food for thought~~~Do you surrender daily to His will...\n\nOur Bible Verse for Today:\n\"Have this in mind in you, which was also in Christ Jesus.\"\n(Phil. 2:5)\n\nOur Lesson for Today:\nHere Paul tells us to be Christ minded: He emptied Himself; He took\nthe form of a servant; He humbled Himself, even to death on the cross...\n\nIt is this mind that was in Christ, the deep humility that gave up His life\nto the very death. That is the spirit that is to be in us. In this we shall\nprove and enjoy the blessed fellowship of His cross...\n\nPaul had said in (vs. 1) \"If there is any comfort in Christ,\" ~ The comforter\nwas to come to reveal His presence in them ~ \"If there is any fellowship \nof the spirit,\" ~ If was in this power of the Spirit that they were to breathe\nthe Spirit of the crucified Christ and manifest His disposition in the fellowship\nof the cross in their lives...\n\nIt is no easy school and no hurried learning ~ this school of the cross. But\nit will lead to a deeper comprehension and a higher appreciation of the\nredemption of the cross through the personal experience of the fellowship\nof the cross...\n\nPrayer Suggestion:\nDear Heavenly Father, may I gain a higher appreciation of\nthe redemption of the cross through the personal experience\nof the fellowship of the cross...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121b50d28f790fb8",
    "date_utc": "Fri, 5 Jun 2009 06:35:58 -0600",
    "subject": "thoughts to live by",
    "verse": "\"I have been crucified with Christ; yet I live; and yet no longer I, but Christ liveth in me.\" (Galatians 2:20)",
    "reflection": "To often the thought of fellowship with Christ in His bearing the cross, has led to a vain attempt in our own power to follow Him and bear His image. but it is impossible until we first learn to know something of what it means to say, \"I have been crucified with Christ.\" Let us try to understand this. When Adam died, all his descendants died with him and in him. In his sin in paradise and in the spiritual death into which he fell, we had a share; we died with him. The power of that sin and death, in which all his descendants share, works in every child of Adam every day. Now Christ came as the second Adam. In His death on the cross, all who believe in Him had a share. Each of us may say in truth, \"I have been crucified with Christ.\" As the representative of His people, He took us up with Him on the cross, Yes you and me too. The life that He gives is the crucified life in which He entered heaven and was exalted to the throne, standing as a Lamb as it had been slain. The power of His death and life work in us, and as we hold fast to that truth that we have been crucified with Him, we now live no more but Christ liveth in us ~ in this power we will conquer sin. The life that we have received from Him is a life that has been made free from the power of sin.",
    "prayer": "Dear Lord, I long in every deed to be dead to all sin, so that the union of Your Son crucified and in fellowship of His cross can day by day it become my life. Amen.",
    "reading": "",
    "original_content": "06/06/09~~~food for thought~~~By our deeds we are judged who we are actually living for...\n\nOur Bible Verse for Today:\n\"I have been crucified with Christ; yet I live; and yet\nno longer I, but Christ liveth in me.\" (Gal. 2:20)\n\nOur Lesson for Today:\n\nTo often the thought of fellowship with Christ in His bearing\nthe cross, has led to a vain attempt in our own power to follow\nHim and bear His image...\n\nbut it is impossible until we first learn to know something of\nwhat it means to say, \"I have been crucified with Christ.\"\n\nLet us try to understand this. When Adam died, all his descendents \ndied with him and in him. In his sin in paradise and in the spiritual\ndeath into which he fell, we had a share; we died with him...\n\nThe power of that sin and death, in which all his descendents share, \nworks in every child of Adam every day...\n\nNow Christ came as the second Adam. In His death on the cross, \nall who believe in Him had a share. Each of us may say in truth,\n\"I have been crucified with Christ.\"\n\nAs the representative of His people, He took us up with Him on the\ncross, Yes you and me too. The life that He gives is the crucified\nlife in which He entered heaven and was exalted to the throne,\nstanding as a Lamb as it had been slain...\n\nThe power of His death and life work in us, and as we hold fast to\nthat truth that we have been crucified with Him, we now live no more \nbut Christ liveth in us ~ in this power we will conquer sin...\n\nThe life that we have received from Him is a life that has been\nmade free from the power of sin...\n\nPrayer Suggestion:\nDear Lord, I long in every deed to be dead to all sin, so that\nthe union of Your Son crucified and in fellowship of His cross\ncan day by day it become my life...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121b72412d7885a2",
    "date_utc": "Sat, 6 Jun 2009 05:01:13 -0600",
    "subject": "thoughts to live by",
    "verse": "\"They that are in Christ Jesus have crucified the flesh with the passions and the lusts thereof.\" (Galatians 5:24)",
    "reflection": "Of the flesh Paul teaches us (Romans 7:18), in me, that is, in the flesh, dwelleth no good thing.\" and again (Romans 8:7), \"The mind of the flesh is, enmity against God; for it is not subject to the law of God, neither indeed can it be.\" When Adam lost the Spirit of God, he became flesh, [Flesh] is the expression for the evil, corrupt nature that we inherit from Adam. [Of this flesh it is written] \"Our old man was crucified with Him.\" (Romans 7:6) And Paul puts it more strongly when he says, \"They that are in Christ Jesus have crucified the flesh.\" When the disciples heard and obeyed the call of Jesus to follow Him, they honestly meant to do so, but as Jesus later on taught them what that would imply, they were far from being ready to yield immediately. Yes even so those who are Christ's and have accepted Him as the Crucified One do not really understand what that includes. But by the act of surrender they have actually crucified the flesh and have consented to regard it as an accursed thing, nailed to the cross with Christ. Paul taught the Galatians, \"Walk in the Spirit, and you shall not fulfill the lusts of the flesh.\" \"As many as are led by the Spirit of God, they are the children of God.\" And yes, only the Spirit, can guide us in living faith and fellowship with Christ as the flesh is kept in the place of crucifixion.",
    "prayer": "O Lord, how little I understood when I accepted you in faith that I crucified once for all the flesh with its passions and lusts! I ask You humbly, teach me to believe and so to live in You, the Crucified One, that I like Paul may always glory in the cross on which the world and the flesh are crucified. Amen.",
    "reading": "",
    "original_content": "06/08/09~~~food for thought~~~Total surrender can only take place with \nthe acceptance of the Holy Spirit...\n\nOur Bible Verse for Today:\n\"They that are in Christ Jesus have crucified the flesh\nwith the passions and the lusts thereof.\" (Gal. 5:24)\n\nOur Lesson for Today:\n\nOf the flesh Paul teaches us (Ro. 7:18), in me, that is, in the flesh,\ndwelleth no good thing.\" and again (Ro. 8:7), \"The mind of the flesh\nis, enmity against God; for it is not subject to the law of God, neither \nindeed can it be.\"\n\nWhen Adam lost the Spirit of God, he became flesh, [Flesh] is the\nexpression for the evil, corrupt nature that we inherit from Adam...\n\n[Of this flesh it is written] \"Our old man was crucified with Him.\" (Ro. 7:6)\nAnd Paul puts it more strongly when he says, \"They that are in Christ Jesus\nhave crucified the flesh.\"\n\nWhen the disciples heard and obeyed the call of Jesus to follow Him,\nthey honestly meant to do so, but as Jesus later on taught them what that \nwould imply, they were far from being ready to yield immediately...\n\nYes even so those who are Christ's and have accepted Him as the\nCrucified One do not really understand what that includes. But by\nthe act of surrender they have actually crucified the flesh and have\nconsented to regard it as an accursed thing, nailed to the cross with\nChrist...\n\nPaul taught the Galatians, \"Walk in the Spirit, and you shall not fulfill\nthe lusts of the flesh.\"\n\n\"As many as are led by the Spirit of God, they are the children of God.\"\n\nAnd yes, only the Spirit, can guide us in living faith and fellowship with \nChrist as the flesh is kept in the place of crucifixion...\n\nPrayer Suggestion:\nO Lord, how little I understood when I accepted you in faith\nthat I crucified once for all the flesh with its passions and lusts!\nI ask You humbly, teach me to believe and so to live in You,\nthe Crucified One, that I like Paul may always glory in the cross\non which the world and the flesh are crucified. ~~~\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121bf55dfa30c02c",
    "date_utc": "Sun, 7 Jun 2009 06:28:40 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Far be it from me to glory. save in the cross of our Lord Jesus Christ, through which the world hath been crucified unto me, and I unto the world.\" (Galatians 6:14)",
    "reflection": "Here Paul speaks of his only glory being that in Christ, he has in every deed been crucified to the world and entirely delivered from its power. When he said: \"I have been crucified with Christ, \" it was not only an inner spiritual truth, but an actual, practical experience in relation to the world and its temptations. Paul boasts that he lives as one crucified to the world, and that now the world as a powerless enemy was crucified to him. It was this that made him glory in the cross of Christ. O Christian friends, when the world crucified Christ, it crucified you with Him. When Christ overcame the world on the cross, he made you an overcome too. He calls you now, at whatever cost of self-denial, to regard the world in its hostility to God and His Kingdom as a crucified enemy over whom the cross can ever keep you conqueror. What a different relationship to the pleasures and attractions of the world the Christian has who by the Holy Spirit has learned to say: \"I have been crucified with Christ; the crucified Christ liveth in me\"!",
    "prayer": "Dear Heavenly Father, I pray that Your Holy Spirit may be revealed to us in all His power, teaching us what it means to \"glory in the cross of our Lord Jesus Christ, through which the world has been crucified unto me.\" Amen.",
    "reading": "",
    "original_content": "06/08/09~~~food for thought~~~Nothing lies beyond the power of man if\nit lies within the will of God...\n\nOur Bible Verse for Today:\n\"Far be it from me to glory. save in the cross of our Lord Jesus Christ,\nthrough which the world hath been crucified unto me, and I unto the\nworld.\" (Gal. 6:14)\n\nOur Lesson for Today:\n\nHere Paul speaks of his only glory being that in Christ, he has in every\ndeed been crucified to the world and entirely delivered from its power...\n\nWhen he said: \"I have been crucified with Christ,\" it was not only an\ninner spiritual truth, but an actual, practical experience in relation to the \nworld and its temptations...\n\nPaul boasts that he lives as one crucified to the world, and that now the \nworld as a powerless enemy was crucified to him. It was this that made\nhim glory in the cross of Christ...\n\nO Christian friends, when the world crucified Christ, it crucified you with Him.\nWhen Christ overcame the world on the cross, he made you an overcomer too...\n\nHe calls you now, at whatever cost of self-denial, to regard the world in its\nhostility to God and His Kingdom as a crucified enemy over whom the cross\ncan ever keep you conqueror...\n\nWhat a different relationship to the pleasures and attractions of the world\nthe Christian has who by the Holy Spirit has learned to say: \"I have been\ncrucified with Christ; the crucified Christ liveth in me\"!\n\nPrayer Suggestion:\nDear Heavenly Father, I pray that Your Holy Spirit may be revealed\nto us in all His power, teaching us what it means to \"glory in the cross \nof our Lord Jesus Christ, through which the world has been crucified \nunto me.\"\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121c47fddb0d3668",
    "date_utc": "Mon, 8 Jun 2009 04:47:34 -0600",
    "subject": "thoughts to live by",
    "verse": "\"If you refuse to take up your cross and follow Me, you are not worthy of being Mine. If you cline to your life, you will lose it; but if you give it up for Me, you will find it. (Matthew 10:38-39)",
    "reflection": "To take up our cross and follow Jesus means to be willing to publicly identify with Him, to experience certain opposition, and to be willing to face suffering as well as possible death for His sake. Verse 39 gives us a positive and a negative statement of the same truth ~ Clinging to this life may cause us to forfeit the best from Christ in this world and the next. The more we love this life's rewards (leisure, power, popularity, financial security), the more we will discover how empty they are. The best way to enjoy life, is to loosen our greedy grasp on earthly rewards so that we can be free to follow Christ ~ In doing so we will inherit eternal life and began at once to experience the benefits of following Christ. Remember this call was not only to His disciple but to us also, so let us give up the self-life with its self-pleasing and self-exaltation and bear the cross in fellowship with Him, and we shall be made partakers of His victory.",
    "prayer": "Dear Lord I hear Your call to give up the self-life and bear the cross in fellowship with You so that I might be a partaker of Your victory, Lord help me to always be obedient to this call. Amen.",
    "reading": "",
    "original_content": "06/09/09~~~food for thought~~~What excuse will you use today not to serve?\n\nOur Bible Verses for Today:\n\"If you refuse to take up your cross and follow Me, you are\nnot worthy of being Mine... If you cline to your life, you will\nlose it; but if you give it up for Me, you will find it. (Mt.10:38-39)\n\nOur Lesson for Today:\nTo take up our cross and follow Jesus means to be willing to\npublicly identify with Him, to experience certain opposition, and \nto be willing to face suffering as well as possible death for His\nsake...\n\nVerse 39 gives us a positive and a negative statement of the \nsame truth ~ Clinging to this life may cause us to forfeit the best\nfrom Christ in this world and the next...\n\nThe more we love this life's rewards (leisure, power, popularity,\nfinancial security), the more we will discover how empty they are...\n\nThe best way to enjoy life, is to loosen our greedy grasp on\nearthly rewards so that we can be free to follow Christ ~ In\ndoing so we will inherit eternal life and began at once to\nexperience the benefits of following Christ...\n\nRemember this call was not only to His disciple but to us also, \nso let us give up the self-life with its self-pleasing and self-exaltation \nand bear the cross in fellowship with Him, and we shall be made \npartakers of His victory...\n\nPrayer Suggestion:\nDear Lord I hear Your call to give up the self-life and bear\nthe cross in fellowship with You so that I might be a partaker\nof Your victory, Lord help me to always be obedient to this call...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121c9a48a2a9c4e0",
    "date_utc": "Tue, 9 Jun 2009 05:01:41 -0600",
    "subject": "thoughts to live by",
    "verse": "Then Jesus said to His disciples, \"If any one wishes to come after Me, let him deny himself, and take up his cross, and follow Me. (Matthew 16:24)",
    "reflection": "Christ had for the first time definitely announced that He would have to suffer much and be killed and be raised again.\"Peter rebuked Him, saying, 'Be it far from Thee, Lord: this shall never be unto Thee.\" Christ's answer was, \"Get thee behind Me Satan.\" The spirit of Peter, seeking to turn Him away from the cross and its suffering, was nothing but Satan tempting Him to turn aside from the path which God had appointed as our way of salvation. Instead of denying himself, Peter denied his Lord: \"I know not the man.\" When a man learns to obey Christ's command, he says of himself: \"I know not the man.\" This is the secret of true discipleship, to bear the cross, to acknowledge the death sentence that has been passed on self, and to deny any right that self has to rule over us. The surrender for Christ sake to live for those around us is to be so complete, that self is never allowed to come down from the cross to which it has been crucified but is ever kept in the place of death.",
    "prayer": "Dear Heavenly Father, help me to hear Your voice, \"Deny self, \" I pray that by the grace of the Holy Spirit I may live crucified with Thee and that You will live in me as my Lord and Master. Amen.",
    "reading": "",
    "original_content": "06/10/09~~~food for thought~~~Death to self is to be the Christian watchword...\n\nOur Bible Verse for Today:\nThen Jesus said to His disciples, \"If any one wishes to come after Me,\nlet him deny himself, and take up his cross, and follow Me...(Mt. 16:24)\n\nOur Lesson for Today:\n\nChrist had for the first time definitely announced that He would have to suffer\nmuch and be killed and be raised again.\"Peter rebuked Him, saying, 'Be it\nfar from Thee, Lord: this shall never be unto Thee.\"\n\nChrist's answer was, \"Get thee behind Me Satan.\" The spirit of Peter, seeking\nto turn Him away from the cross and its suffering, was nothing but Satan tempting \nHim to turn aside from the path which God had appointed as our way of salvation...\n\nInstead of denying himself, Peter denied his Lord: \"I know not the man.\" When\na man learns to obey Christ's command, he says of himself: \"I know not the man.\"\n\nThis is the secret of true discipleship, to bear the cross, to acknowledge the\ndeath sentence that has been passed on self, and to deny any right that self\nhas to rule over us..\n\nThe surrender for Christ sake to live for those around us is to be so complete,\nthat self is never allowed to come down from the cross to which it has been crucified\nbut is ever kept in the place of death...\n\nPrayer Suggestion:\nDear Heavenly Father, help me to hear Your voice, \"Deny self,\"\nI pray that by the grace of the Holy Spirit I may live crucified\nwith Thee and that You will live in me as my Lord and Master...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121cebe455a548d4",
    "date_utc": "Wed, 10 Jun 2009 06:36:04 -0600",
    "subject": "thoughts to live by",
    "verse": "\"If anyone comes to Me, and does not hate (Love less) his own father and mother and wife and children and brothers and sisters, yes, and even his own life, he cannot be My disciple. (Matthew 14:26~33)",
    "reflection": "In these eight verses Jesus speak again about bearing the cross. Here He gives it new meaning when He says we must hate our own life and renounce all that we have.\"IF a man does not hate his own life.\" And why does Christ make such a demand on discipleship? It is because of the vile and sinful nature we have inherited from Adam.\"The flesh is enmity against God\" and so the soul that seeks to love God cannot do less than hate the old man which is corrupt throughout its whole being. Christ has one word more: \"He that renounceth not all that he has, \" whether in property or character, \"Cannot be My disciple.\" Christ claims all.",
    "prayer": "Dear Heavenly Father, help me be more willing to sacrifice all for You. Help me to put You first in all that I do. Amen.",
    "reading": "",
    "original_content": "06/11/09~~~food for thought~~~What we value most says a lot about our\nChristian walk...\n\nOur Bible Verses for Today:\n\"If anyone comes to Me, and does not hate (Love less)\nhis own father and mother and wife and children and\nbrothers and sisters, yes, and even his own life, he\ncannot be My disciple...(Mt. 14:26~33)\n\nOur Lesson for Today:\n\nIn these eight verses Jesus speak again about bearing the cross.\nHere He gives it new meaning when He says we must hate our own\nlife and renounce all that we have...\n\n\"IF a man does not hate his own life.\" And why does Christ make \nsuch a demand on discipleship?\n\nIt is because of the vile and sinful nature we have inherited from Adam.\n\"The flesh is enmity against God\" and so the soul that seeks to love God \ncannot do less than hate the old man which is corrupt throughout its whole\nbeing...\n\nChrist has one word more: \"He that renounceth not all that he has,\" \nwhether in property or character, \"Cannot be My disciple.\" Christ\nclaims all...\n\nPrayer Suggestion:\nDear Heavenly Father, help me be more willing to sacrifice all\nfor You. Help me to put You first in all that I do...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121cf59ebb0f7610",
    "date_utc": "Thu, 11 Jun 2009 04:43:37 -0600",
    "subject": "thoughts to live by",
    "verse": "Then Jesus, beholding him, loved him, and said: \"One thing thou lackest: go thy way, sell whatsoever thou hast, and come, take up the cross, and follow Me.\" (MK. 10:21)",
    "reflection": "Jesus showed genuine love for this man, even though He knew that the man might not follow Him. Love is able to give tough advise; it doesn't hedge on the truth. Christ loved us enough to die for us, and He also loves us enough to talk straight to us. If His love were superficial, He would give us only His approval; but His love is complete, He gives us life-changing challenges.",
    "prayer": "Dear Heavenly Father, let me take today's study of what the fellowship of the cross means to heart and believe that it is only by putting my trust in Thee, the Living God, that I can be a disciple who will forsake all and follow Christ. Amen.",
    "reading": "",
    "original_content": "06/12/09~~~food for thought~~~Examine your challenges ~ Christ maybe trying to\ntell you something...\n\nOur Bible Verse for Today:\nThen Jesus, beholding him, loved him, and said: \n\"One thing thou lackest: go thy way, sell whatsoever \nthou hast, and come, take up the cross, and follow Me.\" (MK. 10:21)\n\nOur Lesson for Today:\n\nJesus showed genuine love for this man, even though\nHe knew that the man might not follow Him...\n\nLove is able to give tough advise; it doesn't hedge on the truth...\n\nChrist loved us enough to die for us, and He also loves us enough\nto talk straight to us. If His love were superficial, He would give us\nonly His approval; but His love is complete, He gives us life-changing \nchallenges...\n\nPrayer Suggestion:\nDear Heavenly Father, let me take today's study of what the\nfellowship of the cross means to heart and believe that it is \nonly by putting my trust in Thee, the Living God, that I can be\na disciple who will forsake all and follow Christ...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121d3d1b2d35cf1f",
    "date_utc": "Thu, 11 Jun 2009 04:43:37 -0600",
    "subject": "thoughts to live by",
    "verse": "Then Jesus, beholding him, loved him, and said: \"One thing thou lackest: go thy way, sell whatsoever thou hast, and come, take up the cross, and follow Me.\" (MK. 10:21)",
    "reflection": "Jesus showed genuine love for this man, even though He knew that the man might not follow Him. Love is able to give tough advise; it doesn't hedge on the truth. Christ loved us enough to die for us, and He also loves us enough to talk straight to us. If His love were superficial, He would give us only His approval; but His love is complete, He gives us life-changing challenges.",
    "prayer": "Dear Heavenly Father, let me take today's study of what the fellowship of the cross means to heart and believe that it is only by putting my trust in Thee, the Living God, that I can be a disciple who will forsake all and follow Christ. Amen.",
    "reading": "",
    "original_content": "06/12/09~~~food for thought~~~Examine your challenges ~ Christ maybe trying to\ntell you something...\n\nOur Bible Verse for Today:\nThen Jesus, beholding him, loved him, and said: \n\"One thing thou lackest: go thy way, sell whatsoever \nthou hast, and come, take up the cross, and follow Me.\" (MK. 10:21)\n\nOur Lesson for Today:\n\nJesus showed genuine love for this man, even though\nHe knew that the man might not follow Him...\n\nLove is able to give tough advise; it doesn't hedge on the truth...\n\nChrist loved us enough to die for us, and He also loves us enough\nto talk straight to us. If His love were superficial, He would give us\nonly His approval; but His love is complete, He gives us life-changing \nchallenges...\n\nPrayer Suggestion:\nDear Heavenly Father, let me take today's study of what the\nfellowship of the cross means to heart and believe that it is \nonly by putting my trust in Thee, the Living God, that I can be\na disciple who will forsake all and follow Christ...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121d909c563b4ddc",
    "date_utc": "Fri, 12 Jun 2009 04:23:46 -0600",
    "subject": "thoughts to live by",
    "verse": "Jesus said: \"the truth is, a kernel of wheat must be planted in the soil. Unless it dies it will be alone ~ a single seed. But its death will produce many new kernels ~ a plentiful harvest of new lives. Those who love their life in this world will lose it. Those who despise their life in this world will keep it for eternal life.\" (John 12:24-25) NLT",
    "reflection": "This is a beautiful picture of the necessary sacrifice of Jesus. Jesus had to die to pay the penalty for our sin, but also to show His power over death. His resurrection proves He has eternal life. Because Jesus is God, Jesus can give the same eternal life to all who believe in Him. BUT we must be so committed to living for Christ that we \"despise\" our lives in comparison ~ this does not mean that we long to die or that we are careless or destructive with the life God has given, but that we are willing to die if doing so will glorify Christ. Releasing control of our lives and transferring control to Christ will bring eternal life and genuine joy.",
    "prayer": "Dear Father in Heaven, How little this is understood! Help us believe that the law of the Spirit of Christ Jesus, can in every deed make His death and His life the daily experience of our souls. Amen.",
    "reading": "",
    "original_content": "06/13/09~~~food for thought~~~Let us believe that what is impossible to man \nis possible with God...\n\nOur Bible Verses for Today:\nJesus said: \"the truth is, a kernel of wheat must be planted \nin the soil. Unless it dies it will be alone ~ a single seed. But\nits death will produce many new kernels ~ a plentiful harvest\nof new lives...Those who love their life in this world will lose it.\nThose who despise their life in this world will keep it for eternal\nlife...\" (Jn. 12:24-25) NLT\n\nOur Lesson for Today:\n\nThis is a beautiful picture of the necessary sacrifice of Jesus.\nJesus had to die to pay the penalty for our sin, but also to show \nHis power over death...\n\nHis resurrection proves He has eternal life. Because Jesus is God,\nJesus can give the same eternal life to all who believe in Him...\n\nBUT we must be so committed to living for Christ that we \"despise\"\nour lives in comparison ~ this does not mean that we long to die or \nthat we are careless or destructive with the life God has given, but\nthat we are willing to die if doing so will glorify Christ...\n\nReleasing control of our lives and transferring control to Christ will\nbring eternal life and genuine joy...\n\nPrayer Suggestion:\nDear Father in Heaven, How little this is understood! Help us believe \nthat the law of the Spirit of Christ Jesus, can in every deed make His\ndeath and His life the daily experience of our souls...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121de3bc991b39d4",
    "date_utc": "Sat, 13 Jun 2009 04:21:06 -0600",
    "subject": "thoughts to live by",
    "verse": "And He went a little beyond them, and fell on His face and prayed, saying, \"My Father, if it is possible, let this cup pass from me; yet not as I will, but as Thou wilt.\"",
    "reflection": "The death on the cross is the highest and the holiest that can be known to Him even in the glory of heaven. And the highest and the holiest that the Holy Spirit can work in us is to take us up and to keep us in the fellowship of the cross of Christ. We need to enter deeply into the truth that Christ the beloved Son of the Father could not return to the glory of heaven until He had first given Himself over to death. As this great truth opens up to us, it will help us to understand how in our life and in our fellowship with Christ, it is impossible for us to share His life until we have first in every deed surrendered ourselves every day to die to sin and the world and so abide in the unbroken fellowship with our crucified Lord.",
    "prayer": "Dear Heavenly Father, in the power of Christ with whom I too, have been crucified, and in the power of His Spirit I pray, 'May I except Thy will in my life, that it may be done.' Amen.",
    "reading": "",
    "original_content": "06/14/09~~~food for thought~~~In the Garden of Gethsemane\n\nOur Bible Verse for Today:\nAnd He went a little beyond them, and fell on His face and\nprayed, saying, \"My Father, if it is possible, let this cup pass \nfrom me; yet not as I will, but as Thou wilt.\"\n\nOur Lesson for Today: \n\nThe death on the cross is the highest and the holiest that can be \nknown to Him even in the glory of heaven. And the highest and the \nholiest that the Holy Spirit can work in us is to take us up and to keep\nus in the fellowship of the cross of Christ...\n\nWe need to enter deeply into the truth that Christ the beloved Son of\nthe Father could not return to the glory of heaven until He had first given \nHimself over to death...\n\nAs this great truth opens up to us, it will help us to understand how in our\nlife and in our fellowship with Christ, it is impossible for us to share His life\nuntil we have first in every deed surrendered ourselves every day to die\nto sin and the world and so abide in the unbroken fellowship with our\ncrucified Lord...\n\nPrayer Suggestion:\nDear Heavenly Father, in the power of Christ with whom I too,\nhave been crucified, and in the power of His Spirit I pray, 'May\nI except Thy will in my life, that it may be done.'\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121e38434ffa514a",
    "date_utc": "Sun, 14 Jun 2009 16:33:40 -0600",
    "subject": "thoughts to live by",
    "verse": "Then Jesus said, \"Father, forgive them; for they know not what they do.\" (Luke 23:34)",
    "reflection": "These seven words from the cross reveal Christ's heart. Just take the first three words, they are truly an expression of His wonderful love. He prays for His enemies!!! In the hour of their triumph over Him and of the shame and suffering which they delight in showering on Him, He pours out His love in prayer for them. What a Savior!!! This is a call to all believers in a crucified Christ to go and do likewise, even as He has said, \"Love your enemies, bless them that curse you, do good to them that hate you, pray for them that persecute you. Let this be a challenge to us all this week.",
    "prayer": "Dear Heavenly Father, help us to prove that the mind of Christ is our mind and that His love is not only what we trust in for ourselves, but it is what guides us in our loving involvement with the world around us. Amen.",
    "reading": "",
    "original_content": "06/15/09~~~food for thought~~~As you read the verse below, think of \"the wonderful love of the cross.\"\n\nOur Bible Verse for Today:\nThen Jesus said, \"Father, forgive them; for they \nknow not what they do.\" (Lk. 23:34)\n\nOur Lesson for Today:\nThese seven words from the cross reveal Christ's heart. \nJust take the first three words, they are truly an expression\nof His wonderful love...\n\nHe prays for His enemies!!! In the hour of their triumph over\nHim and of the shame and suffering which they delight in\nshowering on Him, He pours out His love in prayer for them.\n\nWhat a Savior!!! \n\nThis is a call to all believers in a crucified Christ to go and do \nlikewise, even as He has said, \"Love your enemies, bless them\nthat curse you, do good to them that hate you, pray for them that\npersecute you...\n\nLet this be a challenge to us all this week...\n\nPrayer Suggestion:\nDear Heavenly Father, help us to prove that the mind of Christ\nis our mind and that His love is not only what we trust in for\nourselves, but it is what guides us in our loving involvement\nwith the world around us...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121e8998b5977d62",
    "date_utc": "Mon, 15 Jun 2009 06:37:20 -0600",
    "subject": "thoughts to live by",
    "verse": "\"My God, My God, why hast Thou forsaken Me?\" (Matthew 27:46) \"I thirst\" (John 19:28) \"It is finished\" (John 19:30)",
    "reflection": "The three first words on the cross reveal love overflowing to all men. the next three words reveal love in the tremendous sacrifice that it took to deliver us from sin and give us victory over the foe. They still reveal the very mind that was in Christ, and that is to be in us as the disposition of our whole life. Oh what great words were those that said it all, \"It is finished.\" All that there was to suffer and endure had been brought a willing sacrifice; He had finished the work the Father gave Him to do. His love held nothing back. He gave Himself as an offering and a sacrifice. Such was the mind of Christ ~ and such must be the disposition of everyone who owes himself and his life to that sacrifice. The mind that was in Christ must be in us ready to say: \"I am come to do the will of Him who sent me and to finish His work.\" Every day our confidence should be growing fuller in Christ's finished work, and there should be more and more evidence that we have a more yielding heart to Him.",
    "prayer": "Dear Heavenly Father, help me to be more yielding to your service, lead me in paths of righteousness for your name sake. Amen.",
    "reading": "",
    "original_content": "06/16/09~~~food for thought~~~Remember the Sacrifice of the cross...\n\nOur Bible Verse for Today:\n\"My God, My God, why hast Thou forsaken Me?\" (Mt. 27:46)\n\"I thirst\" (Jn. 19:28)\n\"It is finished\" (Jn. 19:30)\n\nOur Lesson for Today:\nThe three first words on the cross reveal love overflowing to all men.\nthe next three words reveal love in the tremendous sacrifice that it took \nto deliver us from sin and give us victory over the foe...\n\nThey still reveal the very mind that was in Christ, and that is to be in us\nas the disposition of our whole life...\n\nOh what great words were those that said it all, \"It is finished.\"\n\nAll that there was to suffer and endure had been brought a willing sacrifice;\nHe had finished the work the Father gave Him to do. His love held\nnothing back...\n\nHe gave Himself as an offering and a sacrifice. Such was the mind of\nChrist ~ and such must be the disposition of everyone who owes himself\nand his life to that sacrifice...\n\nThe mind that was in Christ must be in us ready to say: \"I am come to do\nthe will of Him who sent me and to finish His work.\" \n\nEvery day our confidence should be growing fuller in Christ's finished work,\nand there should be more and more evidence that we have a more yielding heart\nto Him...\n\nPrayer Suggestion:\nDear Heavenly Father, help me to be more yielding to your\nservice, lead me in paths of righteousness for your name sake...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121edb68606345e3",
    "date_utc": "Tue, 16 Jun 2009 05:01:55 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Father, into Thy hands I commit My Spirit.\" And having said this He gave up the ghost. (Luke 23:46)",
    "reflection": "Like David in (Psalm 31:5), Christ often committed His spirit into the hands of His Father for His daily life and need. But here is something new and very special. He gives up His spirit into the power of death, He gives up all control over it, to sink down into the darkness and death of the grave where He can neither think, nor pray, nor will. He surrenders Himself to the utmost into His Father's hands, trusting Him to care for Him in the dark and in due time to raise Him up again. If we have really died in Christ and are now in faith every day to carry about with us the death of our Lord Jesus, this is the very word we need. Just think once again what Christ meant when He said that we must hate and lose our life. And if we do this, we will find the answer in the mind which Christ died. Like Him we must cast ourselves upon the Father without knowing how the new life is to be attained; But as we in fellowship with Jesus say, \"Father, into Thy hands I commit my spirit, \" and depend simply and absolutely upon God to raise us up into the new life, There will be fulfilled in us the wonderful promise of God's Word concerning the greatness of His power in us who believe, according to the mighty power which He wrought in Christ when He raised Him from the dead.",
    "prayer": "Heavenly Father, as my spiritual life can only grow out of death, I too, pray, \"Father, into Thy hands I commit my Spirit.\" Amen.",
    "reading": "",
    "original_content": "06/17/09~~~food for though~~~Think once again of the death of the Cross...\n\nOur Bible Verse for Today:\n\"Father, into Thy hands I commit My Spirit.\" And having said\nthis He gave up the ghost... (Lk. 23:46)\n\nOur Lesson for Today:\nLike David in (Ps. 31:5), Christ often committed His spirit into the hands\nof His Father for His daily life and need. But here is something new\nand very special...\n\nHe gives up His spirit into the power of death, He gives up all control\nover it, to sink down into the darkness and death of the grave where \nHe can neither think, nor pray, nor will...\n\nHe surrenders Himself to the utmost into His Father's hands, trusting \nHim to care for Him in the dark and in due time to raise Him up again...\n\nIf we have really died in Christ and are now in faith every day to carry \nabout with us the death of our Lord Jesus, this is the very word we \nneed. Just think once again what Christ meant when He said that \nwe must hate and lose our life...\n\nAnd if we do this, we will find the answer in the mind which Christ died.\nLike Him we must cast ourselves upon the Father without knowing how\nthe new life is to be attained; \n\nBut as we in fellowship with Jesus say, \"Father, into Thy hands I commit \nmy spirit,\" and depend simply and absolutely upon God to raise us up \ninto the new life, \n\nThere will be fulfilled in us the wonderful promise of God's Word concerning\nthe greatness of His power in us who believe, according to the mighty power\nwhich He wrought in Christ when He raised Him from the dead...\n\nPrayer Suggestion:\nHeavenly Father, as my spiritual life can only grow out of death,\nI too, pray, \"Father, into Thy hands I commit my Spirit.\"\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121f2aa8eeb71129",
    "date_utc": "Wed, 17 Jun 2009 05:42:49 -0500",
    "subject": "thoughts to live by",
    "verse": "When Jesus had received the vinegar, He said: \"It is finished.\"",
    "reflection": "The seven words of our Lord on the cross reveal to us His mind, and His disposition. At the beginning of His ministry he is quoted in (John 4:34) as saying: \"My meat is to do the will of Him who sent Me, and to finish His work.\" In all things, the small as well as the great, He came to do God's work. In the High-priestly prayer at the end of the three years' ministry, He could say (John 17:4): I have glorified Thee on earth ~ I have finished the work which Thou gravest Me to do.\" Yes He sacrificed all and in dying on the cross He could say: \"It is finished.\" Let us study the inexhaustible treasure contained in this word: \"It is finished.\" Faith in what Christ accomplished on the cross will enable us to understand more clearly the spirit of the cross.",
    "prayer": "Dear Father, may the mind of Christ be in me, to do Your will in all things, and to finish Your work. Amen.",
    "reading": "",
    "original_content": "06/18/09~~~food for thought~~~Please give some thought today of, \nthe last words uttered from the cross...\n\nOur Bible Verse for Today:\nWhen Jesus had received the vinegar, \nHe said: \"It is finished.\"\n\nOur Lesson for Today:\nThe seven words of our Lord on the cross reveal to us His mind, \nand His disposition...\n\nAt the beginning of His ministry he is quoted in (Jn. 4:34) as saying:\n\"My meat is to do the will of Him who sent Me, and to finish His work.\"\n\nIn all things, the small as well as the great, He came to do God's work.\n\nIn the High-priestly prayer at the end of the three years' ministry, He could\nsay (Jn. 17:4): I have glorified Thee on earth ~ I have finished the work \nwhich Thou gavest Me to do.\"\n\nYes He sacrificed all and in dying on the cross He could say: \"It is finished.\"\n\nLet us study the inexhaustible treasure contained in this word: \"It is finished.\"\n\nFaith in what Christ accomplished on the cross will enable us to understand\nmore clearly the spirit of the cross...\n\nPrayer Suggestion:\nDear Father, may the mind of Christ be in me, \nto do Your will in all things, and to finish Your work...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121f7c51e2259a78",
    "date_utc": "Thu, 18 Jun 2009 05:01:29 -0500",
    "subject": "thoughts to live by",
    "verse": "We who died to sin, how shall we any longer live therein? (Romans 6:2)",
    "reflection": "In these words we have the deep spiritual truth that our death to sin in Christ delivers us from its power so that we no longer may or need to live in it. The secret of true and full holiness is by faith and in the power of the Holy Spirit to live in the consciousness 'I am dead to sin'. In expounding this truth Paul reminds his readers that we are baptized into the death of Christ. We were buried with Him through baptism into death. We became united with Him by the likeness of His death. Our \"old man\" was crucified with Him that the body of sin might be done away ~ rendered void and powerless. Take time and ask for the teaching of the Holy Spirit, quietly think about these words until the truth masters you: (I am indeed dead to sin in Christ Jesus). As we grow in the consciousness of our union with the crucified Christ, we shall experience that the power of His life in us has made us free from the power of sin.",
    "prayer": "Dear Heavenly Father, as I meditate on this truth: 'I am dead to sin in Christ Jesus, ' may I truly realize that His life in me sets me free from the power of sin. Amen.",
    "reading": "",
    "original_content": "06/19/09~~~food for thought~~~Only by continually living in Christ can the\nfollowing truth be so...\n\nOur Bible Verse for Today:\nWe who died to sin, how shall we any longer live\ntherein? (Ro. 6:2)\n\nOur Lesson for Today:\nIn these words we have the deep spiritual truth that our death to sin in\nChrist delivers us from its power so that we no longer may or need to \nlive in it...\n\nThe secret of true and full holiness is by faith and in the power of the\nHoly Spirit to live in the consciousness 'I am dead to sin'...\n\nIn expounding this truth Paul reminds his readers that we are baptized\ninto the death of Christ. We were buried with Him through baptism into \ndeath...\n\nWe became united with Him by the likness of His death. Our \"old man\"\nwas crucified with Him that the body of sin might be done away ~ rendered\nvoid and powerless...\n\nTake time and ask for the teaching of the Holy Spirit, quietly think about \nthese words until the truth masters you: (I am indeed dead to sin in Christ Jesus).\n\nAs we grow in the consciousness of our union with the crucified Christ, we \nshall experience that the power of His life in us has made us free from the \npower of sin...\n\nOur Prayer for Today:\nDear Heavenly Father, as I meditate on this truth: \n'I am dead to sin in Christ Jesus,' may I truly realize \nthat His life in me sets me free from the power of sin...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "121fd30314e1dd3c",
    "date_utc": "Fri, 19 Jun 2009 04:49:32 -0500",
    "subject": "thoughts to live by",
    "verse": "Abraham believed God, and it was credited to him as righteousness. He believed God who gives life. (Romans 4:3, 17b)",
    "reflection": "Let us not forget that God justifies us freely by His grace and not for anything we have done. Abraham not only believed this, but something more, he believed in God, who gives life. Yes there is the need of justification by faith to restore man to the favor of God. But there is also more which is needed. In (Romans 5:8) Paul deals with our justification, \"Christ died for our sins.\" In (Romans 5:12 to 8:39) he assures us of the wonderful union with Christ through faith. By which we died with Him, by which we live in Him, and by which through the Holy Spirit we are made free not only from punishment but also from the power of sin and are enabled to live a life of righteousness, of obedience, and of sanctification.",
    "prayer": "Dear Heavenly Father, I thank You that I am not only free from the punishment of sin, but also from the power of sin and am enabled to live a life of righteousness, obedience, and sanctification. Amen.",
    "reading": "",
    "original_content": "06/20/09~~~food for thought~~~We have a Holy and Gracious God...\n\nOur Bible Verses for Today:\nAbraham believed God, and it was credited to him\nas righteousness...He believed God who gives life.\n(Ro. 4:3, 17b)\n\nOur Lesson for Today:\nLet us not forget that God justifies us freely by His grace \nand not for anything we have done...\n\nAbraham not only believed this, but something more, he \nbelieved in God, who gives life...\n\nYes there is the need of justification by faith to restore man\nto the favor of God. But there is also more which is needed...\n\nIn (Ro. 5:8) Paul deals with our justification, \"Christ died for our\nsins.\" In (Ro. 5:12 to 8:39) he assures us of the wonderful union\nwith Christ through faith. \n\nBy which we died with Him, by which we live in Him, and \nby which through the Holy Spirit we are made free not only \nfrom punishment but also from the power of sin and are \nenabled to live a life of righteousness, of obedience, and \nof sanctification...\n\nPrayer Suggestion:\nDear Heavenly Father, I thank You that I am not only free from\nthe punishment of sin, but also from the power of sin and am\nenabled to live a life of righteousness, obedience, and sanctification...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1220261dc8e05675",
    "date_utc": "Sat, 20 Jun 2009 07:51:43 -0500",
    "subject": "thoughts to live by",
    "verse": "If we died with Christ, we believe that we shall also live with Him. (Romans 6:8)",
    "reflection": "There are so many of God's children living outside the power of the resurrection life of Christ; and the reason is because they have so little understanding of or faith in their death with Christ. Here Paul clearly states \"If we died with Christ, we believe that we shall also live with Him\"; my friends it is the knowledge and experience that gives us the assurance of the power of His resurrection in us.\"Christ died unto sin once: but the life that He liveth He liveth unto God\" (vs. 10) It is only when we realize that we died with Him that we can live with Him. In vs. 11 Paul pleads with his readers \"Even so reckon yourselves to be dead to sin, but alive to God in Christ Jesus.\" We probably think very little about the words: \"even so reckon yourself\" but they are a call to an act of bold and confident faith. Truly the words of vs. 11 give us the divine assurance of what we actually are and have in Christ. Now it is true that this is a truth that our minds can not master and appropriate, but it is a reality which the Holy Spirit will reveal to us. By His power we can accept our death with Christ on the cross as the power of our daily life.",
    "prayer": "Heavenly Father help me accept Your Divine assurance that I shall live with Christ. Amen.",
    "reading": "",
    "original_content": "06/21/09~~~food for thought~~~Christ suffered on earth for you...\nWhat are you doing for Him?\n\nOur Bible Verse for Today:\nIf we died with Christ, we believe that we shall also live with Him.\n(Ro. 6:8)\n\nOur Lesson for Today:\nThere are so many of God's children living outside the power of the \nresurrection life of Christ; and the reason is because they have so \nlittle understanding of or faith in their death with Christ...\n\nHere Paul clearly states \"If we died with Christ, we believe that we \nshall also live with Him\"; my friends it is the knowledge and experience\nthat gives us the assurance of the power of His resurrection in us...\n\n\"Christ died unto sin once: but the life that He liveth He liveth unto God\"\n(vs. 10) It is only when we realize that we died with Him that we can live\nwith Him...\n\nIn vs. 11 Paul pleads with his readers \"Even so reckon yourselves to be \ndead to sin, but alive to God in Christ Jesus.\" We probably think very\nlittle about the words: \"even so reckon yourself\" but they are a call to\nan act of bold and confident faith...\n\nTruly the words of vs. 11 give us the divine assurance of what we actually\nare and have in Christ. Now it is true that this is a truth that our minds can\nnot master and appropriate, but it is a reality which the Holy Spirit will reveal \nto us...\n\nBy His power we can accept our death with Christ on the cross as the \npower of our daily life...\n\nPrayer Suggestion:\nHeavenly Father help me accept Your Divine assurance \nthat I shall live with Christ...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12207325add9d58a",
    "date_utc": "Sun, 21 Jun 2009 08:45:36 -0500",
    "subject": "thoughts to live by",
    "verse": "You were made dead to the law, through the body of Christ. We have been released from the law, for we died with Christ, and we are no longer captive to its power. Now we can really serve God, not in the old way by obeying the letter of the law, but in the new way, by the Spirit. (Romans 7:4, 6)",
    "reflection": "When a person dies to the old life and accepts Christ as Savior, a new life begins. It is quiet the opposite with an unbeliever. Their life is centered on self gratification. Those who don't follow Christ have only their own self-determination as their source of power. BUT by contrast, God is at the center of a Christian's life. God supplies the power for a Christian's daily power. Believers find that their whole way of looking at the world changes when they come to Christ.",
    "prayer": "Dear Heavenly Father, help me to realize that in my flesh, there is no good thing and that there is no deliverance from this state but by yielding to the power of the Spirit. Make me free from the bondage of the flesh, that I might fulfill the righteousness of the law. Amen.",
    "reading": "",
    "original_content": "06/22/09~~~food for thought~~~From whom or what do you draw your power?\n\nOur Bible Verses for Today:\nYou were made dead to the law, through the body of Christ.\nWe have been released from the law, for we died with Christ,\nand we are no longer captive to its power. Now we can really \nserve God, not in the old way by obeying the letter of the law, \nbut in the new way, by the Spirit... (Ro. 7:4, 6)\n\nOur Lesson for Today:\nWhen a person dies to the old life and accepts Christ as Savior,\na new life begins. It is quiet the opposite with an unbeliever. Their\nlife is centered on self gratification...\n\nThose who don't follow Christ have only their own self-determination\nas their source of power...\n\nBUT by contrast, God is at the center of a Christian's life. God supplies\nthe power for a Christian's daily power. Believers find that their whole \nway of looking at the world changes when they come to Christ...\n\nPrayer Suggestion:\nDear Heavenly Father, help me to realize that in my flesh,\nthere is no good thing and that there is no deliverance\nfrom this state but by yielding to the power of the Spirit.\nMake me free from the bondage of the flesh, that I might\nfulfill the righteousness of the law...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1220c9dca7cd9c78",
    "date_utc": "Mon, 22 Jun 2009 04:37:09 -0500",
    "subject": "thoughts to live by",
    "verse": "What the law could not do, in that it was weak through the flesh, God, sending His own Son in the likeness of sinful flesh, and for sin, condemned sin in the flesh. (Romans 8:3)",
    "reflection": "In (Romans 8:7) Paul writes: \"The mind of the flesh is enmity against God; for it is not subject to the law of God, neither indeed can it be.\" Here Paul opens up the depth of sin that is in the flesh. In chapter 7 he had said that in the flesh there is no good thing. Here he goes deeper and tells us that it is enmity against God; it hates God and His law. It was on this account God condemned sin in the flesh on the cross; all the curse that there is upon sin is upon the flesh in which it dwells. It is only as the believer understands this that they will cease any attempt at seeking to perfect in the flesh what is begun in the Spirit. The two are at deadly, irreconcilable enmity. The flesh can never by any process of discipline, or struggling, or prayer, be made better than it is! But the Son of God in the likeness of sinful flesh, in the form of man, condemned sin on the cross.\"There is now no condemnation to them which are in Christ Jesus, who walk, not after the flesh, but after the Spirit.",
    "prayer": "Dear Heavenly Father, Help me to always be mindful of the fact that in me, in my flesh, dwells no good thing that can satisfy You, but that in Your Son we walk not after the flesh but after Your Spirit. Amen.",
    "reading": "",
    "original_content": "06/23/09~~~food for thought~~~Only by walking by the Spirit and His power can we\nlive the life that Christ has won for us on the cross.\n\nOur Bible Verse for Today:\nWhat the law could not do, in that it was weak through \nthe flesh, God, sending His own Son in the likeness\nof sinful flesh, and for sin, condemned sin in the flesh.\n(Ro. 8:3)\n\nOur Lesson for Today:\nIn (Ro. 8:7) Paul writes: \"The mind of the flesh is enmity against God; \nfor it is not subject to the law of God, neither indeed can it be.\"\n\nHere Paul opens up the depth of sin that is in the flesh. In chapter 7\nhe had said that in the flesh there is no good thing. Here he goes\ndeeper and tells us that it is enmity against God; it hates God and His\nlaw...\n\nIt was on this account God condemned sin in the flesh on the cross;\nall the curse that there is upon sin is upon the flesh in which it dwells...\n\nIt is only as the believer understands this that they will cease any attempt\nat seeking to perfect in the flesh what is begun in the Spirit. The two are\nat deadly, irreconcilable enmity...\n\nThe flesh can never by any process of discipline, or struggling, or prayer, \nbe made better than it is! But the Son of God in the likeness of sinful\nflesh, in the form of man, condemned sin on the cross...\n\n\"There is now no condemnation to them which are in Christ Jesus, who\nwalk, not after the flesh, but after the Spirit...\n\nPrayer Suggestion:\nDear Heavenly Father, Help me to always be mindful of the fact that\nin me, in my flesh, dwells no good thing that can satisfy You, but that\nin Your Son we walk not after the flesh but after Your Spirit...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "122119af5ff8de60",
    "date_utc": "Tue, 23 Jun 2009 07:12:16 -0500",
    "subject": "thoughts to live by",
    "verse": "For I resolved to know nothing while I was with you except Jesus Christ and Him crucified. My message and my preaching were not with wise and persuasive words, but with a demonstration of the Spirit's power. (1 Corinthians 2:2, 4)",
    "reflection": "As a brilliant scholar, Paul could have overwhelmed his listeners with intellectual arguments. But instead, he shared the simple message of Jesus Christ. Instead of using his scholarly wisdom he allowed the Holy Spirit to guide his words. In sharing the Good News with others, we should follow Paul's example and keep our message simple and basic. The Holy Spirit will give power to our words and use them to bring glory to Jesus.",
    "prayer": "Lord help me to understand how my life as a believer can better bear the stamp, and witness of nothing but Jesus Christ, and Him crucified. Amen.",
    "reading": "",
    "original_content": "06/24/09~~~food for thought~~~How may I demonstrate better the Holy Spirit's power?\n\nOur Bible Verses for Today:\nFor I resolved to know nothing while I was with you except Jesus \nChrist and Him crucified. My message and my preaching were \nnot with wise and persuasive words, but with a demonstration of \nthe Spirit's power...(1 Cor. 2:2, 4)\n\nOur Lesson for Today:\nAs a brilliant scholar, Paul could have overwhelmed his listeners \nwith intellectual arguments. But instead, he shared the simple \nmessage of Jesus Christ...\n\nInstead of using his scholarly wisdom he allowed the Holy Spirit\nto guide his words...\n\nIn sharing the Good News with others, we should follow Paul's\nexample and keep our message simple and basic. The Holy\nSpirit will give power to our words and use them to bring glory\nto Jesus...\n\nPrayer Suggestion:\nLord help me to understand how my life as a believer can\nbetter bear the stamp, and witness of nothing but Jesus\nChrist, and Him crucified...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12216d3c67fba478",
    "date_utc": "Wed, 24 Jun 2009 05:03:31 -0500",
    "subject": "thoughts to live by",
    "verse": "Everyone who competes in the games goes into strict training. They do it to get a crown that will not last; but we do it to get a crown that will last forever. I beat my body and make it my slave. (1 Corinthians 25, 27b) NIV",
    "reflection": "Paul reminds us here that winning a race requires purpose and discipline. Everything no matter how attractive might be a hindrance, thus we must give it up. Sometimes we grown and complain, but let us not forget we are running toward a heavenly reward. So let us not forget the essential disciplines of prayer, Bible Study, and worship these tree will equip us to run the race set before us. So let us not merely observe from the grandstand; don't just turn out to jog a couple of laps each morning. Let us train diligently our spiritual progress depends upon it.",
    "prayer": "Dear Heavenly Father, I pray that this mind set may be found in all Christian and preachers of the Gospel and that the mind of Christ may be in us all. Amen.",
    "reading": "",
    "original_content": "06/25/09~~~food for thought~~~Lets seek the mind of Christ ~ always...\n\nOur Bible Verses for Today:\nEveryone who competes in the games goes into strict\ntraining. They do it to get a crown that will not last; but\nwe do it to get a crown that will last forever. I beat my \nbody and make it my slave...(1 Cor. 25, 27b) NIV\n\nOur Lesson for Today:\nPaul reminds us here that winning a race requires purpose and discipline.\n\nEverything no matter how attractive might be a hindrance, thus we must give\nit up. Sometimes we grown and complain, but let us not forget we are running\ntoward a heavenly reward...\n\nSo let us not forget the essential disciplines of prayer, Bible Study, and worship\nthese tree will equip us to run the race set before us...\n\nSo let us not merely observe from the grandstand; don't just turn out to jog a \ncouple of laps each morning. Let us train diligently our spiritual progress\ndepends upon it...\n\nPrayer Suggestion:\nDear Heavenly Father, I pray that this mind set may be found \nin all Christian and preachers of the Gospel and that the \nmind of Christ may be in us all...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1221c13a1d05de9d",
    "date_utc": "Thu, 25 Jun 2009 05:38:06 -0500",
    "subject": "thoughts to live by",
    "verse": "We always carry around in our body the death of Jesus, so that the life of Jesus may also be revealed in our body. So then, death is at work in us, but life is at work in you. (2 Corinthians 4:10, 12)",
    "reflection": "We often speak of our abiding in Christ. but we forget that, that means the abiding in a crucified Christ. Many believers appear to think that when once they have claimed Christ's death in the fellowship of the cross and have counted themselves as crucified with Him, that they may now consider it as past and done with. They do not understand that it is in the crucified Christ and in the fellowship of His death that they are to abide daily and unceasingly. Let us not forget that the fellowship of the cross is to be the life of a daily experience, the self-emptying of our Lord, His taking the form of a servant, His humbling Himself and becoming obedient unto death, even the death of the cross. This mind that was in Christ is to be the disposition that marks our daily life.",
    "prayer": "Dear Heavenly Father, help me to learn the lesson that the abiding in Christ for which I have so often prayed and striven for is nothing less than the abiding of the crucified in me and I in Him. Amen.",
    "reading": "",
    "original_content": "06/26/09~~~food for thought~~~\"Talking to men for God is a great thing, but\ntalking to God for men is still greater\" E.M. Bounds\n\nOur Bible Verses for Today:\nWe always carry around in our body the death of Jesus,\nso that the life of Jesus may also be revealed in our body...\nSo then, death is at work in us, but life is at work in you...(2 Cor. 4:10, 12)\n\nOur Lesson for Today:\nWe often speak of our abiding in Christ. but we forget that,\nthat means the abiding in a crucified Christ...\n\nMany believers appear to think that when once they have claimed\nChrist's death in the fellowship of the cross and have counted\nthemselves as crucified with Him, that they may now consider it\nas past and done with...\n\nThey do not understand that it is in the crucified Christ and in the \nfellowship of His death that they are to abide daily and unceasingly...\n\nLet us not forget that the fellowship of the cross is to be the life of \na daily experience, the self-emptying of our Lord, His taking the form \nof a servant, His humbling Himself and becoming obedient unto\ndeath, even the death of the cross.\n\nThis mind that was in Christ is to be the disposition that marks our\ndaily life...\n\nPrayer Suggestion:\nDear Heavenly Father, help me to learn the lesson that the abiding \nin Christ for which I have so often prayed and striven for is nothing\nless than the abiding of the crucified in me and I in Him...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "122211e62b2ce2e9",
    "date_utc": "Fri, 26 Jun 2009 07:07:13 -0500",
    "subject": "thoughts to live by",
    "verse": "How much more, then, will the blood of Christ, who through the eternal Spirit offered Himself unblemished to God, cleanse our consciences from acts that lead to death, so that we may serve the living God. (Hebrews 9:14)",
    "reflection": "Yes there still are those who even though they know Christ, are still working hard to make themselves good enough for God. BUT rules and rituals have never cleansed people's hearts. ONLY by Jesus' blood: (1) we have our conscience cleansed, (2) we are freed from death's sting and can live to serve God, (3) we are freed from sin's power. If you are one of many who are still carrying a load of guilt because you are finding that you can't be good enough for God, take another look at Jesus' death and what it means for you. Christ can heal your conscience and deliver you from the frustration of trying to earn God's favor.",
    "prayer": "Dear Heavenly Father, I pray that You would continually remind me and others like me, we have been crucified with Christ, in Him we have died to sin. Amen.",
    "reading": "",
    "original_content": "06/27/09~~~food for thought~~~Jesus paid it all...\n\nBible Verse for Today:\nHow much more, then, will the blood of Christ, who through\nthe eternal Spirit offered Himself unblemished to God, cleanse\nour consciences from acts that lead to death, so that we may \nserve the living God...(Heb. 9:14)\n\nOur Lesson for Today:\nYes there still are those who even though they know Christ,\nare still working hard to make themselves good enough for \nGod...\n\nBUT rules and rituals have never cleansed people's hearts...\n\nONLY by Jesus' blood: \n(1) we have our conscience cleansed,\n(2) we are freed from death's sting and can live to serve God,\n(3) we are freed from sin's power.\n\nIf you are one of many who are still carrying a load of guilt because you\nare finding that you can't be good enough for God, take another look at\nJesus' death and what it means for you...\n\nChrist can heal your conscience and deliver you from the frustration of\ntrying to earn God's favor...\n\nPrayer Suggestion:\nDear Heavenly Father, I pray that You would continually remind me\nand others like me, we have been crucified with Christ, in Him we have \ndied to sin...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "122264ac3628c04c",
    "date_utc": "Sat, 27 Jun 2009 10:48:26 -0500",
    "subject": "thoughts to live by",
    "verse": "Therefore, brothers, since we have confidence to enter the Most Holy Place by the blood of Jesus ~ by a new and living way opened for us through the curtain, that is, His body (Hebrews 10:19-20)",
    "reflection": "In the temple there was a veil between the holy place and the most holy. At the altar in the court the blood of the sacrifice was sprinkled for the forgiveness of sins. That gave the priests entrance into the holy place to offer God the incense as part of a holy worship. But into the Most Holy, behind the veil, the High Priest alone might enter once a year. That veil was the type of sinful nature; even though it had received the forgiveness of sin, full access and fellowship with God was impossible. When Christ died, the veil was rent. Christ dedicated a new and living way to God through the rent veil of His flesh. This new way, by which we now can enter into the holiest of all, ever passes through the rent veil of the flesh. Every believer \"has crucified the flesh with the passions and the lusts thereof.\" (Galatians 5:24)",
    "prayer": "Dear Heavenly Father, help us to praise Thee that the Holy Spirit ever dwells in us to keep the flesh in its place of crucifixion and condemnation and to give us the abiding victory over all temptation. Amen.",
    "reading": "",
    "original_content": "06/28/09~~~food for thought~~~Yesterday is history, tomorrow is a mystery\nToday is a gift, that is why we call it the present...\nLet us live it well\n\nOur Bible Verses for Today:\nTherefore, brothers, since we have confidence to enter the Most Holy\nPlace by the blood of Jesus ~ by a new and living way opened for us\nthrough the curtain, that is, His body (Heb. 10:19-20)\n\nOur Lesson for Today:\nIn the temple there was a veil between the holy place and the most holy.\nAt the altar in the court the blood of the sacrifice was sprinkled for the\nforgiveness of sins...\n\nThat gave the priests entrance into the holy place to offer God the incense \nas part of a holy worship. But into the Most Holy, behind the veil, the High \nPriest alone might enter once a year...\n\nThat veil was the type of sinful nature; even though it had received the \nforgiveness of sin, full access and fellowship with God was impossible...\n\nWhen Christ died, the veil was rent. Christ dedicated a new and living way\nto God through the rent veil of His flesh. This new way, by which we now \ncan enter into the holiest of all, ever passes through the rent veil of the flesh...\n\nEvery believer \"has crucified the flesh with the passions and the lusts thereof.\" \n(Gal. 5:24)\n\nPrayer Suggestion:\nDear Heavenly Father, help us to praise Thee that the Holy Spirit\never dwells in us to keep the flesh in its place of crucifixion and\ncondemnation and to give us the abiding victory over all temptation...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1222b542c4266b73",
    "date_utc": "Sun, 28 Jun 2009 05:39:14 -0500",
    "subject": "thoughts to live by",
    "verse": "Let us run with patience the race that is set before us, looking unto Jesus, the Author and Perfecter of our faith, who for the joy that was set before Him endured the cross, despising the shame. (Hebrews 12:1b-2) R. V.",
    "reflection": "To be successful at any race the eye and the heart need to be set upon the goal and the prize. Christians are called to keep their eyes fix upon Jesus. In our life we are to be led by the Spirit, this will lead to the throne (the goal) and the glory of God. (the prize) This is the new way which He opened for us through the veil of the flesh. It is as we study that we will realize that it was for His bearing the cross that God so highly exalted Him, so let us walk in His footsteps bearing our cross after Him with the flesh condemned and crucified. As believers let us awake to His blessed truth and run the race always looking to the crucified Jesus, and we will receive power to win for Christ the souls He has purchased on the cross.",
    "prayer": "Dear Heavenly Father, Help us to fix our eyes on Jesus enduring the cross as the one object of our desire. Amen.",
    "reading": "",
    "original_content": "06/29/09~~~food for thought~~~They that wait upon the Lord shall\nrenew their strength. (Isa. 40:30a)\n\nOur Bible Verses for Today:\nLet us run with patience the race that is set before us,\nlooking unto Jesus, the Author and Perfector of our\nfaith, who for the joy that was set before Him endured\nthe cross, despising the shame. (Heb. 12:1b-2) R.V.\n\nOur Lesson for Today:\nTo be successful at any race the eye and the heart need to be\nset upon the goal and the prize...\n\nChristians are called to keep their eyes fix upon Jesus. In our\nlife we are to be led by the Spirit, this will lead to the throne (the goal) \nand the glory of God...(the prize)\n\nThis is the new way which He opened for us through the veil of \nthe flesh... \n\nIt is as we study that we will realize that it was for His bearing the cross \nthat God so highly exalted Him, so let us walk in His footsteps bearing \nour cross after Him with the flesh condemned and crucified...\n\nAs believers let us awake to His blessed truth and run the race \nalways looking to the crucified Jesus, and we will receive power\nto win for Christ the souls He has purchased on the cross...\n\nPrayer Suggestion:\nDear Heavenly Father, Help us to fix our eyes on Jesus \nenduring the cross as the one object of our desire...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12230a29c7498bb4",
    "date_utc": "Mon, 29 Jun 2009 05:14:54 -0500",
    "subject": "thoughts to live by",
    "verse": "Under the system of the Jewish laws, the high priest brought the blood of animals into the Holy Place as a sacrifice for sin, but the bodies of the animals were burned outside the camp. So also Jesus suffered and died outside the city gates in order to make His people holy by shedding His blood. So let us go out to Him outside the camp and bear the disgrace He bore. (Hebrews 13:11-13)",
    "reflection": "There are many Christians who love to hear of the boldness with which we can enter into the Holy Place through His blood, who yet have little desire for the fellowship of His reproach and are unwilling to separate themselves from the world with the same boldness with which they think to enter the sanctuary. Christians suffer inconceivable loss when they think of entering into the Holy Place in faith and prayer and then feel themselves free to enjoy the friendship of the world so long as they do nothing actually sinful. But the Word of God has said: \"Know ye not that the friendship of the world is enmity against God?\" \"Love not the world, neither the things that are in the world; if any man loves the world, the love of the Father is not in Him.\" \"Be not conformed to this world.\" To be a follower of Christ means to be like Him in His love of the cross and His will to sacrifice self that the Father may be glorified and others may be saved.",
    "prayer": "Dear Heavenly Father, teach me what it means that I am called to follow You outside the camp, bearing Your reproach, and so to bear witness to Your holy redeeming love. Let the Spirit and the love that was in You be in me too, that I may at any cost seek to win the souls for whom You have died. Amen.",
    "reading": "",
    "original_content": "06/29/09~~~food for thought~~~Where would we be without the sacrifice of Christ?\n\nOur Bible Verses for Today:\nUnder the system of the Jewish laws, the high priest brought\nthe blood of animals into the Holy Place as a sacrifice for sin,\nbut the bodies of the animals were burned outside the camp...\n\nSo also Jesus suffered and died outside the city gates in order\nto make His people holy by shedding His blood...\n\nSo let us go out to Him outside the camp and bear the disgrace \nHe bore...(Heb. 13:11-13)\n\nOur Lesson for Today:\nThere are many Christians who love to hear of the boldness with\nwhich we can enter into the Holy Place through His blood, who yet\nhave little desire for the fellowship of His reproach and are unwilling \nto separate themselves from the world with the same boldness with\nwhich they think to enter the sanctuary...\n\nChristians suffer inconceivable loss when they think of entering into \nthe Holy Place in faith and prayer and then feel themselves free to \nenjoy the friendship of the world so long as they do nothing actually \nsinful...\n\nBut the Word of God has said: \"Know ye not that the friendship of\nthe world is enmity against God?\" \"Love not the world, neither the\nthings that are in the world; if any man loves the world, the love of\nthe Father is not in Him.\" \"Be not conformed to this world.\"\n\nTo be a follower of Christ means to be like Him in His love of the cross\nand His will to sacrifice self that the Father may be glorified and others\nmay be saved...\n\nPrayer Suggestion:\nDear Heavenly Father, teach me what it means that I am called\nto follow You outside the camp, bearing Your reproach, and so \nto bear witness to Your holy redeeming love. Let the Spirit and \nthe love that was in You be in me too, that I may at any cost seek \nto win the souls for whom You have died...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12235ce3ff95f635",
    "date_utc": "Tue, 30 Jun 2009 07:49:08 -0500",
    "subject": "thoughts to live by",
    "verse": "He Himself bore our sins in His body on the tree, so that we might die to sins and live for righteousness; by His wounds you have been healed. (1 Peter 2:24)",
    "reflection": "We need to remember daily what it cost Jesus to bear the cost of the cross. We merely have to remember some of His last words, like when He cried ~ \"Now is my soul troubled, and what shall I say? Father, save Me from this hour. But for this cause came I unto this hour.\" Let us not imagine that the fellowship of the cross of which Peter speaks here, \"That we, having died to sins, might live unto righteousness, \" is easily understood or experienced. It means that we have to be willing to allow the Holy Spirit to teach us what it is to be identified with Christ in His cross. It means that we will have to realize by faith how actually we shared with Christ in His death and now, as He lives in us, must live in an unceasing fellowship with Him, the Crucified One. This costs self-sacrifice; it costs earnest prayer; it costs a wholehearted surrender to God and His will and the cross of Jesus; it costs living in Christ and unceasing fellowship with Him.",
    "prayer": "Dear Heavenly Father, help me to discover fully what it means to live day by day the secret of living a life in and for You. Amen.",
    "reading": "",
    "original_content": "07/01/09~~~food for thought~~~Look up the Hymn, \"Living for Jesus\"\nand read it through...\n\nOur Bible Verse for Today:\nHe Himself bore our sins in His body on the tree, \nso that we might die to sins and live for righteousness;\nby His wounds you have been healed...(1 Pet. 2:24)\n\nOur Lesson for Today:\nWe need to remember daily what it cost Jesus to bear the cost\nof the cross. We merely have to remember some of His last words,\nlike when He cried ~\n\n\"Now is my soul troubled, and what shall I say? Father, save \nMe from this hour. But for this cause came I unto this hour.\"\n\nLet us not imagine that the fellowship of the cross of which Peter\nspeaks here, \"That we, having died to sins, might live unto \nrighteousness,\" is easily understood or experienced...\n\nIt means that we have to be willing to allow the Holy Spirit to teach \nus what it is to be identified with Christ in His cross...\n\nIt means that we will have to realize by faith how actually we shared \nwith Christ in His death and now, as He lives in us, must live in an unceasing \nfellowship with Him, the Crucified One...\n\nThis costs self-sacrifice; it costs earnest prayer; it costs a wholehearted surrender to God and His will and the cross of Jesus; it\ncosts living in Christ and unceasing fellowship with Him...\n\nPrayer Suggestion:\nDear Heavenly Father, help me to discover fully what it means to\nlive day by day the secret of living a life in and for You...\n\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]
