[
  {
    "message_id": "17a073a4843dbe04",
    "date_utc": "Sun, 13 Jun 2021 16:14:58 -0500",
    "subject": "WORK TO ACCOMPLISH HIS WILL (Please Read Proverbs 3:7-10)",
    "verse": "Don't be impressed with your own wisdom. Instead, fear the Lord, and turn your back on evil. (Proverbs 3:7)",
    "reflection": "Solomon has said more than once in Scriptures, \"We must seek God's will in all we do. This means turning every area of our life over to Him. We need to make Him a vital part of everything we do, then He will guide us, because we will be working to accomplish His purpose. What do you present to God--for your sins or what kind of plea for His forgiveness?",
    "prayer": "Dear Heavenly Father, help me to be a better manager of the many blessings you have showered upon me. Amen.",
    "original_content": "*My Verse:*\n*Don't be impressed with your own wisdom. Instead, fear the Lord,*\n*and turn your back on evil. *(Pro. 3:7)\n\n*Today's Reflection:*\nSolomon has said more than once in Scriptures, \"We must seek God's\nwill in all we do. *This means* turning *every *area of our life over to\nHim. We need to make Him a vital part of everything we do, then He\nwill guide us, because we will be working to accomplish His purpose.\nWhat do you present to God--for your sins *or* what kind of plea for His\nforgiveness?\n*Pastor Sather*\n*Dear Heavenly Father, help me to be a better manager of the many *\n*blessings you have showered upon me. Amen.*",
    "original_content_flat": "My Verse: Don't be impressed with your own wisdom. Instead, fear the Lord, and turn your back on evil. (Pro. 3:7) Today's Reflection: Solomon has said more than once in Scriptures, \"We must seek God's will in all we do. This means turning every area of our life over to Him. We need to make Him a vital part of everything we do, then He will guide us, because we will be working to accomplish His purpose. What do you present to God--for your sins or what kind of plea for His forgiveness? Pastor Sather Dear Heavenly Father, help me to be a better manager of the many blessings you have showered upon me. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "17a16b8fd8865d64",
    "date_utc": "Wed, 16 Jun 2021 16:27:40 -0500",
    "subject": "Five Don'ts",
    "verse": "Do not plot against your neighbors; don't copy their ways. Do not make accusations against someone who hasn't wronged you.. Do not envy violent people;' do not copy their ways. (Proverbs 3:29-31)",
    "reflection": "Romans 12-18 tells us, we are to do our part to live in peace with everyone, as far as possible. We should never envy evil people even though some may be extremely popular, or extremely rich. No matter how much they have, it will fade and vanish like grass that withers and dies, Those who follow God live differently from the wicked, and in the end, will have treasures in heaven.",
    "prayer": "Dear Lord help me remain faithful so that I will receive the eternal price. Amen.",
    "reading": "Proverbs 3:29-36",
    "original_content": "*Subject: FIVE DON'TS (Read Pro. 3:29-36)*\n\n\n\n*MY Verses:*\n\n*Do not** plot against your neighbors; don't copy their ways.*\n\n*Do no**t make accusations against someone who hasn't *\n\n*wronged you.. Do not envy violent people;' do not copy *\n\n*their ways. (Pro. 3:29-31)*\n\n\n\n*Today's Reflection:*\n\nRo. 12 18 tells us, we are to do our part to live in peace\n\nwith everyone, as far as possible. We should *never* envy\n\nevil people even though some may be extremely popular,\n\nor extremely rich. No matter how much they have, it will\n\nfade and vanish like grass that withers and dies, Those\n\nwho follow God live differently from the wicked, and in\n\nthe end, will have treasures in heaven.\n\n* Pastor Sather*\n\n*Dear Lord help me remain faithful so that I will receive*\n\n*the eternal price.*",
    "original_content_flat": "Subject: FIVE DON'TS (Read Pro. 3:29-36) MY Verses: Do not plot against your neighbors; don't copy their ways. Do not make accusations against someone who hasn't wronged you.. Do not envy violent people;' do not copy their ways. (Pro. 3:29-31) Today's Reflection: Ro. 12 18 tells us, we are to do our part to live in peace with everyone, as far as possible. We should never envy evil people even though some may be extremely popular, or extremely rich. No matter how much they have, it will fade and vanish like grass that withers and dies, Those who follow God live differently from the wicked, and in the end, will have treasures in heaven. Pastor Sather Dear Lord help me remain faithful so that I will receive the eternal price.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": true
  }
]
