[
  {
    "message_id": "1680c0cb88a6f736",
    "date_utc": "Tue, 01 Jan 2019 18:53:07 -0600",
    "subject": "He Will Reply",
    "verse": "When they call on me, I will answer; I will be with them in trouble. I will rescue them and honor them. (Psalm 91:15)",
    "reflection": "One of the functions of angels is to watch over believers. (Hebrews 1:14) There are many examples of guardian angels through out Scriptures, (I Kings 19 -- Daniel 6 -- Matthew 18 -Luke 16 -- Acts 12) Angels can also be God's messengers (Matthew 2 -- Acts 27:23, 24). I believe it is very comforting to know that God watches over us in times of great stress and fear. WITH THIS FACT WE SHOULD REALIZE WE ALWAYS HAVE GOD'S ATTENTION.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 2:\n\n_When they call on me, I will answer; I will be with them_\n\n_in trouble. I will rescue them and honor them. _(Ps. 91:15)\n\nTHOUGHT FOR TODAY:\n\nOne of the functions of angels is to watch over believers.\n\n(Heb. 1:14) There are many examples of guardian angels\n\nthrough out Scriptures, (I Kings 19 -- Dan. 6 -- Mt. 18 -Lk. 16 -- Acts 12) Angels can also be God's messengers\n\n(Mt. 2 -- Acts 27:23, 24). I believe it is very comforting\n\nto know that God watches over us in times of great stress\n\nand fear.\n\nWITH THIS FACT WE SHOULD REALIZE WE ALWAYS HAVE GOD'S\n\nATTENTION.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16811564dc26c61c",
    "date_utc": "Wed, 02 Jan 2019 19:31:35 -0600",
    "subject": "All His Benefits",
    "verse": "Praise the Lord, my soul, and forget not His benefits. (Psalm 103:2)",
    "reflection": "In our walk of faith, we should come to Jesus Christ humbled by our unworthiness. We come with no sense of entitlement as we receive His grace and should be overwhelmed by the abundance of His love. They reminder us of all His benefits. HEAVENLY FATHER, LET US ALWAYS PAUSE TO CONSIDER ALL WE HAVE IN YOU.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 3:\n\n_Praise the Lord, my soul, and forget not His benefits. _\n\n(Ps. 103:2)\n\nTHOUGHT FOR TODAY:\n\nIn our walk of faith, we should come to Jesus Christ humbled\n\nby our unworthiness. We come with no sense of entitlement\n\nas we receive His grace and should be overwhelmed by the\n\nabundance of His love. They reminder us of all His benefits.\n\nHEAVENLY FATHER, LET US ALWAYS PAUSE TO CONSIDER ALL WE\n\nHAVE IN YOU.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16816abbb67f1684",
    "date_utc": "Thu, 03 Jan 2019 20:23:00 -0600",
    "subject": "An Inspiring Heritage",
    "verse": "Since we are surrounded by such a great cloud of witnesses. let us run with perseverance the race marked out for us. (Hebrews 12:1)",
    "reflection": "The Christian life often requires some hard work. It requires us to give up whatever endangers our relationship with God, to run patiently, and to struggle against sin with the power of the Holy Spirit. To live effectively, we must keep our eyes on Jesus. WE WILL STUMBLE IF WE LOOK AWAY FROM HIM TO STARE AT OURSELVES OR AT THE CIRCUMSTANCES AROUND US. WE SHOULD BE RUNNING FOR CHRIST NOT OURSELVES, AND WE MUST ALWAYS KEEP HIM IN SIGHT.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 4:\n\n_Since we are surrounded by such a great cloud of_\n\n_witnesses. let us run with perseverance the race_\n\n_marked out for us_. (Heb. 12:1)\n\nTHOUGHT FOR TODAY:\n\nThe Christian life often requires some hard work. It requires\n\nus to give up whatever endangers our relationship with God,\n\nto run patiently, and to struggle against sin with the power of\n\nthe Holy Spirit. To live effectively, we must keep our eyes on\n\nJesus.\n\nWE WILL STUMBLE IF WE LOOK AWAY FROM HIM TO STARE AT OURSELVES OR AT THE CIRCUMSTANCES AROUND US. WE SHOULD BE RUNNING\n\nFOR CHRIST NOT OURSELVES, AND WE MUST ALWAYS KEEP HIM IN SIGHT.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1681be9358501fb3",
    "date_utc": "Fri, 04 Jan 2019 20:48:15 -0600",
    "subject": "Has There Been A Change",
    "verse": "19 Wee all. are being transformed into His image with ever-increasing glory, which come from the Lord, who is the Spirit. (2 Corinthians 3:18)",
    "reflection": "What an amazing thing it would be if people could observe us and say, (2 Corinthians 3:18) LET US REACH OUT IN FRIENDSHIP AND ENCOURAGE THE LONELY!",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 5, 2019\n\n_Wee all. are being transformed into His image with_\n\n_ever-increasing glory, which come from the Lord, who_\n\n_is the Spirit__. _ (2 Cor. 3:18)\n\nTHOUGHT FOR TODAY:\n\nWhat an amazing thing it would be if people could\n\nobserve us and say, (2 Cor. 3:18)\n\nLET US REACH OUT IN FRIENDSHIP AND ENCOURAGE THE LONELY!\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16820ac7b9050cdc",
    "date_utc": "Sat, 05 Jan 2019 19:00:01 -0600",
    "subject": "Do All in Love",
    "verse": "Nothing you do for the Lord is ever useless. (I Corinthians 15:58)",
    "reflection": "When we serve the Lord, no job or act of love is too menial to matter. REMEMBER - - when doing any job, the eyes of the Lord are on you no matter how menial they may seem. SORRY FOR A HALF FINISHED DEVOTION YESTERDAY! !",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 6, 2019:\n\n_Nothing you do for the Lord is ever useless. _(I Cor. 15:58)\n\nTHOUGHT FOR TODAY:\n\nWhen we serve the Lord, no job or act of love is too menial\n\nto matter. REMEMBER - - when doing any job, the eyes of the\n\nLord are on you no matter how menial they may seem.\n\nSORRY FOR A HALF FINISHED DEVOTION YESTERDAY! !\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16825f73308ffc9a",
    "date_utc": "Sun, 06 Jan 2019 19:39:44 -0600",
    "subject": "Proceed With Eyes of Faith",
    "verse": "Now faith is confidence in what we hope for and assurance about what we do not see. (Hebrews 11:1)",
    "reflection": "Just as the sun burns away the fog, our faith in God can burn away the haze of doubt. Remember that when we believe that God will fulfill His promises even though we don't see those promises materialize yet, that is when we demonstrate true faith. SO-LET US WALK IN FAITH, WITH, GOD AS OUR GUIDE HE WILL DELIVER!",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 7, 2019:\n\n_Now faith is confidence in what we hope for and_\n\n_assurance about what we do not see. _(Heb. 11:1)\n\nTHOUGHT FOR TODAY:\n\nJust as the sun burns away the fog, our faith in God can\n\nburn away the haze of doubt. Remember that when we\n\nbelieve that God will fulfill His promises even though\n\nwe don't see those promises materialize yet, that is when\n\nwe demonstrate true faith. SO-LET US WALK IN FAITH, WITH, GOD AS OUR GUIDE HE WILL\n\nDELIVER!",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1682afd0b78b40b0",
    "date_utc": "Mon, 07 Jan 2019 19:04:13 -0600",
    "subject": "Focusing On The Creator",
    "verse": "Look to the Lord and His strength; seek His face always. (I Chronicles 16:11)",
    "reflection": "When we turn our eyes toward the beautiful face of God, we can find sustaining strength and comfort even in the midst of unanswered questions. WHERE ARE YOU SEARCHING FOR THE ANSWERS TO YOUR QUESTION.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 8, 2019:\n\n_Look to the Lord and His strength; seek His face always. _\n\n(I Chr. 16:11)\n\nTHOUGHT FOR TODAY:\n\nWhen we turn our eyes toward the beautiful face of God,\n\nwe can find sustaining strength and comfort even in the\n\nmidst of unanswered questions.\n\nWHERE ARE YOU SEARCHING FOR THE ANSWERS TO YOUR QUESTION.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16830455efed37af",
    "date_utc": "Tue, 08 Jan 2019 19:41:19 -0600",
    "subject": "The Secret To God's Undeserved Grace",
    "verse": "By grace you have been saved. (Ephesians 2:5)",
    "reflection": "We don't receive spiritual blessings because we're strong; we get them (the secret is) BECAUSE WE BELIEVE IN JESUS. These blessings come only through God's undeserved grace. The penalty of sin and its power over us were miraculously destroyed by Christ on the cross. THROUGH FAITH IN CHRIST WE STAND ACQUITTED, OR NOT GUILTY BEFORE GOD.",
    "prayer": "",
    "reading": "Romans 3:21, 22",
    "original_content": "VERSE FOR JAN. 9, 2019:\n\n_By grace you have been saved. _(Eph. 2:5)\n\nTHOUGHT FOR TODAY:\n\nWe don't receive spiritual blessings because we're strong;\n\nwe get them (the secret is) BECAUSE WE BELIEVE IN JESUS.\n\nThese blessings come only through God's undeserved grace.\n\nThe penalty of sin and its power over us were miraculously\n\ndestroyed by Christ on the cross.\n\nTHROUGH FAITH IN CHRIST WE STAND ACQUITTED, OR NOT GUILTY\n\nBEFORE GOD. (Ro. 3:21, 22)\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": true
  },
  {
    "message_id": "168356fcc73b7a11",
    "date_utc": "Wed, 09 Jan 2019 19:45:46 -0600",
    "subject": "thoughts to live by",
    "verse": "The Lord gives strength to His people; the Lord blesses His people with peace. (Psalm 29:11)",
    "reflection": "The same power that raised Christ from the dead is available to help us with our daily problems. When you feel weak and limited, don't despair. Remember that God can give you strength. THE SAME POWER THAT CONTROLS CREATION AND RAISES THE DEAD IS AVAILABLE TO YOU.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The Lord gives strength to His people; the Lord blesses His _\n\n_people with peace. _(Ps. 29:11)\n\nTHOUGHT FOR TODAY:\n\nThe same power that raised Christ from the dead is available\n\nto help us with our daily problems. When you feel weak and\n\nlimited, don't despair. Remember that God can give you\n\nstrength.\n\nTHE SAME POWER THAT CONTROLS CREATION AND RAISES THE DEAD\n\nIS AVAILABLE TO YOU.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1683afe0b68bc758",
    "date_utc": "Thu, 10 Jan 2019 21:39:14 -0600",
    "subject": "Hope For Those Who Have No Hope",
    "verse": "If anybody does sin, we have an Advocate with the Father - - Jesus Christ, the Righteous One. (I John 2:1)",
    "reflection": "Jesus, our Advocate, can turn a prison of lost hope, fear, or regret into the place of His presence. Remember, you can't be tried for a case that is no longer on the docket. United with Christ, you are as safe as He is. Don't be afraid to ask Christ to plead your case; HE HAS ALREADY WON IT",
    "prayer": "",
    "reading": "Romans 8:33,34, Hebrews 7:24,25",
    "original_content": "VERSE FOR JAN. 11, 2019:\n\n_If anybody does sin, we have an Advocate with the _\n\n_Father - - __Jesus Christ, the Righteous One. _(I Jn. 2:1)\n\nTHOUGHT FOR TODAY:\n\nJesus, our Advocate, can turn a prison of lost hope, fear,\n\nor regret into the place of His presence. Remember, you\n\ncan't be tried for a case that is no longer on the docket.\n\nUnited with Christ, you are as safe as He is. Don't be afraid\n\nto ask Christ to plead your case;\n\nHE HAS ALREADY WON IT - - (RO. 8:33, 34, HEB. 7:24, 25",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": true
  },
  {
    "message_id": "1683f96ed6c4fc14",
    "date_utc": "Fri, 11 Jan 2019 19:04:42 -0600",
    "subject": "Where To Find True Peace",
    "verse": "I sought the Lord, and He answered me; He delivered me from all my fears. (Psalm 34:3)",
    "reflection": "When we remember who God is and how much He loves us, we can relax into His peace. WE CAN APPROPRIATE HIS BLESSINGS WHEN WE SEEK HIM.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 12, 2019:\n\n_I sought the Lord, and He answered me; He_\n\n_delivered me from all my fears. _(Ps. 34:3)\n\nTHOUGHT FOR TODAY:\n\nWhen we remember who God is and how much He\n\nloves us, we can relax into His peace.\n\nWE CAN APPROPRIATE HIS BLESSINGS WHEN WE SEEK HIM.\n\n_PASTOR AL._",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16844fc07bf75b5c",
    "date_utc": "Sat, 12 Jan 2019 20:13:14 -0600",
    "subject": "A Right Response To God",
    "verse": "A broken and contrite heart You, God, will not despise. (Psalm 51:17)",
    "reflection": "God wants a broken spirit and a broken and repentant heart. You can never please God by outward actions, no matter how good, if your heart attitude is not right. Are you sorry for your sins? Do you genuinely intend to stop? GOD IS PLEASED BY THIS KIND OF REPENTANCE!",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 13, 2019:\n\n_A broken and contrite heart You, God,_\n\n_will not despise. _(Ps. 51:17)\n\nTHOUGHT FOR TODAY:\n\nGod wants a broken spirit and a broken and repentant\n\nheart. You can never please God by outward actions, no\n\nmatter how good, if your heart attitude is not right. Are\n\nyou sorry for your sins? Do you genuinely intend to stop?\n\nGOD IS PLEASED BY THIS KIND OF REPENTANCE!",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1684a0fd52f5050e",
    "date_utc": "Sun, 13 Jan 2019 19:52:58 -0600",
    "subject": "Putting God's Word Into Practice",
    "verse": "Religion that God our Father accepts as pure and faultless is this: to look after orphans and widows in their distress. (James 1:27)",
    "reflection": "To keep ourselves from letting the world corrupt us, we need to commit ourselves to Christ's ethical and moral system, not the world's. We are not to adapt to the world's value system, which is money, power, and pleasure. TRUE FAITH MEANS NOTHING IF WE ARE CONTAMINATED BY SUCH VALUES.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 14, 2019:\n\n_Religion that God our Father accepts as pure and faultless_\n\n_ is this: to look after orphans and widows in their distress. _\n\n(Jm. 1:27)\n\nTHOUGHT FOR TODAY:\n\nTo keep ourselves from letting the world corrupt us, we need\n\nto commit ourselves to Christ's ethical and moral system, not\n\nthe world's. We are not to adapt to the world's value system,\n\nwhich is money, power, and pleasure.\n\nTRUE FAITH MEANS NOTHING IF WE ARE CONTAMINATED\n\nBY SUCH VALUES.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1684f4d65e274436",
    "date_utc": "Mon, 14 Jan 2019 20:18:19 -0600",
    "subject": "Importance of Readjusting Our Focus",
    "verse": "Jesus said: \"It is very hard for someone who is rich to enter the kingdom of heaven. \" He added: \"It is easier for a camel to go through the eye of a needle. (Matthew 19:23, 24)",
    "reflection": "Because it is impossible for a camel to go through the eye of a needle, it appears impossible for a rich person to get into the Kingdom of heaven. But Jesus explains in verse 26: \"But nothing is impossible with God. \" So what we should realize is, faith in Christ, not in self or riches is what counts. WHAT ARE YOU FOCUSED ON TODAY?",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 15, 2019:\n\nJesus said: _\"It is very hard for someone who is rich to enter _\n\n_the kingdom of heaven.\" _He added: _\"It is easier for a camel _\n\n_to go through the eye of a needle._\n\n(Mt. 19:23, 24)\n\nTHOUGHT FOR TODAY:\n\nBecause it is impossible for a camel to go through the eye of\n\na needle, it appears impossible for a rich person to get into the\n\nKingdom of heaven. But Jesus explains in verse 26: _\"But _\n\n_nothing is impossible with God.\"_ So what we should realize is,\n\nfaith in Christ, not in self or riches is what counts.\n\nWHAT ARE YOU FOCUSED ON TODAY?\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16854a6a8f3bc70c",
    "date_utc": "Tue, 15 Jan 2019 21:13:55 -0600",
    "subject": "The Importance of Understanding God's love",
    "verse": "Now abide faith, hope, love, these three; but the greatest of these is love. (I Corinthians 13:13)",
    "reflection": "In morally corrupt Corinth, love had been a mixed-up term with little meaning. Today people are still confused about love. Love is the greatest of all human qualities, and it is an attribute of God Himself (I John 4:8). Love involves unselfish service to others, to give evidence that you care. Faith is the foundation and content of God's message; Hope is the attitude and focus; Love is the action. WHEN FAITH AND HOPE ARE IN LINE, YOU ARE FREE TO LOVE COMPLETELY BECAUSE YOU UNDERSTAND HOW GOD LOVES.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 16, 2019:\n\n_Now abide faith, hope, love, these three; but the _\n\n_greatest of these is love. _(I Cor. 13:13)\n\nTHOUGHT FOR TODAY:\n\nIn morally corrupt Corinth, love had been a mixed-up term with\n\nlittle meaning. Today people are still confused about love. Love\n\nis the greatest of all human qualities, and it is an attribute of\nGod Himself\n\n(I Jn. 4:8). Love involves unselfish service to others, to give\n\nevidence that you care. Faith is the foundation and content of\n\nGod's message; Hope is the attitude and focus; Love is the action.\n\nWHEN FAITH AND HOPE ARE IN LINE, YOU ARE FREE TO LOVE COMPLETELY\n\nBECAUSE YOU UNDERSTAND HOW GOD LOVES.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16859658cf1c3917",
    "date_utc": "Wed, 16 Jan 2019 19:20:54 -0600",
    "subject": "God Graciously Offers Forgiveness",
    "verse": "Can a man take fire to his bosom, and his cloths not be burned? (Proverbs 6:27)",
    "reflection": "God's laws do not forbid good, clean fun, rather they warn us against destroying ourselves through unwise actions or running ahead of God's timetable. GOD'S LAWS ARE NOT ARBITRARY.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 17, 2019:\n\n_Can a man take fire to his bosom, and his cloths _\n\n_not be burned? _(Pro. 6:27)\n\nTHOUGHT FOR TODAY:\n\nGod's laws do not forbid good, clean fun, rather they\n\nwarn us against destroying ourselves through unwise\n\nactions or running ahead of God's timetable.\n\nGOD'S LAWS ARE NOT ARBITRARY.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1685eb343eaac644",
    "date_utc": "Thu, 17 Jan 2019 20:03:53 -0600",
    "subject": "Always Follow God's Request",
    "verse": "19; Pray at all times and on every occasion in the power of the Holy Spirit. Stay alert and be persistent in your prayers for all Christians everywhere. (Ephesians 6:18)",
    "reflection": "The question has been asked by many, \"How can we pray at all times?\" One way is to pray quick habitual prayers in response to every situation you meet throughout the day. Another way, Is to order your life around God's desire and teachings so that your very life becomes a prayer. WE SHOULD PRAY FOR ALL BELIEVERS IN CHRIST; SO PRAY FOR THE CHRISTIANS YOU KNOW AND FOR THE CHURCHES AROUND THE WORLD.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 18, 2019;\n\n_Pray at all times and on every occasion in the power_\n\n_of the Holy Spirit. Stay alert and be persistent in your_\n\n_prayers for all Christians everywhere. _(Eph. 6:18)\n\nTHOUGHT FOR TODAY:\n\nThe question has been asked by many, \"How can we pray\n\nat all times?\" One way is to pray quick habitual prayers in\n\nresponse to every situation you meet throughout the day.\n\nAnother way, Is to order your life around God's desire and\n\nteachings so that your very life becomes a prayer.\n\nWE SHOULD PRAY FOR ALL BELIEVERS IN CHRIST; SO PRAY FOR\n\nTHE CHRISTIANS YOU KNOW AND FOR THE CHURCHES AROUND\n\nTHE WORLD..\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16863b9b6d18acf1",
    "date_utc": "Fri, 18 Jan 2019 19:29:02 -0600",
    "subject": "Adequacy In Christ",
    "verse": "Now the Lord is the Spirit, and where ever the Spirit of the Lord is, He gives freedom. (2 Corinthians 3:17)",
    "reflection": "God has given us His holy Spirit to enable us to speak with Christ's power. He keeps His eye on us, protecting us as we work for Him. As we realize that God has equipped us, we can overcome our feelings of inadequacy. SO SERVING CHRIST, REQUIRES THAT WE FOCUS ON WHAT HE CAN DO THROUGH US.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 19, 2019:\n\n_Now the Lord is the Spirit, and where ever the Spirit_\n\n_of the Lord is, He gives freedom. _(2 Cor. 3:17)\n\nTHOUGHT FOR TODAY:\n\nGod has given us His holy Spirit to enable us to speak\n\nwith Christ's power. He keeps His eye on us, protecting\n\nus as we work for Him. As we realize that God has\n\nequipped us, we can overcome our feelings of inadequacy.\n\nSO SERVING CHRIST, REQUIRES THAT WE FOCUS ON WHAT HE\n\nCAN DO THROUGH US.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16869165cb4e3852",
    "date_utc": "Sat, 19 Jan 2019 20:28:20 -0600",
    "subject": "The Importance of Faithfulness",
    "verse": "To the pure You show Yourself pure, but to the wicked You show Yourself hostile. (2 Samuel 22:27)",
    "reflection": "\"To the wicked You show Yourself hostile. \" This means that to those who sin, God is a judge who will punish them for their sins. Yes, God will destroy those who are evil. BUT HE WILL RESCUE THOSE WHO ARE HUMBLE!",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 20, 2019:\n\n_To the pure You show Yourself pure, but to the wicked You_\n\n_show Yourself hostile. _(2 Sam. 22:27)\n\nTHOUGHT FOR TODAY:\n\n\"To the wicked You show Yourself hostile.\" This means that\n\nto those who sin, God is a judge who will punish them for\n\ntheir sins. Yes, God will destroy those who are evil.\n\nBUT HE WILL RESCUE THOSE WHO ARE HUMBLE!\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1686e1fa1924a381",
    "date_utc": "Sun, 20 Jan 2019 19:56:33 -0600",
    "subject": "Is God Still Waiting",
    "verse": "While he was a long way off, his father saw him and was filled with compassion. (Luke 15:20)",
    "reflection": "God's love is constant, patient, and welcoming. He will search for us and give us opportunities to respond, BUT he will not force us to come to Him. Like the father in the story; GOD WAITS PATIENTLY FOR US TO COME TO OUR SENSES.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 21, 2019:\n\n_While he was a long way off, his father saw him and_\n\n_was filled with _compassion. (Lk. 15:20)\n\nTHOUGHT FOR TODAY:\n\nGod's love is constant, patient, and welcoming. He will search\n\nfor us and give us opportunities to respond, BUT he will not\n\nforce us to come to Him. Like the father in the story;\n\nGOD WAITS PATIENTLY FOR US TO COME TO OUR SENSES.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "168732d7a8e2344e",
    "date_utc": "Mon, 21 Jan 2019 19:29:47 -0600",
    "subject": "Using Our Gifts Fof Christ",
    "verse": "I am coming soon. Hold on to what you have. (Revelation 3:11)",
    "reflection": "Christians have differing gifts, abilities, experiences, and maturity. God doesn't expect us to be and act the same, BUT He does expect us to \"HOLD ON\" to what we have, and to persevere in using our resources for Him. CLINGING TO GOD'S PROMISES IN HARD TIMES STRENGTHENS OUR FAITH.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 22, 2019:\n\n_I am coming soon. Hold on to what you have._\n\n(Rev. 3:11)\n\nTHOUGHT FOR TODAY:\n\nChristians have differing gifts, abilities, experiences,\n\nand maturity. God doesn't expect us to be and act the\n\nsame, BUT He does expect us to \"HOLD ON\" to what we\n\nhave, and to persevere in using our resources for Him.\n\nCLINGING TO GOD'S PROMISES IN HARD TIMES STRENGTHENS\n\nOUR FAITH.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "168787541655089a",
    "date_utc": "Tue, 22 Jan 2019 20:06:17 -0600",
    "subject": "God is ready to respond",
    "verse": "God told Mosses, \"I am who I am\" (Exodus 3:14)",
    "reflection": "Mosses wanted to know God's name so the Hebrew people would know who sent him. God called Himself \"I am who I am\" a name describing His eternal power and unchanging character. Now in a world where values, morals, and laws change constantly, we can find stability and security in our unchanging God. WHAT GOD PROMISED TO THE GREAT PATRIARCHS HUNDREDS OF YEARS EARLIER HE WOULD FULFILL IN MOSSES.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 23, 2019:\n\nGod told Mosses, \"_I am who I am\"_ (Ex. 3:14)\n\nTHOUGHT FOR TODAY:\n\nMosses wanted to know God's name so the Hebrew people\n\nwould know who sent him. God called Himself \"_I am who I am\"_\n\na name describing His eternal power and unchanging character.\n\nNow in a world where values, morals, and laws change constantly,\n\nwe can find stability and security in our unchanging God.\n\nWHAT GOD PROMISED TO THE GREAT PATRIARCHS HUNDREDS OF YEARS\n\nEARLIER HE WOULD FULFILL IN MOSSES.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1687dafb7c266afb",
    "date_utc": "Wed, 23 Jan 2019 20:28:14 -0600",
    "subject": "The Real Source of Our Life",
    "verse": "We love Him because He first loved us. (1 John 4:19)",
    "reflection": "God's love is the source of all human love, and it spreads like fire. In loving His children, God kindles a flame in their hearts, in turn, they love others, who are warmed by God's love through them. IF WE SHOW JESUS' BEAUTY WITH OUR LIVES, OTHERS WILL SAY, \"NO WONDER YOU LOVE HIM. \"",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 24, 2018:\n\n_We love Him because He first loved us. _(1 Jn. 4:19)\n\nTHOUGHT FOR TODAY:\n\nGod's love is the source of all human love, and it spreads\n\nlike fire. In loving His children, God kindles a flame in their\n\nhearts, in turn, they love others, who are warmed by God's\n\nlove through them.\n\nIF WE SHOW JESUS' BEAUTY WITH OUR LIVES, OTHERS WILL SAY,\n\n\"NO WONDER YOU LOVE HIM.\"\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16882c8dfcc08fe4",
    "date_utc": "Thu, 24 Jan 2019 20:13:49 -0600",
    "subject": "Being truely inspired",
    "verse": "2019: The earth is the Lord's and everything in it. (Psalm 24:1)",
    "reflection": "We need to let the world we live in inspire us to worship the One who owns it, because, ALL CREATION BELONGS TO GOD, SEEN AND UNSEEN.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 25: 2019:\n\n_The earth is the Lord's and everything in it._\n\n(Ps. 24:1)\n\nTHOUGHT FOR TODAY:\n\nWe need to let the world we live in inspire us to\n\nworship the One who owns it, because,\n\nALL CREATION BELONGS TO GOD, SEEN AND UNSEEN.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16887dc7bf5b4d4a",
    "date_utc": "Fri, 25 Jan 2019 19:53:20 -0600",
    "subject": "Unexpected encounters can bring unexpected blessings",
    "verse": "The Lord repay your work, and a full reward be given to you by the Lord God of Israel. (Ruth 2:12)",
    "reflection": "Our reputation is often formed by the people who watch us at work, in town, at home, in church. A good reputation comes by consistently living out the qualities we believe in, NO MATTER WHAT GROUP OF PEOPLE OR SURROUNDINGS WE ARE IN.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 26, 2019:\n\n_The Lord repay your work, and a full reward be_\n\n_given to you by the Lord God of Israel._ (Ruth 2:12)\n\nTHOUGHT FOR TODAY:\n\nOur reputation is often formed by the people who watch\n\nus at work, in town, at home, in church. A good reputation\n\ncomes by consistently living out the qualities we believe in,\n\nNO MATTER WHAT GROUP OF PEOPLE OR SURROUNDINGS WE ARE IN.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1688d3acf1847141",
    "date_utc": "Sat, 26 Jan 2019 20:54:28 -0600",
    "subject": "Christian Life Involves Hard Work",
    "verse": "Think about all Christ endured when sinful people did such terrible things to Him, so that you don't become weary and give up. After all you have not given your life. (Hebrews 12:3, 4)",
    "reflection": "When we face hardship and discouragement, it is easy to lose sight of the big picture. But we are not alone; there is help. Many have already made it through life enduring far more difficult circumstances than we have experienced. Suffering is the training ground for Christians. IT DEVELOPS OUR PATIENCE AND MAKES OUR FINAL VICTORY SWEET.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 27, 2019:\n\n_Think about all Christ endured when sinful people did _\n\n_such terrible things to Him, so that you don't become _\n\n_weary and give up._ After all you have not given your life.\n\n(Heb. 12:3, 4)\n\nTHOUGHT FOR TODAY:\n\nWhen we face hardship and discouragement, it is easy to\n\nlose sight of the big picture. But we are not alone; there is\n\nhelp. Many have already made it through life enduring far\n\nmore difficult circumstances than we have experienced.\n\nSuffering is the training ground for Christians.\n\nIT DEVELOPS OUR PATIENCE AND MAKES OUR FINAL VICTORY SWEET.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16891bf0e53a039f",
    "date_utc": "Sun, 27 Jan 2019 17:57:24 -0600",
    "subject": "Why Worry When You Can Pray",
    "verse": "Don't worry about tomorrow, for tomorrow will bring it's own worries. (Matthew 6:34)",
    "reflection": "Planning for tomorrow is time well spent, worry about tomorrow is time wasted. Sometimes it's difficult to tell the difference. Worry comes through human interference with the divine plan. WORRY IS INTEREST PAID ON TROUBLE BEFORE IT HAPPENS.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 28, 2019:\n\n_Don't worry about tomorrow, for tomorrow will_\n\n_bring it's own worries. _(Mt. 6:34)\n\nTHOUGHT FOR TODAY:\n\nPlanning for tomorrow is time well spent, worry\n\nabout tomorrow is time wasted. Sometimes it's\n\ndifficult to tell the difference. Worry comes through\n\nhuman interference with the divine plan.\n\nWORRY IS INTEREST PAID ON TROUBLE BEFORE IT HAPPENS.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "168976a84b642d03",
    "date_utc": "Mon, 28 Jan 2019 20:22:47 -0600",
    "subject": "Confidently Trusting God for Protection and Peace",
    "verse": "I lay down and slept, I woke up in safety. for the Lord was watching over me. (Psalm 3:5)",
    "reflection": "Some mornings we do wake up to a very difficult day. When this happens, we can either give in to despair or follow the faith of David. Faith, gratitude, and expectation will enable us to face the most trying day with strong confidence in God. IF THE BEST THINGS ARE NOT POSSIBLE MAKE THE BEST OF THE THINGS THAT ARE POSSIBLE.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 29, 2019:\n\n_I lay down and slept, I woke up in safety. _\n\n_for the Lord was watching over me. _(Ps. 3:5)\n\nTHOUGHT FOR TODAY:\n\nSome mornings we do wake up to a very difficult day.\n\nWhen this happens, we can either give in to despair or\n\nfollow the faith of David. Faith, gratitude, and expectation\n\nwill enable us to face the most trying day with strong\n\nconfidence in God.\n\nIF THE BEST THINGS ARE NOT POSSIBLE MAKE THE BEST OF\n\nTHE THINGS THAT ARE POSSIBLE.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1689bbe174e39cbb",
    "date_utc": "Tue, 29 Jan 2019 16:32:33 -0600",
    "subject": "What's In A Smile (this is a little early)",
    "verse": "A happy heart makes the face cheerful, but heartache crushes the spirit. (Proverbs 15:13)",
    "reflection": "Let's look to Psalm 4 for some answers. VS. 1 says: we should ask the Lord for relief. VS. 3 says we can find comfort in knowing we are among those who are favored by God. VS. 4 says we can acknowledge our feelings and be quiet before Him. VS. 5 says we can do right. VS. 7 says we need to trust Him to give us overflowing gladness. VS. 8 says we can rest in the assurance of His peace and safety. Remember A HEART TOUCHED BY GRACE SHOULD BRING JOY TO THE FACE.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 30, 2019:\n\n_A happy heart makes the face cheerful, but heartache _\n\n_crushes the spirit. _(Pro. 15:13)\n\nTHOUGHT FOR TODAY:\n\nLet's look to Ps. 4 for some answers. VS. 1 says: we should ask\n\nthe Lord for relief. VS. 3 says we can find comfort in knowing\n\nwe are among those who are favored by God. VS. 4 says we can\n\nacknowledge our feelings and be quiet before Him. VS. 5 says we\n\ncan do right. VS. 7 says we need to trust Him to give us overflowing\n\ngladness. VS. 8 says we can rest in the assurance of His peace and\n\nsafety. Remember\n\nA HEART TOUCHED BY GRACE SHOULD BRING JOY TO THE FACE.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "168a1c3a5b034576",
    "date_utc": "Wed, 30 Jan 2019 20:36:20 -0600",
    "subject": "Building An Early Defense System",
    "verse": "Hear my cry for help, my King and my God, for to You I pray. (Psalm 5:2)",
    "reflection": "Charles Spurgeon once wrote, \"If you are not seeking the Lord, the devil is seeking you. \" We must seek the Lord early and rely on His help. SO, let's not move into any new day without being aware of the urgent need for the Lord. Being prepared is the best way to be ready for Satan's attack. SO LET US START EACH DAY WITH OUR ARMOR IN PLACE AND OUR MARCHING ORDERS IN HAND.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 31, 2019:\n\n_Hear my cry for help, my King and my God, for to You_\n\n_I pray. _(Ps. 5:2)\n\nTHOUGHT FOR TODAY:\n\nCharles Spurgeon once wrote, \"If you are not seeking the\n\nLord, the devil is seeking you.\" We must seek the Lord\n\nearly and rely on His help. SO, let's not move into any new\n\nday without being aware of the urgent need for the Lord.\n\nBeing prepared is the best way to be ready for Satan's attack.\n\nSO LET US START EACH DAY WITH OUR ARMOR IN PLACE AND OUR\n\nMARCHING ORDERS IN HAND.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "168a6d4d3b54112d",
    "date_utc": "Thu, 31 Jan 2019 20:13:12 -0600",
    "subject": "God Is Listening",
    "verse": "I, by Your great love, can come into Your house; in reverence I bow down toward Your holy temple. (Psalm 5:7)",
    "reflection": "Prayerfulness is not an event; it is a way of being in relationship with God. Prayer is our way of connecting with God in all of life's circumstances. God is always listening. We can -- and should -- talk to Him any time throughout the day. IN PRAYER, GOD HEARS MORE THAN OUR WORDS--HE LISTENS TO OUR HEART.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR FEB. 1, 2019:\n\n_I, by Your great love, can come into Your house;in _\n\n_reverence I bow down toward Your holy temple._\n\n(Ps. 5:7)\n\nTHOUGHT FOR TODAY:\n\nPrayerfulness is not an event; it is a way of being in\n\nrelationship with God. Prayer is our way of connecting\n\nwith God in all of life's circumstances. God is always\n\nlistening. We can -- and should -- talk to Him any time\n\nthroughout the day.\n\nIN PRAYER, GOD HEARS MORE THAN OUR WORDS--HE LISTENS\n\nTO OUR HEART.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  }
]
