[
  {
    "message_id": "1693bee784c20e61",
    "date_utc": "Fri, 01 Mar 2019 19:04:38 -0600",
    "subject": "thoughts to live by",
    "verse": "19; For I know my transgressions, and my sins are always before me. (Psalms 51: 3)",
    "reflection": "Sometimes we ask the Lord to adjust our circumstances or to change people instead of asking Him to deal with us. Praying about our spiritual growth becomes effective ONLY when we first come clean with God. LET'S SETTLE FOR NOTHING LESS THAN TOTAL HONESTY WHEN WE TALK WITH THE LORD.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 2/2/2019;\n\n_For I know my transgressions, and my sins are always _\n\n_before me._ (Ps. 51:3)\n\nTHOUGHT FOR TODAY:\n\nSometimes we ask the Lord to adjust our circumstances\n\nor to change people instead of asking Him to deal with\n\nus. Praying about our spiritual growth becomes effective\n\nONLY when we first come clean with God.\n\nLET'S SETTLE FOR NOTHING LESS THAN TOTAL HONESTY WHEN WE\n\nTALK WITH THE LORD.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "169411b865b6f195",
    "date_utc": "Sat, 02 Mar 2019 19:11:57 -0600",
    "subject": "thoughts to live by",
    "verse": "Surely God is my Help; the Lord is the one who sustains me. (Psalms 54: 4)",
    "reflection": "When life has you down--whether through sorrow that seems to hard to bear or circumstance that make each day a morning-to-night grind--my friend's advice can help. But first, let God pull you up by His power (Psalms 54: 1-4). Then. hold on to His hand. Trust His power and hold on. HE WILL GIVE YOU THE STRENGTH TO KEEP FROM FALLING. (ISA. 40: 31)",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 2/2/2019:\n\n_Surely God is my Help; the Lord is the one who_\n\n_sustains me. _(Ps. 54:4)\n\nTHOUGHT FOR TODAY:\n\nWhen life has you down--whether through sorrow that\n\nseems to hard to bear or circumstance that make each day\n\na morning-to-night grind--my friend's advice can help. But\n\nfirst, let God pull you up by His power (Ps. 54:1-4). Then.\n\nhold on to His hand. Trust His power and hold on.\n\nHE WILL GIVE YOU THE STRENGTH TO KEEP FROM FALLING. (ISA. 40:31)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "169463c0efab219b",
    "date_utc": "Sun, 03 Mar 2019 19:05:35 -0600",
    "subject": "thoughts to live by",
    "verse": "The eternal God is your refuge, and underneath are the everlasting arms. (Deut. 33: 27)",
    "reflection": "Once you have begun to walk with God, you need only keep on walking with Him, and all of life becomes one long stroll. As we sense the strength of God's everlasting arms beneath us (Deut. 33: 27), we can stroll through life with confidence, holding the hand of our unseen Companion. YOU CAN BE CONFIDENT ABOUT TOMORROW IF YOU WALK WITH GOD TODAY. PASTOR AL",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 2/4/2019:\n\n_The eternal God is your refuge, and underneath are_\n\n_the everlasting arms. _(Deut. 33:27)\n\nTHOUGHT FOR TODAY:\n\nOnce you have begun to walk with God, you need only\n\nkeep on walking with Him, and all of life becomes one\n\nlong stroll. As we sense the strength of God's everlasting\n\narms beneath us (Deut. 33:27), we can stroll through life\n\nwith confidence, holding the hand of our unseen Companion.\n\nYOU CAN BE CONFIDENT ABOUT TOMORROW IF YOU WALK WITH\n\nGOD TODAY.\n\n_PASTOR AL__ _",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1694b6411bc37ee3",
    "date_utc": "Mon, 04 Mar 2019 19:07:23 -0600",
    "subject": "thoughts to live by",
    "verse": "I will sing of Your strength, in the morning I will sing of Your love. (Psalms 59: 16)",
    "reflection": "the power of music to heal and help is a gift from God that comforts many. Perhaps that is why the Psalmist speaks so deeply to us. There we find lyrics that connects with our hearts, allowing us to speak to God form the depth of our hearts. MAY OUR GOD GIVE US A SONG TODAY THAT WILL REMIND US OF HIS GREATNESS, NO MATTER WHAT WE MAY FACE.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 2/5/2019:\n\n_I will sing of Your strength, in the morning I will sing_\n\n_of Your love. _(Ps. 59:16)\n\nTHOUGHT FOR TODAY:\n\nthe power of music to heal and help is a gift from God\n\nthat comforts many. Perhaps that is why the Psalmist\n\nspeaks so deeply to us. There we find lyrics that connects\n\nwith our hearts, allowing us to speak to God form the depth\n\nof our hearts.\n\nMAY OUR GOD GIVE US A SONG TODAY THAT WILL REMIND US OF\n\nHIS GREATNESS, NO MATTER WHAT WE MAY FACE.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16950a1c0e06ecc4",
    "date_utc": "Tue, 05 Mar 2019 19:32:52 -0600",
    "subject": "thoughts to live by",
    "verse": "Truly my soul finds rest in God; my salvation comes from Him. (Psalms 62: 1)",
    "reflection": "I love a quiet time on a Sunday morning before church service in order to push worldly thoughts from mind. Today we live in a noisy world, even many church services leave little time for quiet reflection. The psalmist's words are truly relevant in our noisy world today, so that we may meet the living God and hear him speak. LET US TURN DOWN THE WORLD'S VOLUME SO THAT WE MAY HEAR GOD'S VOICE. PASTOR AL.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 2/6/2019:\n\n_Truly my soul finds rest in God; my salvation comes_\n\n_ from Him. _(Ps. 62:1)\n\nTHOUGHT FOR TODAY:\n\nI love a quiet time on a Sunday morning before church\n\nservice in order to push worldly thoughts from mind.\n\nToday we live in a noisy world, even many church services\n\nleave little time for quiet reflection.The psalmist's words are\n\ntruly relevant in our noisy world today, so that we may\n\nmeet the living God and hear him speak.\n\nLET US TURN DOWN THE WORLD'S VOLUME SO THAT WE MAY HEAR GOD'S VOICE.\n\n_PASTOR AL._",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16955f4baa0cd962",
    "date_utc": "Wed, 06 Mar 2019 20:21:36 -0600",
    "subject": "thoughts to live by",
    "verse": "Let heaven and earth praise Him, the seas and all that move in them. (Psalms 69: 34)",
    "reflection": "When we grow to understand the wonder of creation, it must always point us to the Creator Himself, and call us to worship Him. If creation itself gives praise to the Creator, we can and certainly should join in the chorus. WHAT A MIGHTY GOD WE SERVE!",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/7/2019:\n\n_Let heaven and earth praise Him, the seas and _\n\n_all that move in them. _(Ps. 69:34)\n\nTHOUGHT FOR TODAY:\n\nWhen we grow to understand the wonder of creation,\n\nit must always point us to the Creator Himself, and call\n\nus to worship Him. If creation itself gives praise to the\n\nCreator, we can and certainly should join in the chorus.\n\nWHAT A MIGHTY GOD WE SERVE!\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1695af83d5e10b5d",
    "date_utc": "Thu, 07 Mar 2019 19:43:32 -0600",
    "subject": "thoughts to live by",
    "verse": "19 From birth I have relied on You; You brought me forth from my mother's womb. I will ever praise You. (Psalms 71: 6)",
    "reflection": "Are you in life's springtime? Trust God's timing to fulfill your dreams. Are you in life's summer or winter? Face your daily challenges head on. If you feel winters chill, Concentrate on knowing God better. HIS PRESENCE WILL MAKE EVERY SEASON OF LIFE ONE OF STRENGTH AND BEAUTY.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/8/2019\n\n_From birth I have relied on You; You brought me forth_\n\n_from my mother's womb. I will ever praise You. _(Ps. 71:6)\n\nTHOUGHT FOR TODAY:\n\nAre you in life's springtime? Trust God's timing to fulfill\n\nyour dreams. Are you in life's summer or winter? Face your\n\ndaily challenges head on. If you feel winters chill, Concentrate\n\non knowing God better.\n\nHIS PRESENCE WILL MAKE EVERY SEASON OF LIFE ONE OF STRENGTH\n\nAND BEAUTY.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "169602661e553d5c",
    "date_utc": "Fri, 08 Mar 2019 19:52:02 -0600",
    "subject": "thoughts to live by",
    "verse": "Let us draw near to God. . . with the full assurance that faith brings. ((Hebrews 10: 22)",
    "reflection": "In the O. T. , access to God in the tabernacle and the temple was strictly limited. Only priests could go in through the curtain and offer sacrifices in the holy place. Now because of Christ's sacrifice for our sins, all those who love and follow Him can come into His presence at any time. HE HAS GIVEN US THE RIGHT OF ACCESS.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/9/2019:\n\n_Let us draw near to God. . . with the full assurance_\n\n_that faith brings. _((Heb. 10:22)\n\nTHOUGHT FOR TODAY:\n\nIn the O. T. , access to God in the tabernacle and the temple\n\nwas strictly limited. Only priests could go in through the curtain\n\nand offer sacrifices in the holy place.Now because of Christ's\n\nsacrifice for our sins, all those who love and follow Him can come\n\ninto His presence at any time. HE HAS GIVEN US THE RIGHT OF ACCESS.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1696535367e53398",
    "date_utc": "Sat, 09 Mar 2019 19:26:20 -0600",
    "subject": "thoughts to live by",
    "verse": "He was looking forward to the city with foundations, whose architect and builder is God. (Hebrews 11: 10)",
    "reflection": "Abraham left all that he knew as he obeyed the Lord's call to live as a foreigner and stranger in a new land (Genesis 12: 1). He pressed through the cultural challenges while keeping his faith in God, and 2, 000 years later the writer to the Hebrews called him a hero. Perhaps you've always lived in the same town, but as Christ's follower you are still a foreigner or stranger on this earth. GOD CALLS US TO LIVE BY FAITH. PASTOR AL.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/10/2019:\n\n_He was looking forward to the city with foundations,_\n\n_whose architect and builder is God. _(Heb. 11:10)\n\nTHOUGHT FOR TODAY:\n\nAbraham left all that he knew as he obeyed the Lord's call\n\nto live as a foreigner and stranger in a new land (Gen. 12:1).\n\nHe pressed through the cultural challenges while keeping his\n\nfaith in God, and 2,000 years later the writer to the Hebrews\n\ncalled him a hero. Perhaps you've always lived in the same\n\ntown, but as Christ's follower you are still a foreigner or\n\nstranger on this earth. GOD CALLS US TO LIVE BY FAITH.\n\n_PASTOR AL._",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1696a4eed3ae07c3",
    "date_utc": "Sun, 10 Mar 2019 20:12:31 -0500",
    "subject": "thoughts to live by",
    "verse": "When the Lord takes pleasure in anyone's way, He causes their enemies to make peace with them. (Proverbs 16: 7)",
    "reflection": "When we have been offended, it's good to compare our instincts with God's intent for human behavior. We may be inclined to strike at people verbally, isolate ourselves, or escape through any number of ways. HOWEVER, choosing a gracious response will help us avoid regret, and most important it will please God. WE CAN ENDURE LIFE'S WRONGS BECAUSE WE KNOW THAT GOD WILL MAKE THINGS RIGHT.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/11/2019:\n\n_When the Lord takes pleasure in anyone's way, He causes _\n\n_their enemies to make peace with them. _(Pro. 16:7)\n\nTHOUGHT FOR TODAY:\n\nWhen we have been offended, it's good to compare our instincts\n\nwith God's intent for human behavior. We may be inclined to\n\nstrike at people verbally, isolate ourselves, or escape through\n\nany number of ways. HOWEVER, choosing a gracious response\n\nwill help us avoid regret, and most important it will please God.\n\nWE CAN ENDURE LIFE'S WRONGS BECAUSE WE KNOW THAT GOD WILL\n\nMAKE THINGS RIGHT.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1696f6d4088a5c05",
    "date_utc": "Mon, 11 Mar 2019 20:03:45 -0500",
    "subject": "thoughts to live by",
    "verse": "Let us run with perseverance the race marked out for us, fixing our eyes on Jesus, the pioneer and perfecter of faith. (Hebrews 12: 1, 2)",
    "reflection": "When the problems of life cloud our vision we have an opportunity to learn to see our goal with eyes of faith. The N. T. letter to the Hebrews urges us to run with perseverance the race marked out for us. when we feel like quitting, this is our signal to remember not only what Jesus suffered for us but now helps us to endure--until the day we see Him face to face. WE CAN FINISH STRONG WHEN WE FOCUS ON HIM.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/12/2019:\n\n_Let us run with perseverance the race marked out for us,_\n\n_fixing our eyes on Jesus, the pioneer and perfecter of faith._\n\n(Heb. 12:1, 2)\n\nTHOUGHT FOR TODAY:\n\nWhen the problems of life cloud our vision we have an\n\nopportunity to learn to see our goal with eyes of faith.\n\nThe N. T. letter to the Hebrews urges us to run with\n\nperseverance the race marked out for us. when we feel\n\nlike quitting, this is our signal to remember not only what\n\nJesus suffered for us but now helps us to endure--until the\n\nday we see Him face to face.\n\nWE CAN FINISH STRONG WHEN WE FOCUS ON HIM.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16974a0d8d7a7e53",
    "date_utc": "Tue, 12 Mar 2019 20:18:12 -0500",
    "subject": "thoughts to live by",
    "verse": "Come with Me by yourselves to a quiet place and get some rest. (Mark 6: 31)",
    "reflection": "In Exodus 18 we see that Moses was wearing himself out serving alone as judge over the Israelites. His Father-in-law warned Moses that his workload was to heavy, and suggested that he delegate some of the work to others. Now in Mark 6: 30, 31 Jesus often slipped away to rest and pray. When we follow His example, we will be more effective in our relationships and better able to give care to others. DON'T TRY TO DO EVERYTHING, TAKE TIME TO REFRESH YOUR BODY AND SPIRIT.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/13/2019:\n\n_Come with Me by yourselves to a quiet place and get _\n\n_some rest. _(Mk. 6:31)\n\nTHOUGHT FOR TODAY:\n\nIn Ex. 18 we see that Moses was wearing himself out serving\n\nalone as judge over the Israelites. His Father-in-law warned\n\nMoses that his workload was to heavy, and suggested that he\n\ndelegate some of the work to others.Now in Mk. 6:30,31\n\nJesus often slipped away to rest and pray. When we follow\n\nHis example, we will be more effective in our relationships\n\nand better able to give care to others.DON'T TRY TO DO EVERYTHING,\n\nTAKE TIME TO REFRESH YOUR BODY AND SPIRIT.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16979b31a1f87875",
    "date_utc": "Wed, 13 Mar 2019 19:56:15 -0500",
    "subject": "thoughts to live by",
    "verse": "We do not have a high priest who is unable to empathize with our weakness, (Hebrews 4: 15)",
    "reflection": "Jesus knew what it was like to lose His personal space in the commotion of crowds desperate to see and touch Him. A woman who had suffered from constant bleeding for 12 years and could not find a cure touched the fringe of His robe and was healed immediately. Jesus felt the power come out of Him. While some of us wish to keep our personal space and privacy, the only way to help a world of hurting people is to let them get close enough to be touched by encouragement, comfort, and the grace of Christ in us. A CHRISTIAN'S LIFE IS THE WINDOW THROUGH WHICH OTHERS CAN SEE JESUS.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/14/2019:\n\n_We do not have a high priest who is unable to empathize with _\n\n_our weakness, _(Heb. 4:15)\n\nTHOUGHT FOR TODAY:\n\nJesus knew what it was like to lose His personal space in the\n\ncommotion of crowds desperate to see and touch Him.A woman\n\nwho had suffered from constant bleeding for 12 years and could\n\nnot find a cure touched the fringe of His robe and was healed\n\nimmediately. Jesus felt the power come out of Him. While\n\nsome of us wish to keep our personal space and privacy, the\n\nonly way to help a world of hurting people is to let them get close\n\nenough to be touched by encouragement, comfort, and the grace\n\nof Christ in us.A CHRISTIAN'S LIFE IS THE WINDOW THROUGH WHICH\n\nOTHERS CAN SEE JESUS.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1697edd57da3060d",
    "date_utc": "Thu, 14 Mar 2019 20:00:29 -0500",
    "subject": "thoughts to live by",
    "verse": "The Lord lifts up those who are bow down. (Psalms 146: 8)",
    "reflection": "It is so easy to become spiritually bow down by the burdens of life. So often we find ourselves discouraged by the problems we face and the needs of those we love. But if we consider God's care, His great power, and His loving heart, we can began to look up and praise Him. We can walk through each day knowing that the \"Lord reigns forever. (Psalms 146: 10) HE LIFTS US UP WHEN WE ARE BOWED DOWN. PRAISE THE LORD.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/15/2019:\n\n_The Lord lifts up those who are bow down. _(Ps. 146:8)\n\nTHOUGHT FOR TODAY:\n\nIt is so easy to become spiritually bow down by the burdens of\n\nlife. So often we find ourselves discouraged by the problems we\n\nface and the needs of those we love.But if we consider God's care,\n\nHis great power, and His loving heart, we can began to look up\n\nand praise Him. We can walk through each day knowing that the\n\n\"Lord reigns forever. (Ps. 146:10)\n\nHE LIFTS US UP WHEN WE ARE BOWED DOWN. PRAISE THE LORD.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "169838aaf1875145",
    "date_utc": "Fri, 15 Mar 2019 17:48:18 -0500",
    "subject": "thoughts to live by",
    "verse": "Your heavenly Father feeds [the birds of the air]. Are you not much more valuable then they? (Matthew 6: 26)",
    "reflection": "Loneliness can make us feel unseen by others--and maybe even by God. But we must remind ourselves that even though we may feel forgotten by our Creator God, we are not. God not only made us in His image (Genesis 1: 26-27), yes He also values each of us, Even in our darkest hours, we can rest in the knowledge that we are never alone, but our loving God is with us. IF WE WEREN'T DEEPLY LOVED, WOULD GOD HAVE SENT HIS SON TO SAVE US.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/16/2019:\n\n_Your heavenly Father feeds [the birds of the air]._\n\n_Are you not much more valuable then they? _(Mt. 6:26)\n\nTHOUGHT FOR TODAY:\n\nLoneliness can make us feel unseen by others--and maybe even\n\nby God. But we must remind ourselves that even though we may\n\nfeel forgotten by our Creator God, we are not. God not only made\n\nus in His image (Gen. 1:26-27), yes He also values each of us,\n\nEven in our darkest hours, we can rest in the knowledge that we\n\nare never alone, but our loving God is with us. IF WE WEREN'T DEEPLY\n\nLOVED, WOULD GOD HAVE SENT HIS SON TO SAVE US.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1698929d47ae58ed",
    "date_utc": "Sat, 16 Mar 2019 20:00:14 -0500",
    "subject": "thoughts to live by",
    "verse": "19; FOR YOU HAVE BEEN GIVEN NOT ONLY THE PRIVILEGE OF TRUSTING IN CHRIST BUT ALSO THE PRIVILEGE OF SUFFERING FOR HIM. (PHIL. 1: 29)",
    "reflection": "When we suffer for our faith, it doesn't mean that we have done something wrong. In fact, the opposite is often true--it verifies that we have been faithful. USE SUFFERING TO BUILD YOUR CHARACTER.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/17/2019;\n\n_FOR YOU HAVE BEEN GIVEN NOT ONLY THE PRIVILEGE OF_\n\n_TRUSTING IN CHRIST BUT ALSO THE PRIVILEGE OF SUFFERING_\n\n_FOR HIM. _(PHIL. 1:29)\n\nTHOUGHT FOR TODAY:\n\nWhen we suffer for our faith, it doesn't mean that we\n\nhave done something wrong. In fact, the opposite is\n\noften true--it verifies that we have been faithful.\n\nUSE SUFFERING TO BUILD YOUR CHARACTER.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1698e8ddf5b61898",
    "date_utc": "Sun, 17 Mar 2019 21:07:36 -0500",
    "subject": "thoughts to live by",
    "verse": "God is faithful; He will not allow you to be tempted beyond what you can bear. (I Corinthians 10: 13)",
    "reflection": "Temptation has aways of often knocking at our door. Sometimes from our own desires, other times through the situations and people we encounter. Now the \"way out\" may include removing the objects of temptation or fleeing from them. OUR BEST COURSE OF ACTION MAY BE TO SIMPLY WALK AWAY--AND FLEE TO GOD.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/18/2019:\n\n_God is faithful; He will not allow you to be tempted beyond _\n\n_what you can bear. _(I Cor. 10:13)\n\nTHOUGHT FOR TODAY:\n\nTemptation has aways of often knocking at our door.Sometimes\n\nfrom our own desires, other times through the situations and\n\npeople we encounter. Now the \"way out\" may include removing\n\nthe objects of temptation or fleeing from them. OUR BEST COURSE\n\nOF ACTION MAY BE TO SIMPLY WALK AWAY--AND FLEE TO GOD.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "169939263360651b",
    "date_utc": "Mon, 18 Mar 2019 20:30:38 -0500",
    "subject": "thoughts to live by",
    "verse": "19; If god is for us who can be against us? (Romans 31 b)",
    "reflection": "Do you ever think that because you are not good enough for God, He will not save you? Do you ever feel as if salvation is for every one else and not for you? If God gave His Son for you; He isn't going to hold back the gift of salvation. HE WILL NOT HOLD BACK ANYTHING YOU NEED TO LIVE FOR HIM.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/19/2019;\n\n_If god is for us who can be against us? _(Ro. 31 b)\n\nTHOUGHT FOR TODAY:\n\nDo you ever think that because you are not good enough for\n\nGod, He will not save you? Do you ever feel as if salvation\n\nis for every one else and not for you? If God gave His Son\n\nfor you; He isn't going to hold back the gift of salvation.\n\nHE WILL NOT HOLD BACK ANYTHING YOU NEED TO LIVE FOR HIM.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16998b8e5bf5d703",
    "date_utc": "Tue, 19 Mar 2019 20:30:48 -0500",
    "subject": "thoughts to live by",
    "verse": "I became a servant of this gospel by the gift of god's grace. (Eph. 3: 9)",
    "reflection": "Saul--who later became Paul, must have truly been surprised when he had been killing the followers of Christ and now Christ Himself chose Paul to become Christ's servant. Have you become surprised by God's gift of grace in your life as He shows you His love and forgiveness? NEVER MEASURE GOD'S UNLIMITED POWER BY YOUR LIMITED EXPECTATIONS.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/20/2019:\n\n_I became a servant of this gospel by the gift of god's grace._(Eph.\n3:9)\n\nTHOUGHT FOR TODAY:\n\nSaul--who later became Paul, must have truly been surprised when\n\nhe had been killing the followers of Christ and now Christ Himself\n\nchose Paul to become Christ's servant. Have you become surprised\n\nby God's gift of grace in your life as He shows you His love and\n\nforgiveness?\n\nNEVER MEASURE GOD'S UNLIMITED POWER BY YOUR LIMITED EXPECTATIONS.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1699dce074974872",
    "date_utc": "Wed, 20 Mar 2019 20:11:59 -0500",
    "subject": "thoughts to live by",
    "verse": "Live as children of the light, (Eph. 5: 8)",
    "reflection": "Scriptures say that believers are children of the light. This means that we need to live in the full light of God's presence to thrive (Psalms 89: 15). If we try to live in darkness, we will produce nothing but \"fruitless deeds\" (see Eph. 5: 3-4). But if we are living in the light of Jesus, who is the Light of the world, WE WILL PRODUCE THE FRUIT OF HIS LIGHT, WHICH IS GOOD, FAITHFUL, AND TRUE.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/21/2019:\n\n_Live as children of the light, _(Eph. 5:8)\n\nTHOUGHT FOR TODAY:\n\nScriptures say that believers are children of the light. This\n\nmeans that we need to live in the full light of God's presence\n\nto thrive (Ps. 89:15). If we try to live in darkness, we will\n\nproduce nothing but \"fruitless deeds\" (see Eph. 5:3-4). But\n\nif we are living in the light of Jesus, who is the Light of the\n\nworld, WE WILL PRODUCE THE FRUIT OF HIS LIGHT, WHICH IS GOOD,\n\nFAITHFUL, AND TRUE.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "169a2fdaed7772a3",
    "date_utc": "Thu, 21 Mar 2019 20:22:08 -0500",
    "subject": "thoughts to live by",
    "verse": "19 Set your eyes on things above, not on earthly things (Colossians 3: 2) (READ COL. 3: 1-11)",
    "reflection": "Our life on earth is like the pregame in basketball. Life is interesting and full of promise, but it doesn't compare to what lies ahead, just think of the pleasure of knowing that when life is good, the best is yet to come! Or that when we give cheerfully to those in need, it's an investment in heavenly treasure. In times of suffering and sorrow, we can find hope as we reflect on the truth that a pain-free, tireless eternity awaits us, LIVING FOR THE FUTURE PUTS TODAY IN PERSPECTIVE.",
    "prayer": "",
    "reading": "COL. 3:1-11",
    "original_content": "VERSE FOR 3/22/2019\n\n_Set your eyes on things above, not on earthly things _(Col. 3:2)\n\n(READ COL. 3:1-11)\n\nTHOUGHT FOR TODAY:\n\nOur life on earth is like the pre-game in basketball. Life is\n\ninteresting and full of promise, but it doesn't compare to\n\nwhat lies ahead, just think of the pleasure of knowing that\n\nwhen life is good, the best is yet to come! Or that when we\n\ngive cheerfully to those in need, it's an investment in heavenly\n\ntreasure. In times of suffering and sorrow, we can find hope\n\nas we reflect on the truth that a pain-free, tireless eternity awaits\n\nus, LIVING FOR THE FUTURE PUTS TODAY IN PERSPECTIVE.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": true
  },
  {
    "message_id": "169a8049620e9efe",
    "date_utc": "Fri, 22 Mar 2019 19:47:47 -0500",
    "subject": "thoughts to live by",
    "verse": "[Christ] went through the greater and more perfect tabernacle that is not made with human hands. (Hebrews 9: 11)",
    "reflection": "The work Christ would accomplish on our behalf, He did it so that \"those who are called may receive the promised eternal inheritance. \" (Vs. 15) Jesus invites us to be a part of His story. JESUS TOOK OUR SIN THAT WE MIGHT HAVE SALVATION.",
    "prayer": "",
    "reading": "Hebrews 9:11-15",
    "original_content": "VERSE FOR 3/23/2019;\n\n[_Christ] went through the greater and more perfect_\n\n_tabernacle that is not made with human hands._ (Heb. 9:11)\n\n(READ HEB. 9:11-15)\n\nTHOUGHT FOR TODAY:\n\nThe work Christ would accomplish on our behalf, He did it so\n\nthat \"those who are called may receive the promised eternal\n\ninheritance.\" (Vs. 15) Jesus invites us to be a part of His story.\n\nJESUS TOOK OUR SIN THAT WE MIGHT HAVE SALVATION.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": true
  },
  {
    "message_id": "169ad27783154e7f",
    "date_utc": "Sat, 23 Mar 2019 19:43:59 -0500",
    "subject": "thoughts to live by",
    "verse": "I will strength you and keep you. (Isaiah 41: 10)",
    "reflection": "At times, God may allow our resources to dwindle so that we rely on His strength to keep going. Our needs showcase His power, but He is the One who says, \"I will strengthen you and help you; I will uphold you with My righteous right hand. \" GOD WANTS US TO DEPEND ON HIS STRENGTH, NOT OUR OWN.",
    "prayer": "",
    "reading": "",
    "original_content": "THE VERSE FOR 3/24/2019:\n\n_I will strength you and keep you. _(Isa. 41:10)\n\nTHOUGHT FOR TODAY:\n\nAt times, God may allow our resources to dwindle so\n\nthat we rely on His strength to keep going. Our needs\n\nshowcase His power, but He is the One who says,\n\n_\"I will strengthen you and help you; I will uphold_\n\n_you with My righteous right hand.\" _\n\nGOD WANTS US TO DEPEND ON HIS STRENGTH, NOT OUR OWN.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "169b23a8b85fd9ce",
    "date_utc": "Sun, 24 Mar 2019 19:22:55 -0500",
    "subject": "thoughts to live by",
    "verse": "In the beginning was the word. . . . Through Him all things were made. (John 1: 1, 3)",
    "reflection": "John tells us, \"The Word became flesh and made His dwelling among us. We have seen His glory. \" (John 1: 14) Out of that eyewitness experience John also wrote, \"We proclaim to you the one who existed from the beginning, whom we have heard and seen. . . He is the Word of life. \" (I John 1: 1). Like John we can use our words to introduce others to Jesus whom wind and water obey. LET US ACKNOWLEDGE THE CREATOR TO OTHER, WHO KNOWS AND LOVES HIS CREATION.",
    "prayer": "",
    "reading": "John 1:1-14",
    "original_content": "THE VERSE FOR 3:25/2019:\n\n_In the beginning was the word. . . . Through Him_\n\n_all things were made. _(Jn. 1:1, 3) For the big picture\n\nread Jn. 1:1-14\n\nTHOUGHT FOR TODAY:\n\nJohn tells us, \"_The Word became flesh and made His dwelling _\n\n_among us. We have seen His glory.\" _(Jn. 1:14) Out of that\n\neyewitness experience John also wrote, _\"We proclaim to you _\n\n_the one who existed from the beginning, whom we have heard _\n\n_and seen. . . He is the Word of life.\" _(I Jn. 1:1). Like John we\n\ncan use our words to introduce others to Jesus whom wind and\n\nwater obey. LET US ACKNOWLEDGE THE CREATOR TO OTHER, WHO KNOWS\n\nAND LOVES HIS CREATION.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": true
  },
  {
    "message_id": "169b77399fbe2b48",
    "date_utc": "Mon, 25 Mar 2019 19:43:20 -0500",
    "subject": "thoughts to live by",
    "verse": "It is not the healthy who need a doctor, but the sick. (Mark 2: 17)",
    "reflection": "Yes Jesus came to save sinners, which includes all of us. He loves us, He welcomes us into His presence, and calls us to follow Him. If we will walk with Him, we will grow more and more spiritually fit. It is up to us to reach out to those who need a Savior. JESUS'S ARMS OF WELCOME ARE ALWAYS OPEN.",
    "prayer": "",
    "reading": "Mark 2:13-17",
    "original_content": "VERSE FOR 3/26/2019:\n\n_It is not the healthy who need a doctor, but the sick._\n\n(Mk. 2:17) . . . read (Mk. 2:13-17)\n\nTHOUGHT FOR TODAY:\n\nYes Jesus came to save sinners, which includes all of us.\n\nHe loves us, He welcomes us into His presence, and calls\n\nus to follow Him. If we will walk with Him, we will grow\n\nmore and more spiritually fit. It is up to us to reach out to\n\nthose who need a Savior.\n\nJESUS'S ARMS OF WELCOME ARE ALWAYS OPEN.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": true
  },
  {
    "message_id": "169bcaabcf51267b",
    "date_utc": "Tue, 26 Mar 2019 20:01:40 -0500",
    "subject": "thoughts to live by",
    "verse": "The Lord is good and His love endures forever. (Psalms 100:3)",
    "reflection": "We need to remember that we were fashioned from dust in the hands of our Creator, and led like sheep into green pasture (vs. 5). We, His people, have a loving Savior. What a picture, have of, a good, loving, and faithful God we have. No wonder it will take forever to enjoy His greatness. LET US THANK GOD FOR LIFE, FOR JOY, FOR PROTECTION, AND FOR PROMISING US A FUTURE WITH HIM FOREVER.",
    "prayer": "",
    "reading": "Psalms 100",
    "original_content": "VERSE FOR 3/27/2019:\n\n_The Lord is good and His love endures forever. _(Ps. 100:3)\n\nREAD ALL OF PS. 100\n\nTHOUGHT FOR TODAY;\n\nWe need to remember that we were fashioned from dust in\n\nthe hands of our Creator, and led like sheep into green pasture\n\n(vs. 5). We, His people, have a loving Savior. What a picture,\n\nhave of, a good, loving, and faithful God we have. No wonder\n\nit will take forever to enjoy His greatness.\n\nLET US THANK GOD FOR LIFE, FOR JOY, FOR PROTECTION, AND FOR\n\nPROMISING US A FUTURE WITH HIM FOREVER.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": true
  },
  {
    "message_id": "169c149fbec8c791",
    "date_utc": "Wed, 27 Mar 2019 17:34:05 -0500",
    "subject": "thoughts to live by",
    "verse": "In all your ways submit to Him, and He will make your paths straight. (Proverbs 3: 6)",
    "reflection": "In moral and spiritual areas of our life, we can foolishly pursue dangerous things God tells us to avoid because of His love for us. Instead of following the ways of the world, a wiser approach would be to read the book of Proverbs, which contains many positive ways to elude the snares of life. LET US FOLLOW THE LORD'S GUIDANCE EACH DAY. . .",
    "prayer": "",
    "reading": "Proverbs 3:1-18",
    "original_content": "VERSE FOR 3/28/2019:\n\n_In all your ways submit to Him, and He will make your_\n\n_paths straight. _(Pro. 3:6) Read Pro. 3:1-18) for a greater picture)\n\nTHOUGHT FOR TODAY:\n\nIn moral and spiritual areas of our life, we can foolishly pursue\n\ndangerous things God tells us to avoid because of His love for us.\n\nInstead of following the ways of the world, a wiser approach\n\nwould be to read the book of Proverbs,which contains many\n\npositive ways to elude the snares of life.\n\nLET US FOLLOW THE LORD'S GUIDANCE EACH DAY. . .\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": true
  },
  {
    "message_id": "169c6ef0952e3ec3",
    "date_utc": "Thu, 28 Mar 2019 19:52:28 -0500",
    "subject": "thoughts to live by",
    "verse": "They went to a place called Gethsemane. (Mark 14: 32)",
    "reflection": "The word Gethsemane means \"place of the olive press, \"and that perfectly describes those first crushing hours of Christ's suffering on OUR behalf. There, \"in anguish, He prayed. . . and His sweat was like drops of blood (Luke 22: 44). Jesus suffered and died \"to take away the sins of the world\" (John 1: 29). In so doing He restored our broken relationship with the Father. GONE MY TRANSGRESSIONS, AND NOW I AM FREE-ALL BECAUSE JESUS WAS WOUNDED FOR ME.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/29/2019:\n\n_They went to a place called Gethsemane. _(Mk. 14:32)\n\nTHOUGHT FOR TODAY:\n\nThe word _Gethsemane _means \"place of the olive press,\"and\n\nthat perfectly describes those first crushing hours of Christ's\n\nsuffering on OUR behalf. There, \"in anguish, He prayed. . .\n\nand His sweat was like drops of blood (Lk. 22:44). Jesus\n\nsuffered and died \"to take away the sins of the world\" (Jn.\n\n1:29). In so doing He restored our broken relationship with\n\nthe Father. GONE MY TRANSGRESSIONS, AND NOW I AM FREE-ALL BECAUSE JESUS WAS WOUNDED FOR ME.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "169cc3e3ba583ce8",
    "date_utc": "Fri, 29 Mar 2019 20:37:04 -0500",
    "subject": "thoughts to live by",
    "verse": "The Holy Spirit helps us in our distress. For we don't even know what we should pray for, nor how we should pray. (Romans 8: 26)",
    "reflection": "As a believer we are not left to our own resources to cop with problems. Even when you do not know the right words to pray, the Holy Spirit will pray with and for you, and God will answer. With God helping you pray, you don't need to be afraid to come before Him. WE CAN BE CONFIDENT OF OUR SALVATION.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR 3/30/2019:\n\n_The Holy Spirit helps us in our distress. For we don't_\n\n_even know what we should pray for, nor how we should _\n\n_pray. _(Ro. 8:26)\n\nTHOUGHT FOR TODAY:\n\nAs a believer we are not left to our own resources to cop\n\nwith problems. Even when you do not know the right words\n\nto pray, the Holy Spirit will pray with and for you, and God\n\nwill answer. With God helping you pray, you don't need to be\n\nafraid to come before Him. WE CAN BE CONFIDENT OF OUR SALVATION.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "169d0df0edb1d78e",
    "date_utc": "Sat, 30 Mar 2019 18:11:13 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus cried out in a loud voice. . . My God, My God, why have You forsaken Me? (Matthew 27: 46)",
    "reflection": "Isolation is the agony Christ suffered when His eternal relationship with the Father was broken on the cross. We hear this in His cry captured in (Matthew 27: 46) About three in the afternoon Jesus cried out 'Eli. Eli, lema sabachthani?' (which means, 'My God, my God, why have you forsaken Me?' As He suffered and died under the burden of our sins, Christ was suddenly alone. THOSE WHO KNOW JESUS ARE NEVER ALONE.",
    "prayer": "",
    "reading": "PSALM 22:1-10",
    "original_content": "THE VERSE FOR 3/31/2019:\n\n_Jesus cried out in a loud voice. . . \"My God, My God, why _\n\n_have You forsaken Me? (_Mt 27:46)\n\nREAD PSALM 22:1-10\n\nTHOUGHT FOR TODAY:\n\nIsolation is the agony Christ suffered when His eternal\n\nrelationship with the Father was broken on the cross. We\n\nhear this in His cry captured in (Mt. 27:46) \"About three\n\nin the afternoon Jesus cried out 'Eli. Eli, lema sabachthani?'\n\n(which means, 'My God, my God, why have you forsaken\n\nMe?' As He suffered and died under the burden of our sins,\n\nChrist was suddenly alone.\n\nTHOSE WHO KNOW JESUS ARE NEVER ALONE.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": true
  },
  {
    "message_id": "169d5ff043aad783",
    "date_utc": "Sun, 31 Mar 2019 18:04:14 -0500",
    "subject": "thoughts to live by",
    "verse": "Do not work for food that spoils, but for food that endures to eternal life. (John 6: 27)",
    "reflection": "Jesus's kingdom, of course, is \"not of the world\" (John 18: 36) The crowd mistakenly thought \"King\" Jesus would give them full stomachs and natural freedom. But Jesus counseled them, AND US: \"Do not work for food that spoils, but for food that endures to eternal life\" (v. 27). CHRIST IS THE BREAD OF ETERNAL LIFE.",
    "prayer": "",
    "reading": "John 6:22-34",
    "original_content": "VERSE FOR 4/1/2019:\n\n_Do not work for food that spoils, but for food_\n\n_that endures to eternal life. _(Jn. 6:27)\n\nREAD JN. 6:22-34)\n\nTHOUGHT FOR TODAY:\n\nJesus's kingdom, of course, is \"not of the world\" (Jn. 18:36)\n\nThe crowd mistakenly thought \"King\" Jesus would give them\n\nfull stomachs and natural freedom. But Jesus counseled them,\n\nAND US: \"Do not work for food that spoils, but for food that\n\nendures to eternal life\" (v. 27).\n\nCHRIST IS THE BREAD OF ETERNAL LIFE.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": true
  }
]
