[
  {
    "message_id": "140d925d4f6d8584",
    "date_utc": "Sun, 1 Sep 2013 05:51:03 -0500",
    "subject": "thoughts to live by",
    "verse": "For you have judged in my favor; from your throne you have judged with fairness. 5 You have rebuked the nations and destroyed the wicked; you have erased their names forever. 6 The enemy is finished, in endless ruins; the cities you uprooted are now forgotten. 7 But the Lord reigns forever, executing judgment from his throne. 8 He will judge the world with justice and rule the nations with fairness. 9 The Lord is a shelter for the oppressed, a refuge in times of trouble.",
    "reflection": "God upholds our just cause; He is our vindicator (one who clears us from criticism and justifies us before others. ) In this life we may face many injustices: (1) We may be falsely accused and misunderstood by friends and enemies; (2) We may not be fully appreciated by others for the love we show; (3) The true value of our work and service may not be duly rewarded; (4) Our ideas may be ignored. But God is to be praised, for He sees and remembers all the good we do, and it is up to Him to decide the timing and the appropriateness of our rewards. If we do not trust Him to vindicate us, then we will be susceptible to hatred and self-pity. If we do trust Him, we can experience God's peace, and be free from worry of how others perceive us and treat us. . .",
    "prayer": "Dear Heavenly Father give me the patience to wait on Your timing. I thank You also, for the peace that is freely given when I place my trust in You. I pray that I would be obedient to Your Holy Spirit's guidance. Give me a teachable spirit I pray. . Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 9:4-9 (NLT)\n\nFor you have judged in my favor; from your throne you have judged with\nfairness.\n\n5 You have rebuked the nations and destroyed the wicked; you have erased\ntheir names forever.\n\n6 The enemy is finished, in endless ruins; the cities you uprooted are now\nforgotten. \n7 But the Lord reigns forever, executing judgment from his throne.\n\n8 He will judge the world with justice and rule the nations with fairness.\n\n9 The Lord is a shelter for the oppressed, a refuge in times of trouble. \n\n\n\nToday's Thoughts:\n\nGod upholds our just cause; He is our vindicator (one who clears us from\ncriticism and justifies us before others.)\n\nIn this life we may face many injustices:\n\n(1) We may be falsely accused and misunderstood by friends and enemies;\n\n(2) We may not be fully appreciated by others for the love we show;\n\n(3) The true value of our work and service may not be duly rewarded;\n\n(4) Our ideas may be ignored.\n\nBut God is to be praised, for He sees and remembers all the good we do,\n\nand it is up to Him to decide the timing and the appropriateness of our\nrewards.\n\nIf we do not trust Him to vindicate us, then we will be susceptible to\nhatred and self-pity.\n\nIf we do trust Him, we can experience God's peace, and be free from worry of\nhow others perceive us and treat us. . .\n\n\n\nToday's Prayer Suggestion:\n\nDear Heavenly Father give me the patience to wait on Your timing.\n\nI thank You also, for the peace that is freely given when I place my trust\nin You.\n\nI pray that I would be obedient to Your Holy Spirit's guidance. \n\nGive me a teachable spirit I pray. . Amen.\n\n\n\nPastor Al & Marcie Sather\n\nWe will be going up north for a week and a half so I won't be sending any\nMorning Devotions-Sorry! ! !\n\n\n\nPhil. 4:8 Fix your thoughts on what is true and honorable and right.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1410771287364806",
    "date_utc": "Tue, 10 Sep 2013 05:35:50 -0500",
    "subject": "thoughts to live by",
    "verse": "10 Those who know Your name trust in You, for You, O Lord, do not abandon those who search for You. Psalms 9:10 (NLT)",
    "reflection": "God will never abandon those who seek Him. God's promise does not mean that if we trust Him we will escape lose or suffering; it means that God Himself will never leave us no matter what we face.",
    "prayer": "Dear Lord, I thank You for the promise that You will never leave me nor forsake me. I thank You for Your grace and mercies which are new every day. . . Amen.",
    "reading": "",
    "original_content": "Today's Verse:\n\n10 Those who know Your name trust in You, for You, O Lord, do not abandon\nthose who search for You. \n\nPsalms 9:10 (NLT)\n\n\n\nToday's Thoughts:\n\nGod will never abandon those who seek Him. God's promise does not mean that\nif we trust Him we \n\nwill escape lose or suffering; it means that God Himself will never leave\nus no matter what we face.\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord, I thank You for the promise that You will never leave me nor\nforsake me.\n\nI thank You for Your grace and mercies which are new every day. . . Amen.\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1410c6b36ccd0825",
    "date_utc": "Wed, 11 Sep 2013 04:47:29 -0500",
    "subject": "thoughts to live by",
    "verse": "11 Sing praises to the Lord who reigns in Jerusalem. Tell the world about his unforgettable deeds. 12 For he who avenges murder cares for the helpless. He does not ignore the cries of those who suffer. 13 Lord, have mercy on me. See how my enemies torment me. Snatch me back from the jaws of death. 14 Save me so I can praise you publicly at Jerusalem's gates, so I can rejoice that you have rescued me.",
    "reflection": "God does not only live in Jerusalem (or Zion, another name for Mount Moriah, the hill on which the temple was built); He lives everywhere all the time. . . From this central point the Jews were to tell the world about the one true God. All of us want God to help us when we are in trouble, but often for different reasons. Some people want God to help them so they will be successful and other people will like them. Others want God to help them so they will be comfortable and feel good about themselves. David wanted help from God so that justice would be restored to Israel and so he could show others God's power. When you call to God for help, consider your motive. Is it to save yourself pain and embarrassment or to bring God glory and honor?",
    "prayer": "Dear Heavenly Father Help me to be sensitive to Your Holy Spirits guidance so that my motives would always be just, so that my requests would only be to give you honor and glory. . . Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 9:11-14 (NLT)\n\n11 Sing praises to the Lord who reigns in Jerusalem. Tell the world about\nhis unforgettable deeds.\n\n12 For he who avenges murder cares for the helpless. He does not ignore the\ncries of those who suffer. \n13 Lord, have mercy on me. See how my enemies torment me. Snatch me back\nfrom the jaws of death.\n\n14 Save me so I can praise you publicly at Jerusalem's gates, so I can\nrejoice that you have rescued me. \n\n\n\nToday's Thoughts:\n\nGod does not only live in Jerusalem (or Zion, another name for Mount Moriah,\nthe hill on which the temple was built);\n\nHe lives everywhere all the time. . . From this central point the Jews were\nto tell the world about the one true God.\n\n\n\nAll of us want God to help us when we are in trouble, but often for\ndifferent reasons. \n\nSome people want God to help them so they will be successful and other\npeople will\n\nlike them. Others want God to help them so they will be comfortable and\nfeel good\n\nabout themselves. \n\n\n\nDavid wanted help from God so that justice would be restored to Israel and\nso he could\n\nshow others God's power.\n\n\n\nWhen you call to God for help, consider your motive. Is it to save yourself\npain and\n\nembarrassment or to bring God glory and honor? \n\n\n\nToday's Prayer Suggestion:\n\nDear Heavenly Father Help me to be sensitive to Your Holy Spirits guidance\nso that\n\nmy motives would always be just, so that my requests would only be to give\nyou honor \n\nand glory. . . Amen.\n\n\n\nPastor AL & Marcie Sather\n\nI Cor. 3:20 The Lord knows the thoughts of the wise, that they are\nworthless.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1411180cce0c7340",
    "date_utc": "Thu, 12 Sep 2013 04:29:11 -0500",
    "subject": "thoughts to live by",
    "verse": "16 The Lord is known for his justice. The wicked are trapped by their own deeds. 17 The wicked will go down to the grave. This is the fate of all the nations who ignore God. 18 But the needy will not be ignored forever; the hopes of the poor will not always be crushed.",
    "reflection": "The Lord alone is our only hope. The Lord knows our every need, He will not remain silent forever. He will come to the aid of all who call upon Him.",
    "prayer": "I thank You O Lord, that You Love and care for Your people. Let not my enemies triumph over me. Open my eyes that I may see all the wonders thy hands have made. . . Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 9:16-18 (NLT)\n16 The Lord is known for his justice. The wicked are trapped by their own\ndeeds. \n17 The wicked will go down to the grave. This is the fate of all the nations\nwho ignore God.\n18 But the needy will not be ignored forever; the hopes of the poor will not\nalways be crushed. \n\nToday's Thoughts:\nThe Lord alone is our only hope. The Lord knows our every need, He will not\nremain silent \nforever. He will come to the aid of all who call upon Him.\n\nToday's Prayer Suggestion:\nI thank You O Lord, that You Love and care for Your people. Let not my\nenemies triumph \nover me. Open my eyes that I may see all the wonders thy hands have made. .\n. Amen.\n\nPastor Al & Marcie Sather\nPhil. 4:8 Fix your thoughts on what is true and honorable and right.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14116ff922f10d0f",
    "date_utc": "Fri, 13 Sep 2013 06:05:48 -0500",
    "subject": "thoughts to live by",
    "verse": "19 Arise, O Lord! Do not let mere mortals defy you! Judge the nations! 20 Make them tremble in fear, O Lord. Let the nations know they are merely human.",
    "reflection": "If you are facing battles you feel you can't possible win, don't give up. In the midst of numerous problems, pray for God's help, admit to Him that you are powerless. . . The secret of victory is to first admit to the futility of unaided human effort and then to trust God to save. His power works best through those who recognize their limitations (2 Corinthians 12:9). It is those who think they can do it all, on their own who are in the greatest danger. . .",
    "prayer": "Dear Lord forgive me for the times I have attempted to take on difficult situations and failed because I did not trust in You for the help I needed. Help me see my limitations. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 9:19-20 (NLT)\n\n19 Arise, O Lord! Do not let mere mortals defy you! Judge the nations!\n\n20 Make them tremble in fear, O Lord. Let the nations know they are merely\nhuman. \n\n\n\nToday's Thoughts:\n\nIf you are facing battles you feel you can't possible win, don't give up.\n\nIn the midst of numerous problems, pray for God's help, admit to Him\n\nthat you are powerless. . .\n\n\n\nThe secret of victory is to first admit to the futility of unaided human\neffort\n\nand then to trust God to save. His power works best through those who \n\nrecognize their limitations (2 Cor. 12:9).\n\n\n\nIt is those who think they can do it all, on their own who are in the\ngreatest danger. . . \n\nToday's Prayer Suggestion:\n\nDear Lord forgive me for the times I have attempted to take on difficult\nsituations and \n\nfailed because I did not trust in You for the help I needed. Help me see my\nlimitations.Amen.\n\n\n\nPastor Al & Marcie Sather\n\n\"Fear of the Lord is the beginning of wisdom.\" Pro. 1:7",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1411bff25fe1ebca",
    "date_utc": "Sat, 14 Sep 2013 05:23:04 -0500",
    "subject": "thoughts to live by",
    "verse": "O Lord, why do you stand so far away? Why do you hide when I am in trouble?",
    "reflection": "\"Why do You hide when I need You the most?\" to the psalmist, God seemed far away. But even though the writer had honest doubts, he did not stop praying or conclude that God no longer cared. He was not complaining but simply asking God to hurry to his aid. It is during those times when we feel the most alone or oppressed that we need to keep praying, telling God about our troubles. . .",
    "prayer": "Dear Lord it is during the trials of life that You seem so far away, but I have found that they are meant to cause my faith to grow. Help me to be mindful that You are never any further away than a prayer so that my faith in You will grow stronger. Guide and direct me that I may never stop praying. . . Amen.",
    "reading": "",
    "original_content": "Today's Verse: Psalms 10:1 (NLT)\n\nO Lord, why do you stand so far away? Why do you hide when I am in trouble?\n\n\n\nToday's Thoughts:\n\n\"Why do You hide when I need You the most?\" to the psalmist, God seemed far\naway.\n\nBut even though the writer had honest doubts, he did not stop praying or\nconclude that\n\nGod no longer cared. He was not complaining but simply asking God to hurry\nto his aid.\n\n\n\nIt is during those times when we feel the most alone or oppressed that we\nneed to keep \n\npraying, telling God about our troubles. . . \n\n\n\nToday's Prayer Suggestion:\n\nDear Lord it is during the trials of life that You seem so far away, but I\nhave found that\n\nthey are meant to cause my faith to grow. Help me to be mindful that You are\nnever any\n\nfurther away than a prayer so that my faith in You will grow stronger. Guide\nand direct\n\nme that I may never stop praying. . . Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-:1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14121477fc83b0cf",
    "date_utc": "Sun, 15 Sep 2013 05:50:37 -0500",
    "subject": "thoughts to live by",
    "verse": "4 The wicked are too proud to seek God. They seem to think that God is dead 5 Yet they succeed in everything they do. They do not see your punishment awaiting them. They sneer at all their enemies. 6 They think, \"Nothing bad will ever happen to us! We will be free of trouble forever!\"",
    "reflection": "Some people succeed in everything they do, and they brag that no one, not even God, can keep them down. We may wonder why God allow them to gain great wealth, while they despise Him as they do. BUT why are we upset when the wicked prosper? Are we angry about the damage they are doing, or just jealous of their success? To answer these questions, we must gain the right perspective on wickedness and wealth. The wicked will surely be punished because God hates their evil deeds. Wealth is only temporary, it is not necessarily a sign of God's approval on a person's life, nor a lack of it a sign of God's disapproval. . . Don't let wealth become your obsession",
    "prayer": "Dear Lord, help me to always have the right perspective of situations in life that are cloudy to me. Help me remember that the riches of this life are only temporary. Help me set my sights on the eternal riches You wish for me. . . Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 10:4-6 (NLT)\n\n4 The wicked are too proud to seek God. They seem to think that God is dead\n\n5 Yet they succeed in everything they do. They do not see your punishment\nawaiting them. They sneer at all their enemies.\n\n6 They think, \"Nothing bad will ever happen to us! We will be free of\ntrouble forever!\" \n\n\n\nToday's Thoughts:\n\nSome people succeed in everything they do, and they brag that no one, not\neven God,\n\ncan keep them down. We may wonder why God allow them to gain great wealth,\n\nwhile they despise Him as they do. \n\n\n\nBUT why are we upset when the wicked prosper?\n\nAre we angry about the damage they are doing, or just jealous of their\nsuccess?\n\nTo answer these questions, we must gain the right perspective on wickedness\nand wealth.\n\nThe wicked will surely be punished because God hates their evil deeds.\n\nWealth is only temporary, it is not necessarily a sign of God's approval on\na person's life,\n\nnor a lack of it a sign of God's disapproval. . . Don't let wealth become\nyour obsession\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord, help me to always have the right perspective of situations in\nlife that are\n\ncloudy to me. Help me remember that the riches of this life are only\ntemporary.\n\nHelp me set my sights on the eternal riches You wish for me. . . Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1412656af8e81089",
    "date_utc": "Mon, 16 Sep 2013 05:17:26 -0500",
    "subject": "thoughts to live by",
    "verse": "7 Their mouths are full of cursing, lies, and threats. Trouble and evil are on the tips of their tongues. 8 They lurk in ambush in the villages, waiting to murder innocent people. They are always searching for helpless victims. 9 Like lions crouched in hiding, they wait to pounce on the helpless. Like hunters they capture the helpless and drag them away in nets. 10 Their helpless victims are crushed; they fall beneath the strength of the wicked. 11 The wicked think, \"God isn't watching us! He has closed his eyes and won't even see what we do!\"",
    "reflection": "Have you ever said to yourself -\"Well I'm not to bad. I'm a pretty good person. \" Look at these verses again and see if any of them apply to you. Have you ever lied? Have you ever hurt someone's feelings by your words or tone of voice/? Are you bitter toward anyone? Do you become angry with those who strongly disagree with you? In thought word and deed, you like everyone else in the world, stand guilty before God. We must remember who we are in His sight-alienated sinners. Don't deny that you are a sinner. Instead, allow your desperate need to point you to God",
    "prayer": "Dear Heavenly Father I have to confess that I have sinned against You in thought-word-and deed, for Wich I have no excuse other than I am a sinful human being-I beg for Your forgiveness. . . Amen",
    "reading": "",
    "original_content": "Today's Verses: Psalms 10:7-11 (NLT)\n\n7 Their mouths are full of cursing, lies, and threats. Trouble and evil are\non the tips of their tongues.\n\n8 They lurk in ambush in the villages, waiting to murder innocent people.\nThey are always searching for helpless victims.\n\n9 Like lions crouched in hiding, they wait to pounce on the helpless. Like\nhunters they capture the helpless and drag them away in nets.\n\n10 Their helpless victims are crushed; they fall beneath the strength of the\nwicked.\n\n11 The wicked think, \"God isn't watching us! He has closed his eyes and\nwon't even see what we do!\" \n\n\n\nToday's Thoughts:\n\nHave you ever said to yourself-\"Well I'm not to bad. I'm a pretty good\nperson.\"\n\nLook at these verses again and see if any of them apply to you.\n\nHave you ever lied? Have you ever hurt someone's feelings by your words or\ntone of voice/?\n\nAre you bitter toward anyone? Do you become angry with those who strongly\ndisagree with you?\n\nIn thought word and deed, you like everyone else in the world, stand guilty\nbefore God.\n\nWe must remember who we are in His sight-alienated sinners.\n\nDon't deny that you are a sinner. Instead, allow your desperate need to\npoint you to God\n\n\n\nToday's Prayer Suggestion:\n\nDear Heavenly Father I have to confess that I have sinned against You in\nthought-word-and deed, for \n\nWich I have no excuse other than I am a sinful human being-I beg for Your\nforgiveness. . . Amen \n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1412b7158c65e603",
    "date_utc": "Tue, 17 Sep 2013 05:22:28 -0500",
    "subject": "thoughts to live by",
    "verse": "Why do the wicked get away with despising God? They think, \"God will never call us to account. \" 14 But you see the trouble and grief they cause. You take note of it and punish them. The helpless put their trust in you. You defend the orphans.",
    "reflection": "God sees and take note of each evil deed-He encourages us, and listens to our cries. He fulfills the desires of those who fear Him; He hears their cries for help and rescues them. He is always with us-We can face the wicked because we do not face them aloneGod is by our side.",
    "prayer": "I thank You Lord for Your faithfulness. I thank You that You hear our cries and come to our aid. . . Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 10:13-14 (NLT)\n\nWhy do the wicked get away with despising God? They think, \"God will never\ncall us to account.\"\n\n14 But you see the trouble and grief they cause. You take note of it and\npunish them. The helpless put their trust in you. You defend the orphans. \n\n\n\nToday's Thoughts\"\n\nGod sees and take note of each evil deed-He encourages us, and listens to\nour cries.\n\nHe fulfills the desires of those who fear Him; He hears their cries for help\nand rescues them.\n\nHe is always with us-We can face the wicked because we do not face them\naloneGod is by our side.\n\nToday's Prayer Suggestion:\n\nI thank You Lord for Your faithfulness. I thank You that You hear our cries\nand come to our aid. . . Amen.\n\n\n\nPastor AL & Marcie Sather\n\nI Cor. 3:20 The Lord knows the thoughts of the wise, that they are\nworthless.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14130902009b7efd",
    "date_utc": "Wed, 18 Sep 2013 05:14:11 -0500",
    "subject": "thoughts to live by",
    "verse": "I trust in the Lord for protection. So why do you say to me, \"Fly like a bird to the mountains for safety! 2 The wicked are stringing their bows and fitting their arrows on the bowstrings. They shoot from the shadows at those whose hearts are right. 3 The foundations of law and order have collapsed. What can the righteous do?\" 4 But the Lord is in his holy Temple; the Lord still rules from heaven. He watches everyone closely, examining every person on earth.",
    "reflection": "David was forced to flee for safety several times. Even being God's anointed king did not make him immune to injustice and hatred from others. David fled, but not as if all was lost. He knew that God was in control-While David wisely avoided trouble, he did not fearfully run away from his troubles. David was comforted and optimistic because he knew God was greater than anything his enemies could bring against him. Let us not forget that faith in God keeps us from losing hope and helps us resist fear.",
    "prayer": "Dear Lord, I thank You, for being in control of all situations. Much like in the day of David I often believe that the foundation of the Law is collapsing. It seems as though evil has the upper hand. But I know that You are always watching and that in the end righteousness will win out. . . Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 11:1-4 (NLT)\n\nI trust in the Lord for protection. So why do you say to me, \"Fly like a\nbird to the mountains for safety!\n\n2 The wicked are stringing their bows and fitting their arrows on the\nbowstrings. They shoot from the shadows at those whose hearts are right.\n\n3 The foundations of law and order have collapsed. What can the righteous\ndo?\" \n4 But the Lord is in his holy Temple; the Lord still rules from heaven. He\nwatches everyone closely, examining every person on earth. \n\n\n\nToday's thoughts:\n\nDavid was forced to flee for safety several times. Even being God's anointed\nking did not make him immune to injustice\n\nand hatred from others. David fled, but not as if all was lost. He knew that\nGod was in control-While David wisely\n\navoided trouble, he did not fearfully run away from his troubles. David was\ncomforted and optimistic because he\n\nknew God was greater than anything his enemies could bring against him.\n\n\n\nLet us not forget that faith in God keeps us from losing hope and helps us\nresist fear.\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord, I thank You, for being in control of all situations. Much like in\nthe day of David I often believe that the\n\nfoundation of the Law is collapsing. It seems as though evil has the upper\nhand. But I know that You are always \n\nwatching and that in the end righteousness will win out. . . Amen.\n\n\n\nPastor Al & Marcie Sather\n\n\"Fear of the Lord is the beginning of wisdom.\" Pro. 1:7",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14135c4dae549db3",
    "date_utc": "Thu, 19 Sep 2013 05:29:54 -0500",
    "subject": "thoughts to live by",
    "verse": "5 The Lord examines both the righteous and the wicked. He hates those who love violence. 6 He will rain down blazing coals and burning sulfur on the wicked, punishing them with scorching winds. 7 For the righteous Lord loves justice. The virtuous will see his face.",
    "reflection": "We've probably all have discovered the fact that God does not always preserve believers from difficult circumstances. BUT He examines (or tests) both the righteous and the wicked. For some-God's tests become a refining firewhile for others, the tests become an incinerator for destruction. Don't ignore or defy the tests and challenges that come your way-use them as opportunities to grow. . . God is still in control. . .",
    "prayer": "I thank You Lord, for Your love and mercy for You have guided and protected me from many difficult circumstances. Because of this fact my faith in You has grown. I pray for the health and safety of all who read this e-mail. . . Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 11:5-7 (NLT)\n\n5 The Lord examines both the righteous and the wicked. He hates those who\nlove violence.\n\n6 He will rain down blazing coals and burning sulfur on the wicked,\npunishing them with scorching winds.\n\n7 For the righteous Lord loves justice. The virtuous will see his face. \n\n\n\nToday's Thoughts:\n\nWe've probably all have discovered the fact that God does not always\npreserve believers from difficult circumstances.\n\nBUT He examines (or tests) both the righteous and the wicked. For\nsome-God's tests become a refining firewhile for others, the tests become an incinerator for destruction.\n\n\n\nDon't ignore or defy the tests and challenges that come your way-use them as\nopportunities to grow. . .\n\nGod is still in control. . . \n\n\n\nToday's Prayer Suggestion:\n\nI thank You Lord, for Your love and mercy for You have guided and protected\nme from\n\nmany difficult circumstances. Because of this fact my faith in You has\ngrown.\n\nI pray for the health and safety of all who read this e-mail. . . Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nWorship the LORD with gladness; \ncome before him with joyful songs. Psalm 100:2",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1413adb4917ec2e5",
    "date_utc": "Fri, 20 Sep 2013 05:12:31 -0500",
    "subject": "thoughts to live by",
    "verse": "1 Help, O Lord, for the godly are fast disappearing! The faithful have vanished from the earth!",
    "reflection": "This is a thought that may come to our minds too. Yes living for God in a deceitful world can be difficult and lonely battle. At one time the great prophet Elijah felt so lonely He wanted to die. But God told him that there were 7, 000 other faithful servants (I Kg. 19:4, 14, 18) Let us remember we are never alone in our battle against evil-when you feel alone seek out other believers for strength and support. . .",
    "prayer": "Thank Lord, for being close at hand when I find myself in a battle against evil. You are my strength and ever present help in times of trouble. . . Amen.",
    "reading": "",
    "original_content": "Today's Verse: Psalms 12:1 (NLT)\n\n1 Help, O Lord, for the godly are fast disappearing! The faithful have\nvanished from the earth! \n\nToday's Thoughts:\n\nThis is a thought that may come to our minds too. Yes living for God in a\ndeceitful world\n\ncan be difficult and lonely battle. At one time the great prophet Elijah\nfelt so lonely He\n\nwanted to die. But God told him that there were 7,000 other faithful\nservants (I Kg. 19:4, 14, 18)\n\n\n\nLet us remember we are never alone in our battle against evil-when you feel\nalone seek out\n\nother believers for strength and support. . .\n\n\n\nToday's Prayer Suggestion:\n\nThank Lord, for being close at hand when I find myself in a battle against\nevil.\n\nYou are my strength and ever present help in times of trouble. . . Amen.\n\n\n\nPastor Al & Marcie Sather\n\nI will thank the Lord because He is just;\n\nI will sing praises to the name of the Lord Most High. Ps. 7:17",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "141400d3337ef920",
    "date_utc": "Sat, 21 Sep 2013 05:25:09 -0500",
    "subject": "thoughts to live by",
    "verse": "5 The Lord replies, \"I have seen violence done to the helpless, and I have heard the groans of the poor. Now I will rise up to rescue them, as they have longed for me to do. \"",
    "reflection": "Oh yes, we need not fear, God cares about the helpless. Here we see that He promises to rescue the helpless and confront their oppressors. Shouldn't we identify with God's attitude? His work is not done until we care for the needs of the poor. Let us remember to have faith in God's timing-But let us also be faithful in fulfilling our part in the care of those less fortunate.",
    "prayer": "I thank you Lord, for Your faithfulness! Help me to remain faithful to Your commands. Help me to be more caring of those who are less fortunate. . Amen.",
    "reading": "",
    "original_content": "Today's Verse: Psalms 12:5 (NLT)\n\n5 The Lord replies, \"I have seen violence done to the helpless, and I have\nheard the groans of the poor. \n\nNow I will rise up to rescue them, as they have longed for me to do.\" \n\n\n\nToday's Thoughts: \n\nOh yes, we need not fear, God cares about the helpless. Here we see that He\npromises to rescue the \n\nhelpless and confront their oppressors. Shouldn't we identify with God's\nattitude? His work is not \n\ndone until we care for the needs of the poor.\n\n\n\nLet us remember to have faith in God's timing-But let us also be faithful in\nfulfilling our part in the\n\ncare of those less fortunate.\n\n\n\nToday's Prayer Suggestion:\n\nI thank you Lord, for Your faithfulness! Help me to remain faithful to Your\ncommands. \n\nHelp me to be more caring of those who are less fortunate. . Amen. \n\n\n\nPastor AL & Marcie Sather\n\nI Cor. 3:20 The Lord knows the thoughts of the wise, that they are\nworthless.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "14145167d35cb7b1",
    "date_utc": "Sun, 22 Sep 2013 04:53:26 -0500",
    "subject": "thoughts to live by",
    "verse": "The Lord's promises are pure, like silver refined in a furnace, purified seven times over.",
    "reflection": "Sincerity and truth are extremely valuable because they are becoming more and more rare. Many people have become deceivers, liars, and flatterers-they believe they will get what they want by deception. As a king David certainly faced these kind of people, who hoped to win his favor and gain advancement through flattery. When we feel as though sincerity and truth have nearly gone out of existence, we still have on hope. . . That hope is the Word of God-God's words are as flawless as refined silver. So we need to listen closely when He speaks.",
    "prayer": "Dear Heavenly Father, as You know the world has become filled with those who want to get ahead by deceit. We need to become more wise than a fox, while we keep our focus on You. Help us to be more sensitive to You Holy Spirit's guidance. . . Amen.",
    "reading": "",
    "original_content": "Today's Verse: Psalms 12:6 (NLT)\n\nThe Lord's promises are pure, like silver refined in a furnace, purified\nseven times over. \n\n\n\nToday's Thoughts:\n\nSincerity and truth are extremely valuable because they are becoming more\nand more rare.\n\nMany people have become deceivers, liars, and flatterers-they believe they\nwill get what \n\nthey want by deception. As a king David certainly faced these kind of\npeople, who hoped \n\nto win his favor and gain advancement through flattery. When we feel as\nthough sincerity \n\nand truth have nearly gone out of existence, we still have on hope. . .\n\n\n\nThat hope is the Word of God-God's words are as flawless as refined silverSo we need to listen closely when He speaks.\n\n\n\nToday's Prayer Suggestion:\n\nDear Heavenly Father, as You know the world has become filled with those who\n\nwant to get ahead by deceit. We need to become more wise than a fox, while\nwe\n\nkeep our focus on You. Help us to be more sensitive to You Holy Spirit's\nguidance. . . Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1414a3efb854095e",
    "date_utc": "Mon, 23 Sep 2013 04:55:46 -0500",
    "subject": "thoughts to live by",
    "verse": "O Lord, how long will you forget me? Forever? How long will you look the other way? 2 How long must I struggle with anguish in my soul, with sorrow in my heart every day? How long will my enemy have the upper hand? 3 Turn and answer me, O Lord my God! Restore the sparkle to my eyes, or I will die. 4 Don't let my enemies gloat, saying, \"We have defeated him!\" Don't let them rejoice at my downfall. 5 But I trust in your unfailing love. I will rejoice because you have rescued me.",
    "reflection": "(Sometimes)-all we need to do is talk over our problem with a friend to help put it into perspective. David frequently claimed that God was slow to react on his behalf. I believe we too often feel this same impatience. Often it seems that evil and sufferings go unchecked, and we wonder when God is going to stop them. But David affirmed that he would continue to trust God no matter how long he would have to wait for God's justice to materialize. . . Through prayer we can express our feelings and take our problems to God. He will help us regain the right perspective, and this will give us peace of mind.",
    "prayer": "Dear Lord, You have been so patient with me. You continued to draw me to Your forgiving heart. Grant that I may learn from You to be patient with others thoughtful and considerate, even though they irritate and upset me. Remove from my heart all resentment toward those who upset me by their words and actions. Let me lean on You for strength and guidance and wait on Your time. . . Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 13:1-5 (NLT)\nO Lord, how long will you forget me? Forever? How long will you look the\nother way?\n2 How long must I struggle with anguish in my soul, with sorrow in my heart\nevery day? How long will my enemy have the upper hand? \n3 Turn and answer me, O Lord my God! Restore the sparkle to my eyes, or I\nwill die.\n4 Don't let my enemies gloat, saying, \"We have defeated him!\" Don't let them\nrejoice at my downfall. \n5 But I trust in your unfailing love. I will rejoice because you have\nrescued me. \nToday's Thoughts:\n(Sometimes)-all we need to do is talk over our problem with a friend to help\nput it into perspective.\nDavid frequently claimed that God was slow to react on his behalf. I believe\nwe too often feel this\nsame impatience. Often it seems that evil and sufferings go unchecked, and\nwe wonder when God \nis going to stop them. But David affirmed that he would continue to trust\nGod no matter how long \nhe would have to wait for God's justice to materialize. . .\n\nThrough prayer we can express our feelings and take our problems to God. He\nwill help us regain \nthe right perspective, and this will give us peace of mind.\nToday's Prayer Suggestion:\nDear Lord, You have been so patient with me. You continued to draw me to\nYour forgiving heart.\nGrant that I may learn from You to be patient with others thoughtful and\nconsiderate, even though \nthey irritate and upset me. Remove from my heart all resentment toward\nthose who upset me by \ntheir words and actions. Let me lean on You for strength and guidance and\nwait on Your time. . . Amen.\n\nPastor Al & Marcie Sather\nPhil. 4:8 Fix your thoughts on what is true and honorable and right.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "141643c54309a527",
    "date_utc": "Sat, 28 Sep 2013 06:03:08 -0500",
    "subject": "thoughts to live by",
    "verse": "4 Will those who do evil never learn? They eat up my people like bread and wouldn't think of praying to the Lord. 5 Terror will grip them, for God is with those who obey him. 6 The wicked frustrate the plans of the oppressed, but the Lord will protect his people.",
    "reflection": "There is a clear distinction between those who worship God AND those who refuse to. Under the leadership of David Israel prospered-BUT several hundred years later, Israel forgot God, and it became difficult to distinguish between God's followers and those who worshiped idols. . . When Isaiah called Israel to repentance, he like David, spoke of people who had gone astray (Isaiah 53:6)-But Isaiah was talking about the Israelites themselves. Paul quoted (Psalms 13) in (Romans 3:10-12). He made the image of straying sheep even more general-referring to all people. Let us not be fooled the whole human race-Jews and Gentiles alike-have turned away from God. BUT don't forget the words of vs. 5 and 6 we are not fighting a losing battle our ultimate victory is in God. . .",
    "prayer": "Oh Lord we live in a sad generation-sin in the world has become so prevalent-without You there would be no victory, but those who will obey You-You will protect and victory will come from You. Thanks for that. . . Amen",
    "reading": "",
    "original_content": "Today's Verses: Psalms 14:4-6 (NLT)\n\n4 Will those who do evil never learn? They eat up my people like bread and\nwouldn't think of praying to the Lord.\n\n5 Terror will grip them, for God is with those who obey him.\n\n6 The wicked frustrate the plans of the oppressed, but the Lord will protect\nhis people. \n\nToday's Thoughts:\n\nThere is a clear distinction between those who worship God AND those who\nrefuse to.\n\nUnder the leadership of David Israel prospered-BUT several hundred years\nlater, Israel\n\nforgot God, and it became difficult to distinguish between God's followers\nand those\n\nwho worshiped idols. . .\n\n\n\nWhen Isaiah called Israel to repentance, he like David, spoke of people who\nhad gone astray\n\n(Isa. 53:6)-But Isaiah was talking about the Israelites themselves. Paul\nquoted (Ps. 13) in\n\n(Ro. 3:10-12). He made the image of straying sheep even more\ngeneral-referring to all people.\n\n\n\nLet us not be fooled the whole human race-Jews and Gentiles alike-have\nturned away from God.\n\nBUT don't forget the words of vs. 5 and 6 we are not fighting a losing\nbattle our ultimate victory\n\nis in God. . . \n\nToday's Prayer Suggestion:\n\nOh Lord we live in a sad generation-sin in the world has become so\nprevalent-without You\n\nthere would be no victory, but those who will obey You-You will protect and\nvictory will \n\ncome from You. Thanks for that. . . Amen\n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "141693d9badbff97",
    "date_utc": "Sun, 29 Sep 2013 05:22:38 -0500",
    "subject": "thoughts to live by",
    "verse": "Who may worship in your sanctuary, Lord? Who may enter your presence on your holy hill? 2 Those who lead blameless lives and do what is right, speaking the truth from sincere hearts.",
    "reflection": "God calls His people to be morally upright. As we work through chap. 15 He gives us 10 standards to determine how we are doing. We defiantly live among sinful people whose standards and morals are eroding. . . Our standards for living should not come from our sinful society but from God.",
    "prayer": "Dear Lord, I pray for a sincere and sensitive heart that I may be led by Your Holy Spirit - in the way of righteousness. I pray that I would not become led by the sinfulness of today's society. I pray that revival would come to our country so that our society would once again seek Your truth for all people. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 15:1-2 (NLT)\n\nWho may worship in your sanctuary, Lord? Who may enter your presence on your\nholy hill?\n\n2 Those who lead blameless lives and do what is right, speaking the truth\nfrom sincere hearts. \n\nToday's Thoughts:\n\nGod calls His people to be morally upright. As we work through chap. 15 He\ngives us 10 \n\nstandards to determine how we are doing. We defiantly live among sinful\npeople whose \n\nstandards and morals are eroding. . .\n\n\n\nOur standards for living should not come from our sinful society but from\nGod. \n\nToday's Prayer Suggestion:\n\nDear Lord, I pray for a sincere and sensitive heart that I may be led by\nYour\n\nHoly Spirit-in the way of righteousness. I pray that I would not become\n\nled by the sinfulness of today's society. I pray that revival would come to\n\nour country so that our society would once again seek Your truth for all\npeople. . . Amen. \n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1416e624d1870971",
    "date_utc": "Mon, 30 Sep 2013 05:20:33 -0500",
    "subject": "thoughts to live by",
    "verse": "Those (with blameless hearts) refuse to gossip or harm their neighbors or speak evil of their friends. 4 Those who despise flagrant sinners, and honor the faithful followers of the Lord,",
    "reflection": "Remember this-words are powerful and how you use them reflects on your relationship with God. There possibly isn't anything that identifies Christians as their ability to control their speechspeaking the truth-refusing to slander-and keeping oaths (promises). Always watch what you say. . . (See what James 3:1-13 says about the importance of controlling the tongue)",
    "prayer": "Dear Lord, give me a thankful heart and the determination to live like Jesushelp me to live my thanksgiving by a reverent and cheerful obedience to Your will and by a steadfast trust in Your loving kindness and unfailing mercy. . . Amen.",
    "reading": "",
    "original_content": "Today's Verses: Psalms 15:3-4 (NLT)\n\nThose (with blameless hearts) refuse to gossip or harm their neighbors or\nspeak evil of their friends.\n\n4 Those who despise flagrant sinners, and honor the faithful followers of\nthe Lord, \n\nToday's Thoughts:\n\nRemember this-words are powerful and how you use them reflects on your\nrelationship with God.\n\nThere possibly isn't anything that identifies Christians as their ability to\ncontrol their speechspeaking the truth-refusing to slander-and keeping oaths (promises). Always\nwatch what you say. . . \n\n\n\n(See what James 3:1-13 says about the importance of controlling the tongue)\n\nToday's Prayer Suggestion:\n\nDear Lord, give me a thankful heart and the determination to live like\nJesushelp me to live my thanksgiving by a reverent and cheerful obedience to\n\nYour will and by a steadfast trust in Your loving kindness and unfailing\n\nmercy. . . Amen.\n\n\n\nPastor Al & Marcie Sather\n\nPhil. 4:8 Fix your thoughts on what is true and honorable and right.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]