[
  {
    "message_id": "1678a7f37f46c3f4",
    "date_utc": "Fri, 07 Dec 2018 15:07:32 -0600",
    "subject": "thoughts to live by",
    "verse": "The sound of rejoicing in Jerusalem could be heard far away. (Nehemiah 12:43)",
    "reflection": "The praises that were heard were the result of God's help overcoming the opposition of enemies like Sanballat and the rebuilding of the wall. What has God given us that should cause our praises to overflow into praise? IS IT GOD'S DIRECTION IN OUR LIFE? IS IT THE COMFORT HE ALONE CAN PROVIDE IN THE TIME OF TROUBLE? OR IS IT OUR ULTIMATE GIFT OF SALVATION?",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The sound of rejoicing in Jerusalem could be_\n\n_heard far away._ (Neh. 12:43)\n\nTHOUGHT FOR TODAY:\n\nThe praises that were heard were the result of God's\n\nhelp overcoming the opposition of enemies like\n\nSanballat and the rebuilding of the wall. What has\n\nGod given us that should cause our praises to overflow into praise?\n\nIS IT GOD'S DIRECTION IN OUR LIFE? IS IT THE COMFORT\n\nHE ALONE CAN PROVIDE IN THE TIME OF TROUBLE? OR\n\nIS IT OUR ULTIMATE GIFT OF SALVATION?\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "16790a2f0117275e",
    "date_utc": "Sat, 08 Dec 2018 19:44:17 -0600",
    "subject": "thoughts to live by",
    "verse": "Joseph -- whom the apostles called Barnabas (which means \"son of encouragement\" Sold a field he owned and brought the money and put it at the feet of the apostles. (Acts 4:36, 37)",
    "reflection": "The generosity and support of Barnabas demonstrates what it means to be a son or daughter of encouragement. HAVE YOU DECIDED HOW YOU CAN BE AN ENCOURAGE TO SOMEONE IN THE COMING YEAR?",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Joseph -- whom the apostles called Barnabas_ (which means\n\"son of encouragement\" _Sold a field he owned and brought_\n\n_the money and put it at the feet of the apostles. _(Acts 4:36, 37)\n\nTHOUGHT FOR TODAY:\n\nThe generosity and support of Barnabas demonstrates what it\n\nmeans to be a son or daughter of encouragement.\n\nHAVE YOU DECIDED HOW YOU CAN BE AN ENCOURAGER TO\n\nSOME-ONE IN THE COMING YEAR?\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1679578425dd7081",
    "date_utc": "Sun, 09 Dec 2018 18:15:46 -0600",
    "subject": "thoughts to live by",
    "verse": "Wounds from a friend can be trusted. (Proverbs 27:6)",
    "reflection": "Solomon honored such friendship in his proverbs. Jesus went further-- He endured the wounds of our rejection not only to tell us the truth about ourselves but to show us how much we are loved. WHAT KIND OF FRIEND ARE YOU? DO YOU SHARE THE TRUTH WITH YOUR NEIGHBOR IN LOVE?",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Wounds from a friend can be trusted. _(Pro. 27:6)\n\nTHOUGHT FOR TODAY:\n\nSolomon honored such friendship in his proverbs.\nJesus went further-- He endured the wounds of our\n\nrejection not only to tell us the truth about ourselves\n\nbut to show us how much we are loved.\n\nWHAT KIND OF FRIEND ARE YOU? DO YOU SHARE THE\n\nTRUTH WITH YOUR NEIGHBOR IN LOVE?\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1679b154be5b4dea",
    "date_utc": "Mon, 10 Dec 2018 20:25:23 -0600",
    "subject": "thoughts to live by",
    "verse": "The earnest prayer of a righteous person has great power and produces wonderful results. (James 5:16)",
    "reflection": "God often chooses to move through our prayers to accomplish His work. God wants us to join Him in His work through humble, persistent prayers. When we make it our aim to serve God through praying faithfully, we are taking part in a beautiful privilege where at any moment we may be given the privilege of being a part of a miracle. GREAT FAITH ON OUR PART HONORS GOD.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 11:\n\n_The earnest prayer of a righteous person has great _\n\n_power and produces wonderful results. _(Jm. 5:16)\n\nTHOUGHT FOR TODAY:\n\nGod often chooses to move through our prayers to\n\naccomplish His work. God wants us to join Him in\n\nHis work through humble, persistent prayers. When\n\nwe make it our aim to serve God through praying\n\nfaithfully, we are taking part in a beautiful privilege\n\nwhere at any moment we may be given the privilege\n\nof being a part of a miracle.\n\nGREAT FAITH ON OUR PART HONORS GOD.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167a04336595e788",
    "date_utc": "Tue, 11 Dec 2018 20:33:39 -0600",
    "subject": "thoughts to live by",
    "verse": "You cannot serve both God and money. (Matthew 6:24)",
    "reflection": "Jesus devoted a substantial section of His Sermon on the Mount to money and the fondness of it. He taught us to pray NOT for an accumulation of riches but for \"Our daily bread\" (Matthew 6:11) Yes He warned against storing up treasures on earth. TRUE, MONEY MATTERS. BUT MONEY SHOULDN'T RULE OUR DECISION-MAKING PROCESS. TOUGH TIMES AND BIG DECISIONS ARE OPPORTUNITIES TO GROW OUR FAITH IN NEW WAYS. BUT NEVER FORGET OUR HEAVENLY FATHER LOVE AND CARES FOR US.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 12:\n\n_You cannot serve both God and money. _(Mt. 6:24)\n\nTHOUGHT FOR DEC. 12:\n\nJesus devoted a substantial section of His Sermon on the\n\nMount to money and the fondness of it. He taught us to pray\n\nNOT for an accumulation of riches but for _\"Our daily bread\"_\n\n(Mt. 6:11) Yes He warned against storing up treasures on\n\nearth.\n\nTRUE, MONEY MATTERS. BUT MONEY SHOULDN'T RULE OUR\n\nDECISION-MAKING PROCESS. TOUGH TIMES AND BIG DECISIONS\n\nARE OPPORTUNITIES TO GROW OUR FAITH IN NEW WAYS. BUT\n\nNEVER FORGET OUR HEAVENLY FATHER LOVE AND CARES FOR US.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167a565ba245697d",
    "date_utc": "Wed, 12 Dec 2018 20:29:27 -0600",
    "subject": "thoughts to live by",
    "verse": "Look there, on the mountain, the feet of the one who proclaims peace. (Nahum 1:15)",
    "reflection": "Nahum and Isaiah's prophetic words of hope found their ultimate fulfillment at the first Christmas when the angel told the shepherds, \"Do not be afraid, I bring you good- news that will cause great joy for all people. 'Today in the town of David a Savior has been born to you; He is the Messiah, the Lord. \" (Luke 2:10-12) THE MOST IMPORTANT HEADLINE IN OUR LIVES EVERY DAY IS THE VERY BEST NEWS EVER SPOKEN-CHRIST THE SAVIOR IS BORN.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 13:\n\n_Look there, on the mountain, the feet of the one who_\n\n_who proclaims peace. _(Nah 1:15)\n\nTHOUGHT FOR TODAY:\n\nNahum and Isaiah's prophetic words of hope found their\n\nultimate fulfillment at the first Christmas when the angel\n\ntold the shepherds, _\"Do not be afraid, I bring you good-_\n\n_ news that will cause great joy for all people. 'Today in_\n\n_the town of David a Savior has been born to you; He is_\n\n_the Messiah, the Lord.\" _(Lk. 2:10-12)\n\nTHE MOST IMPORTANT HEADLINE IN OUR LIVES EVERY DAY\n\nIS THE VERY BEST NEWS EVER SPOKEN-CHRIST THE SAVIOR\n\nIS BORN.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167aa72de8cbe50f",
    "date_utc": "Thu, 13 Dec 2018 20:01:54 -0600",
    "subject": "thoughts to live by",
    "verse": "The darkness is passing and the true light is already shinning. (I John 2:8)",
    "reflection": "The apostle John wrote these words to believers as an encouragement. He went on to say, \"Anyone who loves their brother and sister lives in the light, and there is nothing in them to make them stumble. \" (vs. 10). By contrast, he equated hating people with roaming around in darkness. Hatred is disorienting; it takes away our sense of moral direction. WHEN WE CHOOSE LOVE INSTEAD OF HATE, WE ARE SHOWING OUR RELATIONSHIP TO CHRIST AND REFLECTING HIS RADIANCE TO THE WORLD AROUND US. GOD IS LIGHT.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 14:\n\n_The darkness is passing and the true light_\n\n_is already shinning. _(I Jn. 2:8)\n\nTHE THOUGHT FOR TODAY:\n\nThe apostle John wrote these words to believers as an\n\nencouragement. He went on to say, \"_Anyone who loves _\n\n_their brother and sister lives in the light, and there is _\n\n_nothing in them to make them stumble.\" _(vs. 10). By\n\ncontrast, he equated hating people with roaming around\n\nin darkness. Hatred is disorienting; it takes away our\n\nsense of moral direction.\n\nWHEN WE CHOOSE LOVE INSTEAD OF HATE, WE ARE SHOWING\n\nOUR RELATIONSHIP TO CHRIST AND REFLECTING HIS RADIANCE\n\nTO THE WORLD AROUND US. GOD IS LIGHT.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167af8e6cc555610",
    "date_utc": "Fri, 14 Dec 2018 19:50:06 -0600",
    "subject": "thoughts to live by",
    "verse": "We are confident, I say, and would prefer to be away from the body and at home with the Lord. (2 Thessalonians 5:8)",
    "reflection": "Many of us will pass into heaven through death but for some that thought causes great anxiety. Some worry that the process of dying will be to difficult to bear. But with the assurance of Jesus as our Savior we can rest in the confidence that when we close our eyes on earth and pass through death, we will open our eyes in God's presence. AS WE LOOK FORWARD TO SEEING JESUS IN HEAVEN IT WILL BE OUR GREATEST JOY.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 15:\n\n_We are confident, I say, and would prefer to be away_\n\n_from the body and at home with the Lord. _(2 Thess. 5:8)\n\nTHOUGHT FOR TODAY:\n\nMany of us will pass into heaven through death but for some\n\nthat thought causes great anxiety. Some worry that the process\n\nof dying will be to difficult to bear. But with the assurance of\n\nJesus as our Savior we can rest in the confidence that when we\n\nclose our eyes on earth and pass through death, we will open our\n\neyes in God's presence.\n\nAS WE LOOK FORWARD TO SEEING JESUS IN HEAVEN IT WILL BE OUR\n\nGREATEST JOY.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167b4b9ec684fe32",
    "date_utc": "Sat, 15 Dec 2018 19:55:43 -0600",
    "subject": "thoughts to live by",
    "verse": "Hear the Word of the Lord. (Jeremiah 7:2)",
    "reflection": "This speaker's brand of \"Comfort my People\" was another side of God's comfort. Like a bitter herb that heals malaria, His words were spiritually curative. When we hear hard words, instead of walking away, may we respond to their healing effects. GOD'S CORRECTION IS NEVER TO HARM US BUT ONLY TO HEAL US. GOD'S DISCIPLINE IS DESIGNED TO MAKE US LIKE HIS SON.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 16:\n\n_Hear the Word of the Lord. _(Jer. 7:2)\n\nTHOUGHT FOR TODAY:\n\nThis speaker's brand of _\"Comfort my People\"_ was another\n\nside of God's comfort. Like a bitter herb that heals malaria,\n\nHis words were spiritually curative. When we hear hard words,\n\ninstead of walking away, may we respond to their healing effects.\n\nGOD'S CORRECTION IS NEVER TO HARM US BUT ONLY TO HEAL US.\n\nGOD'S DISCIPLINE IS DESIGNED TO MAKE US LIKE HIS SON.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167b9912e9dc5983",
    "date_utc": "Sun, 16 Dec 2018 18:29:19 -0600",
    "subject": "thoughts to live by",
    "verse": "Blessed is the one whose transgressions are forgiven, whose sins are covered. (Psalm 32:1)",
    "reflection": "When Jesus came to this world, John the Baptist called Him \"the Lamb of God that takes away the sin of the world. \" (John 1:29). We need our sins taken care of because it separates us from God whose character and ways are always perfect and right. Being right with God is a gift from Him. Jesus, the Lamb, is God's way to cover us. THE ONLY PERMANENT COVERING FOR SIN IS THE BLOOD OF CHRIST.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 17:\n\n_Blessed is the one whose transgressions are forgiven,_\n\n_whose sins are covered. _(Ps. 32:1)\n\nTHOUGHT FOR TODAY:\n\n_When Jesus came to this world, John the Baptist called_\n\n_Him \"the Lamb of God that takes away the sin of the _\n\n_world_.\" (Jn. 1:29)._ __We need our sins taken care of because _\n\n_it separates us from God whose character and ways are_\n\n_always perfect and right. Being right with God is a gift_\n\n_from Him. Jesus, the Lamb, is God's way to cover us._\n\nTHE ONLY PERMANENT COVERING FOR SIN IS THE BLOOD OF CHRIST.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167bf0fccdbe6709",
    "date_utc": "Mon, 17 Dec 2018 20:05:43 -0600",
    "subject": "thoughts to live by",
    "verse": "The disciples were asked \"Who do you say I am?\" (Matthew 16:15)",
    "reflection": "How can anyone read the Gospel's and not feel the actual presence of Jesus? If you have not discovered this feeling, let me assure you that eventually YOU WILL have to answer the question, \"Who do you say Jesus is?\" WHY? Because-THE IDENTITY OF JESUS IS THE CENTRAL QUESTION OF ETERNITY.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 18:\n\nThe disciples were asked \"_Who do you say I am__?\" _(Mt 16:15)\n\nTHOUGHT FOR TODAY:\n\nHow can anyone read the Gospel's and not feel the actual\n\npresence of Jesus? If you have not discovered this feeling,\n\nlet me assure you that eventually YOU WILL have to answer\n\nthe question, _\"Who do you say Jesus is?\"_\n\nWHY? Because-THE IDENTITY OF JESUS IS THE CENTRAL QUESTION OF ETERNITY.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167c45e42e1d3ab1",
    "date_utc": "Tue, 18 Dec 2018 20:49:31 -0600",
    "subject": "thoughts to live by",
    "verse": "Do you think you deserve credit merely for loving those who love you? Even sinners do that! (Luke 6:32)",
    "reflection": "Love means action. One way to put love to work is to take the initiative in meeting special needs. This is easy to do with people who love us, people whom we trust, BUT love means doing this EVEN to people who dislike us or hurt us. GIVE AS THOUGH YOU ARE GIVING TO GOD!",
    "prayer": "",
    "reading": "",
    "original_content": "THE VERSE FOR DEC. 19\n\n_Do you think you deserve credit merely for loving those who_\n\n_love you? Even sinners do that! _(Lk. 6:32)\n\nTHOUGHT FOR TODAY?\n\nLove means action. One way to put love to work is to take the\n\ninitiative in meeting special needs. This is easy to do with people\n\nwho love us, people whom we trust, BUT love means doing this\n\nEVEN to people who dislike us or hurt us.\n\nGIVE AS THOUGH YOU ARE GIVING TO GOD!\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167c95ae3b52d8b2",
    "date_utc": "Wed, 19 Dec 2018 20:03:56 -0600",
    "subject": "thoughts to live by",
    "verse": "The angel said to the, \"Do not be afraid, I bring you good news that will cause great joy for all people.\" (Luke 2:10)",
    "reflection": "The gospel of Luke tells us that God sent an angle to ordinary shepherds to deliver an extraordinary birth announcement. Since then this message has been spread through the centuries to us, AND NOW we are Christ's messengers of joy to the world. THROUGH the indwelling of the Holy Spirit, we continue the practice of spreading the joy of Jesus as we follow His example and serve others. LET US TAKE THE JOY OF CHRISTMAS WITH US EVERY DAY!",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 20\n\n_The angel said to the, \"Do not be afraid, I bring you good _\n\n_news that will cause great joy for all people.\" _(Lk. 2:10)\n\nTHOUGHT FOR TODAY:\n\nThe gospel of Luke tells us that God sent an angle to ordinary\n\nshepherds to deliver an extraordinary birth announcement.\n\nSince then this message has been spread through the centuries\n\nto us, AND NOW we are Christ's messengers of joy to the world.\n\nTHROUGH the indwelling of the Holy Spirit, we continue the\n\npractice of spreading the joy of Jesus as we follow His example\n\nand serve others.\n\nLET US TAKE THE JOY OF CHRISTMAS WITH US EVERY DAY!",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167ce23444a8965f",
    "date_utc": "Thu, 20 Dec 2018 18:21:17 -0600",
    "subject": "thoughts to live by",
    "verse": "Even if my Father and mother abandon me, the Lord will hold me close. (Psalm 27:10)",
    "reflection": "Many have had the sad experience of be abandoned by father and mother. Broken homes, difference in belief. addiction to drugs or alcohol, even psychological isolation can leave children crippled by this loss. Even as adults, the pain may linger. GOD CAN TAKE THAT PLACE IN OUR LIFE, FILL THAT VOID, AND HEAL THAT HURT.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 21:\n\n_Even if my Father and mother abandon me,_\n\n_the Lord will hold me close. _(Ps. 27:10)\n\nTHOUGHT FOR TODAY:\n\nMany have had the sad experience of be abandoned by\n\nfather and mother. Broken homes, difference in belief.\n\naddiction to drugs or alcohol, even psychological isolation\n\ncan leave children crippled by this loss. Even as adults,\n\nthe pain may linger.\n\nGOD CAN TAKE THAT PLACE IN OUR LIFE, FILL THAT VOID, AND\n\nHEAL THAT HURT.\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167d38b29cb1c2c5",
    "date_utc": "Fri, 21 Dec 2018 19:32:52 -0600",
    "subject": "thoughts to live by",
    "verse": "Always be prepared to give an answer to everyone who asks you to give the reason for the hope that you have. (I Peter 3:15)",
    "reflection": "Some Christians believe that faith is a personal matter that should be kept to oneself. It is true we shouldn't be boisterous or obnoxious in sharing our faith, but we should always be ready to give an answer, gently and respectfully, when asked about our faith, our lifestyle, or our Christian perspective. ARE YOU PREPARED TO TELL OTHERS WHAT CHRIST HAS DONE IN YOUR LIFE?",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 22:\n\n_Always be prepared to give an answer to everyone who_\n\n_asks you to give the reason for the hope that you have._\n\n(I Pet. 3:15)\n\nTHE THOUGHT FOR TODAY:\n\nSome Christians believe that faith is a personal matter that\n\nshould be kept to oneself. It is true we shouldn't be boisterous\n\nor obnoxious in sharing our faith, but we should always be\n\nready to give an answer, gently and respectfully, when asked\n\nabout our faith, our lifestyle, or our Christian perspective.\n\nARE YOU PREPARED TO TELL OTHERS WHAT CHRIST HAS DONE IN\n\nYOUR LIFE?\n\n_ PASTOR AL__ _",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167d8ab7bf27332e",
    "date_utc": "Sat, 22 Dec 2018 19:26:16 -0600",
    "subject": "thoughts to live by",
    "verse": "Praise the Lord, my soul, and forget not all His benefits. (Psalm 103:2)",
    "reflection": "The most important gift we can ever receive is God's gift of His Son, our Savior, and with Him forgiveness, restoration, and the promise of eternal life that begins now and lasts forever. And the most important gift we can give is to give Jesus our heart. IF WE WERE A WISE MEN, WE WOULD DO OUR PART. YET WHAT CAN WE GIVE HIM---LETS GIVE HIM OUR HEART.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 23:\n\n_Praise the Lord, my soul, and forget not all His_\n\n_benefits_. (Ps. 103:2)\n\nTHOUGHT FOR TODAY:\n\nThe most important gift we can ever receive is God's gift of\n\nHis Son, our Savior, and with Him forgiveness, restoration,\n\nand the promise of eternal life that begins now and lasts forever.\n\nAnd the most important gift we can give is to give Jesus our heart.\n\nIF WE WERE A WISE MEN, WE WOULD DO OUR PART. YET WHAT CAN WE\n\nGIVE HIM---LETS GIVE HIM OUR HEART.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167ddae48d21effc",
    "date_utc": "Sun, 23 Dec 2018 18:47:26 -0600",
    "subject": "thoughts to live by",
    "verse": "On those living in the land of deep darkness a light has dawned. (Isaiah 9:2)",
    "reflection": "Out of the brilliance that surround the shepherds a shinning ray fell into our darkness. So this Christmas let us embrace the Good News that God, in Christ, HAS bridged the gap between us. NO MATTER WHERE TODAY FINDS US, JESUS HAS PENETRATED OUR DARK WORLD WITH HIS JOY AND LIGHT.",
    "prayer": "",
    "reading": "",
    "original_content": "THE VERSE FOR DEC. 24:\n\n_On those living in the land of deep darkness a_\n\n_light has dawned. _(Isa. 9:2)\n\nTHOUGHT FOR TODAY:\n\nOut of the brilliance that surround the shepherds a\n\nshinning ray fell into our darkness. So this Christmas\n\nlet us embrace the Good News that God, in Christ, HAS\n\nbridged the gap between us.\n\nNO MATTER WHERE TODAY FINDS US, JESUS HAS PENETRATED\n\nOUR DARK WORLD WITH HIS JOY AND LIGHT.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167e2ff185c9754f",
    "date_utc": "Mon, 24 Dec 2018 19:33:48 -0600",
    "subject": "thoughts to live by",
    "verse": "Do not be afraid. I bring you good news that will cause great joy for all the people. (Luke 2:10)",
    "reflection": "The joy was not for a few people, but for all people. \"For God so loved the whole world that He gave His one and only Son. \" (John 3:16) As we share the lifechanging message of Jesus with others, we need to join the worldwide chorus in proclaiming, \"The glories of His righteousness and the wonders of His love. \" THE GOOD NEWS OF JESUS'S BIRTH IS A SOURCE OF JOY FOR ALL PEOPLE.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 25:\n\n_Do not be afraid. I bring you good news that will_\n\n_cause great joy for all the people. _(Lk. 2:10)\n\nTHOUGHT FOR TODAY:\n\nThe joy was not for a few people, but for all people.\n\n\"For God so loved the whole world that He gave His\n\none and only Son.\" (Jn. 3:16) As we share the lifechanging message of Jesus with others, we need to\n\njoin the worldwide chorus in proclaiming, \"The glories\n\nof His righteousness and the wonders of His love.\"\n\nTHE GOOD NEWS OF JESUS'S BIRTH IS A SOURCE OF JOY FOR\n\nALL PEOPLE.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167e889999ff7fa2",
    "date_utc": "Tue, 25 Dec 2018 21:23:11 -0600",
    "subject": "thoughts to live by",
    "verse": "When the set time had fully come, God sent His Son. (Galatians 4:4)",
    "reflection": "When we become discouraged because God doesn't respond according to our time table. Christmas reminds us that \"when the set time had fully come, God sent His Son. that we might receive adoption to sonship: (Galatians 4:4-5) GOD'S TIMING IS ALWAYS RIGHT, LET US REMEMBER TO PRAY FOR PATIENCE!",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 26\n\n_When the set time had fully come, God sent His Son._\n\n(Gal. 4:4)\n\nTHOUGHT FOR TODAY:\n\nWhen we become discouraged because God doesn't respond\n\naccording to our time table. Christmas reminds us that \"when\n\nthe set time had fully come, God sent His Son. that we\n\nmight receive adoption to sonship: (Gal. 4:4-5)\n\nGOD'S TIMING IS ALWAYS RIGHT, LET US REMEMBER TO\n\nPRAY FOR PATIENCE!\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167edba026fba16c",
    "date_utc": "Wed, 26 Dec 2018 21:34:10 -0600",
    "subject": "thoughts to live by",
    "verse": "We did not follow cleverly devised stories when we told you about the coming of our Lord Jesus Christ in power, but we were eyewitnesses of His majesty. (2 Peter 1:16)",
    "reflection": "The Bible is not a collection of fables or human ideas about God. It is God's very words given through people to people. Peter emphasized his authority as an eyewitness as well as the God inspired authority of Scripture to prepare the way for his harsh words against false teachers. OUR FAITH MUST GO BEYOND WHAT WE BELIEVE, IT MUST BECOME A PART OF ALL WE DO",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 27:\n\n_We did not follow cleverly devised stories when we told _\n\n_you about the coming of our Lord Jesus Christ in power, _\n\n_but we were eyewitnesses of His majesty. _(2 Pet. 1:16)\n\nTHOUGHT FOR TODAY:\n\nThe Bible is not a collection of fables or human ideas about\n\nGod. It is God's very words given through people to people.\n\nPeter emphasized his authority as an eyewitness as well as the\n\nGod inspired authority of Scripture to prepare the way for his\n\nharsh words against false teachers.\n\nOUR FAITH MUST GO BEYOND WHAT WE BELIEVE, IT MUST BECOME\n\nA PART OF ALL WE DO\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167f26ca6212cde6",
    "date_utc": "Thu, 27 Dec 2018 19:27:46 -0600",
    "subject": "thoughts to live by",
    "verse": "Give thanks to the Lord, for He is good; His love endures forever. (Psalm 106:1)",
    "reflection": "The promises of the unfailing and everlasting nature of God's love are found throughout Scripture. And the greatest proof of His love is the death of His Son so that those who put their faith in Him can live eternally. FELLOW BELIEVERS, WE ARE LOCKED INTO GOD'S LOVE FOREVER!",
    "prayer": "",
    "reading": "",
    "original_content": "_VERSE FOR DEC. 28_\n\n_Give thanks to the Lord, for He is good; His love_\n\n_endures forever. _(Ps. 106:1)\n\nTHOUGHT FOR TODAY:\n\nThe promises of the unfailing and everlasting nature of\n\nGod's love are found throughout Scripture. And the\n\ngreatest proof of His love is the death of His Son so\n\nthat those who put their faith in Him can live eternally.\n\nFELLOW BELIEVERS, WE ARE LOCKED INTO GOD'S LOVE FOREVER!\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167f7a2e0624a0f6",
    "date_utc": "Fri, 28 Dec 2018 19:45:06 -0600",
    "subject": "thoughts to live by",
    "verse": "I will make you like My signet ring, for I have chosen you, declares the Lord. (Haggai 2:23)",
    "reflection": "In ancient times, the signet ring was used as a means of identification. Instead of signing their name, People would press their ring into hot wax or soft clay to make their mark. As God's children, we make our mark on the world as we spread the gospel, share His grace through loving our neighbors, and work to end oppression. EACH OF US HAVE OUR OWN UNIQUE STAMP THAT REVEALS HOW WE'RE CREATED IN GOD'S IMAGE.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 29:\n\n_I will make you like My signet ring, for I have chosen you,_\n\n_declares the Lord. _(Haggai 2:23)\n\nTHOUGHT FOR TODAY:\n\nIn ancient times, the signet ring was used as a means of\n\nidentification. Instead of signing their name, People would\n\npress their ring into hot wax or soft clay to make their mark.\n\nAs God's children, we make our mark on the world as we\n\nspread the gospel, share His grace through loving our neighbors,\n\nand work to end oppression.\n\nEACH OF US HAVE OUR OWN UNIQUE STAMP THAT REVEALS HOW WE'RE\n\nCREATED IN GOD'S IMAGE.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "167fd2048106b90f",
    "date_utc": "Sat, 29 Dec 2018 21:20:11 -0600",
    "subject": "thoughts to live by",
    "verse": "[Jesus] went up on a mountainside by Himself to pray. Matthew 14:23",
    "reflection": "Jesus repeatedly help multitudes of people, yet He didn't allow Himself to become haggard and hurried. He nurtured His connection with God through prayer. How is it with you? Do you take time with God to experience His strength and fulfillment. WHEN WE DRAW NEAR TO GOD OUR MINDS ARE REFRESHED AND OUR STRENGTH IS RENEWED!",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 30:\n\n[Jesus] _went up on a mountainside by Himself to pray._\n\nMt. 14:23\n\nTHOUGHT FOR TODAY:\n\nJesus repeatedly help multitudes of people, yet He didn't\n\nallow Himself to become haggard and hurried. He\n\nnurtured His connection with God through prayer. How\n\nis it with you? Do you take time with God to experience\n\nHis strength and fulfillment.\n\nWHEN WE DRAW NEAR TO GOD OUR MINDS ARE REFRESHED\n\nAND OUR STRENGTH IS RENEWED!\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1680194f81e9fa7a",
    "date_utc": "Sun, 30 Dec 2018 18:06:07 -0600",
    "subject": "thoughts to live by",
    "verse": "I tell you, now is the time of God's favor, now is the day of salvation. (2 Corinthians 6:2)",
    "reflection": "We need to keep this verse as a reminder; \"Now is the day of salvation. \" WHY? Have you asked Jesus into your heart? Do you have the assurance that you will have another day? Has the Holy Spirit alerted you to your need to put your trust in Jesus? Don't put it off! Run to Jesus. The Apostle Paul reminds us: \"Now is the day!\" REMEMBER THERE'S NO BETTER DAY THAN TODAY TO ENTER INTO GOD'S FAMILY! HAVE A HAPPY AND BLESSED NEW YEAR IN THE LORD'S FAVOR!",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR DEC. 31:\n\n_I tell you, now is the time of God's favor, now is the day_\n\n_of salvation. _2 Cor. 6:2.\n\nTHOUGHT FOR TODAY:\n\nWe need to keep this verse as a reminder; _\"Now is the day_\n\n_of salvation.\" WHY? _Have you asked Jesus into your heart?\n\nDo you have the assurance that you will have another day?\n\nHas the Holy Spirit alerted you to your need to put your\n\ntrust in Jesus? Don't put it off! Run to Jesus. The Apostle\n\nPaul reminds us: _\"Now is the day!\"_\n\n_REMEMBER THERE'S NO BETTER DAY THAN TODAY TO ENTER INTO_\n\n_GOD'S FAMILY!_\n\n_HAVE A HAPPY AND BLESSED NEW YEAR IN THE LORD'S FAVOR!_\n\n_ PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "168069fe6ee7e722",
    "date_utc": "Mon, 31 Dec 2018 17:36:09 -0600",
    "subject": "thoughts to live by",
    "verse": "We who are still alive and are left will. meet the Lord in the air. And so we will be with the Lord forever. (I Thessalonians 4:17)",
    "reflection": "In an increasingly chaotic world, what a hopeful thought that this could be the year that Jesus returns. More comforting still is the anticipation that all who trust Him for salvation will be gathered together, relieved from this world's suffering, sorrow, and fear. Best of all, we'll be with the Lord forever. NEW YEAR'S RESOLUTION. SUGGESTION SHARE FAITH. OFFER PRAYER. GATHER HOPE.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR JAN. 1:\n\n_We who are still alive and are left will. meet the Lord in the _\n\n_air. And so we will be with the Lord forever. _I Thess. 4:17\n\nTHOUGHT FOR TODAY:\n\nIn an increasingly chaotic world, what a hopeful thought that\n\nthis could be the year that Jesus returns. More comforting still\n\nis the anticipation that all who trust Him for salvation will be\n\ngathered together, relieved from this world's suffering, sorrow,\n\nand fear. Best of all, we'll be with the Lord forever.\n\nNEW YEAR'S RESOLUTION. SUGGESTION\n\nSHARE FAITH. OFFER PRAYER. GATHER HOPE.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  }
]
