[
  {
    "message_id": "164f839182792633",
    "date_utc": "Wed, 01 Aug 2018 20:20:49 -0500",
    "subject": "thoughts to live by",
    "verse": "It is better to be patient than powerful; it is better have self control than to conquer a city. (Proverbs 16:32)",
    "reflection": "Self-control is superior to conquest. Success in business, school, or home life can be ruined by a person who loses control of his or her temper. So it is a great personal victory to control your temper. When you feel yourself ready to explode, remember that losing control may cause you to forfeit what you want most.",
    "prayer": "Dear Heavenly Father, help me to remember to look to You each day for greater patients, when I feel the urge to explode. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_It is better to be patient than powerful; it is better have self_\n\n_control than to conquer a city. _(Pro 16:32)\n\nTHOUGHT FOR TODAY:\n\nSelf-control is superior to conquest. Success in business, school,\n\nor home life can be ruined by a person who loses control of his or\n\nher temper. So it is a great personal victory to control your temper.\n\nWhen you feel yourself ready to explode, remember that losing control\n\nmay cause you to forfeit what you want most.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me to remember to look to You each\n\nday for greater patients, when I feel the urge to explode. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "164fd1c5484e40c3",
    "date_utc": "Thu, 02 Aug 2018 19:07:30 -0500",
    "subject": "thoughts to live by",
    "verse": "A dry crust eaten in peace is better than a great feast with strife. (Proverbs 17:1)",
    "reflection": "Which would you sooner have, a bowl of soup with someone you love, or a steak with someone you hate? What God wants from us is to build on a foundation of love! ! !",
    "prayer": "Dear Heavenly Father, Help me to build on a foundation of love so that no mater what I eat or who I eat is with I will feel I have been blest by You. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A dry crust eaten in peace is better than a great feast with\nstrife._\n\n(Pro 17:1)\n\nTHOUGHT FOR TODAY:\n\nWhich would you sooner have, a bowl of soup with someone you\n\nlove, or a steak with someone you hate? What God wants from us\n\nis to build on a foundation of love! ! !\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, Help me to build on a foundation of love\n\nso that no mater what I eat or who I eat is with I will feel I have\n\nbeen blest by You. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165028ff64ba3edc",
    "date_utc": "Fri, 03 Aug 2018 20:31:54 -0500",
    "subject": "thoughts to live by",
    "verse": "A servant who deals wisely will rule over a son who acts shamefully. (Proverbs 17:2)",
    "reflection": "A wise servant could be given authority and even freed by his master. Servants in the ancient world often had oversight over young heirs, and might even inherit a masters estate in the absence of a biological son. What this proverb cautions is not to always rely on privilege and position.",
    "prayer": "Dear Lord, I pray that my behavior will always be pleasing to You. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A servant who deals wisely will rule over a son who acts_\n\n_shamefully. _(Pro. 17:2)\n\nTHOUGHT FOR TODAY:\n\nA wise servant could be given authority and even freed by\n\nhis master. Servants in the ancient world often had oversight\n\nover young heirs, and might even inherit a masters estate in\n\nthe absence of a biological son. What this proverb cautions\n\nis not to always rely on privilege and position.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that my behavior will always be pleasing\n\nto You. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1650786a0ec222b7",
    "date_utc": "Sat, 04 Aug 2018 19:39:48 -0500",
    "subject": "thoughts to live by",
    "verse": "Fire tests the purity of silver and gold, but the Lord tests the heart. (Proverbs 17:3)",
    "reflection": "It takes intense heat to purify gold and silver. Similarly it takes the heat of trials for the Christian to be purified. through trials. By them God shows us what is in us and clears out anything that gets in the way of complete trust in Him. So when tough times come our way, realize that God wants to use them to refine your faith and purify your heart.",
    "prayer": "Dear Heavenly Father, help me to understand what you are trying to tell me when trials come my way. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Fire tests the purity of silver and gold, but the Lord_\n\n_tests the heart. _(Pro. 17:3)\n\nTHOUGHT FOR TODAY:\n\nIt takes intense heat to purify gold and silver. Similarly it\n\ntakes the heat of trials for the Christian to be purified. through\n\ntrials. By them God shows us what is in us and clears out anything that gets in the way of complete trust in Him. So when\n\ntough times come our way, realize that God wants to use them\n\nto refine your faith and purify your heart.\n\nPRAYER FOR TODAY;\n\nDear Heavenly Father, help me to understand what you are\n\ntrying to tell me when trials come my way. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1650c9f308a59b80",
    "date_utc": "Sun, 05 Aug 2018 19:24:44 -0500",
    "subject": "thoughts to live by",
    "verse": "Those who mock the poor insult their maker, those who rejoice at the misfortune of others will be punished. (Proverbs 17:5)",
    "reflection": "Few facts are as cruel as making fun of the less fortunate, BUT many people do this because it makes them feel good to be better off or more successful than someone else. Mocking the poor is mocking God. who made them. We also ridicule God when we mock the weak, those who are different, or anyone else. When you catch yourself putting others down just for fun, stop and think about Who created them.",
    "prayer": "Dear Heavenly Father, forgive me when I put my mouth in gear before thinking it was You who created them. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Those who mock the poor insult their maker, those who rejoice _\n\n_at the misfortune of others will be punished. _(Pro. 17:5)\n\nTHOUGHT FOR TODAY:\n\nFew facts are as cruel as making fun of the less fortunate, BUT\n\nmany people do this because it makes them feel good to be\n\nbetter off or more successful than someone else. Mocking the\n\npoor is mocking God. who made them. We also ridicule God\n\nwhen we mock the weak, those who are different, or anyone else.\n\nWhen you catch yourself putting others down just for fun, stop\n\nand think about Who created them.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, forgive me when I put my mouth in gear\n\nbefore thinking it was You who created them. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16511c1db4057687",
    "date_utc": "Mon, 06 Aug 2018 19:20:42 -0500",
    "subject": "thoughts to live by",
    "verse": "A bribe seems to work like magic for those who give it; they succeed in all they do. (PRO. 17:8)",
    "reflection": "Solomon is certainly not condoning bribery, but he is making an observation about the way the world operates. Bribes may get people what they want, but the Bible clearly condemns using them (Matthew 28:11-15)",
    "prayer": "Dear Lord, I pray that I would always seek Your honest advise when I am tempted to do something that may cause me to sin. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A bribe seems to work like magic for those who give it; they_\n\n_succeed in all they do__. _(PRO. 17:8)\n\nTHOUGHT FOR TODAY:\n\nSolomon is certainly not condoning bribery, but he is making\n\nan observation about the way the world operates. Bribes may\n\nget people what they want, but the Bible clearly condemns\n\nusing them (Mt. 28:11-15)\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would always seek Your honest advise\n\nwhen I am tempted to do something that may cause me to sin. .Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165170f7f8c14e81",
    "date_utc": "Tue, 07 Aug 2018 20:03:36 -0500",
    "subject": "thoughts to live by",
    "verse": "Disregarding another person's faults preserves love; telling about them separates close friends. (Proverbs 17:9)",
    "reflection": "This proverb is saying that we should be willing to disregard the faults of others. Covering over offenses is necessary to any relationship. It is tempting, especially in an argument, to bring up all the mistakes the other person has ever made. We should be careful to try not to bring anything into an argument that is unrelated to the topic being discussed. As we grow to be more like Christ, we will acquire God's ability to forget confessed sins of the past.",
    "prayer": "Dear Lord, I pray that I would have a more forgiving heart, so that I would become more Christ like each day. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Disregarding another person's faults preserves love;_\n\n_telling about them separates close friends._ (Pro. 17:9)\n\nTHOUGHT FOR TODAY:\n\nThis proverb is saying that we should be willing to\n\ndisregard the faults of others. Covering over offenses is\n\nnecessary to any relationship. It is tempting, especially\n\nin an argument, to bring up all the mistakes the other\n\nperson has ever made. We should be careful to try not\n\nto bring anything into an argument that is unrelated to\n\nthe topic being discussed. As we grow to be more like\n\nChrist, we will acquire God's ability to forget confessed\n\nsins of the past.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would have a more forgiving heart,\n\nso that I would become more Christ like each day. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1651c322c3bcc5da",
    "date_utc": "Wed, 08 Aug 2018 19:59:35 -0500",
    "subject": "thoughts to live by",
    "verse": "A friend is always loyal; and a brother is born to help in time of need. (Proverbs 17:17)",
    "reflection": "What kind of friend are you? There is a vast difference between knowing someone well and being a true friend. The greatest evidence of genuine friendship is loyalty, being available to help in times of distress or personal struggle. To many people are fairweather friends. They stick around when the friendship helps THEM and leave when they are not getting anything out of the relationship. Be the kind of true friend the Bible encourages.",
    "prayer": "Dear Heavenly Father, I pray that I will always be truly loyal to all my friends. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A friend is always loyal; and a brother is born to help_\n\n_in time of need. _(Pro. 17:17)\n\nTHOUGHT FOR TODAY:\n\nWhat kind of friend are you? There is a vast difference between\n\nknowing someone well and being a true friend. The greatest\n\nevidence of genuine friendship is loyalty, being available to help\n\nin times of distress or personal struggle. To many people are fairweather friends. They stick around when the friendship helps\n\nTHEM and leave when they are not getting anything out of the\n\nrelationship. Be the kind of true friend the Bible encourages.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I will always be truly loyal to\n\nall my friends. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165211e9597b258a",
    "date_utc": "Thu, 09 Aug 2018 18:56:17 -0500",
    "subject": "thoughts to live by",
    "verse": "Anyone who loves to quarrel loves sin; anyone who speaks boastfully invites disaster. (Proverbs 17:19)",
    "reflection": "Good people enjoy the positive results of their words, BUT those who are treacherous seem to crave violence.",
    "prayer": "Dear Heavenly Father, I pray that You will always instill in me a positive attitude, always speaking well of others. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Anyone who loves to quarrel loves sin; anyone who speaks _\n\n_boastfully __invites disaster. _(Pro. 17:19)\n\nTHOUGHT FOR TODAY:\n\nGood people enjoy the positive results of their words, BUT\n\nthose who are treacherous seem to crave violence.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that You will always instill in\n\nme a positive attitude, always speaking well of others. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16526d7550d24212",
    "date_utc": "Fri, 10 Aug 2018 21:36:11 -0500",
    "subject": "thoughts to live by",
    "verse": "A cheerful heart is good medicine, but a broken spirit saps a person's strength. (Proverbs 17:22)",
    "reflection": "To be cheerful is to be ready to greet others with a welcome, a word of encouragement, an enthusiasm for the task at hand, and a positive out look on the future. Such people are as welcome, as pain-relieving medicine.",
    "prayer": "Dear Lord, I pray that I would always be ready to greet others with a word of encouragement, and a positive out look on the future. Forgive me when I'm lees then encouraging. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A cheerful heart is good medicine, but a broken spirit saps a_\n\n_person's strength. _(Pro. 17:22)\n\nTHOUGHT FOR TODAY:\n\nTo be cheerful is to be ready to greet others with a welcome,\n\na word of encouragement, an enthusiasm for the task at hand,\n\nand a positive out look on the future. Such people are as welcome,\n\nas pain-relieving medicine.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would always be ready to greet others\n\nwith a word of encouragement, and a positive out look on the\n\nfuture. Forgive me when I'm lees then encouraging. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1652b71fae8f62ee",
    "date_utc": "Sat, 11 Aug 2018 19:03:35 -0500",
    "subject": "thoughts to live by",
    "verse": "Sensible people keep their eyes glued on wisdom, but a fool's wonder to the ends of the earth. (Proverbs 17:24)",
    "reflection": "There is something to be said about having dreams, Lord knows I have had my share, but this proverb points out the folly of chasing fantasies. I have found that it is better to align your goals with God's, being the kind of person He wants you to be! Take time to think about your dreams and goals, and make sure they cover the really important areas of life.",
    "prayer": "Lord, help me to tackle everything on my plate today with grace, and enthusiasm, knowing that my attitude may effect others in ways I'm not even aware of. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Sensible people keep their eyes glued on wisdom, but a fool's_\n\n_wonder to the ends of the earth. _(Pro. 17:24)\n\nTHOUGHT FOR TODAY:\n\nThere is something to be said about having dreams, Lord knows\n\nI have had my share, but this proverb points out the folly of\n\nchasing fantasies. I have found that it is better to align your\n\ngoals with God's, being the kind of person He wants you to be!\n\nTake time to think about your dreams and goals, and make sure\n\nthey cover the really important areas of life.\n\nPRAYER FOR TODAY:\n\nLord, help me to tackle everything on my plate today with grace,\n\nand enthusiasm, knowing that my attitude may effect others in\n\nways I'm not even aware of. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16530aa9f4badb8e",
    "date_utc": "Sun, 12 Aug 2018 19:23:33 -0500",
    "subject": "thoughts to live by",
    "verse": "Even fools are thought to be wise when they keep silent; when they keep their mouths shut, they seem intelligent. (Proverbs 17:28)",
    "reflection": "When we talk to much and listen to little we communicate to others that we think our ideas are much more important then theirs. The Bible advice's us to reverse this process. When we find ourselves acting out this in our lives we need to put a stopwatch on our conversations, and keep track of how much we talk and how much we listen.",
    "prayer": "Dear Heavenly Father, help me to be a better listener. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Even fools are thought to be wise when they keep silent;_\n\n_when they keep their mouths shut, they seem intelligent._\n\nTHOUGHT FOR TODAY;\n\n_When we talk to much and listen to little we communicate to_\n\n_others that we think our ideas are much more important then_\n\n_theirs. The Bible advices us to reverse this process. When we_\n\n_find ourselves acting out this in our lives we need to put a_\n\n_stop-watch on our conversations, and keep track of how much _\n\n_we talk and how much we listen._\n\n_PRAYER FOR TODAY:_\n\n_Dear Heavenly Father, help me to be a better listener. Amen. _",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16535a376851add2",
    "date_utc": "Mon, 13 Aug 2018 18:33:50 -0500",
    "subject": "thoughts to live by",
    "verse": "Fools have very little interest in understanding; they only want to air their own opinions. (Proverbs 18:2)",
    "reflection": "The Lord approves of those who are good, but He condemns those who have evil plans. only the godly have deep roots.",
    "prayer": "Dear Heavenly, I pray that I will not fall under Your condemnation Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Fools have very little interest in understanding; they only want _\n\n_to air their own opinions. _ (Pro. 18:2_)_\n\nTHOUGHT FOR TODAY:\n\nThe Lord approves of those who are good, but He condemns\n\nthose who have evil plans. only the godly have deep roots.\n\nPRAYER FOR TODAY:\n\nDear Heavenly, I pray that I will not fall under Your condemnation\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1653ae27f1a3e85f",
    "date_utc": "Tue, 14 Aug 2018 19:00:47 -0500",
    "subject": "thoughts to live by",
    "verse": "People ruin their lives by their own foolishness and then become angry at the Lord. (Proverbs 19:3",
    "reflection": "People continually blame God for their self-induced problems. How do you handle unpleasant results of your own choices? Where do you fix the blame? Instead of blaming God, look for ways to grow through your bad choices and failures.",
    "prayer": "Dear Heavenly Father, please forgive me for making my own plans, and when they fail I have the tendency to blame You. Help me to always look to You for wisdom. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_People ruin their lives by their own foolishness and then become_\n\n_ angry at the Lord. _(Pro. 19:3\n\nTHOUGHT FOR TODAY:\n\nPeople continually blame God for their self-induced problems.\n\nHow do you handle unpleasant results of your own choices?\n\nWhere do you fix the blame? Instead of blaming God, look for\n\nways to grow through your bad choices and failures.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, please forgive me for making my own\n\nplans, and when they fail I have the tendency to blame You.\n\nHelp me to always look to You for wisdom. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16540c1bbbc329c4",
    "date_utc": "Wed, 15 Aug 2018 22:22:43 -0500",
    "subject": "thoughts to live by",
    "verse": "A false witness will not go unpunished, nor will a liar escape. (Proverbs 19:5)",
    "reflection": "Making up false stories is strictly forbidden by the Lord. Gossip, slander, and false witnessing undermines families, strains neighborhood cooperation, and causes chaos of a justice system. Yes destructive gossip will always cause problems. Even if you do not initiate a lie, you become responsible if you pass it along. The best advice is don't circulate rumors; squelch them before they get started.",
    "prayer": "I thank You Lord, for the many blessings You have given since the creation of the world, even though we are far from deserving of even one. I pray that You would open the eyes of us all so that we may turn our lives back over to You. Help us to be faithful I pray in Jesus name. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A false witness will not go unpunished, nor will a liar_\n\n_escape. _(Pro. 19:5)\n\nTHOUGHT FOR TODAY:\n\nMaking up false stories is strictly forbidden by the Lord.\n\nGossip, slander, and false witnessing undermines families,\n\nstrains neighborhood cooperation, and causes chaos of a\n\njustice system. Yes destructive gossip will always cause\n\nproblems. Even if you do not initiate a lie, you become\n\nresponsible if you pass it along. The best advice is don't\n\ncirculate rumors; squelch them before they get started.\n\nPRAYER FOR TODAY:\n\nI thank You Lord, for the many blessings You have given\n\nsince the creation of the world, even though we are far from\n\ndeserving of even one. I pray that You would open the eyes of\n\nus all so that we may turn our lives back over to You. Help\n\nus to be faithful I pray in Jesus name. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165451fb7f2c3637",
    "date_utc": "Thu, 16 Aug 2018 18:43:51 -0500",
    "subject": "thoughts to live by",
    "verse": "People with good sense restrain their anger; they earn esteem by overlooking wrongs. (Proverbs 19:11)",
    "reflection": "A quick temper can be like a fire out of control. It can burn us and everyone else in its path. Anger divides people. It pushes us into hasty decisions that only causes bitterness and guilt. Yet anger, in itself, is not wrong. Anger can be a legitimate reaction to injustice and sin. When you feel yourself getting angry, look for the cause. Are you reacting to an evil situation that you are going to set right? Or are you responding to a personal insult?",
    "prayer": "Dear heavenly Father, I pray that You will help me control a quick temper, channel my feelings into effective action so that I may conquer selfish anger through humility and repentance. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_People with good sense restrain their anger; they earn_\n\n_esteem by overlooking wrongs. _(Pro. 19:11)\n\nTHOUGHT FOR TODAY:\n\nA quick temper can be like a fire out of control. It can burn us\n\nand everyone else in its path. Anger divides people. It pushes\n\nus into hasty decisions that only causes bitterness and guilt. Yet\n\nanger, in itself, is not wrong. Anger can be a legitimate reaction\n\nto injustice and sin. When you feel yourself getting angry, look\n\nfor the cause. Are you reacting to an evil situation that you are\n\ngoing to set right? Or are you responding to a personal insult?\n\nPRAY FOR TODAY:\n\nDear heavenly Father, I pray that You will help me control a\n\nquick temper, channel my feelings into effective action so that\n\nI may conquer selfish anger through humility and repentance.\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1654a7f5a123f3e0",
    "date_utc": "Fri, 17 Aug 2018 19:46:25 -0500",
    "subject": "thoughts to live by",
    "verse": "Keep the commandments and keep your life; despising them leads to death. (Proverbs 19:16)",
    "reflection": "The commandments we are told to obey are those in God's Word, such as the Ten Commandments (Exodus, 20) and other passages of instruction. To obey what God teaches in the Bible is self-preserving. to disobey is self-destructive.",
    "prayer": "Dear Heavenly Father, I pray for Your Holy Spirit's guidance so that I may always keep Your commandments and Your other instructions. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Keep the commandments and keep your life; despising_\n\n_them leads to death. _(Pro. 19:16)\n\nTHOUGHT FOR TODAY:\n\nThe commandments we are told to obey are those in God's\n\nWord, such as the Ten Commandments (Ex, 20) and other\n\npassages of instruction. To obey what God teaches in the\n\nBible is self-preserving. to disobey is self-destructive.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray for Your Holy Spirit's guidance\n\nso that I may always keep Your commandments and Your other\n\ninstructions. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1654f687f41d7c89",
    "date_utc": "Sat, 18 Aug 2018 18:39:33 -0500",
    "subject": "thoughts to live by",
    "verse": "If you help the poor, you are lending to the Lord, and He will repay you. (Proverbs 19:17)",
    "reflection": "Here God identifies with the poor as Jesus does in (Matthew 25:31-46). As our Creator, God values all of us, whether we are poor or rich. When we help the poor, we horror both the Creator and His creation. God accepts our help as if we had offered it directly to Him.",
    "prayer": "Dear Heavenly Father, help me to look upon all people equally. Help me to reach out to all in need no matter what their status may be. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_If you help the poor, you are lending to the Lord,_\n\n_and He will repay you. _(Pro 19:17)\n\nTHOUGHT FOR TODAY:\n\nHere God identifies with the poor as Jesus does in (Mt. 25:31-46).\n\nAs our Creator, God values all of us, whether we are poor or rich.\n\nWhen we help the poor, we horror both the Creator and His creation.\n\nGod accepts our help as if we had offered it directly to Him.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me to look upon all people equally.\n\nHelp me to reach out to all in need no matter what their status\n\nmay be. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16554bd54705c792",
    "date_utc": "Sun, 19 Aug 2018 19:30:19 -0500",
    "subject": "thoughts to live by",
    "verse": "You can make many plans, but the Lord's purpose will prevail. (Proverbs 19:21)",
    "reflection": "Are you frustrated with the inconsistencies of other or even in yourself? God is completely trustworthy, His intentions never change. There is a promise that what ever is good and perfect comes to us from the Creator who never changes (James 1:17). When you wonder if there is anyone you can trust, remember that God is completely consistent. We need to let Him counsel us.",
    "prayer": "Dear Heavenly Father, I know in my heart that You are trustworthy but there are times I need to be reminded, because in my human nature I become impatient and run out ahead of You. Forgive me for my sins. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_You can make many plans, but the Lord's purpose will prevail._\n\n(Pro. 19:21)\n\nTHOUGHT FOR TODAY:\n\nAre you frustrated with the inconsistencies of other or even in\n\nyourself? God is completely trustworthy, His intensions never\n\nchange. There is a promise that what ever is good and perfect\n\ncomes to us from the Creator who never changes (Jm. 1:17).\n\nWhen you wonder if there is anyone you can trust, remember\n\nthat God is completely consistent. We need to let Him counsel\n\nus.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I know in my heart that You are trustworthy\n\nbut there are times I need to be reminded, because in my human\n\nnature I become impatient and run out ahead of You. Forgive me\n\nfor my sins. AMEN.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1655a076b06403e7",
    "date_utc": "Mon, 20 Aug 2018 20:09:20 -0500",
    "subject": "thoughts to live by",
    "verse": "If you punish a mocker, the simpleminded will learn a lesson, if you reprove the wise, the will be all the smarter. (Proverbs 19:25)",
    "reflection": "There is a great difference between the person who learns from criticism and the person who refuses to accept correction. How we respond to criticism determines whether or not we grow in wisdom. The next time someone criticizes you, listen carefully to all that is said. You might learn something.",
    "prayer": "Dear Heavenly Father, Help me to always accept constructive criticism. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_If you punish a mocker, the simpleminded will learn a lesson,_\n\n_if you reprove the wise, the will be all the smarter._ (Pro. 19:25)\n\nTHOUGHT FOR TODAY:\n\nThere is a great difference between the person who learns from\n\ncriticism and the person who refuses to accept correction. How\n\nwe respond to criticism determines whether or not we grow in\n\nwisdom. The next time someone criticizes you, listen carefully\n\nto all that is said. You might learn something.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, Help me to always accept constructive\n\ncriticism. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1655f1106487abdc",
    "date_utc": "Tue, 21 Aug 2018 19:37:56 -0500",
    "subject": "thoughts to live by",
    "verse": "Mockers will be punished, and the backs of fools will be beaten. (Proverbs 19:29)",
    "reflection": "Wrong assumptions lead to wrong conclusions. We should not take our limited experiences and jump to conclusions about life in general. If you find yourself doubting God, remember that you do not have all the facts. God wants only the very best for your life. Many people endure great pain, but ultimately they find some greater good from it. When you're struggling, don't assume the worst.",
    "prayer": "Dear Lord, I pray that You will forgive me when I jump to conclusions about people and different situations in life. I pray that I will always trust in Your advise. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Mockers will be punished, and the backs of fools will be beaten._\n\nTHOUGHT FOR TODAY:\n\nWrong assumptions lead to wrong conclusions. We should not\n\ntake our limited experiences and jump to conclusions about life\n\nin general. If you find yourself doubting God, remember that you\n\ndo not have all the facts. God wants only the very best for your\n\nlife. Many people endure great pain, but ultimately they find some\n\ngreater good from it. When you're struggling, don't assume the worst.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that You will forgive me when I jump to conclusions\n\nabout people and different situations in life. I pray that I will\nalways\n\ntrust in Your advise. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16564528f09f0e87",
    "date_utc": "Wed, 22 Aug 2018 20:07:37 -0500",
    "subject": "thoughts to live by",
    "verse": "Who can say, \"I have cleansed my heart; I am pure and free from sin. (Proverbs 20:9)",
    "reflection": "No one is without sin. As soon as we confess our sins and repent, sinful thoughts and actions begin to creep back into our life. We all need ongoing cleansing. We need to thank God that He is a merciful God who provides forgiveness by His mercy when we ask for it. We need to make confession and repentance a regular part of our talks with God. We need to rely on Him for the cleansing we need.",
    "prayer": "I thank You Lord for the assurance we have that You hear our confessions and that You promise to forgive us when we repent of our sins. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Who can say, \"I have cleansed my heart; I am pure and free _\n\n_from sin. _(Pro. 20:9)\n\nTHOUGHT FOR TODAY:\n\nNo one is without sin. As soon as we confess our sins and repent,\n\nsinful thoughts and actions begin to creep back into our life. We\n\nall need ongoing cleansing. We need to thank God that He is a\n\nmerciful God who provides forgiveness by His mercy when we\n\nask for it. We need to make confession and repentance a regular\n\npart of our talks with God. We need to rely on Him for the cleansing\n\nwe need.\n\nPRAYER FOR TODAY:\n\nI thank You Lord for the assurance we have that You hear our\n\nconfessions and that You promise to forgive us when we repent\n\nof our sins. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1656968440f12298",
    "date_utc": "Thu, 23 Aug 2018 19:49:26 -0500",
    "subject": "thoughts to live by",
    "verse": "How can we understand the road we travel? It is the Lord who directs our steps. (Proverbs 20:24)",
    "reflection": "We are often confused by the events around us. Some things we will never understand until years later when we look back and see how God was working. Scriptures tell us we should not worry if we don't understand every thing as it happens. Instead, we should trust that God knows what He is doing even if His timing or design is not clear to us.",
    "prayer": "Dear Heavenly Father, forgive me for not always following your leading. Help me to be more trusting even when I don't understand Your plans for us. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nHow can we understand the road we travel? It is the\nLord who directs our steps. (Pro. 20:24)\n\nTHOUGHT FOR TODAY:\n\nWe are often confused by the events around us. Some things\n\nwe will never understand until years later when we look back\n\nand see how God was working. Scriptures tell us we should\n\nnot worry if we don't understand every thing as it happens.\n\nInstead, we should trust that God knows what He is doing\n\neven if His timing or design is not clear to us.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, forgive me for not always following your\n\nleading. Help me to be more trusting even when I don't understand\n\nYour plans for us. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1656e767e0418cd9",
    "date_utc": "Fri, 24 Aug 2018 19:23:04 -0500",
    "subject": "thoughts to live by",
    "verse": "It is dangerous to make a rash promise to God before counting the cost. (Proverbs 20:25)",
    "reflection": "God takes vows very seriously and requires that they are carried out (Deuteronomy 23:21-23). We often have good intentions when making a vow because we want to please God. Jesus, however, says it is better not to make promises to God because He knows how difficult they are to keep (Matthew 5:33-37).",
    "prayer": "Dear Heavenly Father, I pray that You will forgive me for the promises I have made and failed to keep. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_It is dangerous to make a rash promise to God before_\n\n_counting the cost. _(Pro. 2o:25)\n\nTHOUGHT FOR TODAY:\n\nGod takes vows very seriously and requires that they are\n\ncarried out (Deut. 23:21-23). We often have good intentions\n\nwhen making a vow because we want to please God. Jesus,\n\nhowever, says it is better not to make promises to God\n\nbecause He knows how difficult they are to keep (Mt. 5:33-37).\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that You will forgive me for the\npromises\n\nI have made and failed to keep. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16573687475f764f",
    "date_utc": "Sat, 25 Aug 2018 18:25:50 -0500",
    "subject": "thoughts to live by",
    "verse": "The spirit of man is the lamp of the Lord, searching all his innermost parts. (Proverbs 20:27)",
    "reflection": "SPIRIT \"The breath of life\" God breathed into Adams nostrils distinguishing humankind from all other creatures (Genesis 2:7). It penetrates, and energizes every human faculty. God judges the heart and knows who are His. It is a terrible prospect for God to look at our hearts, considering what lies within.",
    "prayer": "Dear Lord, I realize that You know my heart, and I confess that my heart is NOT always pleasing to You. Please forgive me for the uncleanliness that dwells within my heart. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The spirit of man is the lamp of the Lord, searching all_\n\n_his innermost parts. _(Pro. 20:27)\n\nTHOUGHT FOR TODAY:\n\n_SPIRIT \"_The breath of life\" God breathed into Adams nostrils\n\ndistinguishing humankind from all other creatures (Gen. 2:7).\n\nIt penetrates, and energizes every human faculty. God judges\n\nthe heart and knows who are His. It is a terrible prospect for\n\nGod to look at our hearts, considering what lies within.\n\nPRAYER FOR TODAY:\n\nDear Lord, I realize that You know my heart, and I confess\n\nthat my heart is NOT always pleasing to You. Please forgive\n\nme for the uncleanliness that dwells within my heart. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16578f9551c36fc0",
    "date_utc": "Sun, 26 Aug 2018 20:22:11 -0500",
    "subject": "thoughts to live by",
    "verse": "Blows that wound cleanse away evil; stokes make clean the innermost parts. (Proverbs 20:30)",
    "reflection": "Our heavenly Father, disciplines those He loves, WHY? Because we are all born sinful. That is why we should not be surprised by our ill manners. God's dear Son became human for our sakes pierced and lashed to rescue us from sin and to deliver us into the arms of our Heavenly Father.",
    "prayer": "Dear Heavenly Father, I thank You that You provided a way for man to inherit eternal life by faith in Your Son Jesus Christ. I pray for forgiveness of all my sins. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Blows that wound cleanse away evil; stokes make clean the _\n\n_innermost parts. _(Pro. 20:30)\n\nTHOUGHT FOR TODAY:\n\nOur heavenly Father, disciplines those He loves, WHY? Because\n\nwe are all born sinful. That is why we should not be surprised by\n\nour ill manners. God's dear Son became human for our sakes\n\npierced and lashed to rescue us from sin and to deliver us into\n\nthe arms of our Heavenly Father.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You that You provided a way\n\nfor man to inherit eternal life by faith in Your Son Jesus Christ.\n\nI pray for forgiveness of all my sins. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1657e38bfc15b70b",
    "date_utc": "Mon, 27 Aug 2018 20:49:33 -0500",
    "subject": "thoughts to live by",
    "verse": "To do righteousness and justice is more acceptable to the Lord than sacrifices. (Proverbs 21:3)",
    "reflection": "Outward ceremonies as such are not useless, sacrificial offerings of various kinds were required by the Law of Moses. We lay on God's alter the sacrifice of self-will and the offering of wholehearted consecration. True worship DOES NOT begin with giving to God but the receiving in humble faith. Then we need to live in fervent love one to another, especially toward those in need.",
    "prayer": "Dear Lord, help me to have a fervent love for others, giving of myself in the likeness of Christ, especially to the needy. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_To do righteousness and justice is more acceptable to the_\n\n_Lord than sacrifices. _(Pro. 21:3)\n\nTHOUGHT FOR TODAY:\n\nOutward ceremonies as such are not useless, sacrificial offerings\n\nof various kinds were required by the Law of Moses. We lay on\n\nGod's alter the sacrifice of self-will and the offering of wholeheated consecration. True worship DOES NOT begin with giving\n\nto God but the receiving in humble faith. Then we need to live\n\nin fervent love one to another, especially toward those in need.\n\nPRAYER FOR TODAY:\n\nDear Lord, help me to have a fervent love for others, giving of\n\nmyself in the likeness of Christ, especially to the needy. .Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16582eb2daf58bf3",
    "date_utc": "Tue, 28 Aug 2018 18:42:55 -0500",
    "subject": "thoughts to live by",
    "verse": "The violence of the wicked will sweep them away; because they refuse to do what is just (Proverbs 21:7)",
    "reflection": "Those who have left the right path for the way of evil, come to enjoy the way they have chosen. Through the effective working of the DEVIL, what repulses at first becomes interesting, then acceptable, and finally a source of sinful delight.",
    "prayer": "Dear Heavenly Father, help me to remain faithful in the reading and studying of Your Word so that I may receive Your grace through Your Son our Lord Jesus Christ. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The violence of the wicked will sweep them away;_\n\n_because they refuse to do what is just_ (Pro. 21:7)\n\nTHOUGHT FOR TODAY:\n\nThose who have left the right path for the way of evil,\n\ncome to enjoy the way they have chosen. Through the\n\neffective working of the DEVIL, what repulses at first\n\nbecomes interesting, then acceptable, and finally a\n\nsource of sinful delight.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me to remain faithful in the\n\nreading and studying of Your Word so that I may receive\n\nYour grace through Your Son our Lord Jesus Christ. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165885a35f8056e3",
    "date_utc": "Wed, 29 Aug 2018 20:02:18 -0500",
    "subject": "thoughts to live by",
    "verse": "When a scoffer is punished, the simple become wise; when a wise man is instructed, he gains knowledge. (Proverbs 21:11) THOUGHT FOR TODAY. \"SCOFFER\" is someone who stubbornly scorns God's wisdom, \"THE SIMPLE WILL LEARN PRUDENCE. \" Punishment is a deterrent for the simple who take warning from the fate of the wicked. Simple people must actually see what consequences come from disobedience. this is an indictment to us all, we may know well enough that lawlessness has its price, but we change our behavior ONLY when the treat of punishment is near.",
    "reflection": "",
    "prayer": "Dear Heavenly Father, I pray that I don't have to be hit in the head to realize that there are consequences for those whose behavior is not in tune with Your will. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_When a scoffer is punished, the simple become wise; when a_\n\n_wise man is instructed, he gains knowledge. _(Pro. 21:11)\n\nTHOUGHT FOR TODAY.\n\n_\"SCOFFER\" is someone who stubbornly scorns God's wisdom, _\n\n_\"THE SIMPLE WILL LEARN PRUDENCE.\" _Punishment is a deterrent\n\nfor the simple who take warning from the fate of the wicked.\n\nSimple people must actually see what consequences come from\n\ndisobedience. this is an indictment to us all, we may know well\n\nenough that lawlessness has its price, but we change our behavior\n\nONLY when the treat of punishment is near.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I don't have to be hit in the\n\nhead to realize that there are consequences for those whose\n\nbehavior is not in tune with Your will. Amen.",
    "found_verse": true,
    "found_reflection": false,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1658d53666916022",
    "date_utc": "Thu, 30 Aug 2018 19:12:58 -0500",
    "subject": "thoughts to live by",
    "verse": "A gift in secret averts anger, and a concealed bribe, strong wrath. (Proverbs 21:14)",
    "reflection": "\"CONCEALED BRIBE\" does not endorse bribery, but points out the effectiveness of worldly and sinful methods, which God's people should not encourage (Romans 12:1-2). Which is worth reading.",
    "prayer": "Thank You Heavenly Father, for Your mercies in Jesus Christ and for the transforming work, You began in my Baptism. Empower me by Your Spirit to present my body as a living sacrifice of worship acceptable to You in Jesus Christ. Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A gift in secret averts anger, and a concealed bribe, strong_\n\n_wrath_. (Pro. 21:14)\n\nTHOUGHT FOR TODAY:\n\n_\"CONCEALED BRIBE\" _does not endorse bribery, but points out\n\nthe effectiveness of worldly and sinful methods, which God's\n\npeople should not encourage (Ro. 12:1-2). Which is worth\n\nreading.\n\nPRAYER FOR TODAY:\n\nThank You Heavenly Father, for Your mercies in Jesus Christ\n\nand for the transforming work, You began in my Baptism.\n\nEmpower me by Your Spirit to present my body as a living\n\nsacrifice of worship acceptable to You in Jesus Christ. Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165929a91f7a6b7b",
    "date_utc": "Fri, 31 Aug 2018 19:48:48 -0500",
    "subject": "thoughts to live by",
    "verse": "The sacrifice of the wicked is an abomination; how much more when he brings it with evil intent. (Proverbs 21:27)",
    "reflection": "Without faith it is impossible to please God. \"Only justified people, who are led by the Spirit of Christ can do go works. Without faith in Christ as Mediator, good works do not please. Saving faith both in God's existence and in His mercy for Christ's sake is the secret to pleasing God.",
    "prayer": "Lord Jesus, save me from my sin, which clings so closely, and give me endurance to do Your will. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The sacrifice of the wicked is an abomination; how much more_\n\n_when he brings it with evil intent. _(Pro. 21:27)\n\nTHOUGHT FOR TODAY:\n\nWithout faith it is impossible to please God. \"Only justified people,\n\nwho are led by the Spirit of Christ can do go works. Without faith in\n\nChrist as Mediator, good works do not please. Saving faith both in\n\nGod's existence and in His mercy for Christ's sake is the secret to\n\npleasing God.\n\nPRAYER FOR TODAY:\n\nLord Jesus, save me from my sin, which clings so closely, and give\n\nme endurance to do Your will. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]