[
  {
    "message_id": "16154334e51a469a",
    "date_utc": "Thu, 01 Feb 2018 19:48:24 -0600",
    "subject": "Devo. for Feb. 2",
    "verse": "\"May you always be filled with the fruit of your Salvation, those good things that are produced in your life by Jesus Christ--for this will bring much glory and praise to God. \" (Phil. 1:11)",
    "reflection": "The \"fruit of salvation\" includes all of the character traits flowing from a right relationship with God. there is no other way for us to gain this fruit of righteousness than through Christ. See (Gal. 5:22, 23) for the fruit of the Spirit.",
    "prayer": "Dear Heavenly Father, creator and sustainer of all that exists, I am so thankful that You want to have a relationship with us. I am thankful for the fruit of righteousness that is ours through Your Son our Lord Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"May you always be filled with the fruit of your Salvation, those _\n\n_good things that are produced in your life by Jesus Christ--for_\n\n_this will bring much glory and praise to God.\" _(Phil. 1:11)\n\nTHOUGHT FOR TODAY:\n\nThe _\"fruit of salvation\"_ includes all of the character traits\nflowing\n\nfrom a right relationship with God. there is no other way for us to\n\ngain this fruit of righteousness than through Christ. See (Gal. 5:22,\n\n23) for the fruit of the Spirit.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, creator and sustainer of all that exists, I\n\nam so thankful that You want to have a relationship with us.\n\nI am thankful for the fruit of righteousness that is ours through\n\nYour Son our Lord Jesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1615da8ead2ac440",
    "date_utc": "Sat, 03 Feb 2018 15:53:27 -0600",
    "subject": "Devo. for Feb. 3",
    "verse": "Paul says: \"I want you to know that everything that has happened to me here (prison) has helped to spread the God News. \" (Phil. 1:12)",
    "reflection": "Many of us if we were imprisoned would become bitter. But Paul saw it as one more opportunity to spread the Good News of Jesus Christ. What have you done with the opportunities you have been given?",
    "prayer": "Dear Lord, help me use the opportunities wisely the ways of salvation. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nPaul says: _\"I want you to know that everything that has _\n\n_happened to me here _(prison)_ has helped to spread the _\n\n_God News.\" _(Phil. 1:12)\n\nTHOUGHT FOR TODAY:\n\nMany of us if we were imprisoned would become bitter.\n\nBut Paul saw it as one more opportunity to spread the\n\nGood News of Jesus Christ. What have you done with\n\nthe opportunities you have been given?\n\nPRAYER FOR TODAY:\n\nDear Lord, help me use the opportunities wisely the\n\nways of salvation. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1615ec0da6b31210",
    "date_utc": "Sat, 03 Feb 2018 20:59:13 -0600",
    "subject": "Devo for Feb. 4",
    "verse": "Paul says: \"Because of my imprisonment, many of the Christians here have gained confidence and become more bold in telling others about Christ. \" (Phil. 1:14)",
    "reflection": "When we speak fearlessly for Christ or live faithfully for Him during difficult situations, we encourage others to do the same. Let us be an encouragement by the way that we live.",
    "prayer": "Dear heavenly Father, I know that all believers are called to be witnesses for Christ, please FORGIVE ME for not always being a true encouragement to others. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nPaul says: _\"Because of my imprisonment, many of the Christians_\n\n_here have gained confidence and become more bold in telling_\n\n_others about Christ.\" _(Phil. 1:14)\n\nTHOUGHT FOR TODAY:\n\nWhen we speak fearlessly for Christ or live faithfully for Him\n\nduring difficult situations, we encourage others to do the same.\n\nLet us be an encouragement by the way that we live.\n\nPRAYER FOR TODAY:\n\nDear heavenly Father, I know that all believers are called to be\n\nwitnesses for Christ, please FORGIVE ME for not always being a\n\ntrue encouragement to others. . . Amen. _ _",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16163da57cd0ada4",
    "date_utc": "Sun, 04 Feb 2018 20:45:09 -0600",
    "subject": "Devo for Feb. 5",
    "verse": "Paul says: \"Some are preaching out of jealously and rivalry. But others preach about Christ with pure motives. \" (Phil. 1:15)",
    "reflection": "Some Christians serve for the wrong reasons. Paul wouldn't condone, nor does God excuse, their motives, but we should be glad if God uses their message, regardless of their motives.",
    "prayer": "Dear Heavenly Father, I thank You for Your Word, the message of salvation to all who will read, hear, and believe. I pray that Your Spirit would awaken the hearts of all people. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nPaul says:_ \"Some are preaching out of jealously and rivalry._\n\n_But others preach about Christ with pure motives.\"_ (Phil. 1:15)\n\nTHOUGHT FOR TODAY:\n\nSome Christians serve for the wrong reasons. Paul wouldn't\n\ncondone, nor does God excuse, their motives, but we should\n\nbe glad if God uses their message, regardless of their motives.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for Your Word, the\n\nmessage of salvation to all who will read, hear, and believe.\n\nI pray that Your Spirit would awaken the hearts of all\n\npeople. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161690b1634ed000",
    "date_utc": "Mon, 05 Feb 2018 20:56:30 -0600",
    "subject": "Devo. for Feb. 6",
    "verse": "Paul says: \"For I live in eager expectation and hope that I will never do anything that will cause me shame; but that I will always be bold for Christ, as I have been in the past. \" (Phil. 1:20)",
    "reflection": "Paul's prayer was when he stood trial, he would speak courageously for Christ and not be timid or ashamed. Only faith in Christ could sustain Paul or us in a time of adversity.",
    "prayer": "Dear Heavenly Father, my prayer is like that of Paul, that I would always be bold for Christ, even in times of adversity. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nPaul says: _\"For I live in eager expectation and hope that I will _\n\n_never do anything that will cause me shame; but that I will always _\n\n_be bold for Christ, as I have been in the past.\" _(Phil. 1:20)\n\nTHOUGHT FOR TODAY:\n\nPaul's prayer was when he stood trial, he would speak courageously\n\nfor Christ and not be timid or ashamed. Only faith in Christ could\n\nsustain Paul or us in a time of adversity.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, my prayer is like that of Paul, that I would\n\nalways be bold for Christ, even in times of adversity. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1616e192025572dd",
    "date_utc": "Tue, 06 Feb 2018 20:29:56 -0600",
    "subject": "Devo. for Feb. 7",
    "verse": "Paul says, \"You must live in a manner worthy of the Good News about Christ, as citizens of heaven. \" (Phil. 1:27)",
    "reflection": "Paul encourages the believers of a church to be united as they stand side by side, working together for the Good News. How sad it is that so much time and effort is lost in some churches when fighting with one another takes place instead of uniting against the real opposition! It takes a courageous church to resist infighting and to maintain the common purpose of serving Christ.",
    "prayer": "Dear Heavenly Father, I pray that I would always be focused on maintaining the common purpose, that of serving Christ. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nPaul says, _\"You must live in a manner worthy of the Good News_\n\n_about Christ, as citizens of heaven.\" _(Phil. 1:27)\n\nTHOUGHT FOR TODAY:\n\nPaul encourages the believers of a church to be united as they\n\nstand side by side, working together for the Good News. How\n\nsad it is that so much time and effort is lost in some churches\n\nwhen fighting with one another takes place instead of uniting\n\nagainst the real opposition! It takes a courageous church to\n\nresist infighting and to maintain the common purpose of\n\nserving Christ.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I would always be focused\n\non maintaining the common purpose, that of serving Christ.\n\nAmen.\n\n\\\\",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1617351f6165be2f",
    "date_utc": "Wed, 07 Feb 2018 20:50:07 -0600",
    "subject": "Devo for Feb. 8",
    "verse": "\"For to you it has been granted on behalf of Christ, not only to believe in Him, but also to suffer for His sake. \" (Phil. 1:29)",
    "reflection": "Paul considered it a privilege to suffer for Christ. Today it isn't part of our nature to think that it is a privilege to suffer. Yet when we suffer, if we faithfully represent Christ, our message and our example affect us and others for good (see Acts 5:41)",
    "prayer": "Dear Lord, please forgive me for complaining about the trivial things that happen in my life. I am ashamed when I think of what You went through for my sins. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"For to you it has been granted on behalf of Christ, _\n\n_not only to believe in Him, but also to suffer for His _\n\n_sake.\" _(Phil. 1:29)\n\nTHOUGHT FOR TODAY:\n\nPaul considered it a privilege to suffer for Christ.\n\nToday it isn't part of our nature to think that it is\n\na privilege to suffer. Yet when we suffer, if we\n\nfaithfully represent Christ, our message and our\n\nexample affect us and others for good (see Acts 5:41)\n\nPRAYER FOR TODAY:\n\nDear Lord, please forgive me for complaining about\n\nthe trivial things that happen in my life. I am ashamed\n\nwhen I think of what You went through for my sins. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161757bc4d1da6a9",
    "date_utc": "Thu, 08 Feb 2018 06:55:01 -0600",
    "subject": "Devo. for Feb. 8",
    "verse": "\"For to you it has been granted on behalf of Christ, not only to believe in Him, but also to suffer for His sake. \" (Phil. 1:29)",
    "reflection": "Paul considers it a privilege to suffer for Christ. But today it isn't our nature to believe it to be natural to suffer. Yet when we suffer, if we faithfully represent Christ, our message and example affect us and others for good. (Acts 5:41)",
    "prayer": "Dear Lord, forgive me for my complaints, I have so little to complain about, when I think of how You suffered and died for my sins. Thank You Lord Jesus. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"For to you it has been granted on behalf of Christ, not only to_\n\n_believe in Him, but also to suffer for His sake.\" _(Phil. 1:29)\n\nTHOUGHT FOR TODAY:\n\nPaul considers it a privilege to suffer for Christ. But today it\nisn't\n\nour nature to believe it to be natural to suffer. Yet when we suffer,\n\nif we faithfully represent Christ, our message and example affect\n\nus and others for good. (Acts 5:41)\n\nPRAYER FOR TODAY:\n\nDear Lord, forgive me for my complaints, I have so little to\n\ncomplain about, when I think of how You suffered and died\n\nfor my sins. Thank You Lord Jesus. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161785fd0f2e3ed0",
    "date_utc": "Thu, 08 Feb 2018 20:23:21 -0600",
    "subject": "Devo. for Feb. 9",
    "verse": "\"Fulfill my joy by being like minded, having the same love, being of one accord, of one mind. \" (Phil. 2:2)",
    "reflection": "Many people, even Christians---live only to make a good impression on others or to please themselves. But selfishness brings discord. So Paul stresses spiritual unity, asking the Philippians to love one another and to be one in spirit and purpose. We demonstrate Christ's example when we put others first.",
    "prayer": "Dear Heavenly Father, instill in me a love, so that I may demonstrate a Christ like example. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Fulfill my joy by being like minded, having the same love,_\n\n_being of one accord, of one mind.\" _(Phil. 2:2)\n\nTHOUGHT FOR TODAY:\n\nMany people, even Christians---live only to make a good impression\n\non others or to please themselves. But selfishness brings discord.\n\nSo Paul stresses spiritual unity, asking the Philippians to love one\n\nanother and to be one in spirit and purpose. We demonstrate Christ's\n\nexample when we put others first.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, instill in me a love, so that I may\n\ndemonstrate a Christ like example. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1617d87ee71d1794",
    "date_utc": "Fri, 09 Feb 2018 20:25:16 -0600",
    "subject": "Devo for Feb. 10 -- folow-up of Feb. 9",
    "verse": "\"Let nothing be done through selfish ambition or conceit, but in lowliness of mind let each esteem others better then himself. \" (Phil. 2:3)",
    "reflection": "Selfishness can ruin a church, but genuine humility can build it. Being humble involves having a true perspective about ourselves (Ro. 12:3). It does not mean that we should put ourselves down. But let us consider the interests of others more important then our own this will link us with Christ who was a true example of humility.",
    "prayer": "Dear Heavenly Father, Help me to always be mindful of the interests of others as more important then my own, I pray in Jesus name. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Let nothing be done through selfish ambition or conceit,_\n\n_but in lowliness of mind let each esteem others better then _\n\n_himself.\" _(Phil. 2:3)\n\nTHOUGHT FOR TODAY:\n\nSelfishness can ruin a church, but genuine humility can build it.\n\nBeing humble involves having a true perspective about ourselves\n\n(Ro. 12:3). It does not mean that we should put ourselves down.\n\nBut let us consider the interests of others more important then our\n\nown this will link us with Christ who was a true example of humility.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, Help me to always be mindful of the\n\ninterests of others as more important then my own, I pray in\n\nJesus name. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16182b4645476956",
    "date_utc": "Sat, 10 Feb 2018 20:31:56 -0600",
    "subject": "Devo. for Feb. 11",
    "verse": "\"Let each of you look not only for his own interests, but also for the interests of others. \" (Phil. 2:4)",
    "reflection": "While we have freedom in Christ, we shouldn't exercise our freedom at the cost of hurting a Christian brother or sister. We are not to consider only ourselves, we must be sensitive to others.",
    "prayer": "Dear Heavenly Father, Help me to consider the feelings of others, thus being a positive witness for my Lord and Savior Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Let each of you look not only for his own interests,_\n\n_but also for the interests of others.\" _(Phil. 2:4)\n\nTHOUGHT FOR TODAY:\n\nWhile we have freedom in Christ, we shouldn't exercise our\n\nfreedom at the cost of hurting a Christian brother or sister.\n\nWe are not to consider only ourselves, we must be sensitive\n\nto others.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, Help me to consider the feelings of\n\nothers, thus being a positive witness for my Lord and Savior\n\nJesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1618a16caf055fab",
    "date_utc": "Mon, 12 Feb 2018 06:56:45 -0600",
    "subject": "Devo. for Feb. 12",
    "verse": "\"Your attitude should be the same as that of Christ Jesus. Though He was God, He did not demand and cling to His rights as God.\" (Phil. 2:5,6)",
    "reflection": "Jesus Christ was humble, willing to give up His rights in order to obey God and serve people. Like Christ, we should have a servants attitude. You have a choice, you can approach life expecting to be served, or you can look for opportunities to serve. (Mk. 10:45).",
    "prayer": "Dear Heavenly Father, I pray that Your Holy Spirit would guide my every thought so that my attitude would be pleasing to You. I pray this in the name of our Lord Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_ \"Your attitude should be the same as that of Christ Jesus. _\n\n_Though He was God, He did not demand and cling to His _\n\n_rights as God.\" _(Phil. 2:5, 6)\n\nTHOUGHTS FOR TODAY:\n\nJesus Christ was humble, willing to give up His rights in\n\norder to obey God and serve people. Like Christ, we should\n\nhave a servants attitude. You have a choice, you can approach\n\nlife expecting to be served, or you can look for opportunities\n\nto serve. (see Mk. 10:45).\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that Your Holy Spirit would\n\nguide my every thought so that my attitude would be pleasing\n\nto You. I pray this in the name of our Lord Jesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1618cfb3c2ac89af",
    "date_utc": "Mon, 12 Feb 2018 20:25:31 -0600",
    "subject": "Devo. for Feb. 13",
    "verse": "\"He made Himself nothing, He took the humble position of a slave, and appeared in human form. \" (Phil. 2:7)",
    "reflection": "Christ limited His power and knowledge. Jesus of Nazareth was subject to place, time, and many other human limitations. What made His humanity unique was His freedom from sin.",
    "prayer": "",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"He made Himself nothing, He took the humble position _\n\n_of a slave, and appeared in human form.\" _(Phil. 2:7)\n\nTHOUGHT FOR TODAY:\n\nChrist limited His power and knowledge. Jesus of\n\nNazareth was subject to place, time, and many other\n\nhuman limitations. What made His humanity unique\n\nwas His freedom from sin.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "1619224f9e95496d",
    "date_utc": "Tue, 13 Feb 2018 20:29:12 -0600",
    "subject": "Devo. for Feb. 14 (A Day For Flowers & Candy)",
    "verse": "\"LOVE LASTS FOREVER.\" (I Cor. 13:7a)",
    "reflection": "It is impossible to have this kind of Love unless God helps us set aside our own natural desires so that we can love and not expect anything in return. (A gift of flowers helps smoothen the bumps in the road of life too!) (AND ASKING FORGIVENESS ON OUR KNEES ALWAYS HELPS!) (THIS IS FOR US MEN)",
    "prayer": "",
    "reading": "",
    "original_content": "_\"LOVE LASTS FOREVER.\" _ (I Cor. 13:7a)\n\nTHOUGHT FOR TODAY:\n\nIt is impossible to have this kind of Love unless God\n\nhelps us set aside our own natural desires so that we\n\ncan love and not expect anything in return.\n\n(A gift of flowers helps smoothen the bumps in the road of life too!)\n\n(AND ASKING FORGIVENESS ON OUR KNEES ALWAYS HELPS!)\n\n(THIS IS FOR US MEN)",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "161975e384e8902e",
    "date_utc": "Wed, 14 Feb 2018 20:49:50 -0600",
    "subject": "Devo. for Feb. 15",
    "verse": "\"In human form He humbled Himself even further by dying a criminals death on a cross.\" (Phil. 2:8)",
    "reflection": "Jesus died as one who was cursed (Gal. 3:13). How amazing that the perfect man should die the most shameful death so that we would not have to face eternal death.",
    "prayer": "I thank You Lord for the sacrifice You made that I might have eternal life. I pray that I would always walk the path of life according to Your will. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"In human form He humbled Himself even further _\n\n_by dying a criminals death on a cross.\" _(Phil. 2:8)_ _\n\nTHOUGHT FOR TODAY:\n\nJesus died as one who was cursed (Gal. 3:13). How amazing\n\nthat the perfect man should die the most shameful death so\n\nthat we would not have to face eternal death.\n\nPRAYER FOR TODAY:\n\nI thank You Lord for the sacrifice You made that I might\n\nhave eternal life. I pray that I would always walk the path\n\nof life according to Your will. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1619c8004b72cacd",
    "date_utc": "Thu, 15 Feb 2018 20:44:51 -0600",
    "subject": "Devo. for Feb. 16",
    "verse": "(Because of Christ's willingness to go the way of the cross) \"God raised Him up to the heights of heaven and gave Him a name that is above every other name. \" (Phil. 2:9)",
    "reflection": "At the last judgment, EVEN THOSE who are condemned will recognize Jesus' authority and right to rule.",
    "prayer": "Dear Heavenly Father, I thank Your Son Jesus Christ for dying for my sins, and then preparing a place for me to spend eternity with you. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n(Because of Christ's willingness to go the way of the cross)\n\n\"_God raised Him up to the heights of heaven and gave Him_\n\n_a name that is above every other name.\" _(Phil. 2:9)\n\nTHOUGHT FOR TODAY:\n\nAt the last judgment, EVEN THOSE who are condemned\n\nwill recognize Jesus' authority and right to rule.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank Your Son Jesus Christ\n\nfor dying for my sins, and then preparing a place for\n\nme to spend eternity with you. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161a153d26a22f3d",
    "date_utc": "Fri, 16 Feb 2018 19:14:41 -0600",
    "subject": "Devo. for Feb. 17",
    "verse": "\"In everything you do, stay away from complaining and arguing.\" (Phil. 2:14)",
    "reflection": "Our life should be characterized by moral purity, patience, and peacefulness, so that we will \"shine brightly\" in a dark and depraved world. A transformed life is an effective witness to the power of God's Word. The question we need to ask ourselves is, \"Is my life shining brightly, or is it clouded by complaining?\" LET US SHINE OUT FOR GOD.",
    "prayer": "Forgive me Lord, when my life doesn't shine as it should for You Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"In everything you do, stay away from complaining and_\n\n_arguing.\" _(Phil. 2:14)\n\nTHOUGHT FOR TODAY:\n\nOur life should be characterized by moral purity, patience, and\n\npeacefulness, so that we will \"shine brightly\" in a dark and\n\ndepraved world. A transformed life is an effective witness to the\n\npower of God's Word. The question we need to ask ourselves\n\nis, \"Is my life shining brightly, or is it clouded by complaining?\"\n\nLET US SHINE OUT FOR GOD.\n\nPRAYER FOR TODAY\n\nForgive me Lord, when my life doesn't shine as it should for You\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161a6aac43cbfe21",
    "date_utc": "Sat, 17 Feb 2018 20:07:45 -0600",
    "subject": "Devo. for Feb. 18",
    "verse": "(Paul says) \"Even if my life has to be poured out like a drink offering to complete the sacrifice of your faithful service I will rejoice, and I want to share my joy with you all.\" (Phil. 2:17)",
    "reflection": "Paul regarded his life as a sacrifice. When you are totally committed to serving Christ, sacrificing to build the faith of others brings a joyous reward.",
    "prayer": "Forgive me Lord, when I fall short of serving You as I should. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n(Paul says) _\"Even if my life has to be poured out like a drink\noffering_\n\n_to complete the sacrifice of your faithful service I will rejoice,\nand I _\n\n_want to share my joy with you all.\" _(Phil. 2:17)\n\nTHOUGHT FOR TODAY:\n\nPaul regarded his life as a sacrifice. When you are totally committed\n\nto serving Christ, sacrificing to build the faith of others brings a\n\njoyous reward.\n\nPRAYER FOR TODAY:\n\nForgive me Lord, when I fall short of serving You as I should.\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161abe002518d8fd",
    "date_utc": "Sun, 18 Feb 2018 20:24:00 -0600",
    "subject": "Devo. for Feb. 19",
    "verse": "Paul says: \"I have no one like Timothy:\" (Phil. 2:20a)",
    "reflection": "Paul felt that most believers were too preoccupied with themselves, to spend time working for Christ. Don't let your schedule and concerns crowd out your love and Christian service to others.",
    "prayer": "Dear Lord, I pray that you would help me to keep focused on the needs of others, and less concerned about myself. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nPaul says: _\"I have no one like Timothy_:\" (Phil. 2:20a)\n\nTHOUGHT FOR TODAY:\n\nPaul felt that most believers were too preoccupied with\n\nthemselves, to spend time working for Christ. Don't let\n\nyour schedule and concerns crowd out your love and\n\nChristian service to others.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that you would help me to keep focused\n\non the needs of others, and less concerned about myself.\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161b11c2923d85b9",
    "date_utc": "Mon, 19 Feb 2018 20:47:48 -0600",
    "subject": "Devo. for Feb. 20",
    "verse": "Whatever happens, dear brothers and sisters, may the Lord give you joy, I never get tired of telling you this. I am doing this for your own good. (Phil. 3:1)",
    "reflection": "Paul reviewed the basics with the Philippian believers. The Bible is our safeguard both morally and theologically. When we read it individually or publicly in church, it alerts us to the corrections we need to make in our thoughts, attitudes and actions.",
    "prayer": "Dear Heavenly Father, help me to remember to always be faithful in the reading of Scriptures. For You know Lord how much I need the corrections that comes from Scriptures. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY;\n\n_\"Whatever happens, dear brothers and sisters, may the Lord_\n\n_give you joy, I never get tired of telling you this. I am doing _\n\n_this for your own good. _(Phil. 3:1)\n\nTHOUGHT FOR TODAY:\n\nPaul reviewed the basics with the Philippian believers.The Bible\n\nis our safeguard both morally and theologically. When we read it\n\nindividually or publicly in church, it alerts us to the corrections\nwe\n\nneed to make in our thoughts, attitudes and actions.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me to remember to always be faithful\n\nin the reading of Scriptures. For You know Lord how much I need\n\nthe corrections that comes from Scriptures. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161b647db3185b64",
    "date_utc": "Tue, 20 Feb 2018 20:53:38 -0600",
    "subject": "Devo. for Feb. 21",
    "verse": "\"We who worship God in the Spirit, are the only ones who are truly circumcised. We put no confidence in human efforts. Instead, we boast about what Christ Jesus has done for us.\" (Phil. 3:3)",
    "reflection": "It is easy to place more emphases on human effort then on eternal faith, but God values the attitude of our heart above all else. Don't judge people's spirituality by their fulfillment of duties or by their level of human activity. And don't think that you satisfy God by feverishly doing His work. God notices all you do for Him and will reward you for it, BUT only if it comes as a loving response to His free gift of salvation.",
    "prayer": "Dear Heavenly Father, I truly thank You for what Christ Jesus has done for us. I pray that the attitude of my heart would always be pleasing to You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"We who worship God in the Spirit, are the only ones who are_\n\n_truly circumcised. We put no confidence in human efforts. Instead,_\n\n_we boast about what Christ Jesus has done for us.\" _(Phil. 3:3)\n\nTHOUGHT FOR TODAY:\n\nIt is easy to place more emphases on human effort then on eternal\nfaith,\n\nbut God values the attitude of our heart above all else. Don't judge\npeople's\n\nspirituality by their fulfillment of duties or by their level of\nhuman activity.\n\nAnd don't think that you satisfy God by feverishly doing His work.\nGod\n\nnotices all you do for Him and will reward you for it, BUT only if it\ncomes\n\nas a loving response to His free gift of salvation.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I truly thank You for what Christ Jesus has\ndone\n\nfor us. I pray that the attitude of my heart would always be pleasing\nto\n\nYou. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161bb99797583856",
    "date_utc": "Wed, 21 Feb 2018 21:40:53 -0600",
    "subject": "Devo for Feb. 22",
    "verse": "Verses 4-6 give us some insight as to Paul's prior life before he came face to face with Christ, on the road as he was on his way to arrest more Christians. He was so sure of his self righteousness that he was willing to match his life with the life of any Pharisees. After his meeting with Christ a definite change took place in him. this is his statement after meeting with Christ, \"What a priceless gain of knowing Christ.\"",
    "reflection": "Is this your testimony? Or like the old Paul are you depending upon your good works? A religion without faith in the finished work of Christ is a religion without any hope of eternal life. . .",
    "prayer": "I thank You Lord, for the promise of eternal life that is ours by faith in our Lord Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nVerses 4-6 give us some insight as to Paul's prior life before he\n\ncame face to face with Christ, on the road as he was on his way\n\nto arrest more Christians. He was so sure of his self righteousness\n\nthat he was willing to match his life with the life of any Pharisees.\n\nAfter his meeting with Christ a definite change took place in him.\n\nthis is his statement after meeting with Christ, \"What a priceless\n\ngain of knowing Christ.\"\n\nTHOUGHT FOR TODAY:\n\nIs this your testimony? Or like the old Paul are you depending\n\nupon your good works? A religion without faith in the finished\n\nwork of Christ is a religion without any hope of eternal life. . .\n\nPRAYER FOR TODAY.\n\nI thank You Lord, for the promise of eternal life that is ours\n\nby faith in our Lord Jesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161c08d9b81291c1",
    "date_utc": "Thu, 22 Feb 2018 20:46:01 -0600",
    "subject": "Devo. for Feb. 23",
    "verse": "Paul says: \"I once thought all these things were very important, but I consider them worthless because of what Christ has done.\" (Phil. 3:7)",
    "reflection": "When Paul spoke of \"these things,\" he was referring to his credentials, credits, and successes. After showing that he could beat the Judaizers at their own game (being proud of who they were and what they had done. ) Let us be careful of considering past achievements so important that they get in the way of our relationship with Christ.",
    "prayer": "Dear Lord, help me to always consider any thing I have done as worthless in comparison to what Christ as done for me and the rest of the world. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nPaul says: _\"I once thought all these things were very important,_\n\n_but I consider them worthless because of what Christ has done.\" _\n\n(Phil. 3:7)\n\nTHOUGHT FOR TODAY:\n\nWhen Paul spoke of \"these things,\" he was referring to his\ncredentials,\n\ncredits, and successes. After showing that he could beat the\nJudaizers\n\nat their own game (being proud of who they were and what they had\n\ndone.) Let us be careful of considering past achievements so\nimportant\n\nthat they get in the way of our relationship with Christ.\n\nPRAYER FOR TODAY:\n\nDear Lord, help me to always consider any thing I have done\n\nas worthless in comparison to what Christ as done for me and\n\nthe rest of the world. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161c59ca487f9648",
    "date_utc": "Fri, 23 Feb 2018 20:20:33 -0600",
    "subject": "Devo. for Feb. 24",
    "verse": "\"Yes everything else is worthless when compared with the priceless gain of knowing Christ Jesus my Lord. I have discarded everything else, counting it all garbage, so that I may have Christ.\" (Phil. 3:8)",
    "reflection": "After Paul considered everything he had accomplished in his life, he said that it was all \"worthless\" when compared with the greatness of knowing Christ. A person's relationship with Christ is more important than anything else. Is it time to reconsider your values? If your priorities are wrong, how will you reorder them?",
    "prayer": "Dear Lord, help me each day to prioritize my values, so that I will regain a correct perspective of my relationship with my Savior. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Yes everything else is worthless when compared with the_\n\n_ priceless gain of knowing Christ Jesus my Lord. I have _\n\n_discarded everything else, counting it all garbage, so that _\n\n_I may have Christ.\" _(Phil. 3:8)\n\nTHOUGHT FOR TODAY:\n\nAfter Paul considered everything he had accomplished in\n\nhis life, he said that it was all \"worthless\" when compared\n\nwith the greatness of knowing Christ. A person's relationship\n\nwith Christ is more important than anything else. Is it time\n\nto reconsider your values? If your priorities are wrong, how\n\nwill you reorder them?\n\nPRAYER FOR TODAY:\n\nDear Lord, help me each day to prioritize my values, so that\n\nI will regain a correct perspective of my relationship with my\n\nSavior. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161cacf5898a335b",
    "date_utc": "Sat, 24 Feb 2018 20:34:02 -0600",
    "subject": "Devo for Feb. 25",
    "verse": "(follow up of vs. 8) \"I no longer count on my own goodness or my own ability to obey God's law, but I trust Christ to save me. For God's way of making us right with Himself depends on faith.\" (Phil. 3:9)",
    "reflection": "No amount of law-keeping, self-improvement, discipline, or religious effort can make us right with God. Righteousness comes only from God. We are made righteous (receive right-standing with Him) by trusting in Christ. He exchanges our sin and short-comings for His complete righteousness.",
    "prayer": "Dear Lord, I must thank You once again for all that You have done for me through the sacrifice of Your Son, to pay for my sins. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY: _ (follow up of vs. 8)_\n\n_\"I no longer count on my own goodness or my own ability to obey\nGod's_\n\n_law, but I trust Christ to save me. For God's way of making us right\nwith_\n\n_Himself depends on faith.\" _(Phil. 3:9)\n\nTHOUGHT FOR TODAY:\n\nNo amount of law-keeping, self-improvement, discipline, or religious\n\neffort can make us right with God. Righteousness comes only from\n\nGod. We are made righteous (receive right-standing with Him) by\n\ntrusting in Christ. He exchanges our sin and short-comings for His\n\ncomplete righteousness.\n\nPRAYER FOR TODAY:\n\nDear Lord, I must thank You once again for all that You\n\nhave done for me through the sacrifice of Your Son, to\n\npay for my sins. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161cfd98753a7dc0",
    "date_utc": "Sun, 25 Feb 2018 20:03:15 -0600",
    "subject": "Devo. for Feb. 26 (follow-up of 25)",
    "verse": "\"As a result, I can really know Christ and experience the mighty power that raised Him from the dead. I can learn what it means to suffer with Him, sharing in His death.\" (Phil. 3:10)",
    "reflection": "Paul gave up everything - family, friendship, and freedom - in order to know Christ and His resurrection power. We too, have access to this knowledge and this power, but we may have to make sacrifices to enjoy it fully. What ever it is, knowing Christ is more than worth the sacrifice.",
    "prayer": "Dear Heavenly Father, I thank You that Your crucifixion marks the death of my old sinful nature. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"As a result, I can really know Christ and experience the mighty_\n\n_power that raised Him from the dead. I can learn what it means_\n\n_to suffer with Him, sharing in His death.\" _(Phil. 3:10)\n\nTHOUGHT FOR TODAY:\n\nPaul gave up everything- - family, friendship, and freedom - in order to know Christ and His resurrection power. We too,\n\nhave access to this knowledge and this power, but we may\n\nhave to make sacrifices to enjoy it fully. What ever it is,\n\nknowing Christ is more than worth the sacrifice.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You that Your crucifixion\n\nmarks the death of my old sinful nature. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161d574a5def2221",
    "date_utc": "Mon, 26 Feb 2018 22:10:47 -0600",
    "subject": "Devo. for Feb. 27",
    "verse": "\" I strain to reach the end of the race and receive the prize for which God, through Christ Jesus, is calling us up to heaven.\" (Phil 3:14)",
    "reflection": "If our hope is in Christ, we can let go of past guilt and look forward to what God will help us become. Don't dwell on your past, instead, grow in the knowledge of God by concentrating on your relationship with Him now.",
    "prayer": "Dear Lord, I pray that I would continue to grow in the knowledge of my Heavenly Father and also grow in a deeper relationship with Him through the guidance of the Holy Spirit. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\" I strain to reach the end of the race and receive the prize_\n\n_for which God, through Christ Jesus, is calling us up to_\n\n_heaven.\" _(Phil 3:14)\n\nTHOUGHT FOR TODAY:\n\nIf our hope is in Christ, we can let go of past guilt and look\n\nforward to what God will help us become. Don't dwell on\n\nyour past, instead, grow in the knowledge of God by\n\nconcentrating on your relationship with Him now.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would continue to grow in the\n\nknowledge of my Heavenly Father and also grow in a\n\ndeeper relationship with Him through the guidance of\n\nthe Holy Spirit. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161da3268fee6c96",
    "date_utc": "Tue, 27 Feb 2018 20:16:32 -0600",
    "subject": "Devo. for Feb. 28",
    "verse": "Paul's advice: \"Mature Christians, must be sure to obey the truth you have already learned. \" (Phil. 3:15a &16a)",
    "reflection": "Christian maturity involves acting on the guidance that you have already received. We can always make excuses that we still have much to learn. But the instructions to us is to live up to what we already know and live out what we have already learned. We do not have to be sidetracked. by an unending search for the truth.",
    "prayer": "Dear Lord, I pray that Your Spirit would help me to continue growing in my knowledge of You. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nPaul's advice:_ \"Mature Christians, must be sure to obey _\n\n_the truth you have already learned.\" _(Phil. 3:15a &16a)\n\nTHOUGHT FOR TODAY:\n\nChristian maturity involves acting on the guidance that you\n\nhave already received. We can always make excuses that we\n\nstill have much to learn. But the instructions to us is to live\n\nup to what we already know and live out what we have already\n\nlearned. We do not have to be sidetracked.by an unending\n\nsearch for the truth.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that Your Spirit would help me to continue\n\ngrowing in my knowledge of You. . .Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161df65b49a23cf0",
    "date_utc": "Wed, 28 Feb 2018 20:30:40 -0600",
    "subject": "Devo. for Mar. 1",
    "verse": "\"We are citizens of heaven where Jesus Christ lives. And we are eagerly waiting for Him to return as our Savior. \" (Phil. 3:20)",
    "reflection": "One day every born again Christian will experience all the special privileges of our heavenly citizenship because we belong to Christ. Let us not be so tide to this life that we would be sorry to see Christ return.",
    "prayer": "Dear Heavenly Father, I am so grateful that Christ paid for my sins so I now have a place in heaven already prepared for me. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"We are citizens of heaven where Jesus Christ lives. And we _\n\n_are eagerly waiting for Him to return as our Savior.\" _(Phil. 3:20)\n\nTHOUGHT FOR TODAY:\n\nOne day every born again Christian will experience all the\n\nspecial privileges of our heavenly citizenship because we\n\nbelong to Christ. Let us not be so tide to this life that we\n\nwould be sorry to see Christ return.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I am so grateful that Christ paid for\n\nmy sins so I now have a place in heaven already prepared\n\nfor me. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]