[
  {
    "message_id": "160b4a5acb234a9c",
    "date_utc": "Mon, 01 Jan 2018 20:14:05 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul says:\"Be renewed is the spirit of your mind, so that you may put on the new man which was created according to God, in true righteousness and holiness.\" (Eph. 4:23, 24)",
    "reflection": "When we decide to follow Christ we must put on a new nature, head in a new direction, and have a new way of thinking, that the Holy Spirit gives.",
    "prayer": "I thank You Lord for the day I decided to follow Christ, BUT I still need Your Spirit's help each and every day so, I pray that I will be sensitive and obedient to Your Spirit's leading each day. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nPaul says:_\"Be renewed is the spirit of your mind, so that _\n\n_you may put on the new man which was created according _\n\n_to God, in true righteousness __and holiness.\" _(Eph. 4:23, 24)\n\nTHOUGHT FOR TODAY:\n\nWhen we decide to follow Christ we must put on a new nature,\n\nhead in a new direction, and have a new way of thinking, that\n\nthe Holy Spirit gives.\n\nPRAYER FOR TODAY:\n\nI thank You Lord for the day I decided to follow Christ,\n\nBUT I still need Your Spirit's help each and every day so,\n\nI pray that I will be sensitive and obedient to Your Spirit's\n\nleading each day. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160b9cd3ba20b471",
    "date_utc": "Tue, 02 Jan 2018 20:15:23 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Be angry and do not sin,\" Do not let the sun go down on your wrath, nor give place to the devil. (Eph. 4:26, 27)",
    "reflection": "The Bible doesn't tell us we shouldn't feel anger, BUT IT points out that it is important to handle our anger properly. If we keep it inside, it can cause us to become bitter and destroy us from within. Paul says to deal with our anger immediately, in a way that builds relationships rather than destroying them. Don't let the day end before you begin to work on mending your relationship.",
    "prayer": "O Lord, please forgive me, I am often guilty of bottling up anger within. Help me to properly handle my anger toward those who have ruffled my feathers so to speak. Help me build a more compassionate spirit. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Be angry and do not sin,\" Do not let the sun go_\n\n_down on your wrath, nor give place to the devil._\n\n(Eph. 4:26, 27)\n\nTHOUGHT FOR TODAY:\n\nThe Bible doesn't tell us we shouldn't feel anger, BUT IT\n\npoints out that it is important to handle our anger properly.\n\nIf we keep it inside, it can cause us to become bitter and\n\ndestroy us from within. Paul says to deal with our anger\n\nimmediately, in a way that builds relationships rather than\n\ndestroying them. Don't let the day end before you begin to\n\nwork on mending your relationship.\n\nPRAYER FOR TODAY:\n\nO Lord, please forgive me, I am often guilty of bottling up\n\nanger within. Help me to properly handle my anger toward\n\nthose who have ruffled my feathers so to speak. Help me\n\nbuild a more compassionate spirit. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160beee37e593d11",
    "date_utc": "Wed, 03 Jan 2018 20:09:31 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Let no corrupt word proceed out of your mouth, but what is good for necessary edification. that it may impart grace to the hearer.\" (Eph. 4:29)",
    "reflection": "Paul warns against unwholesome language, bitterness, improper use of anger, harsh words, slander, and bad attitudes toward others. Instead we should be forgiving just as God has forgiven us. . .",
    "prayer": "Dear Heavenly Father, I pray that the words that I speak would always be edifying and pleasing to You. I pray this in the name of our Lord Jesus Christ. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Let no corrupt word proceed out of your mouth,_\n\n_but what is good for necessary edification. that it_\n\n_may impart grace to the hearer.\" _(Eph. 4:29)\n\nTHOUGHT FOR TODAY:\n\nPaul warns against unwholesome language, bitterness,\n\nimproper use of anger, harsh words, slander, and bad\n\nattitudes toward others. Instead we should be forgiving\n\njust as God has forgiven us. . .\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that the words that I\n\nspeak would always be edifying and pleasing to You.\n\nI pray this in the name of our Lord Jesus Christ. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160c4131977e32c0",
    "date_utc": "Thu, 04 Jan 2018 20:07:54 -0600",
    "subject": "thoughts to live by",
    "verse": "Do not grieve the Holy Spirit of God, by whom you were sealed for the day of redemption.\" (Eph. 4:30)",
    "reflection": "The presence of the Holy Spirit within us demonstrates the genuineness of our faith, and proves that we are God's children, and secures eternal life for us. The Spirit's power works in us to transform us now, for that day of redemption.",
    "prayer": "Dear Heavenly Father, I pray that the power of Your Spirit will continue His work in my life so that I may become a more faithful believer. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Do not grieve the Holy Spirit of God, by whom you _\n\n_were sealed for the day of redemption.\" _(Eph. 4:30)\n\nTHOUGHT FOR TODAY:\n\nThe presence of the Holy Spirit within us demonstrates\n\nthe genuineness of our faith, and proves that we are God's\n\nchildren, and secures eternal life for us. The Spirit's power\n\nworks in us to transform us now, for that day of redemption.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that the power of Your Spirit\n\nwill continue His work in my life so that I may become a\n\nmore faithful believer. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160c94d3b4772bf4",
    "date_utc": "Fri, 05 Jan 2018 20:29:30 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Let all bitterness, wrath, anger, clamor, and evil speaking be put away from you, with all malice.\" (Eph. 4:31)",
    "reflection": "The main thought for every believer is to rid ourselves of all evil practices and immorality. If we have made such a commitment to Christ, are we remaining true to it?",
    "prayer": "Dear Lord, I pray that Your Spirit would help me remain true to my commitment, I pray this in Jesus name. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Let all bitterness, wrath, anger, clamor, and evil_\n\n_speaking be put away from you, with all malice.\"_\n\n(Eph. 4:31)\n\nTHOUGHT FOR TODAY:\n\nThe main thought for every believer is to rid ourselves\n\nof all evil practices and immorality. If we have made\n\nsuch a commitment to Christ, are we remaining true to it?\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that Your Spirit would help me remain\n\ntrue to my commitment, I pray this in Jesus name. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160ce4bcac9fcfe8",
    "date_utc": "Sat, 06 Jan 2018 19:46:02 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Be kind to each other, tenderhearted, forgiving one another, just as God through Christ has forgiven you.\" (Eph. 4:32)",
    "reflection": "As we come to understand God's mercy we will want to become like Him. Having received forgiveness we should be willing to pass it on to others. Those who are unwilling to forgive have NOT become one with Christ, who was willing to forgive even those who crucified Him (Luke 23:34).",
    "prayer": "Dear Lord, forgive me for not always being as kind or forgiving as I should be to others. I thank You for being forgiving, because it was due to my sins You went to the cross and died. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Be kind to each other, tenderhearted, forgiving one _\n\n_another, just as God through Christ has forgiven you.\"_\n\n(Eph. 4:32)\n\nTHOUGHT FOR TODAY:\n\nAs we come to understand God's mercy we will want to\n\nbecome like Him. Having received forgiveness we should\n\nbe willing to pass it on to others. Those who are unwilling\n\nto forgive have NOT become one with Christ, who was willing\n\nto forgive even those who crucified Him (Luke 23:34).\n\nPRAYER FOR TODAY:\n\nDear Lord, forgive me for not always being as kind or\n\nforgiving as I should be to others. I thank You for being\n\nforgiving, because it was due to my sins You went to the\n\ncross and died. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160d3a48b5c65c99",
    "date_utc": "Sun, 07 Jan 2018 20:41:04 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Follow God's example in everything you do, because you are God's dear children.\" (Eph. 5:1))",
    "reflection": "\"Follow Gods example:\" This raises a great question. How can we be perfect? Lets look at 4 areas in which we need to grow: (1) character (2) holiness (3) maturity (4) love Now we can be perfect, if our behavior is appropriate for our maturity level--yet with room to grow. Our tendency to sin MUST NEVER deter us from trying to become more like Christ.",
    "prayer": "Dear Lord I pray that I would be submissive to Your Holy Spirit's guidance so that I might grow in character, holiness, maturity, and love, helping me to become more like Christ. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Follow God's example in everything you do, because you are _\n\n_God's dear children.\" _(Eph. 5:1))\n\nTHOUGHT FOR TODAY:\n\n_\"Follow Gods example:\" _This raises a great question. How can\n\nwe be perfect? Lets look at 4 areas in which we need to grow:\n\n_(1) character_ _ (2) holiness (3) maturity_ (4) _love _Now we can\n\n_be perfect, if our behavior is appropriate for our maturity\nlevel--yet _\n\nwith room to grow. Our tendency to sin MUST NEVER deter us from\n\ntrying to become more like Christ.\n\nPRAYER FOR TODAY:\n\nDear Lord I pray that I would be submissive to Your Holy Spirit's\n\nguidance so that I might grow in character, holiness, maturity, and\n\nlove, helping me to become more like Christ. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160d8d07ba1b3e49",
    "date_utc": "Mon, 08 Jan 2018 20:47:10 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Live a life filled with love for others, following the example of Christ who loved you and gave His life as a sacrifice to take away your sins.\" (Eph. 5:2)",
    "reflection": "We are to love others based on Jesus' sacrificial love for us. such love will not only bring unbelievers to Christ, it will also keep believers strong and united in a world hostile to God. Jesus was a living example of God's love, as we are to be an example of Jesus' love.",
    "prayer": "O Lord of love, grace, and mercy, I thank You for Your love which caused You to sacrifice Your one and only son, that I might have eternal life. I pray that my life would become an example of Your love. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Live a life filled with love for others, following the example of\nChrist _\n\n_who loved you and gave His life as a sacrifice to take away your\nsins.\" _\n\n(Eph. 5:2)\n\nTHOUGHT FOR TODAY:\n\nWe are to love others based on Jesus' sacrificial love for us. such\nlove\n\nwill not only bring unbelievers to Christ, it will also keep\nbelievers\n\nstrong and united in a world hostile to God. Jesus was a living\nexample\n\nof God's love, as we are to be an example of Jesus' love.\n\nPRAYER FOR TODAY:\n\nO Lord of love, grace, and mercy, I thank You for Your love which\n\ncaused You to sacrifice Your one and only son, that I might have\n\neternal life. I pray that my life would become an example of Your\n\nlove. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160ddd7495167c79",
    "date_utc": "Tue, 09 Jan 2018 20:12:42 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Let there be no sexual immorality, impurity, or greed be found among you. Such sins have no place among God's people.\" (Eph. 5:3)",
    "reflection": "We should consider ourselves dead to sexual immorality, impurity, or greed. We must make a conscious, decision each day to remove anything that supports or feeds these desires. To do this we must rely on the Holy Spirit's power.",
    "prayer": "Dear Heavenly Father, once again I have to plead with You for the guidance of Your Holy Spirit's power to help me to avoid the sins of immorality, impurity, and greed. I ask this in the name of our Lord and Savior Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Let there be no sexual immorality, impurity, or greed be found _\n\n_among you. Such sins have no place among God's people.\" _(Eph. 5:3)\n\nTHOUGHT FOR TODAY:\n\nWe should consider ourselves dead to sexual immorality, impurity,\n\nor greed. We must make a conscious, decision each day to remove\n\nanything that supports or feeds these desires. To do this we must\n\nrely on the Holy Spirit's power.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, once again I have to plead with You\n\nfor the guidance of Your Holy Spirit's power to help me to\n\navoid the sins of immorality, impurity, and greed. I ask this\n\nin the name of our Lord and Savior Jesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160e3099fbd4b673",
    "date_utc": "Wed, 10 Jan 2018 20:25:47 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul says\"you can be sure that no immoral, impure, or greedy person will inherit the Kingdom of Christ and God. For a greedy person is really an idolater who worships the things of this world.\" (Eph. 5:5)",
    "reflection": "Christians come out of all kinds of different backgrounds including these just mentioned. They may struggle with evil desires, but they should not continue in these practices. In I Corinthians 6:11 Paul clearly states that even those who sin in these ways can have their lives changed by Christ.",
    "prayer": "Dear Heavenly Father, forgive me when I point my finger at those who live in sin openly, for I know that in Your eyes I am a sinner only saved by Your grace. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nPaul says _\"you can be sure that no immoral, impure, or greedy_\n\n_person will inherit the Kingdom of Christ and God. For a greedy_\n\n_person is really an idolater who worships the things of this world.\"\n_\n\n(Eph. 5:5)\n\nTHOUGHT FOR TODAY:\n\nChristians come out of all kinds of different back-grounds including\nthese\n\njust mentioned. They may struggle with evil desires, but they should\nnot\n\ncontinue in these practices. In I Cor. 6:11 Paul clearly states that\neven those\n\nwho sin in these ways can have their lives changed by Christ.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, forgive me when I point my finger at those\n\nwho live in sin openly, for I know that in Your eyes I am a sinner\n\nonly saved by Your grace. . .Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160e83989844928b",
    "date_utc": "Thu, 11 Jan 2018 20:36:13 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Don't be fooled by those who try to excuse these sins; (immorality, impurity, greed) for the terrible anger of God comes upon those who disobey.\" (Eph. 5:6)",
    "reflection": "God cannot tolerate sin because His nature is morally perfect. He cannot ignore or condone willful rebellion. God wants to remove the sin and restore the sinner, and He is able to, as long as the sinner does not stubbornly distort or reject the truth. Don't suppress the truth about Him merely to protect your own life style.",
    "prayer": "Dear Heavenly Father, I pray that I would never fall prey to the sins of immorality, impurity, or greed. But I know that I am a sinner saved only by Your Grace. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n\"_Don't be fooled by those who try to excuse these sins; _\n\n(immorality, impurity, greed) _for the terrible anger of God comes_\n\n_upon those who disobey.\" _(Eph. 5:6)\n\nTHOUGHT FOR TODAY:\n\nGod cannot tolerate sin because His nature is morally perfect. He\n\ncannot ignore or condone willful rebellion. God wants to remove\n\nthe sin and restore the sinner, and He is able to, as long as the\nsinner\n\ndoes not stubbornly distort or reject the truth. Don't suppress the\ntruth\n\nabout Him merely to protect your own life style.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I would never fall prey to the\n\nsins of immorality, impurity, or greed. But I know that I am a\n\nsinner saved only by Your Grace. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160ed84698129324",
    "date_utc": "Fri, 12 Jan 2018 21:16:06 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Though your hearts were once full of darkness, now you are full of light from the Lord and your behavior should show it.\" (Eph. 5:8)",
    "reflection": "As people filled with light, our actions should reflect our faith. We should live beyond reproach morally so that we will reflect God's goodness to others. Jesus stressed this truth in the Sermon on the Mount. (Matthew 5:15, 16)",
    "prayer": "Dear Lord, I pray that my behavior would be pleasing to You. I pray that my behavior would always reflect my faith, and that it would always reflect Your goodness to others. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Though your hearts were once full of darkness, now you are _\n\n_full of light from the Lord and your behavior should show it.\"_\n\n(Eph. 5:8)\n\nTHOUGHT FOR TODAY:\n\nAs people filled with light, our actions should reflect our faith.\n\nWe should live beyond reproach morally so that we will reflect\n\nGod's goodness to others. Jesus stressed this truth in the Sermon\n\non the Mount. (Mt. 5:15, 16)\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that my behavior would be pleasing to You.\n\nI pray that my behavior would always reflect my faith, and that\n\nit would always reflect Your goodness to others. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160f27a152cb2e64",
    "date_utc": "Sat, 13 Jan 2018 20:22:55 -0600",
    "subject": "thoughts to live by",
    "verse": "\" Take no part in worthless deeds OF evil AND darkness, instead, rebuke and expose them.\" (Eph. 5; 11)",
    "reflection": "It is important to AVOID worthless deeds of evil, but we are to go further, Paul says we are to EXPOSE THEM, because our silence may be interpreted as approval. God needs people who will take a stand.",
    "prayer": "Dear Heavenly Father, I pray that I would always be ready to be a witness for You, and that I would always be ready to defend Your name. I pray these things in Jesus name. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\" Take no part in worthless deeds OF evil AND darkness,_\n\n_instead, rebuke and expose them.\" _(Eph. 5;11)\n\nTHOUGHT FOR TODAY:\n\nIt is important to AVOID worthless deeds of evil, but we are\n\nto go further, Paul says we are to EXPOSE THEM, because our\n\nsilence may be interpreted as approval. God needs people\n\nwho will take a stand.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I would always be ready\n\nto be a witness for You, and that I would always be ready\n\nto defend Your name. I pray these things in Jesus name. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160f78e8c675e891",
    "date_utc": "Sun, 14 Jan 2018 20:03:23 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Be careful how you live, not as fools, but as those who are wise. Make the most of every opportunity for doing good in these evil days. (Eph. 5:15, 16)",
    "reflection": "You would almost think Paul had been listening to CNN. We surely are living in evil days. We need to be careful to keep our standards high, and do good wherever we can, BUT we also need to be wise and keep our focus on our Savior, who came to pay for the sins of the whole world.",
    "prayer": "Dear Heavenly Father, You know better then we that we do live in evil days. I thank You, for providing for us a Savior who willing paid the penalty for my sins. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Be careful how you live, not as fools, but as those who are wise. _\n\n_Make the most of every opportunity for doing good in these evil _\n\n_days. _(Eph. 5:15, 16)\n\nTHOUGHT FOR TODAY:\n\nYou would almost think Paul had been listening to CNN.\n\nWe surely are living in evil days. We need to be careful to\n\nkeep our standards high, and do good wherever we can, BUT\n\nwe also need to be wise and keep our focus on our Savior,\n\nwho came to pay for the sins of the whole world.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, You know better then we that we do\n\nlive in evil days. I thank You, for providing for us a Savior\n\nwho willing paid the penalty for my sins. . .Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "160fcfbfd22726e3",
    "date_utc": "Mon, 15 Jan 2018 21:21:01 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Don't act thoughtlessly, try to understand what the Lord wants you to do.\" (Eph. 5:17)",
    "reflection": "Being made holy is the process of living the Christian life. It is part of the Holy Spirit work in us conforming us to the image of Christ. (Romans 8:29)",
    "prayer": "Dear heavenly Father, forgive me for not always being in tune with Your Spirit's leading. I pray that I would become more sensitive to Your Spirit attempting to conform me into the image of Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Don't act thoughtlessly, try to understand what the _\n\n_Lord wants you to do.\" _(Eph. 5:17)\n\nTHOUGHT FOR TODAY:\n\nBeing made holy is the process of living the Christian life.\n\nIt is part of the Holy Spirit work in us conforming us to the\n\nimage of Christ. (Ro. 8:29)\n\nPRAYER FOR TODAY:\n\nDear heavenly Father, forgive me for not always being in\n\ntune with Your Spirit's leading. I pray that I would become\n\nmore sensitive to Your Spirit attempting to conform me into\n\nthe image of Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161022b70a1eac81",
    "date_utc": "Tue, 16 Jan 2018 21:30:57 -0600",
    "subject": "thoughts to live by",
    "verse": "\"SUBMIT TO ONE ANOTHER OUT OF REVERENCE TO CHRIST.\" (EPH. 5:21)",
    "reflection": "Submitting to another person is often a misunderstood concept. It does not mean becoming a door mat. Christ at whose Name\"every knee will bow, in heaven and on earth and under the earth\" (Philippians 2:10). submitted His will to the Father, and we honor Christ, by following His example. When we submit to God, we become more willing to obey His command to submit to others.",
    "prayer": "Dear Heavenly Father, I pray that I would have a more submissive spirit, so that I would develop a more Christ-like image. I pray that I would become more sensitive to Your Spirit's leading, so that I would be open to Your every command. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"SUBMIT TO ONE ANOTHER OUT OF REVERENCE TO CHRIST.\"_\n\n(EPH. 5:21)\n\nTHOUGHT FOR TODAY:\n\nSubmitting to another person is often a misunderstood concept.\n\nIt does not mean becoming a door mat. Christ at whose Name\n\n_\"every knee will bow, in heaven and on earth and under the_\n\n_earth_\" (Phil. 2:10)...submitted His will to the Father, and we\n\nhonor Christ, by following His example. When we submit to\n\nGod, we become more willing to obey His command to submit\n\nto others.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I would have a more submissive\n\nspirit, so that I would develop a more Christ-like image. I pray\n\nthat I would become more sensitive to Your Spirit's leading, so\n\nthat I would be open to Your every command. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1610707019621b1c",
    "date_utc": "Wed, 17 Jan 2018 20:09:15 -0600",
    "subject": "thoughts to live by",
    "verse": "(Eph. 5:22-32) What is being said in these verses is:\"Husband and wives should have a Spirit-guided relations.\" Paul sums up what is said in these verses in Vs. 33:\"So again I say, each man must love his wife as he loves himself, and the wife must respect her husband.\"",
    "reflection": "If you read all the verses, what you should surmise is that you should care for your spouse as you care for yourself, learning to anticipate his or her needs, helping them to become all that they can be.",
    "prayer": "Dear Lord, I pray that I would always be in tune with Your Spirit's guidance so that my relationship with my wife and others would be one of love and respect. . . Amen.",
    "reading": "",
    "original_content": "VERSES FOR TODAY:\n\n(Eph. 5:22-32) What is being said in these verses is:\"Husband and\n\nwives should have a Spirit-guided relations.\" Paul sums up what is\n\nsaid in these verses in Vs. 33: _\"So again I say, each man must love\n_\n\n_his wife as he loves himself, and the wife must respect her\nhusband.\"_\n\nTHOUGHT FOR TODAY:\n\nIf you read all the verses, what you should surmise is that you\nshould\n\ncare for your spouse as you care for yourself, learning to anticipate\nhis\n\nor her needs, helping them to become all that they can be.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray that I would always be in tune with Your Spirit's\n\nguidance so that my relationship with my wife and others would be\n\none of love and respect.. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1610c19724b7db3d",
    "date_utc": "Thu, 18 Jan 2018 19:47:30 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Honor Your father and mother. This is the first of the commandments, that ends with a promise,\" (Eph. 6:2)",
    "reflection": "There is a difference between obeying and honoring. To obey, means to do what one is told; to honor means to respect and love. Children are to obey while under their parent's care, but the responsibility to honor parents is for life.",
    "prayer": "I thank You Lord, for the good example my parents set for me. I pray that my life would be a good example for my family members to follow. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Honor Your father and mother. This is the first of the _\n\n_commandments, that ends with a promise,\"_ ((Eph. 6:2)\n\nTHOUGHT FOR TODAY:\n\nThere is a difference between obeying and honoring. To\n\nobey, means to do what one is told; to honor means to\n\nrespect and love. Children are to obey while under their\n\nparent's care, but the responsibility to honor parents is\n\nfor life.\n\nPRAYER FOR TODAY:\n\nI thank You Lord, for the good example my parents set for me.\n\nI pray that my life would be a good example for my family\n\nmembers to follow. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161114201a15f8d1",
    "date_utc": "Fri, 19 Jan 2018 19:49:54 -0600",
    "subject": "thoughts to live by",
    "verse": "\"The promise for honoring your father and mother. you will live a long life, full of blessings.\" (Eph. 6:3)",
    "reflection": "Obeying our parents is our main task when we are young, but honoring should continue even beyond their death. One way to honor our parents is to provide for them in times of financial need or when they are unable to care for themselves. One of the best ways to honor them is to pass on their godly values to our children. (Question) Are you truly living in a way that brings honor to your parents?",
    "prayer": "Dear Heavenly Father, help me by the power of Your Holy Spirit to honor my parents as Christ honored You by fulfilling Your will while He walked this earth, even to the point of suffering for the sins of the world. Help me to mirror the godly values of my parents to my children. . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"The promise for honoring your father and mother. you will live a\nlong _\n\n_life, full of blessings.\" _(Eph. 6:3)\n\nTHOUGHT FOR TODAY:\n\nObeying our parents is our main task when we are young, but honoring\n\nshould continue even beyond their death. One way to honor our parents\n\nis to provide for them in times of financial need or when they are\nunable\n\nto care for themselves.One of the best ways to honor them is to pass\non\n\ntheir godly values to our children. (Question) Are you truly living\nin a\n\nway that brings honor to your parents?\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, help me by the power of Your Holy Spirit to\nhonor\n\nmy parents as Christ honored You by fulfilling Your will while He\nwalked\n\nthis earth, even to the point of suffering for the sins of the world.\nHelp me\n\nto mirror the godly values of my parents to my children.. . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161168ef5931faa8",
    "date_utc": "Sat, 20 Jan 2018 20:32:03 -0600",
    "subject": "thoughts to live by",
    "verse": "And now a word to you fathers. Don't make your children angry by the way you treat them. (Eph. 6:4a)",
    "reflection": "Christian parents and Christian children will relate to each other with thoughtfulness and love. This will happen if both parents and children put the others' interests ahead of their own.",
    "prayer": "Dear Heavenly Father, I thank You for the many gifts and blessing You have given us especially our children. Keep them safe and healthy I pray in Jesus name. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"And now a word to you fathers. Don't make your children_\n\n_angry by the way you treat them. _(Eph. 6:4a)\n\nTHOUGHT FOR TODAY:\n\nChristian parents and Christian children will relate to each other\n\nwith thoughtfulness and love. This will happen if both parents\n\nand children put the others' interests ahead of their own.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for the many gifts and\n\nblessing You have given us especially our children.\n\nKeep them safe and healthy I pray in Jesus name. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1611e4de130d4469",
    "date_utc": "Mon, 22 Jan 2018 08:37:56 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Be strong with the Lord's mighty power.\" (Eph. 6:10)",
    "reflection": "In the Christian life we battle against rulers and authorities (the powerful evil forces of fallen angels headed by Satan, who is a vicious fighter, see I Peter 5:8). To withstand their attacks we must depend on God's strength.",
    "prayer": "Dear Lord, it is so easy to get caught up in the activities of this world and forget to look to You each morning for Your guidance. I need Your Spirit's power to keep from falling into Satan's traps. . . Amen",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Be strong with the Lord's mighty power.\" _(Eph. 6:10)\n\nTHOUGHT FOR TODAY:\n\nIn the Christian life we battle against rulers and authorities (the\npowerful\n\nevil forces of fallen angels headed by Satan, who is a vicious\nfighter, see\n\nI Pet. 5:8). To withstand their attacks we must depend on God's\nstrength.\n\nPRAYER FOR TODAY:\n\nDear Lord, it is so easy to get caught up in the activities of this\nworld and\n\nforget to look to You each morning for Your guidance. I need Your\nSpirit's\n\npower to keep from falling into Satan's traps. . . Amen",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16120d4697cf0c49",
    "date_utc": "Mon, 22 Jan 2018 20:24:07 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Stand your ground, putting on the sturdy belt of truth and the body armor of God's righteousness.\" (Eph. 6:14)",
    "reflection": "Our nation desperately needs a revival of righteousness and justice for the oppressed. The righteousness that God values is more then refraining from sin. We need to fight in the strength of the church, where power comes from the Holy Spirit.",
    "prayer": "Dear Heavenly Father, I pray that a good old fashioned revival would happen in our nation. It is so easy for us, myself include to point our figure at others, but we all have enough sins in our lives to deserve Your wrath. May I allow a revival to begin in my heart. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Stand your ground, putting on the sturdy belt of truth _\n\n_and the body armor of God's righteousness.\" _ (Eph. 6:14)\n\nTHOUGHT FOR TODAY:\n\nOur nation desperately needs a revival of righteousness and\n\njustice for the oppressed. The righteousness that God values\n\nis more then refraining from sin. We need to fight in the strength\n\nof the church, where power comes from the Holy Spirit.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that a good old fashioned revival\n\nwould happen in our nation. It is so easy for us, myself include\n\nto point our figure at others, but we all have enough sins in our\n\nlives to deserve Your wrath. May I allow a revival to begin in\n\nmy heart. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16125fdf80d04a54",
    "date_utc": "Tue, 23 Jan 2018 20:27:37 -0600",
    "subject": "thoughts to live by",
    "verse": "\"For shoes, put on the peace that comes from the Good News, so that you will be fully prepared.\" (Eph. 6:15)",
    "reflection": "God says that the feet those who bring good news, are\"beautiful.\" It is a wonderful privilege to be able to share God's Good News with others, His news of redemption, salvation, and peace. To whom do you need to share the Good News.",
    "prayer": "Dear Heavenly Father, I thank You for the privilege I have had to share The\"Good News.\" I pray that You would forgive me for not ALWAYS fulfilling that privilege as I should. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"For shoes, put on the peace that comes from the Good News,_\n\n_so that you will be fully prepared.\" _(Eph. 6:15)\n\nTHOUGHT FOR TODAY:\n\nGod says that the feet those who bring good news, are\n\n\"beautiful.\" It is a wonderful privilege to be able to share\n\nGod's Good News with others, His news of redemption,\n\nsalvation, and peace. To whom do you need to share the\n\nGood News.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for the privilege I have had\n\nto share The\"Good News.\" I pray that You would forgive me\n\nfor not ALWAYS fulfilling that privilege as I should. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1612b1936759b8ef",
    "date_utc": "Wed, 24 Jan 2018 20:15:28 -0600",
    "subject": "thoughts to live by",
    "verse": "\"In every battle you will need faith as your shield to stop the fiery arrows aimed at you by Satin.\" (Eph. 6:16)",
    "reflection": "Jesus never promised that obeying Him would be easy. But the hard work and self-discipline of serving Christ is no burden to those who love Him. And if our load starts to feel heavy, we can always trust Christ to help us bear it. (see Matthew 11:28-30)",
    "prayer": "Dear Lord, I thank You for always being available to come to our aid when confronted by Satan's attacks. Forgive me for stumbling down the road of life and not always seeking Your help. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"In every battle you will need faith as your shield to stop_\n\n_the fiery arrows aimed at you by Satin.\" _(Eph. 6:16)\n\nTHOUGHT FOR TODAY:\n\nJesus never promised that obeying Him would be easy.\n\nBut the hard work and self-discipline of serving Christ\n\nis no burden to those who love Him. And if our load starts\n\nto feel heavy, we can always trust Christ to help us bear it.\n\n(see Mt. 11:28-30)\n\nPRAYER FOR TODAY:\n\nDear Lord, I thank You for always being available to\n\ncome to our aid when confronted by Satan's attacks.\n\nForgive me for stumbling down the road of life and\n\nnot always seeking Your help. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161303c5c0e75e04",
    "date_utc": "Thu, 25 Jan 2018 20:11:58 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Pray at all time and on every occasion, in the power of the Holy Spirit. Stay alert and be persistent in your prayers for all Christians everywhere.\" (Eph. 6:18)",
    "reflection": "I've had students ask me how you can pray at all times? One way is to0 make quick, brief prayers your habit to every situation. Another ways is to order your life around God's desire and teaching, so that your life so that your very life becomes a prayer. You can make prayer your life, and your life a prayer.",
    "prayer": "I pray for Your forgiveness for my negligence in not living a life of prayer as I should. But today I want to remember Christian Churches around the world. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Pray at all time and on every occasion, in the power of the _\n\n_Holy Spirit.Stay alert and be persistent in your prayers for _\n\n_all Christians everywhere.\" _(Eph. 6:18)\n\nTHOUGHT FOR TODAY:\n\nI've had students ask me how you can pray at all times?\n\nOne way is to0 make quick, brief prayers your habit to\n\nevery situation. Another ways is to order your life around\n\nGod's desire and teaching, so that your life so that your very\n\nlife becomes a prayer. You can make prayer your life, and\n\nyour life a prayer.\n\nPRAYER FOR TODAY:\n\nI pray for Your forgiveness for my negligence in not living a\n\nlife of prayer as I should. But today I want to remember\n\nChristian Churches around the world. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161357c31ce5312b",
    "date_utc": "Fri, 26 Jan 2018 20:39:47 -0600",
    "subject": "thoughts to live by",
    "verse": "\"May God give you peace, dear brothers and sisters, and love with faith, from God the Father and the Lord Jesus Christ.\" (Eph. 6:23)",
    "reflection": "We are encouraged to continue living responsibly in spite of critical circumstances. Christ's return is more then doctrine, IT IS A PROMISE! It is not just for the future, it has a vital impact on how we live now!",
    "prayer": "Dear Lord, help me to persevere in confident expectation that I am not alone or forgotten. Help me never forget Your promise that You would never abandon me. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\" May God give you peace, dear brothers and sisters, and love with\nfaith,_\n\n_from God the Father and the Lord Jesus Christ.\" _(Eph. 6:23)\n\nTHOUGHT FOR TODAY:\n\nWe are encouraged to continue living responsibly in spite of critical\n\ncircumstances. Christ's return is more then doctrine, IT IS A\nPROMISE!\n\nIt is not just for the future, it has a vital impact on how we live\nnow!\n\nPRAYER FOR TODAY:\n\nDear Lord, help me to persevere in confident expectation\n\nthat I am not alone or forgotten. Help me never forget Your\n\npromise that You would never abandon me. . . Amen..",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1613e12d403306bd",
    "date_utc": "Sun, 28 Jan 2018 12:41:17 -0600",
    "subject": "thoughts to live by",
    "verse": "\"I always pray for you, and I make my requests with a heart full of joy\" (Philippians 1:4)",
    "reflection": "Paul was sharing his feelings toward all believers in Philippi. (Here are some personal thoughts to ask yourself) When others think about you, what comes to their minds? Are you remembered with joy by them? Do your acts of kindness lift up others?",
    "prayer": "Dear Lord of grace and mercy, I pray that my acts of kindness would always be remembered with joy by others. I pray that my acts of kindness would lift others up. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"I always pray for you, and I make my requests with a heart full of\njoy,\" _\n\n(Phil. 1:4)\n\nTHOUGHT FOR TODAY:\n\nPaul was sharing his feelings toward all believers in Philippi.\n\n(Here are some personal thoughts to ask yourself)\n\nWhen others think about you, what comes to their minds?\n\nAre you remembered with joy by them? Do your acts of\n\nkindness lift up others?\n\nPRAYER FOR TODAY:\n\nDear Lord of grace and mercy, I pray that my acts of kindness\n\nwould always be remembered with joy by others. I pray that my\n\nacts of kindness would lift others up. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1613f9c6fb5bbcc7",
    "date_utc": "Sun, 28 Jan 2018 19:51:12 -0600",
    "subject": "thoughts to live by",
    "verse": "\"You have been my partners in spreading the Good News about Christ from the time you first believe until now.\" (Philippians 1:5)",
    "reflection": "Paul was thankful for the Philippians's contribution in the spreading of God's message through their financial support. As we help our ministers, missionaries, and evangelists through prayer, hospitality, and financial gifts, we become partners with them.",
    "prayer": "Dear Heavenly Father, I pray that I would always be faithful in spreading God's message of eternal life. Help me remember to pray for our ministers, missionaries, and evangelists. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"You have been my partners in spreading the Good News about _\n\n_Christ from the time you first believe until now.\" _(Phil. 1:5)\n\nTHOUGHT FOR TODAY:\n\nPaul was thankful for the Philippian's contribution in the spreading\n\nof God's message through their financial support. As we help our\n\nministers, missionaries, and evangelists through prayer, hospitality,\n\nand financial gifts, we become partners with them.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I would always be faithful in\n\nspreading God's message of eternal life. Help me remember to\n\npray for our ministers, missionaries, and evangelists. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "161452530d4ea35c",
    "date_utc": "Mon, 29 Jan 2018 21:38:41 -0600",
    "subject": "thoughts to live by",
    "verse": "\"I am sure that God, who began a good work within you, will continue His work until it is finally finished on that day when Jesus comes back again.\" (Philippians 1:6)",
    "reflection": "Do you sometimes feel as I do, that you aren't making any progress in your spiritual life? Scriptures tell us that when God starts a project, He completes it! As with the Philippians, Scriptures also tells us God will help us grow in grace until He has completed His work in our life. When we become discouraged, let us pray for patience and remember that God HAS promised He will complete the work He has begun in us.",
    "prayer": "Dear Heavenly Father, forgive me when I become discouraged with my spiritual growth I know You have promised to finish the work You have begun. Forgive me for my lack of patience. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"I am sure that God, who began a good work within you, will continue\n_\n\n_His work until it is finally finished on that day when Jesus comes\nback _\n\n_again.\" _(Phil. 1:6)\n\nTHOUGHT FOR TODAY:\n\nDo you sometimes feel as I do, that you aren't making any progress in\n\nyour spiritual life?_ _ Scriptures tell us that when God starts a\nproject, He\n\ncompletes it! As with the Philippians, Scriptures also tells us God\nwill\n\nhelp us grow in grace until He has completed His work in our life.\nWhen\n\nwe become discouraged, let us pray for patience and remember that God\n\nHAS promised He will complete the work He has begun in us.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, forgive me when I become discouraged with my\n\nspiritual growth I know You have promised to finish the work You have\n\nbegun. Forgive me for my lack of patience. . .Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1614a248d5ae5162",
    "date_utc": "Tue, 30 Jan 2018 20:56:05 -0600",
    "subject": "thoughts to live by",
    "verse": "\"I pray that your love for each other will overflow more and more, and that you will keep growing in your knowledge and understanding.\" (Philippians 1:9)",
    "reflection": "Often the best way to influence someone is to pray for them. Paul's prayer for the Philippians was that they would be unified in love. Their love was to result in a greater knowledge of Christ and s deeper moral discernment. As we grow in Christ's love, our heart and mind must grow together.",
    "prayer": "Dear Heavenly Father, I have to confess that it is easy to fall into the trap of praying only for family needs. I pray that you would enlighten me in the needs of others especially the less fortunate. I pray now for our ministers, missionaries, and evangelists. I pray that our country's leaders would grow in a deeper moral discernment. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"I pray that your love for each other will overflow more _\n\n_and more, and that you will keep growing in your knowledge_\n\n_ and __understanding.\" _(Phil. 1:9)\n\nTHOUGHT FOR TODAY:\n\nOften the best way to influence someone is to pray for them.\n\nPaul's prayer for the Philippians was that they would be unified\n\nin love. Their love was to result in a greater knowledge of Christ\n\nand s deeper moral discernment.. As we grow in Christ's love, our\n\nheart and mind must grow together.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I have to confess that it is easy to\n\nfall into the trap of praying only for family needs. I pray\n\nthat you would enlighten me in the needs of others\n\nespecially the less fortunate. I pray now for our ministers,\n\nmissionaries, and evangelists. I pray that our country's\n\nleaders would grow in a deeper moral discernment. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1614f43dd368fa5b",
    "date_utc": "Wed, 31 Jan 2018 20:48:23 -0600",
    "subject": "thoughts to live by",
    "verse": "\"I want you to understand what really matters, so that you may live pure and blameless lives until Christ returns:\" (Philippians 1:10)",
    "reflection": "Paul prayed that the Philippians believers would have the ability to differentiate between right and wrong, good and bad, vial and trivial. We ought to pray for discernment so we can maintain our Christian morals and values. (Hebrews 5:14) We should live each day as though Christ might return at any moment.",
    "prayer": "O Lord of all creation, create now in me a discernment to always be able to maintain true Christian morals and values. Help me live each day as if Christ were to return any moment. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"I want you to understand what really matters, so that you may_\n\n_live pure and blameless lives until Christ returns:\" _(Phil. 1:10)\n\nTHOUGHT FOR TODAY:\n\nPaul prayed that the Philippian believers would have the ability\n\nto differentiate between right and wrong, good and bad, vial\n\nand trivial. We ought to pray for discernment so we can maintain\n\nour Christian morals and values. (Heb. 5:14) We should live each\n\nday as though Christ might return at any moment.\n\nPRAYER FOR TODAY:\n\nO Lord of all creation, create now in me a discernment to always\n\nbe able to maintain true Christian morals and values. Help me\n\nlive each day as if Christ were to return any moment. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]
