[
  {
    "message_id": "12b6c3e47a4ab04c",
    "date_utc": "Fri, 1 Oct 2010 06:46:46 -0500",
    "subject": "thoughts to live by",
    "verse": "\"If You can do anything, have compassion on us and help us\" (Mk. 9:22)",
    "reflection": "\"If You can do anything.\" Why does it seem to take a valley of humiliation to remove the skepticism from us? Look back at your own experiences and I think you will find that until you learned who Jesus really was, you were a skillful skeptic about His power. When you were on the mountaintop you could believe anything, but what about when you were faced with the facts of the valley? You may be able to give a testimony regarding your sanctification, but what about the thing that is a humiliation to you right now? The last time you were on the mountain with God, you saw that all the power in heaven and on earth belonged to Jesus ~ will you be skeptical now, simply because you are in the valley of humiliation?",
    "prayer": "Dear Lord, I believe, help my unbelief. Amen.",
    "reading": "",
    "original_content": "10/02/2010~~~food for thought~~~A PLACE OF HUMILIATION\n\nOur Bible Verse for Today:\n\"If You can do anything, have compassion on us \nand help us\" (Mk. 9:22)\n\nOur Lesson for Today:\n\"If You can do anything.\" Why does it seem to take a valley of humiliation to\nremove the skepticism from us? Look back at your own experiences and I think\nyou will find that until you learned who Jesus really was, you were a skillful skeptic\nabout His power.\n\nWhen you were on the mountaintop you could believe anything, but what about \nwhen you were faced with the facts of the valley?\n\nYou may be able to give a testimony regarding your sanctification, but what about\nthe thing that is a humiliation to you right now? \n\nThe last time you were on the mountain with God, you saw that all the power in heaven \nand on earth belonged to Jesus ~ will you be skeptical now, simply because you are \nin the valley of humiliation?\n\nPrayer Suggestion:\nDear Lord, I believe, help my unbelief.Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life.\nNo one can come to The father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b71565bc4fb5e9",
    "date_utc": "Sat, 2 Oct 2010 05:09:58 -0500",
    "subject": "thoughts to live by",
    "verse": "\"He said to them, 'This kind [of unclean spirit] can come out by nothing but prayer'\" (Mk. 9:29)",
    "reflection": "The disciples would often face difficult situations that could only be resolved through prayer. Prayer is the key that unlocks faith in our life. ~ Effective prayer needs both an attitude, complete dependence, and an action, asking. Prayer demonstrates our reliance on God as we humbly invite Him to fill us with faith and power. ~ There is no substitute for prayer, especially in circumstances that seem impossible. In what are you depending upon today? \"I can do all things through Christ who strengthens me. \" (Phil. 4:13)",
    "prayer": "Dear Lord, I pray for a Christ-like attitude so my prayers will be in accordance with Your will. Amen.",
    "reading": "",
    "original_content": "10/03/2010~~~food for thought~~~THE PLACE OF MINISTRY\n\nOur Bible Verse for Today:\n\"He said to them, 'This kind [of unclean spirit] can come out by\nnothing but prayer' \" (Mk. 9:29)\n\nOur Lesson for Today:\nThe disciples would often face difficult situations that could only be resolved\nthrough prayer. Prayer is the key that unlocks faith in our life. ~\n\nEffective prayer needs both an attitude, complete dependence, and an action,\nasking.\n\nPrayer demonstrates our reliance on God as we humbly invite Him to fill us with\nfaith and power. ~ There is no substitute for prayer, especially in circumstances\nthat seem impossible.\n\nIn what are you depending upon today?\n\n\"I can do all things through Christ who strengthens me.\" (Phil. 4:13)\n\nPrayer Suggestion:\nDear Lord, I pray for a Christ-like attitude so my\nprayers will be in accordance with Your will. Amen.\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b7696f5976dbe6",
    "date_utc": "Sun, 3 Oct 2010 05:25:40 -0500",
    "subject": "thoughts to live by",
    "verse": "\"To those who are. called to be saints.\" (I Cor. 1:2)",
    "reflection": "Don't we find that a personal invitation makes us feel wanted and welcome? Here we are \"called by God to be His own holy people.\" God personally invites us to be citizens of His Kingdom. But let us remember Jesus Christ, God's Son, is the only one who can bring us into His glorious Kingdom because He is the only One who removes our sins. We can only accept God's invitation by accepting His Son, Jesus Christ, and by trusting in the work He did on the cross to forgive our sins. Remember, God knows where we live, but He also knows the gutters into which we crawl! He will hunt us down as fast as a flash of lightening. Here is a thought to remember, (No human being knows human beings as God does. )",
    "prayer": "Dear Lord, there is nothing I can hide. You know me through and through, here I stand sins and all without one excuse, please forgive my sins, known and unknown. Amen.",
    "reading": "",
    "original_content": "10/04/2010~~~food for thought~~~THE VISION OF REALITY\n\nOur Bible Verse for Today:\n\".To those who are . called to be saints.\" (I Cor. 1:2)\n\nOur Lesson for Today:\nDon't we find that a personal invitation makes us feel wanted and welcome?\n\nHere we are \"called by God to be His own holy people.\" God personally invites \nus to be citizens of His Kingdom. But let us remember Jesus Christ, God's Son,\nis the only one who can bring us into His glorious Kingdom because He is the only \nOne who removes our sins.\n\nWe can only accept God's invitation by accepting His Son, Jesus Christ, and by\ntrusting in the work He did on the cross to forgive our sins.\n\nRemember, God knows where we live, but He also knows the gutters into which \nwe crawl! He will hunt us down as fast as a flash of lightening.\n\nHere is a thought to remember, (No human being knows human beings as God does.)\n\nPrayer Suggestion:\nDear Lord, there is nothing I can hide. You know me\nthrough and through, here I stand sins and all without\none excuse, please forgive my sins, known and unknown. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b7bba826a227c7",
    "date_utc": "Mon, 4 Oct 2010 05:33:48 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Just as through one man sin entered the world, and death through sin, and thus death spread to all men, because all sinned.\" (Ro. 5:12)",
    "reflection": "The question often asked is, \"How can we be declared guilty for something Adam did thousands of years ago?\" ~ ~ ~ Yes many feel it isn't fair for God to judge us because of Adam's sin. Yet each of us confirms our heritage with Adam by our own sins every day. We have the same sinful nature and are prone to rebel against God, and we are judged for the sins we commit. Sin is something I am born with and cannot touch ~ only God touches sin through redemption. It is through the cross of Christ that God redeemed the entire human race from the possibility of damnation through the heredity of sin. Because we are sinners, it isn't fairness we need ~ It is mercy.",
    "prayer": "Dear Lord, today, I seek Your mercy to forgive me of my many sins, known and unknown. Amen.",
    "reading": "",
    "original_content": "10/05/2010~~~food for thought~~~THE NATURE OF DEGENERATION\n\nOur Bible Verse for Today:\n\"Just as through one man sin entered the world, and death through sin,\nand thus death spread to all men, because all sinned.\" (Ro. 5:12)\n\nOur Lesson for Today:\nThe question often asked is, \"How can we be declared guilty for something\nAdam did thousands of years ago?\" ~ ~ ~ Yes many feel it isn't fair for God\nto judge us because of Adam's sin.\n\nYet each of us confirms our heritage with Adam by our own sins every day.\nWe have the same sinful nature and are prone to rebel against God, and we\nare judged for the sins we commit.\n\nSin is something I am born with and cannot touch ~ only God touches sin through\nredemption. It is through the cross of Christ that God redeemed the entire human\nrace from the possibility of damnation through the heredity of sin.\n\nBecause we are sinners, it isn't fairness we need ~ It is mercy.\n\nPrayer Suggestion:\nDear Lord, today, I seek Your mercy to forgive me\nof my many sins, known and unknown. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b8102f22d663c8",
    "date_utc": "Tue, 5 Oct 2010 05:27:02 -0500",
    "subject": "thoughts to live by",
    "verse": "Here on earth you will have many trials and sorrows, but take heart, because I have overcome the world. (Jn. 16:33b)",
    "reflection": "In spite of the inevitable struggles we will face, remember we are not alone. Jesus does not abandon us in our struggles. Let us also remember that the ultimate victory has already been won so let us avoid these mistakes. 1. Remorse over yesterday's failure. 2. Anxiety over today's problems. 3. Worry over tomorrow's uncertainty. 4. Procrastination with one's present duty. 5. Resentment of another's success. 6. Criticism of a neighbor's imperfections. 7. Impatience with youth's imperfection. 8. Skepticism of our nations future. 9. Unbelief in God's providence. Instead let us claim the peace of Christ in the most troublesome times.",
    "prayer": "Dear Lord, I am guilty of all the fore mentioned mistakes, help me to gain the peace of Christ, remembering He is always at my side. Amen.",
    "reading": "",
    "original_content": "10/07/2010~~~food for thought~~~THE VICTORY HAS BEEN WON\n\nOur Bible Verse for Today:\n\"Here on earth you will have many trials and sorrows, but \ntake heart, because I have overcome the world. (Jn. 16:33b)\n\nOur Lesson for Today:\nIn spite of the inevitable struggles we will face, remember we are not alone.\nJesus does not abandon us in our struggles. Let us also remember that the\nultimate victory has already been won so let us avoid these mistakes.\n\n1. Remorse over yesterday's failure.\n2. Anxiety over today's problems.\n3. Worry over tomorrow's uncertainty.\n4. Procrastination with one's present duty.\n5. Resentment of another's success.\n6. Criticism of a neighbor's imperfections.\n7. Impatience with youth's imperfection.\n8. Skepticism of our nations future.\n9. Unbelief in God's providence.\n\nInstead let us claim the peace of Christ in the most troublesome times.\n\nPrayer Suggestion:\nDear Lord, I am guilty of all the fore mentioned mistakes,\nhelp me to gain the peace of Christ, remembering He is \nalways at my side. Amen.\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b86236c1a6ebd4",
    "date_utc": "Wed, 6 Oct 2010 09:11:29 -0500",
    "subject": "thoughts to live by",
    "verse": "Whoever wants to become great among you must be your servant ~ And whoever wants to be first must be your slave. (Mt. 20:26, 27)",
    "reflection": "I think you will agree with me, that Jesus describes leadership from a whole new perspective. ~ Instead of using people, we are to serve them. Jesus' mission was to serve others and to give His life away. What Jesus is saying is \"A real leader has a servant's heart. \" Servant leaders appreciate others' worth and realize that they're not above any job. If you see something that needs to be done, don't wait to be asked. Take the initiative and do it like a faithful servant.",
    "prayer": "Dear Lord, Help me to forget self and always focus on the needs of others. Amen.",
    "reading": "",
    "original_content": "10/07/2010~~~food for thought~~~ITS TIME TO REFOCUS\n\nOur Bible Verse for Today:\nWhoever wants to become great among you must be your servant ~\nAnd whoever wants to be first must be your slave. (Mt. 20:26, 27)\n\nOur Lesson for Today:\nI think you will agree with me, that Jesus describes leadership from a whole new \nperspective. ~ Instead of using people, we are to serve them. \n\nJesus' mission was to serve others and to give His life away. What Jesus is saying \nis \"A real leader has a servant's heart.\" Servant leaders appreciate others' worth\nand realize that they're not above any job.\n\nIf you see something that needs to be done, don't wait to be asked.\nTake the initiative and do it like a faithful servant.\n\nPrayer Suggestion:\nDear Lord, Help me to forget self and always focus \non the needs of others. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b8b20f59007185",
    "date_utc": "Thu, 7 Oct 2010 07:40:25 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus says: \"Come to Me, all you who are weary and caring heavy burdens, and I will give you rest.\" (Mt. 11:28)",
    "reflection": "There are a number of things that may qualify as a heavy burden, but lets just look at one. ~~~ Self-pity Our Thinking His Thinking \"Its impossible. \" \"All thing are possible\" (Lk. 18:27) \"I am to tired. \" \"I will give you rest\" (Mt. 11:20-30) \"Nobody really love me. \" \"I love you\" (Jn. 3:16) \"Nobody really cares for me. \" \"I care for you\" (I Pet. 5:7) \"I cannot go on. \" \"My grace is sufficient\" (II Cor. 12:9) \"I can't figure things out. \" \"I will direct your Steps\" (Pro. 20:24; 3:6) \"I can't do it. \" \"You can do all things\" (Phil. 4:13 \"I am not worth it. \" \"It will be worth it\" (Ro. 8:28) \"I can't forgive myself. \" \"I forgive you\" (Ps. 103:12) \"I can't afford to. \" \"I will supply all your needs\" (Phil. 4:19)",
    "prayer": "Dear Lord, when my focus becomes that of self-pity help me refocus on what is possible with You. Amen.",
    "reading": "",
    "original_content": "10/08/2010~~~food for thought~~~HIS THINKING IS ALWAYS BETTER\n\nOur Bible Verse for Today:\nJesus says: \"Come to Me, all you who are weary and caring heavy burdens,\nand I will give you rest.\" (Mt. 11:28)\n\nOur Lesson for Today:\nThere are a number of things that may qualify as a heavy burden, \nbut lets just look at one. ~~~ Self-pity \n\nOur Thinking His Thinking\n\"Its impossible.\" \"All thing are possible\" (Lk. 18:27)\n\"I am to tired.\" \"I will give you rest\" (Mt. 11:20-30)\n\"Nobody really love me.\" \"I love you\" (Jn. 3:16)\n\"Nobody really cares for me.\" \"I care for you\" (I Pet. 5:7)\n\"I cannot go on.\" \"My grace is sufficient\" (II Cor. 12:9)\n\"I can't figure things out.\" \"I will direct your Steps\" (Pro. 20:24; 3:6)\n\"I can't do it.\" \"You can do all things\" (Phil. 4:13 \n\"I am not worth it.\" \"It will be worth it\" (Ro. 8:28) \n\"I can't forgive myself.\" \"I forgive you\" (Ps. 103:12)\n\"I can't afford to.\" \"I will supply all your needs\" (Phil. 4:19)\n\nPrayer Suggestion:\nDear Lord, when my focus becomes that of self-pity\nhelp me refocus on what is possible with You...Amen.\n\nPastor Alvin & Marcie Sather\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b908a83fcbeb9c",
    "date_utc": "Fri, 8 Oct 2010 05:20:30 -0500",
    "subject": "thoughts to live by",
    "verse": "Present your members as instruments of righteousness to God. (Ro. 6:13)",
    "reflection": "Let us remember, we cannot save or sanctify ourselves. We cannot make atonement for sin; we cannot redeem the world; We cannot make right what is wrong, purify what is impure, or make holy what is unholy. That is all the sovereign work of God. Do I have faith in what Jesus Christ has done? ~ He has made the perfect atonement for sin. Am I in the habit of constantly realizing it? The greatest need we have is not to do things, but to believe things. The redemption of Christ is not an experience, it is the great act of God which He has performed through Christ, and we have to build our faith on it. If we construct our faith on our own experience, we produce the most unscriptural kind of life ~ an isolated life, with our eyes focused solely on our own holiness. Let us beware of that human holiness that is not based on the atonement of the Lord. Prayer Suggestion. Dear Lord, Help me to build on the atonement, purchased by Christ. Amen.",
    "prayer": "Dear Lord, Help me to build on the atonement, purchased by Christ. Amen.",
    "reading": "",
    "original_content": "10/09/2010~~~food for thought~~~BUILDING ON THE ATONEMENT\n\nOur Bible Verse for Today:\n\". Present . your members as instruments of \nrighteousness to God.\" (Ro. 6:13)\n\nOur Lesson for Today:\nLet us remember, we cannot save or sanctify ourselves.\nWe cannot make atonement for sin; we cannot redeem the world;\nWe cannot make right what is wrong, purify what is impure, or\nmake holy what is unholy.\n\nThat is all the sovereign work of God. Do I have faith in what \nJesus Christ has done? ~ He has made the perfect atonement for\nsin. Am I in the habit of constantly realizing it?\n\nThe greatest need we have is not to do things, but to believe things.\nThe redemption of Christ is not an experience, it is the great act of \nGod which He has performed through Christ, and we have to build\nour faith on it.\n\nIf we construct our faith on our own experience, we produce the most \nunscriptural kind of life ~ an isolated life, with our eyes focused solely\non our own holiness. Let us beware of that human holiness that is\nnot based on the atonement of the Lord.\n\nPrayer Suggestion.\nDear Lord, Help me to build on the atonement,\npurchased by Christ. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b95752f175659d",
    "date_utc": "Sat, 9 Oct 2010 09:17:43 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus answered and said, \"I thank You, Father. that you have hidden these things from the wise and prudent and have revealed them to babes\" (Mt. 11:25)",
    "reflection": "All of God's revealed truths are sealed until they are opened to us through obedience. We will never open them through philosophy or thinking. But once we obey, a flash of light comes immediately. Let us let God's truth work into us by immersing ourselves in it, not by worrying about it. The only way we can get to know the truth of God is to stop trying to find out and by being born again. If we obey God in the first thing He shows us, then He instantly opens up the next truth to us. We could read volumes on the work of the Holy Spirit, when five minutes of total, uncompromising obedience would make things as clear as sunshine. Don't say, \"I suppose I will understand these things someday!\" You can understand them now. And it is not study that brings understanding to you, but obedience. Even the smallest bit of obedience opens heaven, and the deepest truths of God immediately become yours. But for further truths we need to obey what we have learned already.",
    "prayer": "Dear Lord, help me to put into practice the truths You have made known onto me. Amen.",
    "reading": "",
    "original_content": "10/10/2010~~~food for thought~~~HOW WILL WE KNOW?\n\nOur Bible Verse for Today:\nJesus answered and said, \"I thank You, Father . that you have hidden \nthese things from the wise and prudent and have revealed them to babes\"\n(Mt. 11:25)\n\nOur Lesson for Today:\nAll of God's revealed truths are sealed until they are opened to us through \nobedience. We will never open them through philosophy or thinking. But\nonce we obey, a flash of light comes immediately. Let us let God's truth work\ninto us by immersing ourselves in it, not by worrying about it.\n\nThe only way we can get to know the truth of God is to stop trying to find out \nand by being born again. If we obey God in the first thing He shows us,\nthen He instantly opens up the next truth to us.\n\nWe could read volumes on the work of the Holy Spirit, when five minutes of \ntotal, uncompromising obedience would make things as clear as sunshine.\n\nDon't say, \"I suppose I will understand these things someday!\" You can \nunderstand them now. And it is not study that brings understanding to you, \nbut obedience. Even the smallest bit of obedience opens heaven, and the \ndeepest truths of God immediately become yours.\n\nBut for further truths we need to obey what we have learned already.\n\nPrayer Suggestion:\nDear Lord, help me to put into practice the truths \nYou have made known onto me.Amen.\n\nPastor Alvin & Marcie Sather\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b9ab2ba31f0f3d",
    "date_utc": "Sun, 10 Oct 2010 05:30:11 -0500",
    "subject": "thoughts to live by",
    "verse": "\"When He heard that he, (Lazarus) was sick, He (Jesus) stayed two more days in the place where He was. \" (Jn. 11:6)",
    "reflection": "Has God trusted you with His silence, a silence that has great meaning? God's silences are actually His answers. Just think of those days of absolute silence in the home at Bethany! Is there anything comparable to those days in your life? ~ Can God trust you like that, or are you still asking Him for a visible answer? God will give you the very blessings you ask if you refuse to go any further without them, but His silence is the sign that He is bringing you into an even more wonderful understanding of Himself. When you cannot hear God, you will find that He has trusted you in the most intimate way possible ~ with absolute silence, not a silence of despair, but one of pleasure, because He saw that you could withstand an even bigger revelation. If God has given you a silence, then praise Him ~ He is bring you into the mainstream of His purpose.",
    "prayer": "Dear Lord, help me to be patient in the time of silence. Help me to accept Your silence with faith. Amen.",
    "reading": "",
    "original_content": "10/11/2010~~~food for thought~~~GOD'S SILENCE ~ THEM WHAT?\n\nOur Bible Verse for Today:\n\"When He heard that he, (Lazarus) was sick, He (Jesus) stayed two more days\nin the place where He was.\" (Jn. 11:6)\n\nOur Lesson for Today:\nHas God trusted you with His silence, a silence that has great meaning?\nGod's silences are actually His answers.\n\nJust think of those days of absolute silence in the home at Bethany!\nIs there anything comparable to those days in your life? ~ Can God\ntrust you like that, or are you still asking Him for a visible answer?\n\nGod will give you the very blessings you ask if you refuse to go any \nfurther without them, but His silence is the sign that He is bringing you\ninto an even more wonderful understanding of Himself.\n\nWhen you cannot hear God, you will find that He has trusted you in the most\nintimate way possible ~ with absolute silence, not a silence of despair, but \none of pleasure, because He saw that you could withstand an even bigger\nrevelation.\n\nIf God has given you a silence, then praise Him ~ He is bring you into the\nmainstream of His purpose.\n\nPrayer Suggestion:\nDear Lord, help me to be patient in the time\nof silence. Help me to accept Your silence\nwith faith. Amen.\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b9fa826f17d429",
    "date_utc": "Mon, 11 Oct 2010 06:07:53 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Enoch walked with God. \" (Gen. 5:24)",
    "reflection": "The true test of a person's spiritual life and character is not what he does during the extraordinary moments of his life, but what he does during the ordinary times when there is nothing tremendous or exciting happening. A person's worth is revealed in his attitude toward the ordinary things of life when he is not under the spotlight (see Jn. 1:35-37 and 3:30). Oh it can be painful work to get in step with God and to keep pace with Him ~ it means getting your second wind spiritually. In learning to walk with God, there is always the difficulty of getting into His stride, but once we have done so, the only characteristic that exhibits itself is the very life of God Himself.",
    "prayer": "Dear Lord, help me to become merged into a oneness with You, so that Your stride and Your power alone are exhibited. Amen.",
    "reading": "",
    "original_content": "10/12/2010~~~food for thought~~~KEEPING IN STEP WITH GOD\n\nOur Bible Verse for Today:\n\"Enoch walked with God. \" (Gen. 5:24)\n\nOur Lesson for Today:\nThe true test of a person's spiritual life and character is not what he\ndoes during the extraordinary moments of his life, but what he does\nduring the ordinary times when there is nothing tremendous or exciting\nhappening.\n\nA person's worth is revealed in his attitude toward the ordinary things \nof life when he is not under the spotlight (see Jn. 1:35-37 and 3:30).\n\nOh it can be painful work to get in step with God and to keep pace\nwith Him ~ it means getting your second wind spiritually. In learning to\nwalk with God, there is always the difficulty of getting into His stride,\nbut once we have done so, the only characteristic that exhibits itself\nis the very life of God Himself.\n\nPrayer Suggestion:\nDear Lord, help me to become merged into a oneness\nwith You, so that Your stride and Your power alone are\nexhibited. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12ba4d920bb837d1",
    "date_utc": "Tue, 12 Oct 2010 05:13:54 -0500",
    "subject": "thoughts to live by",
    "verse": "\". When Moses was grown. he went out to his brethren and looked at their burdens\" (Ex. 2:11).",
    "reflection": "We may have a clear vision of what God wants of us, and yet when we start to do it, there comes to us something equivalent to Moses' forty years in the wilderness. It's as if God had ignored the entire thing, and when we are thoroughly discouraged, God comes back and revives His call to us. And then we like Moses begin to tremble and say, \"Who am I that I should go. \" We must learn that God's great stride is drummed up in these words, \"I AM WHO I AM. has sent me to you\" (Ex. 3:14). We must also learn that our individual effort for God shows nothing but disrespect for Him, our individuality is to be rendered radiant through a personal relationship with God so that He may be \"well pleased\" (Mt. 3:17). Remember ~ if you are going through a time of discouragement, there is a time of great personal growth ahead.",
    "prayer": "Dear Lord, Help me to remain patient, while a personal growth is taking place in me. Amen.",
    "reading": "",
    "original_content": "10/13/2010~~~food for thought~~~A TIME FOR PERSONAL GROWTH\n\nOur Bible Verse for Today:\n\".When Moses was grown. he went out to his brethren and\nlooked at their burdens\" (Ex. 2:11).\n\nOur Lesson for Today:\nWe may have a clear vision of what God wants of us, and yet when \nwe start to do it, there comes to us something equivalent to Moses'\nforty years in the wilderness.\n\nIt's as if God had ignored the entire thing, and when we are thoroughly\ndiscouraged, God comes back and revives His call to us. And then\nwe like Moses begin to tremble and say, \"Who am I that I should go.\"\n\nWe must learn that God's great stride is drummed up in these words,\n\"I AM WHO I AM.has sent me to you\" (Ex. 3:14). We must also learn\nthat our individual effort for God shows nothing but disrespect for Him,\nour individuality is to be rendered radiant through a personal relationship\nwith God so that He may be \"well pleased\" (Mt. 3:17).\n\nRemember ~ if you are going through a time of discouragement, there is\na time of great personal growth ahead.\n\nPrayer Suggestion:\nDear Lord, Help me to remain patient, while a personal\ngrowth is taking place in me.Amen.\n\nPastor Alvin & Marcie Sather\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12baa0ea598e1b98",
    "date_utc": "Wed, 13 Oct 2010 05:32:28 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus came to them saying, \"all authority has been given to Me in heaven and on earth. Go therefore and make disciples of all nations. \" (Mt. 28:18-19)",
    "reflection": "\"Go therefore. \" To \"go\" simply means to live. Acts 1:8 is the description of how to go. Jesus did not say in this verse, \"Go to Jerusalem, Judea, and Samaria, \" but, \". you shall be witnesses to Me in [all these places]. \" He takes upon Himself the work of sending us. \"If you abide in Me, and My words abide in you. \" (Jn. 15:7) ~ that my friends is the way to keep going. ~ Where we are placed is then a matter of indifference to us, because God sovereignly engineers our going.",
    "prayer": "Dear Heavenly Father, forgive me for questioning Your leading, just help me to be a faithful follower. Amen.",
    "reading": "",
    "original_content": "10/14/2010~~~food for thought~~~ALL THE WAY HE LEADS ME\n\nOur Bible Verse for Today:\nJesus came to them saying, \"all authority has been given to Me in heaven\nand on earth. Go therefore and make disciples of all nations.\" (Mt. 28:18-19)\n\nOur Lesson for Today:\n\"Go therefore.\" To \"go\" simply means to live. Acts 1:8 is the description of\nhow to go. Jesus did not say in this verse, \"Go to Jerusalem, Judea, and Samaria,\"\nbut, \". you shall be witnesses to Me in [all these places].\" He takes upon Himself \nthe work of sending us.\n\n\"If you abide in Me, and My words abide in you.\" (Jn. 15:7) ~ that my friends is\nthe way to keep going. ~ Where we are placed is then a matter of indifference\nto us, because God sovereignly engineers our going.\n\nPrayer Suggestion:\nDear Heavenly Father, forgive me for questioning Your\nleading, just help me to be a faithful follower. Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12baf4118665ed55",
    "date_utc": "Thu, 14 Oct 2010 05:44:53 -0500",
    "subject": "thoughts to live by",
    "verse": "He Himself is the propitiation for our sins, and not for ours only but also for the whole world. \" (I Jn. 2:2)",
    "reflection": "Sometimes it is difficult to forgive those who wrong us. Imagine how hard it would be to forgive everyone ~ the whole world, no matter what they had done. This is what God has done in Jesus. Yes Jesus is the atoning sacrifice for our sins. ~ He can stand before God as our mediator because His death satisfied the wrath of God against sin and paid the death penalty for our sins. Thus Christ satisfies God's requirement and removes our sin. In Him we are forgiven and purified. No one, no matter what he or she has done is beyond forgiveness. All a person has to do is to turn from ALL known sin, receive Christ's forgiveness, and commit his or her life to Him.",
    "prayer": "Dear Lord, I am a sinful human being, not deserving of Your mercy, but by Christ's blood, I come before you in repentance, seeking Your forgiveness, in Jesus Name. Amen.",
    "reading": "",
    "original_content": "10/15/2010~~~food for thought~~~THE KEY TO OUR MESSAGE\n\nOur Bible Verse for Today:\nHe Himself is the propitiation for our sins, and not for ours\nonly but also for the whole world.\" (I Jn. 2:2)\n\nOur Lesson for Today:\nSometimes it is difficult to forgive those who wrong us. Imagine \nhow hard it would be to forgive everyone ~ the whole world, no \nmatter what they had done. This is what God has done in Jesus.\n\nYes Jesus is the atoning sacrifice for our sins. ~ He can stand before \nGod as our mediator because His death satisfied the wrath of God \nagainst sin and paid the death penalty for our sins.\n\nThus Christ satisfies God's requirement and removes our sin.\nIn Him we are forgiven and purified.\n\nNo one, no matter what he or she has done is beyond forgiveness.\nAll a person has to do is to turn from ALL known sin, receive Christ's\nforgiveness, and commit his or her life to Him.\n\nPrayer Suggestion:\nDear Lord, I am a sinful human being, not deserving of Your mercy,\nbut by Christ's blood, I come before you in repentance, seeking\nYour forgiveness, in Jesus Name. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bb4762687b1942",
    "date_utc": "Fri, 15 Oct 2010 05:58:22 -0500",
    "subject": "thoughts to live by",
    "verse": "Pray to the Lord of the harvest to send out laborers into the harvest field. (Mt. 9:38)",
    "reflection": "From Jesus Christ's perspective, there are no nations, but only the world. How many of us pray without regard to persons, but with regard to only one person ~ Jesus Christ? He owns the harvest that is produced through distress and through conviction of sin. ~ This is the harvest for which we have to pray that laborers be sent out to reap. We stay busy with different things, while people all around us are ripe and ready to be harvested; ~ we do not reap even one of them, ~ but simply waste our Lord's time in over-energized activities and programs. Suppose a crisis were to come into one of your families lives ~ are you there as a laborer to reap the harvest for Christ? Every Christian is called to be Jesus Christ's own, \"a servant [who] is not greater than his Master\" (Jn. 13:16), and someone who does not dictate to Jesus what he intends to do. ~ \"Pray to the Lord of the harvest, \" and He will engineer your circumstance to send you out as His laborer.",
    "prayer": "Dear Lord, give me a sensitive heart and spirit to recognize the need of a laborer even where I am at. Amen.",
    "reading": "",
    "original_content": "10/16/2010~~~food for thought~~~THE KEY TO BEING THE MASTER'S LABORER\n\nOur Bible Verse for Today:\nPray to the Lord of the harvest to send out laborers into\nthe harvest field. (Mt. 9:38)\n\nOur Lesson for Today:\nFrom Jesus Christ's perspective, there are no nations, but only the world.\nHow many of us pray without regard to persons, but with regard to only one\nperson ~ Jesus Christ?\n\nHe owns the harvest that is produced through distress and through conviction \nof sin. ~ This is the harvest for which we have to pray that laborers be sent out \nto reap. We stay busy with different things, while people all around us are\nripe and ready to be harvested; ~ we do not reap even one of them, ~ but\nsimply waste our Lord's time in over-energized activities and programs.\n\nSuppose a crisis were to come into one of your families lives ~ are you there \nas a laborer to reap the harvest for Christ? \n\nEvery Christian is called to be Jesus Christ's own, \"a servant [who] is not greater \nthan his Master\" (Jn. 13:16), and someone who does not dictate to Jesus what he \nintends to do. ~ \"Pray to the Lord of the harvest,\" and He will engineer your circumstance\nto send you out as His laborer.\n\nPrayer Suggestion:\nDear Lord, give me a sensitive heart and spirit to\nrecognize the need of a laborer even where I am at. Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bb9964c74c6491",
    "date_utc": "Sat, 16 Oct 2010 06:45:53 -0500",
    "subject": "thoughts to live by",
    "verse": "\". I say to you, he who believes in Me, . greater works than these he will do, because I go to My Father. \" (Jn. 14:12)",
    "reflection": "Before your feathers get ruffled, about what I'm about to say read on and think ~ think seriously. Prayer does not equip us for greater work ~ prayer is the greater work. Yet we think of prayer as some commonsense exercise of our higher power that simply prepares us for God's work. In the teachings of Jesus Christ, prayer is the working of the miracle of redemption in others, through the power of God. The way fruit remains firm is through prayer, ~ but remember that it is prayer based on the agony of Christ in redemption, not on our agony. We must go to God as His child, because only a child gets his prayers answered; a wise man does not (see Mt. 11:25).",
    "prayer": "Help me Lord never to shirk my duty as a prayer warrior. Amen.",
    "reading": "",
    "original_content": "10/17/24~~~food for thought~~~\n\nOur Bible Verse for Today:\n\". I say to you, he who believes in Me, .\ngreater works than these he will do, because\nI go to My Father.\" (Jn. 14:12)\n\nOur Lesson for Today:\nBefore your feathers get ruffled, about what I'm about to say read on\nand think ~ think seriously.\n\nPrayer does not equip us for greater work ~ prayer is the greater work.\nYet we think of prayer as some commonsense exercise of our higher\npower that simply prepares us for God's work.\n\nIn the teachings of Jesus Christ, prayer is the working of the miracle\nof redemption in others, through the power of God. The way fruit remains \nfirm is through prayer, ~ but remember that it is prayer based on the\nagony of Christ in redemption, not on our agony.\n\nWe must go to God as His child, because only a child gets his prayers\nanswered; a wise man does not (see Mt. 11:25).\n\nPrayer Suggestion:\nHelp me Lord never to shirk my duty as a prayer warrior. Amen. \n\nPastor Alvin & Marcie Sather\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bbec1ccc1b1cbb",
    "date_utc": "Sun, 17 Oct 2010 06:11:02 -0500",
    "subject": "thoughts to live by",
    "verse": "\". they went forth for His name sake. \" (3 Jn. 1:7)",
    "reflection": "'Faithfulness' to Jesus Christ is the supernatural work of redemption that has been performed in us by the Holy Spirit ~ \"The love of God has been poured out in our hearts by the Holy Spirit. \" (Ro. 5:5) It is that love in us that effectively works through us which in turn shows itself to everyone we come in contact with. The duty of His faithful followers is to concentrate on keeping his/her soul completely and continually open to the nature of our Lord Jesus Christ. Those who our Lord sends out on 'His' endeavors are ordinary human people, but people who are controlled by their devotion to Him, which has been brought about through the work of the Holy Spirit.",
    "prayer": "Dear Lord, I am definitely an ordinary human being, help me to be a more devoted follower. Amen.",
    "reading": "",
    "original_content": "10/18/2010~~~food for thought~~~THEY KEY TO CHRISTIAN DEVOTION\n\nOur Bible Verse for Today:\n\". they went forth for His name sake.\" (3 Jn. 1:7)\n\nOur Lesson for Today:\n'Faithfulness' to Jesus Christ is the supernatural work of redemption that\nhas been performed in us by the Holy Spirit ~ \"The love of God has been\npoured out in our hearts by the Holy Spirit.\" (Ro. 5:5)\n\nIt is that love in us that effectively works through us which in turn shows itself\nto everyone we come in contact with.\n\nThe duty of His faithful followers is to concentrate on keeping his/her soul\ncompletely and continually open to the nature of our Lord Jesus Christ.\n\nThose who our Lord sends out on 'His' endeavors are ordinary human people,\nbut people who are controlled by their devotion to Him, which has been brought \nabout through the work of the Holy Spirit.\n\nPrayer Suggestion:\nDear Lord, I am definitely an ordinary human being,\nhelp me to be a more devoted follower. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bc3d0c3835b2e9",
    "date_utc": "Mon, 18 Oct 2010 05:57:54 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus answered, \"My Kingdom is not of this world. \" (Jn 18:36)",
    "reflection": "I have said it before and I'll say it again ~ We must get rid of the plague of the spirit of this religious age in which we live. In our Lord's life here on earth there was none of the pressures and the rushing of tremendous activity that we regard so highly today, and a disciple (believer) is to be like his Master. The central point of the kingdom of Jesus Christ is a personal relationship with Him, not public usefulness to others. We need to spend more time submersing ourselves in His Word so that we become rooted and grounded in Him, then we will remain true to Him what ever happens.",
    "prayer": "Dear Lord, Help me to put aside the business of the things of this world, so that I can spend more time becoming rooted and ground in You. Amen.",
    "reading": "",
    "original_content": "10/19/2010~~~food for thought~~~SEEKING FIRST HIS KINGDOM\n\nOur Bible Verse for Today:\nJesus answered, \"My Kingdom is not of this world.\" (Jn 18:36)\n\nOur Lesson for Today:\nI have said it before and I'll say it again ~ We must get rid of the plague of the \nspirit of this religious age in which we live.\n\nIn our Lord's life here on earth there was none of the pressures and the rushing\nof tremendous activity that we regard so highly today, and a disciple (believer)\nis to be like his Master. \n\nThe central point of the kingdom of Jesus Christ is a personal relationship with \nHim, not public usefulness to others.\n\nWe need to spend more time submersing ourselves in His Word so that we\nbecome rooted and grounded in Him, then we will remain true to Him what ever\nhappens.\n\nPrayer Suggestion:\nDear Lord, Help me to put aside the business of the things \nof this world, so that I can spend more time becoming rooted\nand ground in You.Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bc9060ffd7a670",
    "date_utc": "Tue, 19 Oct 2010 06:09:34 -0500",
    "subject": "thoughts to live by",
    "verse": "\"This is the will of God, your sanctification. \" (I Thess. 4:3)",
    "reflection": "Sanctification is not a question of whether God is willing to sanctify me ~ is it my will? Am I willing to let God do in me everything that has been made possible through the atonement of the Cross of Christ? Am I willing to let Jesus become sanctification to me, and to let His life be exhibited in my human flesh? (see I Cor. 1:30) Beware of saying, \"Oh, I am longing to be sanctified. \"No your not!\" Recognize your need, but stop longing and make it a matter of action. Receive Jesus Christ to become sanctification for you by absolute, unquestioning faith, and the great miracle of the atonement of Jesus will become real to you.",
    "prayer": "Dear Lord, effect in me an obedient heart toward service and prayer, also created in me an inexpressible thanks and adoration for the gift of eternal life. Amen.",
    "reading": "",
    "original_content": "10/20/2010~~~food for thought~~~IS GOD'S WILL MY WILL ?\n\nOur Bible Verse for Today:\n\"This is the will of God, your sanctification.\" (I Thess. 4:3)\n\nOur Lesson for Today:\nSanctification is not a question of whether God is willing to sanctify me ~ \nis it my will? Am I willing to let God do in me everything that has been made\npossible through the atonement of the Cross of Christ?\n\nAm I willing to let Jesus become sanctification to me, and to let His life be\nexhibited in my human flesh? (see I Cor. 1:30)\n\nBeware of saying, \"Oh, I am longing to be sanctified. \"No your not!\"\nRecognize your need, but stop longing and make it a matter of action.\n\nReceive Jesus Christ to become sanctification for you by absolute,\nunquestioning faith, and the great miracle of the atonement of Jesus\nwill become real to you.\n\nPrayer Suggestion:\nDear Lord, effect in me an obedient heart toward service and prayer,\nalso created in me an inexpressible thanks and adoration for the gift\nof eternal life. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to The Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bce0e6cf26d2a1",
    "date_utc": "Wed, 20 Oct 2010 05:56:12 -0500",
    "subject": "thoughts to live by",
    "verse": "But you, beloved, must continue to build your lives on the foundation of your holy faith. And continue to pray as you are directed by the Holy Spirit. \" (Jude 20)",
    "reflection": "In order to pray being led by the Holy Spirit, we need to build up the foundation of our faith. To pray as we are (directed by the Holy Spirit) means to pray in the power and strength of the Holy Spirit. He prays for us (Ro. 8:26, 27) He opens our mind to Jesus (Jn. 14:26) And He teaches us about Him (Jn. 15:26). John warns us to live close to God and His people, not listening to false teachers who would try to pull us away from Him (Jn. 15:9, 10).",
    "prayer": "Dear Lord, Help me to continue building up my holy faith, that I may remain faithful, and allow the Holy Spirit to lead me in the way of righteousness. Amen.",
    "reading": "",
    "original_content": "10/21/2010~~~food for thought~~~\n\nOur Bible Verse for Today:\nBut you, beloved, must continue to build your lives on the foundation \nof your holy faith. And continue to pray as you are directed by the Holy \nSpirit.\" (Jude 20)\n\nOur Lesson for Today:\nIn order to pray being led by the Holy Spirit, we need to build up the \nfoundation of our faith.\n\nTo pray as we are (directed by the Holy Spirit) means to pray in the \npower and strength of the Holy Spirit.\n\nHe prays for us (Ro. 8:26, 27)\nHe opens our mind to Jesus (Jn. 14:26) And\nHe teaches us about Him (Jn. 15:26).\n\nJohn warns us to live close to God and His people, not listening to false \nteachers who would try to pull us away from Him (Jn. 15:9, 10).\n\nPrayer Suggestion:\nDear Lord, Help me to continue building up my holy faith,\nthat I may remain faithful, and allow the Holy Spirit to lead \nme in the way of righteousness. Amen.\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bd34a05d6449ce",
    "date_utc": "Thu, 21 Oct 2010 05:34:54 -0500",
    "subject": "thoughts to live by",
    "verse": "\"The Spirit Himself bears witness with our Spirit. \" (Ro. 8:16)",
    "reflection": "The Spirit of God witnesses to the redemption of our Lord, and nothing else. He cannot witness to our reason. WHY? ? ? Because we are inclined to mistake the simplicity that comes from our natural commonsense decisions for the witness of the Spirit, but the Spirit witnesses only to His own nature, and to the work of redemption, never to our reason. If we are trying to make Him witness to our reason, it is no wonder that we are in darkness and uncertainty. ~ Throw it all over board, trust in Him, and He will give you the witness of the Spirit.",
    "prayer": "Dear Lord, I thank You for Your Spirit's presence, and guidance to witness in accordance with Your will. Amen.",
    "reading": "",
    "original_content": "10/22/2010~~~food for thought~~~THE WITNESS OF THE SPIRIT\n\nOur Bible Verse for Today:\n\"The Spirit Himself bears witness with our Spirit.\" (Ro. 8:16)\n\nOur Lesson for Today:\nThe Spirit of God witnesses to the redemption of our Lord, and nothing else.\nHe cannot witness to our reason. WHY? ? ?\n\nBecause we are inclined to mistake the simplicity that comes from our natural \ncommonsense decisions for the witness of the Spirit, but the Spirit witnesses \nonly to His own nature, and to the work of redemption, never to our reason.\n\nIf we are trying to make Him witness to our reason, it is no wonder that we are \nin darkness and uncertainty. ~ Throw it all over board, trust in Him, and He will \ngive you the witness of the Spirit.\n\nPrayer Suggestion:\nDear Lord, I thank You for Your Spirit's presence, \nand guidance to witness in accordance with Your\nwill. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bd859438ce1826",
    "date_utc": "Fri, 22 Oct 2010 05:25:45 -0500",
    "subject": "thoughts to live by",
    "verse": "If anyone is in Christ, he is a new creation; old things have passed away; behold all things have become new. \" (II Cor. 5:17)",
    "reflection": "When we are born again, the Holy Spirit begins to work His new creation in us, and there will come a time when there is nothing remaining of the old life. Our old gloomy outlook disappears, as does our old attitude toward things, and: ~ \"all things are of God\" (II Cor. 5:8) How are we going to get a life that has no lust, no self-interest, and is not sensitive to the ridicule of others? ~ How will we have the type of love that \"is kind ~ is not provoked, and thinks no evil\"? (I Cor. 13:4, 5) The only way is by allowing nothing of the old life to remain, and by having only simple, perfect trust in God ~ such a trust that we no longer want God's blessing, but only want God Himself. Have we come to the point where God can withdraw His blessings from us without our trust in Him being affected? Once we truly see God at work, we will never be concerned again about the things that happen, because we are actually trusting in our Father in heaven, whom the world cannot see.",
    "prayer": "Dear Lord, help me to turn from my old ways, and put my total trust in You alone. Amen.",
    "reading": "",
    "original_content": "10/23/2010~~~food for thought~~~\n\nOur Bible Verse for Today:\nIf anyone is in Christ, he is a new creation; old things have passed\naway; behold all things have become new.\" (II Cor. 5:17)\n\nOur Lesson for Today:\nWhen we are born again, the Holy Spirit begins to work His new creation\nin us, and there will come a time when there is nothing remaining of the\nold life. Our old gloomy outlook disappears, as does our old attitude\ntoward things, and: ~ \"all things are of God\" (II Cor. 5:8)\n\nHow are we going to get a life that has no lust, no self-interest, and is not\nsensitive to the ridicule of others? ~ How will we have the type of love that \n\"is kind ~ is not provoked, and thinks no evil\"? (I Cor. 13:4, 5)\n\nThe only way is by allowing nothing of the old life to remain, and by having \nonly simple, perfect trust in God ~ such a trust that we no longer want God's \nblessing, but only want God Himself.\n\nHave we come to the point where God can withdraw His blessings from us\nwithout our trust in Him being affected? Once we truly see God at work, we \nwill never be concerned again about the things that happen, because we are \nactually trusting in our Father in heaven, whom the world cannot see.\n\nPrayer Suggestion:\nDear Lord, help me to turn from my old ways, and put my\ntotal trust in You alone. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bdd8d1986eff1d",
    "date_utc": "Sat, 23 Oct 2010 04:57:07 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Thanks be to God who always leads us in triumph in Christ. \" (II Cor. 2:14)",
    "reflection": "The proper perspective of a servant of God must not simply be as near to the highest as he/she can get, but it must be the highest. Be careful to vigorously maintain God's perspective, and remember that it must be done every day, little by little. The proper perspective to maintain is that we are here for only one purpose, to be captives marching in the procession of Christ's triumphs. We are not on display in God's showcase ~ we are here to exhibit only one thing - the \"captivity [of our lives] to the obedience of Christ\" (II Cor. 10:5). No outside power can touch the proper perspective.",
    "prayer": "Dear Lord, Help me to always maintain the proper perspective. Amen.",
    "reading": "",
    "original_content": "10/24/2010~~~food for thought~~~THE PROPER PERSPECTIVE\n\nOur Bible Verse for Today:\n\"Thanks be to God who always leads us in triumph in Christ.\"\n(II Cor. 2:14)\n\nOur Lesson for Today:\nThe proper perspective of a servant of God must not simply be as near \nto the highest as he/she can get, but it must be the highest. Be careful\nto vigorously maintain God's perspective, and remember that it must be \ndone every day, little by little.\n\nThe proper perspective to maintain is that we are here for only one purpose,\nto be captives marching in the procession of Christ's triumphs.\n\nWe are not on display in God's showcase ~ we are here to exhibit only one\nthing - the \"captivity [of our lives] to the obedience of Christ\" (II Cor. 10:5).\n\nNo outside power can touch the proper perspective.\n\nPrayer Suggestion:\nDear Lord,Help me to always maintain the proper\nperspective.Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12be28decef75e89",
    "date_utc": "Sun, 24 Oct 2010 05:04:12 -0500",
    "subject": "thoughts to live by",
    "verse": "\"I have become all things to all men, that I might by all means save some. \" (I Cor. 9:22)",
    "reflection": "A Christian worker has to learn how to be God's man or woman of great worth and excellence in the midst of a multitude of meager and worthless things. We should never protest by saying, \"If only were somewhere else!\" All of God's people are ordinary people who have been made extraordinary by the purpose He has given them. Unless we have the right purpose intellectually in our minds and lovingly in our hearts, we will very quickly be diverted from being useful to God. We are not workers for God by choice. Many people deliberately choose to be workers, but they have no purpose of God's almighty grace or His mighty Word in them. Paul's whole heart, mind, and soul were consumed with the great purpose of what Jesus Christ came to do, and he never lost sight of that one thing. W must continually confront ourselves with one central fact ~ \". Jesus Christ and Him crucified. \" (I Cor. 2:2) Never choose to be a worker, but once God has placed His call upon you, woe be to you if you \"turn aside. to the right or the left. \" (Deut. 28:14) He will do with you what He never did before His call came to you, and He will do with you what He is not doing with other people. Let Him have His way.",
    "prayer": "Dear Heavenly Father, Help to find my way, so that I might be found faithful in Your eyes. Amen.",
    "reading": "",
    "original_content": "10/25/2010~~~food for thought~~~SUBMITTING TO GOD'S PURPOSE\nOur Bible Verse for Today:\n\n\"I have become all things to all men, that I might\nby all means save some.\" (I Cor. 9:22)\n\nOur Lesson for Today:\nA Christian worker has to learn how to be God's man or woman\nof great worth and excellence in the midst of a multitude of meager\nand worthless things.\n\nWe should never protest by saying, \"If only were somewhere else!\"\nAll of God's people are ordinary people who have been made extraordinary\nby the purpose He has given them. Unless we have the right purpose \nintellectually in our minds and lovingly in our hearts, we will very quickly\nbe diverted from being useful to God.\n\nWe are not workers for God by choice. Many people deliberately choose \nto be workers, but they have no purpose of God's almighty grace or His \nmighty Word in them. Paul's whole heart, mind, and soul were consumed \nwith the great purpose of what Jesus Christ came to do, and he never lost\nsight of that one thing.\n\nW must continually confront ourselves with one central fact ~ \n\".Jesus Christ and Him crucified.\" (I Cor. 2:2)\n\nNever choose to be a worker, but once God has placed His call upon you,\nwoe be to you if you \"turn aside. to the right or the left. \" (Deut. 28:14)\nHe will do with you what He never did before His call came to you, and He\nwill do with you what He is not doing with other people. Let Him have His way.\n\nPrayer Suggestion:\nDear Heavenly Father, Help to find my way,\nso that I might be found faithful in Your eyes.Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12be7eb0b6b78cf5",
    "date_utc": "Mon, 25 Oct 2010 05:28:06 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus said to them again. As the Father has sent me, I also send you. (Jn. 20:21)",
    "reflection": "A missionary is someone sent by Jesus Christ just as He was sent by God. The great controlling factor is not the needs of the people, but the command of Jesus. The source of our inspiration in our service to God is behind us, not ahead of us. The tendency today is to put the inspiration out in front ~ to sweep everything together in front of us and make it conform to our definition of success. But in the New Testament the inspiration is put behind us, and is the Lord Jesus Himself. The goal is to be true to Him ~ to carry out His plans.",
    "prayer": "Dear Lord, help me to stay true to Your plans. Amen.",
    "reading": "",
    "original_content": "10/26/2010~~~food for thought~~~WHAT IS A MISSIONARY?\n\nOur Bible Verse for Today:\nJesus said to them again, \". As the Father has sent me,\nI also send you.\" (Jn. 20:21)\n\nOur Lesson for Today:\nA missionary is someone sent by Jesus Christ just as He was sent by God.\nThe great controlling factor is not the needs of the people, but the command \nof Jesus. The source of our inspiration in our service to God is behind us, not \nahead of us.\n\nThe tendency today is to put the inspiration out in front ~ to sweep everything \ntogether in front of us and make it conform to our definition of success. But in\nthe New Testament the inspiration is put behind us, and is the Lord Jesus Himself.\n\nThe goal is to be true to Him ~ to carry out His plans.\n\nPrayer Suggestion:\nDear Lord, help me to stay true to Your plans. Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bed55826ca53f2",
    "date_utc": "Wed, 27 Oct 2010 05:56:30 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Go therefore and make disciples of all nations. \" (Mt. 28:19)",
    "reflection": "LISTEN ~ Jesus did not say, \"Go save souls\" (the salvation of souls is the supernatural work of God). What Jesus said was \"Go. make disciples of all nations. \" BUT you cannot make disciples unless you are a disciple yourself. When the disciples returned from their first mission, we are told they were filled with joy because even the demons were subject to them. But Jesus said, in effect, \"Don't rejoice in successful service, the great secret of joy is that you have the right relationship with Me. \" (see Lk. 10:17-20) A missionary's most important essential is remaining true to the call of God, and realizing that his one and only purpose is to disciple men and women to Jesus.",
    "prayer": "Dear Lord, Help me to have the right relationship with you, so that I do not to get in the way of Your work. Amen.",
    "reading": "",
    "original_content": "10/27/2010~~~food for thought~~~THE METHOD OF MISSIONS\n\nOur Bible Verse for Today:\n\"Go therefore and make disciples of all nations.\" (Mt. 28:19)\n\nOur Lesson for Today:\nLISTEN ~ Jesus did not say, \"Go save souls\" (the salvation of souls\nis the supernatural work of God). What Jesus said was \"Go.make\ndisciples of all nations.\" BUT you cannot make disciples unless you\nare a disciple yourself.\n\nWhen the disciples returned from their first mission, we are told they were\nfilled with joy because even the demons were subject to them. But Jesus\nsaid, in effect, \"Don't rejoice in successful service, the great secret of joy \nis that you have the right relationship with Me.\" (see Lk. 10:17-20)\n\nA missionary's most important essential is remaining true to the call of God, \nand realizing that his one and only purpose is to disciple men and women to \nJesus.\n\nPrayer Suggestion:\nDear Lord, Help me to have the right relationship with you, \nso that I do not to get in the way of Your work. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bf22d435e06752",
    "date_utc": "Wed, 27 Oct 2010 06:29:35 -0500",
    "subject": "thoughts to live by",
    "verse": "If when we were enemies we were reconciled to God through the death of His Son, much more, having been reconciled, we shall be saved by His life. (Ro. 5:10)",
    "reflection": "I am not saved by believing ~ I simply realize I am saved by believing. And it is not repentance that saves me ~ repentance is only the sign that I realize what God has done through Christ Jesus. The danger here is: putting the emphasis on the effect, instead of on the cause. Is it: my obedience, consecration, and dedication that make me right with God? It is never that! I am made right with God because, prior to all of that, Christ died. When I turn to God and by belief accept what God reveals, the miraculous atonement by the cross of Christ instantly places me into a right relationship with God. And as a result, of the supernatural miracle of God's grace I stand justified, not because I'm sorry for my sins, or because I have repented, but because of what Jesus has done. The Spirit of God brings justification with a shattering, radiant light, and I know that I am saved, even though I don't know fully how it was accomplished.",
    "prayer": "Dear Lord, I thank You for the miracle of salvation through Jesus Christ's death on the cross. Amen.",
    "reading": "",
    "original_content": "10/28/2010~~~food for thought~~~JUSTIFICATION BY FAITH\n\nOur Bible Verse for Today:\nIf when we were enemies we were reconciled to God through the \ndeath of His Son, much more, having been reconciled, we shall \nbe saved by His life. (Ro. 5:10)\n\nOur Lesson for Today:\nI am not saved by believing ~ \nI simply realize I am saved by believing.\n\nAnd it is not repentance that saves me ~ \nrepentance is only the sign that I realize what God has done through Christ Jesus.\n\nThe danger here is: putting the emphasis on the effect, instead of on the cause.\nIs it: my obedience, consecration, and dedication that make me right with God?\nIt is never that! I am made right with God because, prior to all of that, Christ died.\n\nWhen I turn to God and by belief accept what God reveals, the miraculous atonement \nby the cross of Christ instantly places me into a right relationship with God.\n\nAnd as a result, of the supernatural miracle of God's grace I stand justified, not\nbecause I'm sorry for my sins, or because I have repented, but because of what \nJesus has done.\n\nThe Spirit of God brings justification with a shattering, radiant light, and I know that \nI am saved, even though I don't know fully how it was accomplished.\n\nPrayer Suggestion:\nDear Lord, I thank You for the miracle of salvation\nthrough Jesus Christ's death on the cross. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bf73b6a4d56449",
    "date_utc": "Thu, 28 Oct 2010 06:28:40 -0500",
    "subject": "thoughts to live by",
    "verse": "\"He made Him who knew no sin to be sin for us, that we might become the righteousness of God in Him. \" (II Cor. 5:21)",
    "reflection": "The 'modern' view of the death of Jesus is that He died for our sins out of sympathy for us. But the New Testament view is that He took our sin on Himself not because of sympathy, but, because of His identification with us. He was \"made. to be sin. \" Our sins are removed because of the death of Jesus, and the only explanation for His death is His obedience to His Father, not His sympathy for us. We are acceptable to God not because we have obeyed, nor because we have promised to give up things, but because of the death of Christ, and for no other reason. We say that Jesus came to reveal the fatherhood and the loving kindness of God, but the New Testament says He came to \"take away sin of the world. \" (Jn. 1:29) and the revealing of the Fatherhood of God is only for those whom Jesus has been introduced as Savior.",
    "prayer": "Dear Lord, I thank you for paying the penalty for my sins. I pray that Your Spirit may be seen in my love for others. Amen.",
    "reading": "",
    "original_content": "10/29/2010~~~food for thought~~~SUBSTITUTION\n\nOur Bible Verse for Today:\n\"He made Him who knew no sin to be sin for us, that we might become\nthe righteousness of God in Him.\" (II Cor. 5:21)\n\nOur Lesson for Today:\nThe 'modern' view of the death of Jesus is that He died for our sins out\nof sympathy for us. But the New Testament view is that He took our sin\non Himself not because of sympathy, but, because of His identification\nwith us.\n\nHe was \"made.to be sin.\" Our sins are removed because of the\ndeath of Jesus, and the only explanation for His death is His obedience\nto His Father, not His sympathy for us.\n\nWe are acceptable to God not because we have obeyed, nor because \nwe have promised to give up things, but because of the death of Christ,\nand for no other reason.\n\nWe say that Jesus came to reveal the fatherhood and the loving kindness \nof God, but the New Testament says He came to \"take away sin of the world.\"\n(Jn. 1:29) and the revealing of the Fatherhood of God is only for those whom\nJesus has been introduced as Savior.\n\nPrayer Suggestion:\nDear Lord, I thank you for paying the penalty for\nmy sins. I pray that Your Spirit may be seen in\nmy love for others. Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12bfdbbabfd763bf",
    "date_utc": "Fri, 29 Oct 2010 08:25:10 -0500",
    "subject": "",
    "verse": "\"Without faith it is impossible to please Him. \" (Heb. 11:6)",
    "reflection": "For every detail of common sense in life, there is a truth God has revealed by which we can prove in our practical experience what we believe God to be. Faith is a tremendously active principle that always puts Jesus Christ first. The life of faith says, \"Lord you have said it, it appears to be irrational, but I'm going to step out boldly, trusting in Your Word\" (for example, see Mathew 6:33).",
    "prayer": "Dear Heavenly Father, give me the strength to step out in faith as I should. Amen.",
    "reading": "",
    "original_content": "10/30/2010~~~food for thought~~~FAITH\n\nOur Bible Verse for Today:\n\"Without faith it is impossible to please Him.\" (Heb. 11:6)\n\nOur Lesson for Today:\nFor every detail of common sense in life, there is a truth God has\nrevealed by which we can prove in our practical experience what\nwe believe God to be. Faith is a tremendously active principle that\nalways puts Jesus Christ first.\n\nThe life of faith says, \"Lord you have said it, it appears to be irrational,\nbut I'm going to step out boldly, trusting in Your Word\" (for example, \nsee Mathew 6:33).\n\nPrayer Suggestion:\nDear Heavenly Father, give me the strength to \nstep out in faith as I should. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12c03034990a3566",
    "date_utc": "Sat, 30 Oct 2010 13:23:32 -0500",
    "subject": "thoughts to live by",
    "verse": "\"if you have faith as a mustard seed. nothing will be impossible for you. \" (Mt. 17:20)",
    "reflection": "\"Faith\" is the key, but not in ourselves but in the power of God. Jesus said that even faith as small or undeveloped as a mustard seed will be sufficient. Could it have been that the disciples had tried to cast out the demon with their own ability rather than God's? There is great power in even a little faith when we trust in God's power to act. If we feel weak or powerless as Christians, we should examine our faith, making sure we are trusting God's power, not in our own ability to produce results.",
    "prayer": "Dear Lord, help me to make a honest examination of my faith. Give me just enough faith to always trust in Your Power. Amen.",
    "reading": "",
    "original_content": "10/31/2010~~~food for thought~~~THE TRIAL OF FAITH\n\nOur Bible Verse for Today:\n\"if you have faith as a mustard seed.nothing will be\nimpossible for you.\" (Mt. 17:20)\n\nOur Lesson for Today:\n\"Faith\" is the key, but not in ourselves but in the power of God.\nJesus said that even faith as small or undeveloped as a mustard \nseed will be sufficient.\n\nCould it have been that the disciples had tried to cast out the\ndemon with their own ability rather than God's? There is great \npower in even a little faith when we trust in God's power to act. \n\nIf we feel weak or powerless as Christians, we should examine\nour faith, making sure we are trusting God's power, not in our own\nability to produce results.\n\nPrayer Suggestion:\nDear Lord, help me to make a honest examination \nof my faith. Give me just enough faith to always trust\nin Your Power. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12c06cc3cb530a6e",
    "date_utc": "Sun, 31 Oct 2010 13:19:50 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Do you not know that. you are not your own?\" (I Cor. 6:19)",
    "reflection": "There is no such thing as a private life, ~ or ~ a place to hide in this world, for a man or woman who is intimately aware of ~ and~ shares in the suffering of Jesus Christ. God divides the private life of His saints and makes it a highway for the world on one hand and for Himself on the other. ~ No ~ human being can stand unless He is identified with Jesus Christ. We are not sanctified for ourselves. ~ We are called ~ into intimacy with the gospel, and things happen that appear to have nothing to do with us. ~ But~ God is getting us into fellowship with Himself. ~ Let Him have His way. ~ If ~ you refuse, you will be of no value to God in His redemptive work in the world, ~ but ~ will be a hindrance and a stumbling block.",
    "prayer": "Dear Lord, help me to grow in faith that I may have a more intimate relationship with You. Amen.",
    "reading": "",
    "original_content": "11/1/2010~~~food for thought~~~\"YOU ARE NOT YOUR OWN\"\n\nOur Bible Verse for Today:\n\"Do you not know that . you are not your own?\" (I Cor. 6:19)\n\nOur Lesson for Today:\nThere is no such thing as a private life, ~ or ~ a place to hide in this world, \nfor a man or woman who is intimately aware of ~ and~ shares in the suffering\nof Jesus Christ.\n\nGod divides the private life of His saints and makes it a highway for the world on \none hand and for Himself on the other. ~ No ~ human being can stand unless He \nis identified with Jesus Christ.\n\nWe are not sanctified for ourselves. ~ We are called ~ into intimacy with the gospel, \nand things happen that appear to have nothing to do with us. ~ But~ God is getting \nus into fellowship with Himself. ~ Let Him have His way. ~ If ~ you refuse, you will\nbe of no value to God in His redemptive work in the world, ~ but ~ will be a\nhindrance and a stumbling block.\n\nPrayer Suggestion: \nDear Lord, help me to grow in faith that I may\nhave a more intimate relationship with You. Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life.\nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]