[
  {
    "message_id": "16c4fb5fbd572c16",
    "date_utc": "Thu, 01 Aug 2019 19:23:42 -0500",
    "subject": "SUNSHINE FOR YOUR SOUL",
    "verse": "For the Lord God is a sun and a shield; the Lord bestows favor and honor; no good thing does He withhold from those whose walk is blameless. (Psalms 84:11)",
    "reflection": "I prefer sunny days, but I am not a sun-worshiper. Instead, I'm a worshiper of God's Son, who shines brightly in all who believe in Him what ever the weather. Which kind of worshiper are you? LASTING HAPPINESS DOESN'T COME FROM SUNNY DAYS BUT FROM THE SON OF GOD.",
    "prayer": "",
    "original_content": "VERSE FOR 8:2:19:\n\n_For the Lord God is a sun and a shield; the Lord bestows _\n\n_favor and honor; no good thing does He withhold from _\n\n_those whose walk is blameless. _(Ps. 84:11)\n\nTHOUGHT FOR TODAY:\n\nI prefer sunny days, but I am not a sun-worshiper. Instead,\n\nI'm a worshiper of God's Son, who shines brightly in all\n\nwho believe in Him what ever the weather. Which kind of\n\nworshiper are you? LASTING HAPPINESS DOESN'T COME FROM\n\nSUNNY DAYS BUT FROM THE SON OF GOD.\n\n_PASTOR AL_",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalms 84",
    "found_reading": true
  },
  {
    "message_id": "16c5455cc7c56ced",
    "date_utc": "Fri, 02 Aug 2019 16:56:45 -0500",
    "subject": "THE LISTENING PRAYER",
    "verse": "Teach me Your way, Lord, that I may rely on Your faithfulness; give me an undivided heart, that I may fear your name. (Psalms 86:11)",
    "reflection": "Prayer is not a way of making use of God; prayer is a way of offering ourselves to God in order that He should be able to make use of us. It may be that one of our great faults in prayer is that we talk too much and listen to little. When prayer is at its highest we should wait in silence for God's voice to us. We might call this a \"listening prayer,\" and it is a practice we nee to develop. GOD SPEAKS THROUGH HIS WORD--TAKE TIME TO LISTEN.",
    "prayer": "",
    "original_content": "VERSE FOR TODAY:\n\n_Teach me Your way, Lord, that I may rely on_\n\n_Your faithfulness; give me an undivided heart,_\n\n_that I may fear your name. _(Ps. 86:11)\n\nTHOUGHT FOR TODAY:\n\nPrayer is not a way of making use of God; prayer\n\nis a way of offering ourselves to God in order that\n\nHe should be able to make use of us. It may be that\n\none of our great faults in prayer is that we talk too\n\nmuch and listen to little. When prayer is at its highest\n\nwe should wait in silence for God's voice to us. We\n\nmight call this a \"listening prayer,\" and it is a practice\n\nwe nee to develop.\n\nGOD SPEAKS THROUGH HIS WORD--TAKE TIME TO LISTEN.\n\n_ PASTOR AL _",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "reading": "Psalms 86:1-12",
    "found_reading": true
  }
]
