[
  {
    "message_id": "16597fbbd7bb151f",
    "date_utc": "Sat, 01 Sep 2018 20:53:02 -0500",
    "subject": "thoughts to live by",
    "verse": "Thorns and snares are the way of the crocked; Whoever guards his soul will keep far from them. (Pro. 22:5)",
    "reflection": "Thorns and snares were often placed on paths to capture animals even people, Here thorns and snares refer to the problems that result from sin.",
    "prayer": "Dear Lord I pray for Your guidance so that I will be able to avoid the snares of this world. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Thorns and snares are the way of the crocked ; Whoever_\n\n_guards his soul will keep far from them. _(Pro. 22:5)\n\nTHOUGHT FOR TODAY:\n\nThorns and snares were often placed on paths to capture\n\nanimals even people, Here thorns and snares refer to the\n\nproblems that result from sin.\n\nPRAYER FOR TODAY:\n\nDear Lord I pray for Your guidance so that I will be able to\n\navoid the snares of this world. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1659cae9c4268610",
    "date_utc": "Sun, 02 Sep 2018 18:46:54 -0500",
    "subject": "thoughts to live by",
    "verse": "Train up a child in the way he should go, and even when he is old he will not depart from it. (Pro. 22:6)",
    "reflection": "The Gospel is the chief teaching of God's Word. We must hold the commandments before our children, and constantly teach them so that we bring them up not only with punishment, but also in reverence and the fear of God.",
    "prayer": "Dear Heavenly Father, I thank You for Your Word which helps us how to teach our children, but is also a guide in which we need to live our lives so that WE will become a living Gospel. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Train up a child in the way he should go, and even when he_\n\n_is old he will not depart from it__. _(Pro. 22:6)\n\nTHOUGHT FOR TODAY:\n\nThe Gospel is the chief teaching of God's Word. We\n\nmust hold the commandments before our children, and\n\nconstantly teach them so that we bring them up not only\n\nwith punishment, but also in reverence and the fear of God.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for Your Word which\n\nhelps us how to teach our children, but is also a guide in\n\nwhich we need to live our lives so that WE will become a\n\nliving Gospel. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165a209d48f08bbe",
    "date_utc": "Mon, 03 Sep 2018 19:44:38 -0500",
    "subject": "thoughts to live by",
    "verse": "Whoever has a bountiful eye will be blessed, for he shares his bread with the poor. (Pro. 22:9)",
    "reflection": "Works and troubles do not merit justification, but other payments. . . The fulfilling of the law eanrs a reward, for a reward properly relates to the law. Yet we should be mindful of the Gospel, which freely offers justification for Christ's sake we neither obey the Law, nor can we keep it, nor can we obey it, before we have been reconciled to God, justified, and reborn. Nor would the fulfilling of the Law please God. We are accepted by faith.",
    "prayer": "Dear Lord open and widen our narrow hearts to You, Your children, and to all. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Whoever has a bountiful eye will be blessed,_\n\n_for he shares his bread with the poor. _(Pro. 22:9)\n\nTHOUGHT FOR TODAY:\n\nWorks and troubles do not merit justification, but other\n\npayments. . . The fulfilling of the law eanrs a reward, for\n\na reward properly relates to the law.Yet we should be\n\nmindful of the Gospel, which freely offers justification\n\nfor Christ's sake we neither obey the Law, nor can we\n\nkeep it, nor can we obey it, before we have been reconciled\n\nto God, justified, and reborn. Nor would the fulfilling of the\n\nLaw please God. We are accepted by faith.\n\nPRAYER FOR TODAY:\n\nDear Lord open and widen our narrow hearts to You,\n\nYour children, and to all. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165a70aaa79b6eec",
    "date_utc": "Tue, 04 Sep 2018 19:03:39 -0500",
    "subject": "thoughts to live by",
    "verse": "He who loves purity of heart, and whose speech is gracious, will have the king as his friend. (Prov. 22:11)",
    "reflection": "The Lord looks with favor on the faithful in the land; they may dwell with Him. They who walk in the way of the blameless shall mister to Him.",
    "prayer": "Dear Heavenly Father, we pray that you would come to us, and make us people of integrity in Your Church and in Your nation. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_He who loves purity of heart, and whose speech is _\n\n_gracious, will have the king as his friend. _(Prov. 22:11)\n\nTHOUGHT FOR TODAY:\n\nThe Lord looks with favor on the faithful in the land;\n\nthey may dwell with Him. They who walk in the way\n\nof the blameless shall mister to Him.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, we pray that you would come to us,\n\nand make us people of integrity in Your Church and in Your\n\nnation. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165ac523fee96810",
    "date_utc": "Wed, 05 Sep 2018 19:39:56 -0500",
    "subject": "thoughts to live by",
    "verse": "The eyes of the Lord keep watch over knowledge, but He overthrows the words of the traitor. (Pro. 22:12)",
    "reflection": "(KNOWLEDGE) Human beings cannot always discern the truth of the situation, but God knows all things He (OVERTHROWS THE WORDS OF THE TRAITOR). God makes sure that those who would lie to or betray their neighbor will not succeed in the end.",
    "prayer": "Dear Heavenly Father, I thank You that You know all things. It makes me feel more secure as I work to serve You. I thank you that it is by Your grace I can do what I do. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The eyes of the Lord keep watch over knowledge,but _\n\n_He overthrows the words of the traitor. _(Pro. 22:12)\n\nTHOUGHT FOR TODAY:\n\n_(KNOWLEDGE)_ Human beings cannot always discern the truth\n\nof the situation, but God knows all things He _(OVERTHROWS THE_\n\n_ WORDS OF THE TRAITOR). _God makes sure that those who would\n\nlie to or betray their neighbor will not succeed in the end.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You that You know all things.\n\nIt makes me feel more secure as I work to serve You. I thank\n\nyou that it is by Your grace I can do what I do. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165b10010ee37859",
    "date_utc": "Thu, 06 Sep 2018 17:28:16 -0500",
    "subject": "thoughts to live by",
    "verse": "Folly is bound up in the heart of a child, but the rod of discipline drives it far from him. (Pro. 22:15)",
    "reflection": "\"Heart of a child\" I think many tend to think of children as morally neutral at worst. BUT THE Bible does not; it says we are born with a sinful nature. Godly education means not merely bringing the child's good talents to light but also driving out the bad. The Bible does approve of corporal punishment. HOWEVER. it does not envision the sort of abuse that would maim, or kill a child, BUT rather it promotes discipline that instructs.",
    "prayer": "Dear Heavenly Father, I pray for those poor children who have had to live in conditions which will only cause to another generation of abused children. Its only by Your grace that this can be discontinued Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Folly is bound up in the heart of a child, but the rod of discipline\n_\n\n_drives it far from him. _(Pro. 22:15)\n\nTHOUGHT FOR TODAY:\n\n_\"Heart of a child\" _I think many tend to think of children as\nmorally\n\nneutral at worst. BUT THE Bible does not; it says we are born with a\n\nsinful nature. Godly education means not merely bringing the child's\n\ngood talents to light but also driving out the bad. The Bible does\napprove\n\nof corporal punishment. HOWEVER. it does not envision the sort of\nabuse\n\nthat would maim, or kill a child, BUT rather it promotes discipline\nthat\n\ninstructs.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray for those poor children who have had to\n\nlive in conditions which will only cause to another generation of\n\nabused children. Its only by Your grace that this can be discontinued\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165b65531001af6a",
    "date_utc": "Fri, 07 Sep 2018 18:19:21 -0500",
    "subject": "thoughts to live by",
    "verse": "Incline your ear, and hear the words of the wise, and apply your heart to my knowledge, for it will be pleasant if you keep them within you, if all of them are ready on your lips. (Pro. 22:17, 18)",
    "reflection": "Solomon\"s primary concern is to teach his readers to trust the Lord. \"in your heart, on your lips, \" This is the Bible's way of both saying. both inwardly and outwardly. In other words be able to recite them and explain the connections between them.",
    "prayer": "Dear Lord, forgive me for becoming lax in putting Your Word to memory. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Incline your ear, and hear the words of the wise, and apply your_\n\n_heart to my knowledge, for it will be pleasant if you keep them_\n\n_within you, if all of them are ready on your lips._ (Pro.22:17, 18)\n\nTHOUGHT FOR TODAY:\n\nSolomon\"s primary concern is to teach his readers to trust the Lord.\n\n_\"in your heart, on your lips,\" _This is the Bible's way of both\nsaying.\n\nboth inwardly and outwardly. In other words be able to recite them\n\nand explain the connections between them.\n\nPRAYER FOR TODAY:\n\nDear Lord, forgive me for becoming lax in putting Your Word to\n\nmemory. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165bb9336bdd071a",
    "date_utc": "Sat, 08 Sep 2018 18:45:12 -0500",
    "subject": "thoughts to live by",
    "verse": "make no friendship with a man given to anger, nor go with a wrathful man, lest you learn his ways, and entangle yourself in a snare. (Pro. 22:24, 25)",
    "reflection": "Angry people tend to exploit other; if we associate with them we learn the think like they do.",
    "prayer": "Dear Heavenly Father, it is my prayer that I would be sensitive to Your Holy Spirit's guidance so that I would not fall into the trap of associating with those would lead me down the path of unrighteousness. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_make no friendship with a man given to anger, nor go _\n\n_with a wrathful man, lest you learn his ways, and entangle_\n\n_yourself in a snare. _(Pro. 22:24, 25)\n\nTHOUGHT FOR TODAY:\n\nAngry people tend to exploit other; if we associate\n\nwith them we learn the think like they do.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, it is my prayer that I would be\n\nsensitive to Your Holy Spirit's guidance so that I would\n\nnot fall into the trap of associating with those would\n\nlead me down the path of unrighteousness. . .Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165c09361333428c",
    "date_utc": "Sun, 09 Sep 2018 18:03:29 -0500",
    "subject": "thoughts to live by",
    "verse": "Do not speak in the hearing of a fool. for he will despise the good sense of your words. . . (Pro. 23:9)",
    "reflection": "Fools only want to hear their own WISDOM. One cannot directly correct a fool and expect to make any headway.",
    "prayer": "Dear Heavenly Father, I pray that Your Spirit will advice me as to how I should approach those who are less than approachable. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Do not speak in the hearing of a fool. for he will despise_\n\n_the good sense of your words. . ._(Pro. 23:9)\n\nTHOUGHT FOR TODAY:\n\nFools only want to hear their own _WISDOM.. _One cannot\n\ndirectly correct a fool and expect to make any headway.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that Your Spirit will advice\n\nme as to how I should approach those who are less than\n\napproachable. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165c5d7b1a905711",
    "date_utc": "Mon, 10 Sep 2018 18:36:12 -0500",
    "subject": "thoughts to live by",
    "verse": "The father of the righteous will greatly rejoice; he who fathers a wise son will be glad in him. (Pro. 23:24)",
    "reflection": "Good parents have reason to rejoice when they see their children growing wisely. this brings them more joy than if their children become rich and successful in school or work.",
    "prayer": "I thank You Lord Jesus for Your continuing presence in our lives. I pray that our children and grandchildren will grow in godly wisdom. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_The father of the righteous will greatly rejoice; he who _\n\n_fathers a wise son will be glad in him. _(Pro. 23:24)\n\nTHOUGHT FOR TODAY:\n\nGood parents have reason to rejoice when they see\n\ntheir children growing wisely. this brings them more\n\njoy than if their children become rich and successful\n\nin school or work.\n\nPRAYER FOR TODAY:\n\nI thank You Lord Jesus for Your continuing presence\n\nin our lives. I pray that our children and grandchildren\n\nwill grow in godly wisdom. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165cb0e1a1e2c218",
    "date_utc": "Tue, 11 Sep 2018 18:53:44 -0500",
    "subject": "thoughts to live by",
    "verse": "If you say, \"Behold we did not know this, \" Does not He who weighs the heart perceive it? (Pro. 24:12)",
    "reflection": "Remember claiming ignorance will not work with God, who knows whether or not we saw people in need and refused to help them. We need to remember that the One who created us and everything, else knows us through and through.",
    "prayer": "Dear Lord help me to remain faithful through life, willing to help my neighbor when in need. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_If you say, \"Behold we did not know this,\" Does not _\n\n_He who weighs the heart perceive it? _(Pro. 24:12)\n\nTHOUGHT FOR TODAY:\n\nRemember claiming ignorance will not work with God,\n\nwho knows whether or not we saw people in need and\n\nrefused to help them. We need to remember that the One\n\nwho created us and everything, else knows us through\n\nand through.\n\nPRAYER FOR TODAY:\n\nDear Lord help me to remain faithful through life, willing\n\nto help my neighbor when in need. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165dfbcbca1486ff",
    "date_utc": "Sat, 15 Sep 2018 19:16:53 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Everything is meaningless, \" says the teacher, \"utterly meaningless!\"(Ecc 1:2)",
    "reflection": "It is ironic that so many people spend so much time securing their lives on earth but take very little or no thought where they will spend eternity. few people understand that their only hope is in the Lord.",
    "prayer": "Dear Heavenly Father, please forgive me for focusing on earthly thing more than on eternal things. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_\"Everything is meaningless,\" says the teacher, \"utterly_\n\n_ meaningless_!\"(Ecc 1:2)\n\nTHOUGHT FOR TODAY:\n\nIt is ironic that so many people spend so much time securing\n\ntheir lives on earth but take very little or no thought where\n\nthey will spend eternity. few people understand that their\n\nonly hope is in the Lord.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, please forgive me for focusing\n\non earthly thing more than on eternal things. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165e4d65e086d474",
    "date_utc": "Sun, 16 Sep 2018 19:02:59 -0500",
    "subject": "thoughts to live by",
    "verse": "Generations come and go, but nothing really changes (Ecc. 1:4 )",
    "reflection": "Remember God placed the world on its foundation so it would never be moved. Yes the world is built on God's foundation and He guarantees its permanence. That same power that undergirds the world ALSO provides a firm foundation for believers.",
    "prayer": "Dear Heavenly Father, I thank You for Your faithfulness which extends to all generations, which is also as enduring as the earth You created. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Generations come and go, but nothing really changes _\n\n(Ecc. 1:4 )\n\nTHOUGHT FOR TODAY:\n\nRemember God placed the world on its foundation so\n\nit would never be moved. Yes the world is built on God's\n\nfoundation and He guarantees its permanence. That same\n\npower that undergirds the world ALSO provides a firm foundation\n\nfor believers.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I thank You for Your faithfulness\n\nwhich extends to all generations, which is also as enduring\n\nas the earth You created. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165ea237d82e85d6",
    "date_utc": "Mon, 17 Sep 2018 19:45:19 -0500",
    "subject": "thoughts to live by",
    "verse": "Everything under the sun is meaningless, like chasing the wind. What is wronged cannot be made right. what is missing cannot be recovered. (Ecc. 1:14-15)",
    "reflection": "Solomon tests our faith, challenging us to find true and lasting meaning in God alone. As you take a hard look at your life, as Solomon did his, you will see how important serving God is over all other opinions. Is God asking you to rethink your purpose and direction in life?",
    "prayer": "Dear Heavenly Father, I pray that Your Spirit would help me to be faithful in always reexamining my thinking and purpose in life. Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Everything under the sun is meaningless, like chasing the wind._\n\n_What is wronged cannot be made right. what is missing cannot_\n\n_be recovered. _(Ecc. 1:14-15)\n\nTHOUGHT FOR TODAY:\n\nSolomon tests our faith, challenging us to find true and lasting\n\nmeaning in God alone. As you take a hard look at your life, as\n\nSolomon did his, you will see how important serving God is\n\nover all other opinions.Is God asking you to rethink your purpose\n\nand direction in life?\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that Your Spirit would help me to\n\nbe faithful in always reexamining my thinking and purpose in life.\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165ef2ff5b3c9114",
    "date_utc": "Tue, 18 Sep 2018 19:17:02 -0500",
    "subject": "thoughts to live by",
    "verse": "Solomon said, \"The greater my wisdom, the greater my grief. To increase knowledge only increases sorrow. (Ecc. 1:18)",
    "reflection": "Our minds cannot fathom God's wisdom, which is hidden in Christ. We know His mercy only through the wisdom revealed to us in Holy Scripture.",
    "prayer": "O God of all mercies, You have begun good works in us. Continue we pray, to fill us with all wisdom and knowledge. Grant that Satan would have no power over us, but that our hearts and minds might be directed to the blessed hope of the coming of our Savior Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nSolomon said, \"_The greater my wisdom, the greater my grief._\n\n_To increase knowledge only increases sorrow. _(Ecc. 1:18)\n\nTHOUGHT FOR TODAY:\n\nOur minds cannot fathom God's wisdom, which is hidden in\n\nChrist. We know His mercy only through the wisdom revealed\n\nto us in Holy Scripture.\n\nPRAYER FOR TODAY:\n\nO God of all mercies, You have begun good works in us.Continue\n\nwe pray, to fill us with all wisdom and knowledge. Grant that\n\nSatan would have no power over us, but that our hearts and minds\n\nmight be directed to the blessed hope of the coming of our Savior\n\nJesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165f45d17aec78e6",
    "date_utc": "Wed, 19 Sep 2018 19:24:26 -0500",
    "subject": "thoughts to live by",
    "verse": "Solomon said to himself, \"Come now, let's give pleasure a try. Let's look for the good things in life. but I found that this, too, was meaningless. (Ecc. 2:1)",
    "reflection": "Solomon's goal was to explore what life might be for the ideally gifted and advantaged, but it was meaningless, We should not try to find enjoyment in happiness, goods, our own counsels, or any other thing; only as God has given them should we use them. One should let God have His way.",
    "prayer": "Dear Lord, Help me to be observant of the mistakes of others and give me the wisdom to not make the same mistakes. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Solomon said to himself, \"Come now, let's give pleasure_\n\n_a try. Let's look for the good things in life. but I found that_\n\n_this, too, was meaningless. _(Ecc. 2:1)\n\nTHOUGHT FOR TODAY:\n\nSolomon's goal was to explore what life might be for the\n\nideally gifted and advantaged, but it was meaningless, We\n\nshould not try to find enjoyment in happiness, goods, our\n\nown counsels, or any other thing; only as God has given\n\nthem should we use them. One should let God have His way.\n\nPRAYER FOR TODAY:\n\nDear Lord, Help me to be observant of the mistakes of others\n\nand give me the wisdom to not make the same mistakes. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165f939f8682b22e",
    "date_utc": "Thu, 20 Sep 2018 18:04:11 -0500",
    "subject": "thoughts to live by",
    "verse": "Solomon says, \"Then I saw that there is more gain in wisdom than in folly, as there is more gain in light then in darkness. the wise person has his eyes in his head, but the fool walks in darkness. And yet I perceived the same event happens to them all. (Ecc. 2:13-14)",
    "reflection": "Rich and poor have one similarity; when they die they will leave all they own behind. At the moment of death (which every one will face) both rich and poor are naked and empty handed and will face the Lord. The only riches have at that time are those we have already invested in, our eternal heritage.",
    "prayer": "Dear Heavenly Father, I know that one day I will stand before You empty handed. I pray that at that time I will have attained eternal life through faith in our Lord and Savior Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_Solomon says, \"Then I saw that there is more gain in wisdom_\n\n_than in folly, as there is more gain in light then in darkness._\n\n_the wise person has his eyes in his head, but the fool walks in _\n\n_darkness. And yet I perceived the same event happens to them _\n\n_all. _(Ecc. 2:13-14)\n\nTHOUGHT FOR TODAY:\n\nRich and poor have one similarity; when they die they will\n\nleave all they own behind. At the moment of death (which every\n\none will face) both rich and poor are naked and empty handed and\n\nwill face the Lord.. The only riches have at that time are those we\n\nhave already invested in, our eternal heritage.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I know that one day I will stand before You\n\nempty handed. I pray that at that time I will have attained eternal\n\nlife through faith in our Lord and Savior Jesus Christ. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "165fe77e11b880bf",
    "date_utc": "Fri, 21 Sep 2018 18:29:54 -0500",
    "subject": "thoughts to live by",
    "verse": "Solomon after examining his life says, \"So I turned in despair from hard work, it was not the answer to my search for satisfaction in this life. \" (Ecc. 2:20)",
    "reflection": "Solomon's point is that God has a plan for all people. God provides cycles of life, each with it's work for us to do. Although we may face many problems that seem to contradict God's plan, these should not be barriers to believing in Him but rather opportunities to discover that without God, life's problems have no lasting solutions.",
    "prayer": "Dear Heavenly Father, what would we be if You were to forsake us, if You withdrew Your Word and Your hand? Enlighten us with Your Word. Let us walk in the light of Your blessed Son, our Lord Jesus Christ. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nSolomon after examining his life says, \"_So I turned in despair_\n\n_from hard work , it was not the answer to my search for\nsatisfaction_\n\n_in this life.\" _(Ecc. 2:20)\n\nTHOUGHT FOR TODAY:\n\nSolomon's point is that God has a plan for all people. God provides\n\ncycles of life, each with it's work for us to do. Although we may\nface\n\nmany problems that seem to contradict God's plan, these should not\n\nbe barriers to believing in Him but rather opportunities to discover\n\nthat without God, life's problems have no lasting solutions.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, what would we be if You were to forsake us,\n\nif You withdrew Your Word and Your hand? Enlighten us with Your\n\nWord. Let us walk in the light of Your blessed Son, our Lord Jesus\n\nChrist. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "166036f70ab68aca",
    "date_utc": "Sat, 22 Sep 2018 17:38:47 -0500",
    "subject": "thoughts to live by",
    "verse": "God gives wisdom, knowledge, and joy to those who please Him. (Ecc. 2:26a)",
    "reflection": "Those who really know how to enjoy life are the ones who take life each day as a gift from God, thanking Him for it.",
    "prayer": "Dear Heavenly Father, You have given us many priceless gifts. by Your gracious hand, I thank you in Jesus name. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_God gives wisdom, knowledge, and joy to those who please Him._\n\n(Ecc. 2:26a)\n\nTHOUGHT FOR TODAY:\n\nThose who really know how to enjoy life are the ones who take\n\nlife each day as a gift from God, thanking Him for it.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, You have given us many priceless gifts.\n\nby Your gracious hand, I thank you in Jesus name. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "166084ff3d513780",
    "date_utc": "Sun, 23 Sep 2018 16:22:29 -0500",
    "subject": "thoughts to live by",
    "verse": "For everything there is a season, and a time for every matter under the sun. (Ecc. 3:1)",
    "reflection": "All human works and efforts have a certain and definite time of acting, of beginning, and ending, beyond human control. this is spoken in opposition to free will. it is not up to us to prescribe the time, the manner, or the effect of the things that are to be done; and so it is obvious that here our strivings and efforts are unreliable.",
    "prayer": "Dear Heavenly Father. I pray that I would always follow Your guidance. May I always be found faithful in what ever You ask me to do. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_For everything there is a season, and a time for every_\n\n_matter under the sun._ (Ecc. 3:1)\n\nTHOUGHT FOR TODAY:\n\nAll human works and efforts have a certain and definite time\n\nof acting, of beginning, and ending, beyond human control.\n\nthis is spoken in opposition to free will. it is not up to us to\n\nprescribe the time, the manner, or the effect of the things that\n\nare to be done; and so it is obvious that here our strivings and\n\nefforts are unreliable.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father. I pray that I would always follow\n\nYour guidance. May I always be found faithful in what\n\never You ask me to do. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1660e0ba42fe7987",
    "date_utc": "Mon, 24 Sep 2018 19:05:36 -0500",
    "subject": "thoughts to live by",
    "verse": "A time to be born, and a time to die; a time to plant and a time to pluck up what was planted; (Ecc. 3:2)",
    "reflection": "born. . . . die as we think about these appointed times it seems painfully short to us. . . To plant and pluck are as short as an agricultural season A wise person should grasp these rhythms of life and live in agreement with them because these are the allotted times our Lord has placed us in.",
    "prayer": "Dear Heavenly Father, I pray that I would, by Your Holy Spirit's guidance fulfill these time slots in accordance with Your will. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_A time to be born, and a time to die; a time to plant and a_\n\n_time to pluck up what was planted; _(Ecc. 3:2)\n\nTHOUGHT FOR TODAY:\n\n_born. . . . die _as we think about these appointed times it\n\nseems painfully short to us. . . To _plant _and_ pluck_ are as\n\nshort as an agricultural season A wise person should grasp\n\nthese rhythms of life and live in agreement with them because\n\nthese are the allotted times our Lord has placed us in.\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that I would, by Your Holy Spirit's\n\nguidance fulfill these time slots in accordance with Your will. . .\n\nAmen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16612c5eddd4786f",
    "date_utc": "Tue, 25 Sep 2018 17:07:33 -0500",
    "subject": "thoughts to live by",
    "verse": "(Ecc. 3:3) says: There is a time to kill, and a time to heal; a time to break down, and a time to build up;",
    "reflection": "The term here is applied to those in earthly positions of authority who are to serve God and people. God allows governments to us the death penalty.",
    "prayer": "Thank You Lord, for caring for us through those you have put in authority over us. Guide them to use their authority according to Your will, and help us to obey them. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n(Ecc. 3:3) says: _There is a time to kill, and a time to heal;_\n\n_a time to break down, and a time to build up;_\n\nTHOUGHT FOR TODAY:\n\nThe term here is applied to those in earthly positions of\n\nauthority who are to serve God and people. God allows\n\ngovernments to us the death penalty.\n\nPRAYER FOR TODAY:\n\nThank You Lord, for caring for us through those you have\n\nput in authority over us. Guide them to use their authority\n\naccording to Your will, and help us to obey them. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16618a90049dffb8",
    "date_utc": "Wed, 26 Sep 2018 20:33:41 -0500",
    "subject": "thoughts to live by",
    "verse": "Ec. 3:4 says: There is a time to weep, and a time to laugh; a time to mourn, and a time to dance.",
    "reflection": "Jesus says in His Sermon on the Mount, to live in harmony with one another; He says, rejoice with those who rejoice, and weep with those who weep.",
    "prayer": "Dear Lord, Help me to be the best neighbor I can be, help me see the needs of others. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nEc. 3:4 says: _There is a time to weep, and a time to laugh;_\n\n_a time to mourn, and a time to dance._\n\nTHOUGHT FOR TODAY:\n\nJesus says in His Sermon on the Mount,_ to live in harmony_\n\n_with one another; He says, rejoice with those who rejoice, and_\n\n_weep with those who weep._\n\nPRAYER FOR TODAY:\n\nDear Lord, Help me to be the best neighbor I can be, help me\n\nsee the needs of others. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1661d7d757d7cb00",
    "date_utc": "Thu, 27 Sep 2018 19:04:13 -0500",
    "subject": "thoughts to live by",
    "verse": "There is a time to scatter stones and a time to gather stones. A time to embrace and a time to turn away. (Ec. 3:5)",
    "reflection": "Solomon's point of view in these verses is that God has a plan for all people. In doing this he shows us that God provides numerous cycles in life, each with its work for us to do. Although we may face many problems that seem to contradict God's plan, these should not be barriers to believe in Him.",
    "prayer": "Help me to understand that without You, lives opportunities have no lasting solutions. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_There is a time to scatter stones and a time to gather stones._\n\n_A time to embrace and a time to turn away. _(Ec. 3:5)\n\nTHOUGHT FOR TODAY:\n\nSolomon's point of view in these verses is that God has a\n\nplan for all people. In doing this he shows us that God\n\nprovides numerous cycles in life, each with its work for us\n\nto do. Although we may face many problems that seem to\n\ncontradict God's plan,these should not be barriers to believe\n\nin Him.\n\nPRAYER FOR TODAY:\n\nHelp me to understand that without You, lives opportunities have\n\nno lasting solutions. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16622918d8f594c0",
    "date_utc": "Fri, 28 Sep 2018 18:44:16 -0500",
    "subject": "thoughts to live by",
    "verse": "There is a time to search and a time to lose; a time to keep and a time to throw away. (Ec. 3:6)",
    "reflection": "Timing is important. All the experiences listed in these verses are appropriate at certain times. the secret to peace with God is to discover, accept, and appreciate God's perfect timing. The danger is to doubt or resent God's timing. This can lead to despair, rebellion, or moving ahead without His advice.",
    "prayer": "Dear heavenly Father, I pray that when I become impatient You will rein me in so that I will not run out ahead of You, thus falling into despair. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_There is a time to search and a time to lose; a time_\n\n_to keep and a time to throw away. _(Ec. 3:6)\n\nTHOUGHT FOR TODAY:\n\nTiming is important. All the experiences listed in these verses\n\nare appropriate at certain times. the secret to peace with God\n\nis to discover, accept, and appreciate God's perfect timing.\n\nThe danger is to doubt or resent God's timing. This can lead\n\nto despair, rebellion, or moving ahead without His advice.\n\nPRAYER FOR TODAY:\n\nDear heavenly Father, I pray that when I become impatient\n\nYou will rein me in so that I will not run out ahead of You,\n\nthus falling into despair. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "16627dd95068e081",
    "date_utc": "Sat, 29 Sep 2018 19:25:25 -0500",
    "subject": "thoughts to live by",
    "verse": "There is a time to tear, and a time to sew: a time to keep silent, and a time to speak. (Ec. 3:7)",
    "reflection": "tear. . . sew. A time to undo what we have done and a time to repair what we have undone. silence. . . speak -- Slow to speak -quick to listen. A time to be silent when words violate the Eight Commandment, and a time to speak the healing words of God. The time for changes should be discretely weighed, as to when the tongue ought to be restrained, or when it might speak the wonderful words of comfort.",
    "prayer": "Dear Lord, I pray for the wisdom to weigh my words carefully so that I have the words You would have me to share to one who may be hurting from careless words that may have been spoken by another. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\n_There is a time to tear, and a time to sew: a time to_\n\n_ keep silent, and a time to speak. _(Ec. 3:7)\n\nTHOUGHT FOR TODAY:\n\ntear. . . sew. A time to undo what we have done and a time to\n\nrepair what we have undone. _silence. . . speak_ -- Slow to speak -quick to listen. A time to be silent when words violate the Eight\n\nCommandment, and a time to speak the healing words of God.\n\nThe time for changes should be discretely weighed, as to when\n\nthe tongue ought to be restrained, or when it might speak the\n\nwonderful words of comfort.\n\nPRAYER FOR TODAY:\n\nDear Lord, I pray for the wisdom to weigh my words carefully\n\nso that I have the words You would have me to share to one\n\nwho may be hurting from careless words that may have been\n\nspoken by another. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1662d26f5e69bff5",
    "date_utc": "Sun, 30 Sep 2018 20:03:40 -0500",
    "subject": "thoughts to live by",
    "verse": "There is: A time to love and a time to hate. a time for war and a time for peace. (Ec. 3:8)",
    "reflection": "When is there a time for hating? We shouldn't hate evil people, but we should hate what they do. We should also hate it when people are mistreated, when children are starving, and when God is dishonored. In addition, we must hate sin in our life BECAUSE this is God's attitude! (Ps. 5:5)",
    "prayer": "Dear Heavenly Father, I pray that Your Holy Spirit would Help me to be aware of the sins in my life that so often seem to cause me to drift from the path You would have me follow. . . Amen.",
    "reading": "",
    "original_content": "VERSE FOR TODAY:\n\nThere is: _A time to love and a time to hate. a time_\n\n_for war and a time for peace. _(Ec. 3:8)\n\nTHOUGHT FOR TODAY:\n\nWhen is there a time for hating? We shouldn't hate evil\n\npeople, but we should hate what they do. We should also\n\nhate it when people are mistreated, when children are\n\nstarving, and when God is dishonored. In addition, we\n\nmust hate sin in our life BECAUSE this is God's attitude!\n\n(Ps. 5:5)\n\nPRAYER FOR TODAY:\n\nDear Heavenly Father, I pray that Your Holy Spirit\n\nwould Help me to be aware of the sins in my life that\n\nso often seem to cause me to drift from the path You\n\nwould have me follow. . . Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]
