[
  {
    "message_id": "176c089d12145295",
    "date_utc": "2021-01-02T00:40:26+00:00",
    "subject": "TRUE FAITH = ASSURANCE",
    "verse": "What is faith? It is the confident assurance that what  we hope for is going to happen. It is the evidence of things we cannot yet see. (Hebrews 11:1)",
    "reflection": "Do you remember how you felt when you were very young and your birthday approached? You were ex cited and anxious.You knew you would certainly receive gifts and other special treats.\nBut somethings would be a surprise. Birthdays combine assurance and anticipation and so does faith! Faith is the conviction based on past experiences that God’s new and fresh surprises will surely be ours.",
    "prayer": "Loving God, fill us with the childlike excitement and trust that comes from knowing Your goodness, and help us anticipate with joy the fresh surprises You have in store for us each day. May our faith grow ever stronger as we remember Your faithfulness and look forward to Your continued blessings in our lives. (AI)",
    "original_content": "message_id: 176c089d12145295\nsubject   : Subject: TRUE FAITH = ASSURANCE (1-2-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 1 Jan 2021 18:40:26 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*What is faith? It is the confident assurance that what *\n\n*we **hope for is going to happen. It is the evidence of things **we cannot\nyet see. *(Heb. 11:1)\n\n\n\n*Today’s Reflection:*\n\nDo you remember how you felt when you were very young and your birthday\napproached? You were ex-\n\ncited and anxious.You knew you would certainly receive gifts and other\nspecial treats. But somethings would be a surprise. Birthdays combine assurance\nand anticipation and so does faith! *Faith is the con**viction *\n\n*based on past experiences that God’s new and fresh*\n\n*surprises will surely be ours. *\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Hebrews 11:6 AI",
    "found_reading": true
  },
  {
    "message_id": "176c536dc663c75a",
    "date_utc": "2021-01-02T22:27:56+00:00",
    "subject": "NOT GOD'S FAULT",
    "verse": "Let no one say when he is tempted, “I am tempted  by God,”f or God cannot be tempted by evil, nor  does He Himself tempt anyone. Temptation come  from the lure of our own evil desires. (James 1:13, 14)",
    "reflection": "People who live for God often wonder why they still have temptations.\nDoes God still tempt them? God tests people, but He does not tempt them by trying to seduce them to sin.\nGod allows Satan to tempt people, however, in order to refine their faith. And to help them grow in their dependence on Christ. We can resist the temptation to sin by turning to God for strength and choosing to obey His Word.",
    "prayer": "Holy God, grant us the strength to resist temptation and the wisdom to turn to You in times of trial. Help us grow in our faith and dependence on Christ as we face life's challenges, always choosing to obey Your Word. (AI)",
    "original_content": "message_id: 176c536dc663c75a\nsubject   : Subject: NOT GOD'S FAULT (1-3-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 2 Jan 2021 16:27:56 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Let no one say when he is tempted, “I am tempted *\n\n*by God,”**f or God cannot be tempted by evil, nor *\n\n*does He Himself **tempt anyone. Temptation come *\n\n*from the lure of our **own evil desires. *(Jm. 1:13, 14)\n\n\n\n*Today’s Reflection:*\n\nPeople who live for God often wonder why they still have temptations. Does\nGod still tempt them? God\n\ntests people, but He does not tempt them by trying to seduce them to sin.\nGod allows Satan to tempt people, however, in order to refine their faith.\nAnd to help\n\nthem grow in their dependence on Christ. *We can *\n\n*resist the temptation to sin by** turning* t*o God for strength and\nchoosing to obey His** Word.*\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "James 4:7 AI",
    "found_reading": true
  },
  {
    "message_id": "176ca8115f3b921b",
    "date_utc": "2021-01-03T23:07:06+00:00",
    "subject": "CAN YOU WAIT",
    "verse": "Wait patiently for the Lord. Be brave and  courageous.  Yes, wait patiently for the Lord.  (Psalm 27:14) ",
    "reflection": "David knew from experience what it meant to wait for the Lord. He had been anointed king at age 16 but didn’t become king until he was 30. During the interim, he was chased through the wilderness by jealous king Saul.\nDavid had to wait on God for the fulfillment of his promise to reign. Later, after becoming king, He was chased by his rebellious son, Absalom. Waiting for God is not easy Often it seems that He isn’t answering our prayers or doesn’t understand the urgency of our situation. That kind of thinking implies that God is not in control or is not fair. But God IS worth waiting for (Lamentations 3:24-26 calls us to hope in and wait for the Lord because often God uses times of waiting to refresh, renew, and teach us. Make good use of your waiting times by discov ering what God may be trying to teach you in them.",
    "prayer": "Gracious God, help us to trust in Your perfect timing and to use periods of waiting as opportunities for growth and renewal. Teach us patience and perseverance as we seek Your will, knowing that You are always working for our good. (AI)",
    "original_content": "message_id: 176ca8115f3b921b\nsubject   : Subject: CAN YOU WAIT (1-4-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 3 Jan 2021 17:07:06 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n* Wait patiently for the Lord. Be brave and *\n\n*courageous.** Yes, wait patiently for the Lord. *\n\n(Ps. 27:14)\n\n\n\n*Today’s Reflection:*\n\nDavid knew from experience what it meant to\n\nwait for the Lord. He had been anointed king at\n\nage 16 but didn’t become king until he was 30.\n\nDuring the interim, he was chased through the wilderness by jealous king\nSaul. David had to\n\nwait on God for the fulfilment of his promise to\n\nreign. Later, after becoming king, He was chased\n\nby his rebellious son, Absalom. Waiting for God\n\nis not easy Often it seems that He isn’t answering\n\nour prayers or doesn’t understand the urgency of\n\nour situation. That kind of thinking implies that\n\nGod is not in control or is not fair. But God *IS *\n\nworth waiting for (Lam. 3:24-26 calls us to hope\n\nin and wait for the Lord because often God uses\n\ntimes of waiting to refresh, renew, and teach us.\n\n*Make good use of your waiting times **by* *discov-*\n\n*ering **what God may be trying to teach you in*\n\n* them.*\n\n* Pastor Sather*.\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Lamentations 3:25-26 AI",
    "found_reading": true
  },
  {
    "message_id": "176cfa625394d7a7",
    "date_utc": "2021-01-04T23:05:41+00:00",
    "subject": "A TIME TO PRAY A TIME TO ACT",
    "verse": "The Lord said to Moses, “Why are you crying out to Me! Use your shepherd’s staff—hold it over the water, and a path will open before you through the sea. Then all the people of Israel will pass through on dry ground. (Exodus 14:15)",
    "reflection": "The Lord told Moses to stop praying and get moving!\nPrayer must have a vital place in our lives, but there\nis also a place for action. Sometimes we know what\nto do but we pray for more guidance as an excuse to\npostpone doing it. If we know what we should do, then it's time to get moving,",
    "prayer": "Almighty God, grant us the courage to act decisively when we know Your will, and help us discern when it's time to move forward in faith rather than lingering in prayer. Guide our steps as we seek to balance contemplation with action in our daily walk with You. (AI)",
    "original_content": "message_id: 176cfa625394d7a7\nsubject   : Subject: A TIME TO PRAY A TIME TO ACT (1-5-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 4 Jan 2021 17:05:41 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*The Lord said to Moses, “Why are you crying out to Me! **Use your\nshepherd’s staff—hold it over the water, and a **path will open before you\nthrough the sea. Then all the **people of Israel will pass through on dry\nground.*\n\n\n\n*Today’s Reflection:*\n\nThe Lord told Moses to stop praying and get moving!\n\nPrayer must have a vital place in our lives, but there\n\nis also a place for action. Sometimes we know what\n\nto do but we pray for more guidance as an excuse to\n\npostpone doing it. *If we know what we should do,*\n\n*then it's time to get moving, *\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Joshua 1:9 AI",
    "found_reading": true
  },
  {
    "message_id": "176d520b1d44cf83",
    "date_utc": "2021-01-06T00:37:38+00:00",
    "subject": "NEVER ALONE",
    "verse": "I hereby command you, be strong and courageous;  do not be frightened or dismayed, for the Lord your God is with you wherever you go. (Joshua 1:9)",
    "reflection": "Since Covig took over our country-and the chall enges about the election being a farse the country has been in turmoil, and we even hear that our democracy is being threatened. Let us put to\nmemory . . . “The Lord your God will be with you wherever you go.” Only He can give us the courage to face life and death. May we be moved to call up on His power and promises daily.",
    "prayer": "Faithful God, grant us the courage to face the challenges and uncertainties in our nation, remembering Your promise to be with us always. Help us to rely on Your power and promises daily, finding strength and hope in Your unfailing presence. (AI)",
    "original_content": "message_id: 176d520b1d44cf83\nsubject   : Subject: NEVER ALONE (1-6-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 5 Jan 2021 18:37:38 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*I hereby command you, be strong and courageous; *\n\n*do not be f**rightened or dismayed, for the Lord your God is with you\n**wherever\nyou go. *(Jos. 1:9)\n\n\n\n*Today’s Reflection:*\n\nSince Covig took over our country—and the chall-\n\nenges about the election being a farse the country\n\nhas been in turmoil, and we even hear that our democracy is being\nthreatened. Let us put to\n\nmemory *. . . “**The Lord your God will be with you wherever you go.” *Only\nHe can give us the courage\n\nto face life and death. *May we be **moved to call up-*\n\n*on His power and promises daily.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 46:1-2 AI",
    "found_reading": true
  },
  {
    "message_id": "176d9d8a313d2dc7",
    "date_utc": "2021-01-06T22:37:02+00:00",
    "subject": "TRUE PRAISE SHOULD COME FROM THE HEART",
    "verse": "Praise His name with dancing, accompanied by tambourine and harp. The Lord delights in His  people; He crowns the humble with salvation.  Let the faithful rejoice in this honor. Let them  sing for joy as they lie on their beds. (Psalm 149:3-5)",
    "reflection": "Even through the Bible invites us to praise God, we often are not sure how to go about it. Here several ways are suggested: singing, dancing, or playing musical instruments. God enjoys His people, AND We should enjoy praising Him.",
    "prayer": "Holy God, inspire us to praise You with joyful hearts through song, dance, and music, and help us to delight in worshiping You as much as You delight in us. May our expressions of praise draw us closer to You and bring glory to Your name. (AI)",
    "original_content": "message_id: 176d9d8a313d2dc7\nsubject   : Subject: TRUE PRAISE SHOULD COME FROM THE HEART (1-7-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 6 Jan 2021 16:37:02 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Praise His name with dancing, accompanied by tambourine **and harp. The\nLord delights in His *\n\n*people; He crowns the **humble with salvation. *\n\n*Let the faithful rejoice in this honor. **Let them *\n\n*sing for joy as they lie on their beds. *(Ps. 149:3-5)\n\n\n\n*Today’s Reflection:*\n\nEven through the Bible invites us to praise God,\n\nwe often are not sure how to go about it. Here\n\nseveral ways are suggested: singing, dancing, or\n\nplaying musical instruments. God enjoys His\n\npeople, *AND We should* *enjoy praising Him.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 150:3-5 AI",
    "found_reading": true
  },
  {
    "message_id": "176df5369cc444ab",
    "date_utc": "2021-01-08T00:09:14+00:00",
    "subject": "The author is unknown to the text I am about to share--",
    "verse": "His question is—Will God really live on earth?  Why, even the highest heavens cannot contain You.  How much less this temple that I have built.! Listen  to my prayer and my request, O Lord my God. Hear  the cry and prayer that Your servant is making to You today. (1 Kings 8:27, 28",
    "reflection": "We should try our best to build a beautiful and help ful place of worship to be a testimony and credit to God. In so doing, however, we must remember that God cannot be contained in our buildings or beautiful settings. He is far greater than any building, so we must focus our praise on Him and not merely on the place of worship.",
    "prayer": "Eternal God, as we strive to create beautiful spaces for worship, remind us that Your presence extends far beyond any structure we could build, and help us to focus our hearts and minds on praising You above all else. (AI)",
    "original_content": "message_id: 176df5369cc444ab\nsubject   : Subject: The author is unknown to the text I am about to share--\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 7 Jan 2021 18:09:14 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\nthe thought is it could possibly have been Jeremiah\n\n(1-8-21)\n\n\n\n*Today’s Verses:*\n\n*His question is—**Will God really live on earth? *\n\n*Why, even the **highest heavens cannot contain You. *\n\n*How much less this temple **that I have built.! Listen *\n\n*to my prayer and my request, O Lord** my God. Hear *\n\n*the cry and prayer that Your servant is making** to You today. *(I Kings\n8:27, 28\n\n\n\n*Today’s Reflection:*\n\nWe should try our best to build a beautiful and help-\n\nful place of worship to be a testimony and credit to God. In so doing, however,\nwe must remember that\n\nGod cannot be contained in our buildings or beautiful settings. *He is far\ngreater than **any building, so we must focus our praise on Him and **not\nmerely on *\n\n*the place of worship. *\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 139:7-10 AI",
    "found_reading": true
  },
  {
    "message_id": "176e45b4a027362c",
    "date_utc": "2021-01-08T23:35:57+00:00",
    "subject": "GOD SILENTLY AT WORK",
    "verse": "The Lord is watching everywhere, keeping His  eyes on both the evil and the good. (Proverbs 15:3)",
    "reflection": "At times it seems like God has let sin run rampant in the world, and we wonder if He really notices it. But God sees everything clearly-but the evil actions and the evil intentions lying beneath them (15:11). He is not an indifferent observer. He cares and is active in the world. Right now His work may be unseen and unfelt, but don’t give up. One day He will wipe out evil and punish the evil doers, just as He will establish the good and reward those who do His will.",
    "prayer": "Almighty God, we trust that You see all the evil in this world and are not indifferent to it. Help us to persevere in faith, knowing that You will ultimately establish justice and righteousness according to Your perfect will. (AI)",
    "original_content": "message_id: 176e45b4a027362c\nsubject   : Subject: GOD SILENTLY AT WORK (1-9-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 8 Jan 2021 17:35:57 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*The Lord is watching everywhere, keeping His *\n\n*eyes on **both the evil and the good. *(Pro. 15:3)\n\n\n\n*Today’s Reflection:*\n\nAt times it seems like God has let sin run rampant\n\nin the world, and we wonder if He really notices it.\n\n*But *God sees *everything* clearly—but the evil act-\n\nions and the evil intentions lying beneath them\n\n(15:11). He is not an indifferent observer. He cares\n\nand is active in the world. *Right now*—His work\n\nmay be unseen and unfelt, *but* don’t give up. One\n\nday He will wipe out evil and punish the evil\n\ndoers, just as He will establish the good and reward those who do His will.\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 33:13-15 AI",
    "found_reading": true
  },
  {
    "message_id": "176eea8b29a325bf",
    "date_utc": "2021-01-10T23:36:42+00:00",
    "subject": "FROM TRIVIA TO TREASURE",
    "verse": "“While your servant was busy here and  there, the man disappeared.” (1 Kings 20:40)",
    "reflection": "According to the account in I Kings, a prophet told King Ahab a fictitious story. He said he had been guarding a prisoner, but he had been negligent “busy here and there” and the prisoner had escaped. The lesson was meant to get Ahab’s attention because he had let his enemy, King Ben-Hadad of Syria, escape. Many people leave the important tasks of life undone\nbecause they are preoccupied with the trivial things of life, thus the big picture escapes them. Jesus Christ came into the world and into our hearts on the bridge of faith built by the Holy Spirit, through the Gospel, for the purpose of saving us from sin and death.The Redeemer took our attention away from the trifles of the world, from man’s gaudy lights which keep us from seeing God’s Sun, in our pursuit of selfish interests and from being “busy here and there.” Instead, He wants us to focus our attention on the treasures of His Word and the joy of serving Him in His Kingdom. Ask Jesus, your priceless Treasure, your truest Friend, to keep you always near Him.",
    "prayer": "Gracious God, help us to focus on the treasures of Your Word and the joy of serving in Your Kingdom, rather than being distracted by the trivial things of this world. Keep us always near to Jesus, our priceless Treasure and truest Friend. (AI)",
    "original_content": "message_id: 176eea8b29a325bf\nsubject   : Subject: FROM TRIVIA TO TREASURE (1-11-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 10 Jan 2021 17:36:42 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*“While your servant was busy here and *\n\n*there, **the man** disappeared.” *(I Kings 20:40)\n\n\n\n*Today’s Reflection:*\n\nAccording to the account in I Kings, a\n\nprophet told King Ahab a fictitious story.\n\nHe said he had been guarding a prisoner,\n\nbut he had been negligent “busy here and there” and the prisoner had\nescaped. The\n\nlesson was meant to get Ahab’s attention because he had let his enemy,\nKing Ben-Hadad\nof Syria, escape. Many people\n\nleave the important tasks of life undone\n\nbecause they are preoccupied with the\n\ntrivial things of life, thus the big picture escapes them. Jesus Christ\ncame into the\n\nworld and into our hearts on the bridge\n\nof faith built by the Holy Spirit, through the Gospel, for the purpose of\nsaving us\n\nfrom sin and death.The Redeemer took\n\nour attention away from the trifles of the world, from man’s gaudy lights\nwhich keep\n\nus from seeing God’s Sun, in our pursuit of selfish interests and from\nbeing “busy here and there.” Instead, He wants us to focus\n\nour attention on the treasures of His Word\n\nand the joy of serving Him in His Kingdom. *Ask Jesus, **your **priceless\nTreasure, your truest Friend, to keep **you **always near Him.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 6:33 AI",
    "found_reading": true
  },
  {
    "message_id": "176f3da7d03cbcf7",
    "date_utc": "2021-01-11T23:49:11+00:00",
    "subject": "GOOD HEALTH FOR SOUL AND BODY",
    "verse": "A cheerful look brings joy to the heart, and good news gives health to the bones. (Proverbs 15:30)",
    "reflection": "The best medicine is the Gospel of Jesus Christ. It is the good news that the Lamb of God has taken away our sin and has reconciled us to God. This says it all: “Since we have been justified through faith, we have peace with God through our Lord Jesus Christ” (Romans 5:1). We can feel it in our bones!\nLet us give thanks to the Lord Jesus, the great Physician, for bringing joy into our life by taking away our sins.",
    "prayer": "Lord Jesus, we thank You for being the great Physician who has healed our souls and brought us peace with God through Your sacrifice. May we always feel the joy of Your forgiveness deep within our hearts and live in gratitude for the reconciliation You have accomplished. (AI)",
    "original_content": "message_id: 176f3da7d03cbcf7\nsubject   : Subject: GOOD HEALTH FOR SOUL AND BODY (1-12-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 11 Jan 2021 17:49:11 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*A cheerful look brings joy to the heart, and good news gives **health to\nthe bones. *(Pro. 15:30)\n\n\n\n*Today’s Reflection:*\n\nThe best medicine is the Gospel of Jesus Christ.\n\nIt is the good news that the Lamb of God has\n\ntaken away our sin and has reconciled us to God.\n\nThis says it all: *“Since we have been** justified *\n\n*through faith, we have peace with God through*\n\n* our **Lord Jesus Christ” *(Ro. 5:1). We can feel\n\nit in our bones!\n\n*Let us give thanks to the Lord Jesus, the great Physician, **for bringing\njoy into our life by taking away our sins.*\n\n* Pastor Sather *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 5:1-2 AI",
    "found_reading": true
  },
  {
    "message_id": "176f8deaf157766b",
    "date_utc": "2021-01-12T23:11:52+00:00",
    "subject": "SYMBOL OF CHRIST'S AUTHORITY",
    "verse": "“I will place on His shoulder the key to the house  of David; what He opens no one can shut, and  what He shuts no one can open.” (Isaiah 22:22)   ",
    "reflection": "You will find this verse quoted in Revelation 3:7 by John.\nAs the one who possesses all power in heaven and\non earth Jesus exercises His power to delegate autho rity by entrusting to His disciples the office of the\nKeys:\nthe authority to retain the sins of the impenit ent and to remit the sins of those who repent and\nbelieve in Jesus as Savior. This is the power the\nchurch exercises through the public ministry: it is\nthe power to close and to open heaven. Let us thank the Lord Jesus, the head of the church for having given His followers the power to forgive. Let us also remem ber to pray for our Government Officials.",
    "prayer": "Holy God, we thank You for entrusting Your church with the power to forgive sins and share Your grace with the world. Guide our leaders, both in the church and in government, to use their authority wisely and in accordance with Your will. (AI)",
    "original_content": "message_id: 176f8deaf157766b\nsubject   : Subject: SYMBOL OF CHRIST'S AUTHORITY (1-13-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 12 Jan 2021 17:11:52 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*“I will place on His shoulder the key to the house *\n\n*of David; what He opens no one can shut, and *\n\n*what He shuts no one can open.” *(Isa. 22:22)\n\n\n\n*Today’s Reflection:*\n\nYou will find this verse quoted in Rev. 3:7 by John.\n\nAs the one who *possesses* all power in heaven and\n\non earth Jesus exercises His power to delegate autho-\n\nrity by entrusting to His disciples the office of the\n\nKeys: the authority to retain the sins of the impenit-\n\nent and to remit the sins of those who repent and\n\nbelieve in Jesus as Savior. This is the power the\n\nchurch exercises through the public ministry: it is\n\nthe power to close and to open heaven.\n\n*Let us thank the Lord Jesus, the head of the *\n\n*church for having given His followers the power*\n\n* to forgive.*\n\n\n\n*Let us also remem**ber to pray for our Government Officials.*\n\n* Pastor Sather *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 16:19 AI",
    "found_reading": true
  },
  {
    "message_id": "176fe294d8d51f26",
    "date_utc": "2021-01-13T23:51:28+00:00",
    "subject": "HOW TO OVERCOME SATAN",
    "verse": "He told them,“I saw Satan falling from heaven as a flash of lightening! And I have given you  all the power of the enemy, and you can walk  among  snakes and scorpions and crush them. Nothing will injure you. But don’t rejoice just  because evil spirits obey you; rejoice because  your names are registered as citizens of heaven.” (Luke 10:18-20)  ",
    "reflection": "Jesus may have been looking ahead to his victory over Satan at the cross. John 12:31, 32, indicates\nthat Satan would be judged and driven out at the time of Jesus’ death. On the other hand, Jesus may have been warning His disciples against pride. Perhaps He was referring to Isaiah 14:12-17, which begins, “How you are fallen from heaven, O shin ning star, son of the morning!” Some interpreters identify this verse with Satan and explain that\nSatan’s pride led to all evil we see on earth today.\nTo Jesus’ disciples, who were thrilled with their power over evil spirits (“snakes and scorpions”), He may have been giving this stern warning; “Yours is the kind of pride that led to Satan’s downfall. Be careful!” Pastor Saher Let us thank God for giving us the victory over Satan through Jesus Christ our Lord.",
    "prayer": "Almighty God, we thank You for the victory over evil that You have given us through Your Son Jesus Christ, and we humbly ask for Your guidance to remain vigilant against pride in our own lives. (AI)",
    "original_content": "message_id: 176fe294d8d51f26\nsubject   : Subject: HOW TO OVERCOME SATAN (1-14-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 13 Jan 2021 17:51:28 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*He told them,“I saw Satan falling from heaven*\n\n* as **a flash of lightening! And I have given you *\n\n*all the power of the enemy, and you can walk *\n\n*among** snakes and scorpions and crush them. Nothing **will injure you.\nBut don’t rejoice just *\n\n*because **evil spirits obey you; rejoice because *\n\n*your **names are registered as citizens of heaven.”*\n\n(Lk. 10:18-20)\n\n\n*Today’s Reflection:*\n\nJesus may have been looking ahead to his victory over Satan at the cross.\nJn. 12:31, 32, indicates\n\nthat Satan would be judged and driven out at the\n\ntime of Jesus’ death. On the other hand, Jesus may have been warning His\ndisciples against pride. Perhaps He was referring to Isa. 14:12-17, which\nbegins, “How you are fallen from heaven, O shin-\n\nning star, son of the morning!” Some interpreters identify this verse with\nSatan and explain that\n\nSatan’s pride led to all evil we see on earth today.\n\nTo Jesus’ disciples, who were thrilled with their power over evil spirits\n(“snakes and scorpions”),\n\nHe may have been giving this stern warning;\n\n*“Yours is the kind of* *pride that led to Satan’s downfall. Be careful!”*\n\n* Pastor Saher*\n\n*Let us thank God for giving us the victory over*\n\n*Satan through Jesus Christ our Lord.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Ephesians 6:11-12 AI",
    "found_reading": true
  },
  {
    "message_id": "17703149bde75472",
    "date_utc": "2021-01-14T22:46:58+00:00",
    "subject": "JESUS WOUNDED BUT A WINNER",
    "verse": "I will put enmity between you and the woman, and between your offspring and hers;\nHe will crush your head., and you will strike His heel.” (Genesis 3:15)",
    "reflection": "Let us thank God for frustrating the Devil’s plan by faithfully keeping His promise to provide us with a Savior, who in the Gospel is called the woman’s Seed or Offspring. A great battle was to take place between Satan and the Son of God, and in this deadly duel Satan’s power would be crushed, but not without wounds suffered by Jesus. However, these were mere mortal wounds. After His human death, Jesus rose again to life and proclaimed His victory. Our Lord, “The Lion of the tribe of Judah” (Revelation 5:5),once and for all overcame him who like a roaring lion tried to devour Christians, large and small. Since no one is too small for Satan to pursue, no one is too insignificant for the Savior to seek and to save. Jesus Christ died for all.\nLet us thank God that we can rest assured that Jesus loves us, for the Bible tells us so!",
    "prayer": "Faithful God, we thank you for fulfilling your promise of salvation through Jesus Christ, who crushed Satan's power and overcame death, assuring us of your unfailing love for all people, great and small. (AI)",
    "original_content": "message_id: 17703149bde75472\nsubject   : Subject: JESUS WOUNDED BUT A WINNER (1-15-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 14 Jan 2021 16:46:58 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*I will put enmity between you and the woman, and between your offspring\nand hers; He will crush your head., and you will strike His heel.” *(Gen.\n3:15)\n\n\n\n*Today’s Reflection:*\n\nLet us thank God for frustrating the Devil’s plan\n\nby faithfully keeping His promise to provide us\n\nwith a Savior, who in the Gospel is called the woman’s Seed or Offspring. A\ngreat battle was\n\nto take place between Satan and the Son of God,\n\nand in this dead-ly duel Satan’s power would be crushed, but not without\nwounds suffered by\n\nJesus. However, these were mere mortal wounds. After His human death, Jesus\nrose again to life\n\nand proclaimed His victory. Our Lord, “The Lion\n\nof the tribe of Judah” (Rev. 5:5),once and for all overcame him who like a\nroaring lion tried to\n\ndevour Christians, large and small. Since no one\n\nis too small for Satan to pursue, no one is too insignificant for the\nSavior to seek and to save.\n\nJesus Christ died for all.\n\n*Let us thank God that we can rest assured *\n\n*that Jesus** loves us, for the Bible tells us so!*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 16:20 AI",
    "found_reading": true
  },
  {
    "message_id": "177084b2fb30064b",
    "date_utc": "2021-01-15T23:04:41+00:00",
    "subject": "THE HEAVENLY BRIDEGROOM AND BRIDE",
    "verse": "I saw the Holy City, the new Jerusalem, coming  down out of heaven from God, prepared  as a bride beautifully dressed for her husband. (Revelation 21:2) ",
    "reflection": "Through-out Scripture we are made aware of Christ’s love, because of His love He died for the church. But that isn’t the end of the story. The heavenly Bridegroom will come again in glory. St. John had a highly symbolic vision of the forthcom ing reunion of Christ with His church. We are pictured as coming to meet Him “prepared as a bride beautifully dressed for her husband.” The dress is the righteousness of Christ in which we are clad through faith in the Savior. Once again we need to pray that the Holy Spirit may sustain in us the great expectation of Jesus' return in glory.",
    "prayer": "Lord Jesus, as we await Your glorious return, clothe us in Your righteousness and keep our hearts filled with joyful anticipation. May the Holy Spirit sustain our faith and prepare us to meet You, our heavenly Bridegroom, with hearts overflowing with love and gratitude. (AI)",
    "original_content": "message_id: 177084b2fb30064b\nsubject   : Subject: THE HEAVENLY BRIDEGROOM AND BRIDE (1-16-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 15 Jan 2021 17:04:41 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*I saw the Holy City, the new Jerusalem, coming *\n\n*down out of heaven **from God, prepared *\n\n*as **a bride beautifully dressed for her* *husband. *(Rev. 21:2)\n\n\n\n*Today’s Reflection:*\n\nThrough-out Scripture we are made aware\n\nof Christ’s love, because of His love He\n\ndied for the church. But that isn’t the end\n\nof the story. The heavenly Bridegroom\n\nwill come again in glory. St. John had a\n\nhighly symbolic vision of the forthcom-\n\ning reunion of Christ with His church.\n\nWe are pictured as coming to meet Him *“prepared **as a bride beauti**fully\ndressed *\n\n*for her husband.” *The dress is the right-eousness of Christ in which we\nare clad through faith in the Savior. *Once **again *\n\n*we need to pray that the Holy Spirit*\n\n*may sustain in us the great expectation *\n\n*of **Jesus' return i**n glory.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Ephesians 5:25-27 AI",
    "found_reading": true
  },
  {
    "message_id": "1770d626513de17d",
    "date_utc": "2021-01-16T22:48:08+00:00",
    "subject": "MAN'S GREED, GOD'S GRACE",
    "verse": "You know the grace of your Lord Jesus  Christ, that though He was rich, yet for  your sakes He became pour, so that you through His poverty might become rich.  (2 Corinthians 8:9).",
    "reflection": "The Bible has much to say about greed as being morally wrong. In the first Commandment, God declares:” You\nshall have no other gods before me” (Deuteronomy 5:7). He tells us to fear, love and trust in Him above all things. It is a trans gression of God’s Law to be greedy, to make an idol of wealth of any kind. How do we overcome greed? We need to look to Jesus Christ. He the Son of God gave up everything when He Became incarnate and was born into poverty. He came to atone for all our sins, greed included, and to bring us the incomparable riches of\nheaven. His poverty resulted in great spiritual wealth for us: peace with God, the full and free forgiveness of sins as His children and heirs of eternal life. The temp orary things of this world lose their appeal; greed vanishes, for we have the riches of Christ’s grace. Let us thank Jesus for His grace in sacrificing everything, even His very life, for our eternal welfare.",
    "prayer": "Gracious God, help us to overcome greed by fixing our eyes on Jesus, who sacrificed everything for our eternal welfare. May we find contentment in the incomparable riches of Your grace and forgiveness, rather than in the temporary things of this world. (AI)",
    "original_content": "message_id: 1770d626513de17d\nsubject   : Subject: MAN'S GREED, GOD'S GRACE (1-17-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 16 Jan 2021 16:48:08 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*You know the grace of your Lord Jesus *\n\n*Christ, that though **He was rich, yet for *\n\n*your sakes He became pour, so that **you through His poverty might become\nrich. *\n\n(*2 Cor. 8:9).*\n\n*Today’s Reflection:*\n\nThe Bible has much to say about greed\n\nas being morally wrong. In the first Commandment, God declares:” You\n\nshall have no other gods before me”\n\n(Deut. 5:7). He tells us to fear, love and\n\ntrust in Him above all things. It is a trans-\n\ngression of God’s Law to be greedy, to\n\nmake an idol of wealth of any kind. How\n\ndo we overcome greed? We need to look\n\nto Jesus Christ. He the Son of God gave\n\nup everything when He Became incarnate\n\nand was born into poverty. He came to\n\natone for all our sins, greed included, and\n\nto bring us the incomparable riches of\n\nheaven. His poverty resulted in great\n\nspiritual wealth for us: peace with God,\n\nthe full and free forgiveness of sins as His children and heirs of eternal\nlife. The temp-\n\norary things of this world lose their appeal; greed vanishes, for we have\nthe riches of Christ’s grace. *Let us **thank Jesus **for His grace in\nsacrificing everything, **even His *\n\n*very** life, for our eternal welfare.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Philippians 2:5-8 AI",
    "found_reading": true
  },
  {
    "message_id": "177123edb4134641",
    "date_utc": "2021-01-17T21:27:25+00:00",
    "subject": "A LIE THAT WOULDN'T FLY",
    "verse": "The chief priests . . . gave the soldiers a  large sum of money, telling them, “You are  to say, ‘His disciples came during the night and stole Him away while we were asleep.” (Matthew 28:12-13)",
    "reflection": "The government had taken extra measures to seal the tomb Jesus had been placed in. A government seal had been placed on the entrance, and guards were stationed at the tomb. But these precautions backfired. They were in and of themselves, proof that\nthe circulated story of the theft of Jesus’ body was a lie.\nNow the soldiers had said the body had been stolen by the disciples while they slept, if they were asleep how did they know it was the disciples. Further, when we consider how frightened the disciples were, we would have to believe they were the least likely candidates for grave rob bery.\nThe truth is simply this: “Christ has indeed been raised from the dead” (I Corinthians 15:20) AND, He was delivered over to death for our sins and was raised to life for our justification.” (Romans 4:25) THE TRUTH PREVAILS.",
    "prayer": "Almighty God, we stand in awe of Your power to overcome even death itself, and we thank You for the undeniable truth of Christ's resurrection. May this truth strengthen our faith and embolden us to live as witnesses to Your victory over sin and death. (AI)",
    "original_content": "message_id: 177123edb4134641\nsubject   : Subject: A LIE THAT WOULDN'T FLY (1-18-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 17 Jan 2021 15:27:25 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*The chief priests . . . gave the soldiers a *\n\n*large sum of money, telling them, “You are*\n\n* to say, ‘His disciples came during the night and stole Him away while we\nwere asleep.” *(Mt. 28:12-13)\n\n*Today’s Reflection:*\n\nThe government had taken extra measures\n\nto seal the tomb Jesus had been placed in.\n\nA government seal had been placed on the entrance, and guards were\nstationed at the tomb. But these precautions back-fired.\n\nThey were in and of themselves, proof that\n\nthe circulated story of the theft of Jesus’\n\nbody was a lie.\n\nNow the soldiers had said the body had been stolen by the disciples\nwhile they\n\nslept, if they were asleep how did they\n\nknow it was the disciples. Further, when\n\nwe consider how frightened the disciples\n\nwere, we would have to believe they were\n\nthe least likely candidates for grave rob-\n\nbery.\n\nThe truth is simply this: “Christ has indeed been raised from the\ndead” (I Cor. 15:20) *AND, * He was delivered over to\n\ndeath for our sins and was raised to life\n\nfor our justification.” (Ro. 4:25)\n\n*THE TRUTH PREVAILS.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Corinthians 15:3-4 AI",
    "found_reading": true
  },
  {
    "message_id": "17717c14d044303c",
    "date_utc": "2021-01-18T23:08:00+00:00",
    "subject": "GOD'S PERSPECTIVE",
    "verse": "Be on your guard, stand true to what you believe in. Be courageous. Be strong. And everything you do must be done in love. (1 Corinthians 16:13, 14) ",
    "reflection": "As the Corinthians awaited Paul’s next visit, they were directed to (1)\nbe on their guard against spiritual dangers, (2) stand firm in the faith (3) be courageous, (4) be strong and, (5) do everything with kindness\nand in love. Today as we wait for the return of Christ, we should follow the same instructions. We need to remember love involves unselfish service to others; to show it gives evidence that you care. Remember to let love be your highest goal.",
    "prayer": "Faithful God, help us stand firm in our faith, be courageous and strong, and do everything with kindness and love as we await Christ's return. May we remember that love involves unselfish service to others, and guide us to make love our highest goal in all we do. (AI)",
    "original_content": "message_id: 17717c14d044303c\nsubject   : Subject: GOD'S PERSPECTIVE (1-19-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 18 Jan 2021 17:08:00 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*Be on your guard, stand true to what you believe in. Be courageous. **Be\nstrong. And everything you do must be done in love.*\n\n(I Cor. 16:13, 14)\n\n\n\n*Today’s Reflection:*\n\nAs the Corinthians awaited Paul’s next\n\nvisit, they were directed to (1) be on their guard against spiritual\ndangers, (2) stand\n\nfirm in the faith (3) be courageous, (4) be strong and, (5) do everything\nwith kindness\n\nand in love. Today as we wait for the return\n\nof Christ, we should follow the same instruc-tions. We need to remember\nlove involves unselfish service to others; *to show *it gives evidence that\nyou care. *Remember** to let *\n\n*love be your highest goal.*\n\n* Pastor Sather*\n\n\nLet us pray for a peaceful innagration\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Peter 5:8-9 AI",
    "found_reading": true
  },
  {
    "message_id": "1771ce40f0f4d0ef",
    "date_utc": "2021-01-19T23:04:04+00:00",
    "subject": "LETTING THE LORD SETTLE IT",
    "verse": "Judge nothing before the appointed time;  wait tell the Lord comes. (1 Corinthians 4:5) ",
    "reflection": "It also wars us. We are to confront those who are sinning (see I Corinthians 5:12, 13), but we must not judge who is a better servant of Christ. When you judge some one, you invariably consider yourself better-and that is arrogant. Somethings we need to gladly leave to the Lord. When He comes again, He will take things in hand and settle them once and for all.",
    "prayer": "Let us ask the Savior to grant us wisdom and love to make the right choices when it is time to do so.",
    "original_content": "message_id: 1771ce40f0f4d0ef\nsubject   : Subject: LETTING THE LORD SETTLE IT (1-20-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 19 Jan 2021 17:04:04 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Judge nothing before the appointed time; *\n\n*wait tell the Lord comes. *(I Cor. 4:5)\n\n\n\n*Today’s Reflection:*\n\nIt also wars us. We are to confront those\n\nwho are sinning (see I Cor. 5:12, 13),\n\n*but *we must not judge who is a better\n\nservant of Christ. When you judge some-\n\none, you invariably consider yourself\n\nbetter—and that is arrogant*. Some**things*\n\n*we need to gladly leave to the Lord. *\n\n*When He comes again, He **will take *\n\n*things in hand and settle them once *\n\n*and for all.*\n\n* Pastor Sather*\n\n\n\n*Let us ask the Savior to grant us wisdom *\n\n*and love to make the right** choices when *\n\n*it is time to do so.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 7:1-2 AI",
    "found_reading": true
  },
  {
    "message_id": "177221874f147d31",
    "date_utc": "2021-01-20T23:19:24+00:00",
    "subject": "JESUS--A MEMBER OF OUR FAMILY",
    "verse": "God knew His people in advance, and He chose them to become like His Son, so  that His Son would be the first born, with many brothers and sisters. (Romans 8:29)",
    "reflection": "God’s ultimate goal for us is to make us like Christ (I John 3:2). As we become more and more like him, we discover ourselves, the person we were created to be. How can we become like Christ? By reading and heading the Word-By studying His His life on earth through the Gospels, By spending time in prayer By being filled with the Spirit, and By doing His work in the world. Remember He promises to guide and protect us until we one day stand in His presence.",
    "prayer": "Let us pray that on that day we will be found faithful!",
    "original_content": "message_id: 177221874f147d31\nsubject   : Subject: JESUS--A MEMBER OF OUR FAMILY (1-21-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 20 Jan 2021 17:19:24 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*God knew His people in advance, and He chose them to become **like His\nSon, so *\n\n*that His Son would be the first born, with many **brothers and sisters. *(Heb.\n8:29)\n\n\n\n*Today’s Reflection:*\n\nGod’s ultimate goal for us is to make us\n\nlike Christ (I Jn. 3:2). As we become\n\nmore and more like him, we discover ourselves, the person we were created\n\nto be. How can we become like Christ?\n\n*By* reading and heading the Word—*By *studying His His life on earth\nthrough\n\nthe Gospels, *By *spending time in prayer\n\n*By* being filled with the Spirit, and *By *\n\ndoing His work in the world.\n\n*Remember He promises to guide *\n\n*and protect **us until we one day *\n\n*stand in His presence.*\n\n* Pastor Sather*\n\n*Let us pray that on that day we will be *\n\n*found faithful!*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Philippians 2:5-8 AI",
    "found_reading": true
  },
  {
    "message_id": "1772749fa5cba60e",
    "date_utc": "2021-01-21T23:31:36+00:00",
    "subject": "OUR TRUE HOPE",
    "verse": "The People who walk in darkness will see a great light—a light that will shine on all who live in the land where death casts its shadow.  (Isaiah 9:2) ",
    "reflection": "Here Isaiah refers to Jesus as Great Light the apostle John also referred to Jesus as the “Light” (JohnI:9) Jesus referred to Him self as the “Light of the world” (John 8:12. When I read the fact that this was considered as a time of ‘great darkness, on the 6th I thought we were heading into a similar time, the fact of the matter is we live in such a time. That ‘darkness” is sin. Then I remembered\nGod’s promise that He would send a light who would shine on everyone living in the shadow of death. He would be both\n“Wonderful Counselor” and “Mighty God.” This message of hope was fulfilled in the birth of Christ and the establishment of His eternal Kingdom. He came to deliver (all) people from their slavery to sin, the darkness we live in today.",
    "prayer": "Lord Jesus, Light of the world, shine Your truth and love into the darkness of our lives and guide us along Your path of righteousness. Help us to embrace Your eternal Kingdom and find freedom from the shadows of sin that surround us. (AI)",
    "original_content": "message_id: 1772749fa5cba60e\nsubject   : Subject: OUR TRUE HOPE (1-22-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 21 Jan 2021 17:31:36 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*The People who walk in darkness will see a great light—a light** that will\nshine on all who live in the land where death casts its** shadow. *\n\n(Isa. 9:2)\n\n\n\n*Today’s Reflection: *\n\nHere Isaiah refers to Jesus as Great Light—\n\nthe apostle John also referred to Jesus as\n\nthe “Light” (Jn. I:9) Jesus referred to Him-\n\nself as the “*Light of the world” *(Jn 8:12.\n\nWhen I read the fact that this was considered as a time of ‘great darkness,\non the 6th I thought we were heading into a similar time, the fact of the\nmatter is we live in such a time. That ‘darkness” is sin. Then I remembered\n\nGod’s promise that He would send a light\n\nwho would shine on everyone living in the shadow of death. He would be both\n\n“Wonderful Counselor” and “Mighty God.” This message of hope was fulfilled\nin the\n\nbirth of Christ and the establishment of His\n\neternal Kingdom. *He came to deliver (all) people from **their slavery to\nsin, the darkness we live in today.*\n\n* Pastor Sather *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "John 1:4-5 AI",
    "found_reading": true
  },
  {
    "message_id": "1772c619e52a0812",
    "date_utc": "2021-01-22T23:15:31+00:00",
    "subject": "SURRENDER THE OLD TO RECEIVE THE NEW",
    "verse": "As he (Saul) was nearing Damascus on his mission, a brilliant light from heaven suddenly beamed down on him.\nHe fell to the ground and heard a voice saying to him,  “Saul, Saul! Why are you persecuting me?\n(Acts 9:3, 4)",
    "reflection": "Paul refers to his experience as the start of his new life in Christ (1 Corinthians 9:1; 15:18; Galatians 1:15, 16). At the center of this wonder ful experience was Jesus Christ. Paul did not see a vision he saw the risen Christ Himself (9:17). Paul acknowledged Jesus as Lord, confessed his own sin, surrendered his life to Christ, and resolved to obey Him. True conversion comes from a personal encounter with Jesus Christ and leads to a new life in\na relationship with Him.",
    "prayer": "Ask the Holy Spirit to keep you in the faith so the Savior Jesus Christ may be glorified in and through you",
    "original_content": "message_id: 1772c619e52a0812\nsubject   : Subject: SURRENDER THE OLD TO RECEIVE THE NEW (1-23-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 22 Jan 2021 17:15:31 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*As he (Saul) was nearing Damascus on his mission, a **brilliant light from\nheaven sud-*\n\n*denly beamed down on **him. He fell to the ground and heard a voice\nsaying **to him, *\n\n*“Saul, Saul! Why are you persecuting me?*\n\n(Acts 9:3, 4)\n\n\n\n*Today’s Reflection:*\n\nPaul refers to his experience as the start of\n\nhis new life in Christ (1 Cor. 9:1; 15:18;\n\nGal. 1:15, 16). At the center of this wonder-\n\nful experience was Jesus Christ. Paul did not\n\nsee a vision he saw the risen Christ Himself\n\n(9:17). Paul acknowledged Jesus as Lord, confessed his own sin, surrendered\nhis life\n\nto Christ, and resolved to obey Him. True conversion comes from a personal\nencounter\n\nwith Jesus Christ and leads to a new life in\n\na relationship with Him.\n\n* Pastor Sather*\n\n*Ask the Holy Spirit to keep you in the faith so the **Savior Jesus Christ\nmay be glorified in and **through you *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "2 Corinthians 5:17 AI",
    "found_reading": true
  },
  {
    "message_id": "177317d7286be13b",
    "date_utc": "2021-01-23T23:04:01+00:00",
    "subject": "RECONCILIATION WITH GOD COME FIRST",
    "verse": "We are Christ’s ambassadors, and God is using us to speak to you. We urge you, as though Christ Himself were here pleading  with you, “Be reconciled to God.” (2 Corinthians 5:2) ",
    "reflection": "God’s reconciliation of sinners is the top most truth of the Gospel. Reconciliation with God proceeds-not follows-reconciliation to one another in the\ncommunity.\nAn ambassador is an official representative of one country to another. As believers, we are Christ’s ambassadors, sent with His message of reconciliation to the world. An ambassador of reconciliation has an important responsibility.\nWe dare not take this responsibility lightly. How well are you fulfilling your commission of Christ’s ambassador?",
    "prayer": "Ask His help for affecting greater reconciliation among people.",
    "original_content": "message_id: 177317d7286be13b\nsubject   : Subject: RECONCILIATION WITH GOD COME FIRST (1-24-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 23 Jan 2021 17:04:01 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’ Verse:*\n\n*We are Christ’s ambassadors, and God is using **us to speak to you. We\nurge you, as though Christ **Himself were here pleading *\n\n*with you, “Be recon**ciled to God.”*\n\n(2 Cor. 5:2)\n\n\n\n*Today’s Reflection:*\n\nGod’s reconciliation of sinners is the top-\n\nmost truth of the Gospel. Reconciliation\n\nwith God proceeds—not follows—reconciliation to one another in the\n\ncommunity. An ambassador is an official representtative of one country to\nanother.\n\nAs believers, we are Christ’s ambassadors, sent with His message of\nreconciliation to\n\nthe world. An ambassador of reconciliation has an important responsibility.\nWe dare not\n\ntake this responsibility lightly. *How well *\n\n*are you fulfilling your commission of Christ’s **ambassador?*\n\n* Pastor Sather*\n\n*Ask His help for affecting greater recon-*\n\n*cil**iation **among people.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Colossians 1:19-20 AI",
    "found_reading": true
  },
  {
    "message_id": "17736be00ec098dc",
    "date_utc": "2021-01-24T23:32:38+00:00",
    "subject": "JESUS THE GO-BETWEEN",
    "verse": "For Christ Himself has made peace be- tween us Jews and you Gentiles by making  us all one people. He has broken down the wall of hostility that used to separate us.  (Ephesians 2:14) ",
    "reflection": "By faith in the redeeming work of Christ Jesus we, are at peace with God, who is our heavenly Father and we are His sons and daughters. As God children, we are brothers and sisters to one another and strive to live at peace. The Psalmist declares, “How good and pleasant it is when brothers live together in unity!” (Psalm 133:1). When-ever we cross a bridge, we can be remind ed that through our Spiritual bridge, we are one with God and with one another.",
    "prayer": "Thank the Lord Jesus for enabling you to be at peace with God for you can now pray to Him boldly and confidently in Jesus’ name.",
    "original_content": "message_id: 17736be00ec098dc\nsubject   : Subject: JESUS THE GO-BETWEEN (1-25-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 24 Jan 2021 17:32:38 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*For Christ Himself has made peace be-*\n\n*tween us Jews and **you Gentiles **by making *\n\n*us all one people. He has broken **down the wall of hostility** that used\nto separate us. *\n\n(Eph. 2:14)\n\n\n\n*Today’s Reflection:*\n\nBy faith in the redeeming work of Christ\n\nJesus we, are at peace with God, who is\n\nour heavenly Father and we are His sons\n\nand daughters. As God children, we are brothers and sisters to one another\nand strive to live at peace. The Psalmist declares, “How good and pleasant\nit is when brothers\n\nlive together in unity!” (Ps. 133:1). *When-ever we **cross **a bridge, we\ncan be remind-*\n\n*ed that through our **Spiritual bridge, we*\n\n*are one with God and with one **another. *\n\n* Pastor Sather*\n\n*Thank the Lord Jesus for enabling you to be *\n\n*at peace **with God for you** can now pray to Him boldly and **confidently\nin Jesus’ name.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Galatians 3:28 AI",
    "found_reading": true
  },
  {
    "message_id": "1773bc6f3c349eae",
    "date_utc": "2021-01-25T23:00:30+00:00",
    "subject": "POSSESSING ALL--YET POOR",
    "verse": "Your attitude should be the same that Christ Jesus had. Though He was God, He did not demand and cling to His rights as God.  (Philippians 2:5, 6) ",
    "reflection": "Jesus Christ was humble, willing to give up His rights in order to obey God and serve people. Like Christ, we should have a servant’s attitude, serving out of love for God and for others, not out of guilt and fear. Remember you can choose your attitude. You can approach life expecting to be served, or you can look for opportune ities to serve others. See Mark 10:45 for more on Christ’s attitude of servant hood.",
    "prayer": "Give thanks to God for His unspeakable grace in sending His Son into the World as the all-sufficient Savior.",
    "original_content": "message_id: 1773bc6f3c349eae\nsubject   : Subject: POSSESSING ALL--YET POOR (1-26-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 25 Jan 2021 17:00:30 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*Your attitude should be the same that Christ Jesus had. **Though **He was\nGod, He did not demand and cling to **His rights as God. *\n\n(Phil. 2:5, 6)\n\n\n\n*Today’s Reflection:*\n\nJesus Christ was humble, willing to give\n\nup His rights in order to obey God and\n\nserve people. Like Christ, we should have a servant’s attitude, serving out\nof love for\n\nGod and for others, not out of guilt and fear. Remember you can choose your\nattitude.\n\nYou can approach life expecting to be\n\nserved, or you can look for opportun-\n\nities to serve others. *See Mk. 10:45 for *\n\n*more on Christ’s attitude of servant-*\n\n*hood.*\n\n* Pastor Sather*\n\n*Give thanks to God for His unspeakable grace in sending **His Son into the\nWorld *\n\n*as the all-sufficient Savior.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Philippians 2:3-4 AI",
    "found_reading": true
  },
  {
    "message_id": "17741464ace20b0e",
    "date_utc": "2021-01-27T00:37:42+00:00",
    "subject": "THE TWO TREES",
    "verse": "Christ has rescued us from the curse pronounced by the law. When He was  hung on the cross, He took upon Him- self the curse of our wrong doing. For  it is written in the Scriptures,“Cursed  is everyone who is hung on a tree.”  (Galatians 3:13)",
    "reflection": "I came across this saying about Satan, “That he by a tree once overcame, might likewise by a tree be overcome.” That tree\nwas the cross on which Jesus defeated the devil. In overcoming Satan, God’s Son overcame sin and death. He bore the curse of sin in our place. Through faith In Him as our Savior we are redeemed and given eternal life.\n“Without faith it is impossible to please God.” (Hebrews 11:6)",
    "prayer": "Gracious God, we thank You for sending Your Son to overcome sin and death through His sacrifice on the cross. May our faith in Jesus as our Savior grow stronger each day, drawing us closer to You and the eternal life You promise. (AI)",
    "original_content": "message_id: 17741464ace20b0e\nsubject   : Subject: THE TWO TREES (1-27-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 26 Jan 2021 18:37:42 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Christ has rescued us from the curse*\n\n*pronounced **by the law.** When He was *\n\n*hung on the cross, He took upon Him-*\n\n*self the** curse of our wrong doing. For *\n\n*it is written in the Scriptures,**“Cursed *\n\n*is everyone who is hung on a tree.” *\n\n(Gal 3:13)\n\n\n\n*Today’s Reflection:*\n\nI came across this saying about Satan,\n\n“That he by a tree once overcame, might likewise by a tree be overcome.”\nThat tree\n\nwas the cross on which Jesus defeated the devil. In overcoming Satan, God’s\nSon overcame sin and death. He bore the curse\n\nof sin in our place. Through faith In Him\n\nas our Savior we are redeemed and given eternal life. “*Without **faith it\nis impossible *\n\n*to please God.” *(Heb. 11:6)\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 5:8 AI",
    "found_reading": true
  },
  {
    "message_id": "177461e6df918afe",
    "date_utc": "2021-01-27T23:12:15+00:00",
    "subject": "CHRIST'S PEACE: PERFECT, PERMANENT",
    "verse": "He will be called . . . Prince of Peace.  (Isaiah 9:6)",
    "reflection": "How can we be sure of the permanence of Christ’s peace? The prophet continued with this proof: “For to us a Child is born, to us a Son is given.” (Isaiah 9:6). This Child made a perfect and permanent peace with God through the reconciation He effected as the Lamb of God sacrificed for our sins.\nNow the church’s spokesmen can comfort God’s people by proclaiming to them that their warfare is accomplished, their iniquity is pardoned. As God in Christ forgives us, so we are to forgive others. We do more than bury the hatch with the handle sticking out. We forgive really and truly-from the heart. We are to live in peace with all people.",
    "prayer": "Let us thank the Savior, the price of peace, for carrying out His ministry of reconciliation and for granting us peace.",
    "original_content": "message_id: 177461e6df918afe\nsubject   : Subject: CHRIST'S PEACE: PERFECT, PERMANENT (1-28-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 27 Jan 2021 17:12:15 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*He will be called . . . Prince of Peace. *\n\n(Isa. 9:6)\n\n\n\n*Today’s Reflection:*\n\nHow can we be sure of the permanence\n\nof Christ’s peace? The prophet continued\n\nwith this proof: “For to us a Child is born,\n\nto us a Son is given.” (Isa. 9:6). This Child made a perfect and permanent\npeace with\n\nGod through the reconciation He effected as\n\nthe Lamb of God sacrificed for our sins.\n\nNow the church’s spokesmen can comfort God’s people by proclaiming to them\nthat\n\ntheir warfare is accomplished, their iniquity\n\nis pardoned. As God in Christ forgives us,\n\nso we are to forgive others. *We do more *\n\n*than bury the hatch with* *the** handle sticking out. We forgive really\nand truly—from **the heart. We are to live in peace *\n\n*with all people.*\n\n* Pastor Sather*\n\n\n\n*Let us thank the Savior, the price of peace, for carrying out **His\nministry of reconcil-iation and for granting us peace.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 5:1 AI",
    "found_reading": true
  },
  {
    "message_id": "1774b5187199f286",
    "date_utc": "2021-01-28T23:26:10+00:00",
    "subject": "A PRICE TO PAY",
    "verse": "And since we are His children, we will share His treasures—for everything God gives to  His Son, Christ, is ours, too. But if we are  to share His glory, we must also share His suffering. (Romans 8:17)",
    "reflection": "There is a price to pay for being identified with Jesus. Along with the great treasures, Paul mentions the sufferings that Christians must face. What kind of sufferings are we to endure? For first century believers, there was economic and social persecution, and some even faced death. We, too, must pay a price for following Jesus. In many parts of the world, Christians face pressures just a sever as those faced by Christ’s first followers. Even in countries where Christianity is tolerated or encouraged, Christians must not become complacent. To live as Jesus did-serving others, giving up one’s right, resisting pressures to conform to the world-always exacts a price. Nothing we suffer, however, can compare-to the great price that Jesus paid to save us.",
    "prayer": "During times of difficulty ask the Holy Spirit to assure you, on the basis of God's promises in His Word, that you belong to Christ's family.",
    "original_content": "message_id: 1774b5187199f286\nsubject   : Subject: A PRICE TO PAY (1-29-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : Alvin Sather <pastor.sather5@gmail.com>, Angie Truscinski <atruscinski@hotmail.com>, \"Bart & Dorie Krenke\" <krenke@midstatesd.net>, \"Bill & Marilyn Nelson\" <marbill28@gmail.com>, Brennen Sather <brennenchamp@gmail.com>, \"Brian & Trish Waage\" <brianntrish@wiktel.com>, Cassidy Nelson <cassidylnelson23@gmail.com>, Chuck Clow <chuckc@wiktel.com>, \"Clark & Sandra Sather\" <clark.sather@gmail.com>, Courtney Nelson <corkygoose@gmail.com>, \"Craig & Peggy Swanson\" <pcswanson@midstatesd.net>, \"Curt & Marilyn Zimdars\" <cmzimdars@wiktel.com>, \"Dale & Debi Wiskow\" <dlw@wiktel.com>, Dale Strege <dale.r.strege@gmail.com>, \"Dan & Karla Cummings\" <dkcummings@midstatesd.net>, David Niemela <dav.niemela@gmail.com>, Dee Burkel <dbur@wiktel.com>, \"Don & Margaret Lake\" <dmlake@midstatesd.net>, \"Donnie & Donna Dominiack\" <ddominiack@midstatesd.net>, \"Doug & Corena Green\" <green@wiktel.com>, Duane Olson <duaneo05118@gmail.com>, \"Dwight & Carolyn Lange\" <dclange@wiktel.com>, Eileen Kilen <ekilen@wiktel.com>, Elderbush Apts <elderb@wiktel.com>, \"Ellis & Darlene Waage\" <edwaage@wiktel.com>, Eunice Korczak <snookyk@gmail.com>, Felix Korczak <squidbrain@gmail.com>, \"Franklin & Laray Frislie\" <lfrislie@badger.k12.mn.us>, \"Gary & Leslie Udstrand\" <gbu@digitalwind.net>, \"Gene & Rose Fenstrom\" <dozenrosebuds2002@yahoo.com>, \"Gerald & Donna Graff\" <gdgraff@wiktel.com>, Glen Darst <gdarst@wiktel.com>, Gracia Nelson <gracianelson@yahoo.com>, \"Harold & Betty Hudson\" <bjhjhud@frontier.com>, \"Harold (2) Hudson\" <hhcpa@comcast.net>, \"Harvey & Becky Melby\" <hmelby@wiktel.com>, \"Jerome & Dee Burkel\" <2river@wiktel.com>, \"Kirk & Desirae Surat\" <kirksurat@midstatesd.net>, Laura Melby <lauramelby@hotmail.com>, Linda Hantke <lelba@midstatesd.net>, Lois Halbakken <Lhbakken64@gmail.com>, Lyle Mattson <lylema@wiktel.com>, Madison Udstrand <madyudstrand@gmail.com>, Mark Udstrand <invitations@linkedin.com>, Mark Udstrand <mud@mudworks.net>, Mary Graves <magraves@midstatesd.net>, Michael Sather <mike_sather@hotmail.com>, Missy Udstrand <melissa.udstrand@gmail.com>, \"Neil & Abby Sather\" <nasather2@gmail.com>, \"Paul & Carol Ann Karlovitz\" <cak17min@yahoo.com>, Rae Ann Dozal <littlegdole@yahoo.com>, \"Rick & Trish Sather\" <mnsather@charter.net>, Robert Stoop <pinball@wiktel.com>, Roger Green <rgreen@wiktel.com>, Rolland Deschene <roldes3@hotmail.com>, Ryan Sather <ryan.sather@gmail.com>, Stephanie Kilen <skilen@wiktel.com>, \"Steve & Kim Riggen\" <riggen@midstatesd.net>, \"Steve & Kristy Nelson\" <stevenkristy@msn.com>, Stevie Bredeson <stevieleigh.0724@gmail.com>, \"Tim & Carol Urbaniak\" <tlc@wiktel.com>, Tracy Halbakken <tlsnh1111@gmail.com>, \"Troy & Cheryl Power\" <tcpower@me.com>, Wendy Lee <wenstalee@yahoo.com>, Will Udstrand <will.udstrand@gmail.com>\ndate      : Thu, 28 Jan 2021 17:26:10 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*And since we are His children, we will share His treasures—for everything\nGod gives to *\n\n*His Son, Christ, is ours, too. But if we are *\n\n*to share His** glory, we must also share His suffering. *(Ro. 8:17)\n\n\n\n*Today’s Reflection: *\n\nThere is a price to pay for being identified with Jesus. Along with the\ngreat treasures, Paul mentions the sufferings that Christians must face. What\nkind of sufferings are we to endure? For first century believers, there was\neconomic and social persecution, and some even faced death. We, too, must\npay a price\n\nfor following Jesus. In many parts of the world, Christians face pressures\njust a sever\n\nas those faced by Christ’s first followers.\n\nEven in countries where Christianity is tolerated or encouraged, Christians\nmust\n\nnot become complacent. To live as Jesus\n\ndid—serving others, giving up one’s right, resisting pressures to conform\nto the world—always exacts a price. *Nothing we suffer, however, can\ncomp**are—to\nthe great price that Jesus paid to save **us. *\n\n* Pastor Sather*\n\n*During times of difficulty ask the Holy Spirit to*\n\n*assure you, on the basis of God's promises in*\n\n*His Word, that you belong to Christ's family. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "2 Timothy 3:12 AI",
    "found_reading": true
  },
  {
    "message_id": "177509c638e6de88",
    "date_utc": "2021-01-30T00:06:02+00:00",
    "subject": "THE DAY OF HOPE HAS DAWNED",
    "verse": "Someone calls to me from Seir, “Watchman, what is left of the night? . . . The watchman replies, “Morning is coming, but also the night.” (Isaiah 21:11-12) ",
    "reflection": "It is night in many parts of the world; there is dense spiritual darkness-witchcraft, sorcery, Satanism. There are the primitive religions of voodoo, paganism, and occult ism that even in our so-called enlightened times and places are practiced. But Christ ians have ample reason to thank God for the coming of Jesus Christ the light of the world. This is what God did through His Son: “He has rescued us from the dominion of dark ness and brought us into the kingdom of the Son He loves, in whom we have redemption, the forgiveness of sins” (Colossians 1:13-14). What glorious Good News to shine throughout the world!",
    "prayer": "Holy God, we thank You for sending Jesus Christ as the light of the world, rescuing us from darkness and bringing us into Your kingdom of love and forgiveness. Shine Your glorious Good News throughout the world, dispelling spiritual darkness and drawing all people to Your redeeming grace. (AI)",
    "original_content": "message_id: 177509c638e6de88\nsubject   : Subject: THE DAY OF HOPE HAS DAWNED (1-30-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 29 Jan 2021 18:06:02 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*Someone calls to me from Seir, “Watchman, what is left of the **night? . .\n. The watchman replies, “Morning is coming, but **also the night.” *(Isa\n21:11-12)\n\n\n\n*Today’s Reflection:*\n\nIt is night in many parts of the world; there\n\nis dense spiritual darkness—witchcraft, sorcery, Satanism. There are the\nprimative religions of voodoo, paganism, and occult-\n\nism that even in our so-called enlightened times and places are practiced. But\nChrist-\n\nians have ample reason to thank God for the coming of Jesus Christ the\nlight of the world. This is what God did through His Son: “He has rescued\nus from the dominion of dark-\n\nness and brought us into the kingdom of the Son He loves, in whom we have\nredemption, the forgiveness of sins” (Col. 1:13-14). *What glorious Good\nNews to shine through**out *\n\n*the world!*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Colossians 1:13-14 AI",
    "found_reading": true
  },
  {
    "message_id": "17755c02d956ddc4",
    "date_utc": "2021-01-31T00:03:14+00:00",
    "subject": "IN PARTNERSHIP WITH GOD",
    "verse": "As God’s fellow workers we urge you not to receive God’s grace in vain . . . I tell you, now is the time of God’s favor, now is the day of salvation. (2 Corinthians 6:1-2)",
    "reflection": "As far as our salvation is concerned, Christ has completed it. We can-add-nothing. We are fully redeemed by Jesus’ blood shed on the cross. BUT let us not forget there is work for us to do, not to earn salvation but to serve the Lord in whatever situation He places us . . . Our response is to do good works for the glory of God, for the good of our neighbor, and for the joy of knowing that we fulfill a purpose in life. It is always time to spread the glad tidings of salvation in Christ, The apostles faithfully did what Christ commanded they preached His Gospel to the world. We too can praise our Lord by what we say and do. We confess our faith in Him when we share what we have with others. We give our witness by our actions and our words, and by what we leave undone: the works of a sinful world.",
    "prayer": "Let us give thanks to Christ for making us a partner in the spreading of the Gospel.",
    "original_content": "message_id: 17755c02d956ddc4\nsubject   : Subject: IN PARTNERSHIP WITH GOD (1-31-210\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 30 Jan 2021 18:03:14 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*As God’s fellow workers we urge you not to receive God’s grace in vain . .\n. I tell you, now is the time of God’s favor, now is the day of salvation.*\n(2 Cor. 6:1-2)\n\n\n*Today’s Reflection:*\n\nAs far as our salvation is concerned, Christ\n\nhas completed it. *We— **can—add—nothing.* We are fully redeemed by Jesus’\nblood shed on the cross. BUT let *us not* forget there is work for us to\ndo, *not* to earn salvation *but*\n\nto serve the Lord in whatever situation He places us *. . . *Our response\nis to do good\n\nworks for the glory of God, for the good of\n\nour neighbor, and for the joy of knowing that we fulfill a purpose in life.\nIt is always time\n\nto spread the glad tidings of salvation in Christ, The apostles faithfully\ndid what Christ commanded*—*they preached His Gospel to\n\nthe world. We too can praise our Lord by what we say and do. We confess our\nfaith in Him when we share what we have with others. We give our witness by\nour actions and our words, and by what we leave undone: the works of a\nsinful world.\n\n*Pastor Sather*\n\n\n*Let us give thanks to Christ for making us *\n\n*a partner in the spreading **of the Gospel.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Ephesians 2:8-10 AI",
    "found_reading": true
  },
  {
    "message_id": "1775aa14f55c4ece",
    "date_utc": "2021-01-31T22:47:37+00:00",
    "subject": "GOD'S WITNESS OF HIMSELF",
    "verse": "Since the creation of the world His invisible attributes are clearly seen, being understood by the things that are made, even His eternal power and Godhead, so they (mankind) is without excuse. (Romans 1:20)",
    "reflection": "God reveals His divine nature and personal qualities through creation, even though creation’s testimony has been distorted by the Fall. Adam’s sin resulted in a divine curse upon the whole natural order (Genesis 3: 17-19); thorns and thistles were an immed ate result, and natural disasters have been common from Adam’s day to ours. In (Romans 8:19-21)Paul says that nature itself is eagerly waiting its own redemption from the effects of sin (see Revelation 22;3).",
    "prayer": "Let us give thanks to God for having revealed Himself as the Father of Jesus Christ and our Father.",
    "original_content": "message_id: 1775aa14f55c4ece\nsubject   : Subject: GOD'S WITNESS OF HIMSELF (2-1-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 31 Jan 2021 16:47:37 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Since the creation of the world His invisible attributes are clearly\nseen,** being\nunderstood by the things that are made, even His eternal power** and\nGodhead, so they (mankind) is without excuse. *(Ro. 1:20)\n\n\n\n*Today’s Reflection:*\n\nGod reveals His divine nature and personal qualities through creation,\n*even* though creation’s testimony has been distorted by\n\nthe Fall. Adam’s sin resulted in a divine\n\ncurse upon the whole natural order (Gen.3:\n\n17-19); thorns and thistles were an immed-\n\nate result, and natural disasters have been common from Adam’s day to ours.\nIn (Ro. 8:19-21)Paul says that nature itself is eagerly waiting its own\nredemption from the effects\n\nof sin (see Rev. 22;3).\n\n*Pastor Sather*\n\n*Let us give thanks to God for having revealed Himself as the** Father of\nJesus Christ and our Father.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 19:1-3 AI",
    "found_reading": true
  },
  {
    "message_id": "1775accb8a8d4f46",
    "date_utc": "2021-01-31T23:35:02+00:00",
    "subject": "CHRISTIANS AS STEWARDS",
    "verse": "He who has been stealing must steal no longer but must work, doing something useful with his own hands, that he may have  something to share with those in need. (Ephesians 4:28)",
    "reflection": "The first Christians, we are told, “had everything in common” (Acts 2:44). Many sold their possessions and put their money\ninto a common fund. God had not comm anded such an arrangement, in fact, when He commanded, “You shall not steal”\nExodus 20:15), He presupposed the existence of private property. What God does require is that His people be faithful stewards of all that He gives them. All we have has been entrusted to us for furthering God’s King dom. In this respect, the Jerusalem Christ ians were to set a good example, not that we should relinquish our goods and enter into a communal lifestyle, but that we use our proceeds to God’s glory and for the good of people, including ourselves. It is interesting to note that Paul did not advocate communism.",
    "prayer": "We need to ask the Lord Jesus to strengthen us in the conviction that all we are and have are at His disposal.",
    "original_content": "message_id: 1775accb8a8d4f46\nsubject   : \nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 31 Jan 2021 17:35:02 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Subject: CHRISTIANS AS STEWARDS *(2-2-21)\n\n\n\n*Today’s Verse:*\n\n*He who has been stealing must steal no long-er but must work, **doing\nsomething useful*\n\n* with his own hands, that he may have*\n\n*something** to share with those in need.*\n\n(Eph. 4:28)\n\n\n*Today’s Reflection:*\n\nThe first Christians, we are told, “had everything in common” (Acts 2:44).\nMany sold their possessions and put their money\n\ninto a common fund. God had not comm-\n\nanded such an arrangement, in fact, when\n\nHe commanded, “You shall not steal”\n\nEx. 20:15), He presupposed the existence\n\nof private property. What God does require\n\nis that His people be faithful stewards of all\n\nthat He gives them. All we have has been entrusted to us for furthering\nGod’s King-\n\ndom. In this respect, the Jerusalem Christ-\n\nians were to set a good example, not that we should relinquish our goods\nand enter into a communal lifestyle, but that we use our proceeds to God’s\nglory and for the good of people, including ourselves. *It is interesting\nto note that Paul **did not* *advocate communism.*\n\n* Pastor Sather*\n\n*We need to ask the Lord Jesus to strengthen us in the **conviction that\nall we are and have** are at His disposal. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Timothy 6:17-19 AI",
    "found_reading": true
  }
]