[
  {
    "message_id": "16d89d5caafb2f17",
    "date_utc": "2019-10-02T00:19:13+00:00",
    "subject": "THE POWER OF BAPTISM",
    "verse": "This water [of the flood] symbolizes baptism that now saves\nyou also. (1 Peter 3:21)",
    "reflection": "Christ’s Word on Holy Baptism is backed by His sin atoning\nwork. “Christ died for sins once for all, the righteous for\nthe unrighteous, to bring you to God” (I Peter 3:18). By\nvirtue of His all-sufficient atonement, as verified by His\nresurrection. Baptism save because it creates and confirms\nfaith in the merit of Jesus Christ as Savior. Let me say;\nThe water of Baptism cleans up the messes that floods of sin\ncreate.",
    "prayer": "Lord Jesus, Your sin-atoning sacrifice makes baptism a\npowerful means of grace, through which faith is created and\nconfirmed in Your saving merit. As the water cleanses, so\ndoes Your Spirit wash away the floods of sin that overwhelm\nus. Thank You for the promise that baptism connects us to\nYour resurrection and new life, covering us with Your\nrighteousness and keeping us close to You. May this sacred\ngift deepen our faith and strengthen our trust in Your\nall-sufficient grace. Amen. (AI)",
    "original_content": "message_id: 16d89d5caafb2f17\nsubject   : Subject for 10/2/19: THE POWER OF BAPTISM (read I Pet. 3:13-22)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 1 Oct 2019 19:19:13 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*This water [of the flood] symbolizes baptism that*\n\n*now saves you also. *(I Pet. 3:21)\n\n\n\n*Thoughts for Today:*\n\nChrist’s Word on Holy Baptism is backed by His sin-\n\natoning work. “Christ died for sins once for all, the\n\nrighteous for the unrighteous, to bring you to God”\n\n(I Pet. 3:18). By virtue of His all-sufficient atonement,\n\nas verified by His resurrection. Baptism save because\n\nit creates and confirms faith in the merit of Jesus\n\nChrist as Savior. Let me say; *The water of Baptism *\n\n*cleans up the messes that floods of sin create.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Peter 3:13-22",
    "found_reading": true
  },
  {
    "message_id": "16d8f01dd3c6eab6",
    "date_utc": "2019-10-03T00:25:27+00:00",
    "subject": "WHO IS THE GREATEST",
    "verse": "“If anyone wants to be first, he must be the very last, and\nthe servant of all.” (Mark 9:35)",
    "reflection": "Jesus sat down to set the twelve straight: “If anyone wants\nto be first, he must be the very last.” Jesus didn’t stop\nwith words. He gave the group an object lesson in humility.\nHe placed in their midst, a child who personified the kind\nof faith and love that should mark every disciple, young or\nold. The person who has a childlike-not childish-faith is a\ntrue representative of Christ.",
    "prayer": "Lord Jesus, thank You for teaching us that true greatness\ncomes from humble, childlike faith. Help us to embrace the\ntrust, dependence, and openness that children show, not with\nchildishness but with sincere humility. Teach us to follow\nYour example by putting others first and receiving Your\nkingdom with a pure heart. May our faith be marked by love\nand simplicity, reflecting Your grace every day. Amen. (AI)",
    "original_content": "message_id: 16d8f01dd3c6eab6\nsubject   : Subject for 10/3/19: WHO IS THE GREATEST (read Mk. 9:33-37)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 2 Oct 2019 19:25:27 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*“If anyone wants to be first, he must be the very last,*\n\n*and the servant of all.” *(Mk. 9:35)\n\n\n\n*Thoughts for Today:*\n\nJesus sat down to set the twelve straight: “*If anyone*\n\n*wants to be first, he must be the very last.” *Jesus\n\ndidn’t stop with words. He gave the group an object\n\nlesson in humility. He placed in their midst, a child\n\nwho personified the kind of faith and love that should\n\nmark every disciple, young or old. *The person who has *\n\n*a childlike—not childish—faith is a true representative*\n\n*of Christ.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Mark 9:33-37",
    "found_reading": true
  },
  {
    "message_id": "16d9422d80941e2e",
    "date_utc": "2019-10-04T00:19:35+00:00",
    "subject": "WITH JESUS ON THE SEA OF LIFE",
    "verse": "The disciples went down and woke Him, saying “Master,\nMaster, we’re going to drown!” (Luke 8:24)",
    "reflection": "Caught in a strong squall on the sea of Galilee was a boat\ncarrying Jesus and His disciples. When the storm reached a\ndangerous point the disciple felt they needed Jesus. They\nwoke Jesus and He stilled the storm. Jesus can-and\ndoes-still storms arising in the human soul. Sin and fear of\ndeath are like strong winds and waves disturbing our inner\ncalm. Like the disciples, we can confidently approach the\nLord with our prayers, for He is our Savior from sin, the\nsovereign of life. Faith in Him assures us of His mercy and\nfrees us from all our faults.",
    "prayer": "Lord Jesus, You are the calm in the storms of life, just as\nYou stilled the raging sea on the Sea of Galilee. When fear\nand anxiety threaten to overwhelm us, help us to turn to You\nin faith and trust Your sovereign power. Quiet the storms\nwithin our souls, and grant us peace that surpasses all\nunderstanding. Teach us to rely on Your mercy, knowing You\nare our Savior from sin and the sovereign Lord over life.\nWith faith, we approach You confidently, trusting in Your\ngrace. Amen. (AI)",
    "original_content": "message_id: 16d9422d80941e2e\nsubject   : Subject for 10/4/19: WITH JESUS ON THE SEA OF LIFE (read Mk. 8:22-25)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 3 Oct 2019 19:19:35 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*The disciples went down and woke Him, saying “Master,*\n\n*Master, we’re going to drown!” *(Lk. 8:24)\n\n\n\n*Thoughts for Today:*\n\nCaught in a strong squall on the sea of Galilee was a\n\nboat carrying Jesus and His disciples. When the storm\n\nreached a dangerous point the disciple felt they needed\n\nJesus. They woke Jesus and He stilled the storm. Jesus\n\ncan—and does—still storms arising in the human soul.\n\nSin and fear of death are like strong winds and waves\n\ndisturbing our inner calm. Like the disciples, we can\n\nconfidently approach the Lord with our prayers, for\n\nHe is our Savior from sin, the sovereign of life.\n\n*Faith in Him assures us of His mercy and frees us from*\n\n*all our faults.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Mark 8:22-25",
    "found_reading": true
  },
  {
    "message_id": "16d9905a1496c9c5",
    "date_utc": "2019-10-04T23:05:46+00:00",
    "subject": "A TIME OF SILENCE",
    "verse": "Jesus withdrew from that place. Many followed Him, and He\nhealed all their sick, warning them not to tell who He was.\n(Matthew 12:15-16)",
    "reflection": "The quiet procedure of Jesus, is so different from the\npublicity seeking actions of many would-be reformers and\ncrusaders. Matthew records the Messianic prophecy of Isaiah,\n“He will not quarrel or cry out; no one will hear His voice\nin the streets . . . till He leads justice to victory” (Matthew 12:19-20). The Messiah is presented as the Servant who\nwithout self-promotion and fanfare, quickly, gently, and\ntenderly did His work of healing the sick and nurturing\nfaith. Are we like that?",
    "prayer": "Lord Jesus, Your quiet strength and gentle spirit stand in\ncontrast to the loud and boastful ways of the world. As\nIsaiah prophesied and You fulfilled, You did not quarrel or\ncry out in the streets but moved with tenderness and\nhumility in Your healing and teaching. Help us to follow\nYour example-to serve and love without seeking applause or\nattention, showing justice with patience and gentleness. May\nour lives reflect Your quiet power and tender care for the\nbroken and weak, leading others to Your peace. Amen. (AI)",
    "original_content": "message_id: 16d9905a1496c9c5\nsubject   : Subject for 10/5/19: A TIME OF SILENCE (read Mt.12:13-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 4 Oct 2019 18:05:46 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*Jesus withdrew from that place. Many followed Him,*\n\n*and He healed all their sick, warning them not to tell*\n\n*who He was. *(Mt. 12:15-16)\n\n\n\n*Thoughts for Today:*\n\nThe quiet procedure of Jesus, is *so* different from the\n\npublicity seeking actions of many would-be reformers\n\nand crusaders. Matthew records the Messianic prophecy\n\nof Isaiah, “He will not quarrel or cry out; no one will hear\n\nHis voice in the streets *. . . *till He leads justice to victory”\n\n(Mt. 12:19-20). The Messiah is presented as the Servant\n\nwho without self-promotion and fanfare, quickly, gently,\n\nand tenderly did His work of healing the sick and nurturing\n\nfaith. *Are we like that?*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 12:13-21",
    "found_reading": true
  },
  {
    "message_id": "16d9e742574df0bc",
    "date_utc": "2019-10-06T00:24:35+00:00",
    "subject": "STAYING CONNECTED",
    "verse": "“I am the Vine, you are the branches. If a man remains In Me\nand I in him, he will bear much fruit.” (John 15:5)",
    "reflection": "In our spiritual lives, we need to be connected to the\nhigher power-God-to be effective in glorifying Him and\nserving others. Jesus uses the illustration of a vine and\nits branches. He identifies Himself as the vine and his\nfollowers as branches. Jesus says, “No branch can bear fruit\nby itself; it must remain in the vine. Neither can you bear\nfruit unless you remain in Me” John 15: 4). We need to be\nconnected to the power source-Jesus Christ-if there are to\nbe the sweet grapes of the Words and works of Love. By the\npower of the Holy Spirit, we were born again and given\nfaith. Faith is the critical connection.",
    "prayer": "Lord Jesus, You are the true Vine, and we are the branches.\nHelp us to remain closely connected to You, drawing our\nstrength, life, and purpose from Your presence. May Your\nSpirit bear fruit in our lives, showing love, kindness, and\nfaithfulness. Teach us to abide in You so that without You,\nwe can do nothing, but with You, we flourish and glorify the\nFather. Amen.  (AI)",
    "original_content": "message_id: 16d9e742574df0bc\nsubject   : Subject for 10/6/19: STAYING CONNECTED (read Jn. 15:1-8)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 5 Oct 2019 19:24:35 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*“I am the Vine, you are the branches. If a man remains*\n\n*In Me and I in him, he will bear much fruit.” *(Jn. 15:5)\n\n\n\n*Thoughts for Today:*\n\nIn our spiritual lives, we need to be connected to the\n\nhigher power—God—to be effective in glorifying Him\n\nand serving others. Jesus uses the illustration of a vine\n\nand its branches. He identifies Himself as the vine and\n\nhis followers as branches. Jesus says, “*No branch can *\n\n*bear fruit by itself; it must remain in the vine. Neither*\n\n*can you bear fruit unless you remain in Me*” Jn. 15: 4).\n\nWe need to be connected to the power source—Jesus\n\nChrist—if there are to be the sweet grapes of the Words\n\nand works of Love. By the power of the Holy Spirit, we\n\nwere born again and given faith. *Faith is the critical *\n\n*connection.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "John 15:1-8",
    "found_reading": true
  },
  {
    "message_id": "16da395bb18b8d80",
    "date_utc": "2019-10-07T00:19:22+00:00",
    "subject": "THE POWER OF LOVE",
    "verse": "“Greater love has no one than this, that he lay down his\nlife for his friends.” (John 15:13)",
    "reflection": "Jesus the Bread of Life, gained salvation for all when in\nlove He became an atoning sacrifice on the cross. He called\nHis disciples His friends, telling them that love prompted\nHim to lay down His life for them. What’s more, His\nredeeming, life-give love extends to all mankind, including\nHis enemies. “When we were God’s enemies, we were reconciled\nto Him through the death of His Son” (Romans 5:10). “Christ\ndied, that’s history. . .Christ died for you and me, that’s\nsalvation. “AMEN”",
    "prayer": "Lord Jesus, You are the Bread of Life who loved us so deeply\nthat You laid down Your life as the perfect atoning\nsacrifice on the cross. Your death reconciled us to the\nFather, even when we were His enemies, showing the boundless\nreach of Your redeeming love. Help us to remember that Your\nsacrifice is not just history but our present salvation and\nhope. May we live each day in gratitude for the grace You\nhave given us through Your sacrificial love. Amen.  (AI)",
    "original_content": "message_id: 16da395bb18b8d80\nsubject   : Subject for 10/7/19: THE POWER OF LOVE (read Jn. 15:9-17)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 6 Oct 2019 19:19:22 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*“Greater love has no one than this, that he lay down*\n\n*his life for his friends.” *(Jn. 15:13)\n\n\n\n*Thoughts for Today:*\n\nJesus the Bread of Life, gained salvation for all when\n\nin love He became an atoning sacrifice on the cross.\n\nHe called His disciples His friends, telling them that\n\nlove prompted Him to lay down His life for them.\n\nWhat’s more, His redeeming, life-give love extends\n\nto all mankind, including His enemies. *“When we*\n\n*were God’s enemies, we were reconciled to Him*\n\n*through the death of His Son” *(Ro. 5:10).\n\n*“Christ died, that’s history. . .Christ died for you *\n\n*and me, that’s salvation. “AMEN”*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "John 15:9-17",
    "found_reading": true
  },
  {
    "message_id": "16da8c2dc477fe39",
    "date_utc": "2019-10-08T00:26:46+00:00",
    "subject": "WELL DRESSED WITH HUMILITY",
    "verse": "All of you, cloth yourselves with humility toward one\nanother. (1 Peter 5:5)",
    "reflection": "Humility is hard to define and even harder to live. What is\nsometimes thought to be humility can be inverse pride, as in\nbeing “proud of his humility.” Christian humility is a\nvirtue, a fruit of faith. The human heart is by nature\nproud, but the Holy Spirit changed that when He brought us\nto faith in Christ. With faith He gave humility, that is,\nbeing what we are-no more--no less. It fits beautifully with\nthe fruit of the Spirit: love, joy, peace, patience,\nkindness, and all the rest. It helps us to be more\nChrist-like.",
    "prayer": "Lord Jesus, humble my heart as You have taught through Your\nperfect example. Help me to embrace true humility, not as\nfalse pride, but as faithful recognition of who I am in Your\nsight—no more, no less. Fill me with the fruit of the\nSpirit-love, joy, peace, patience, and kindness-so that I\nmay reflect Your character and walk humbly with You each\nday. Teach me to serve others with grace, always trusting\nYour strength in my weakness. Amen.",
    "original_content": "message_id: 16da8c2dc477fe39\nsubject   : Subject for 10/8/19: WELL DRESSED WITH HUMILITY (read I Pet. 5:1-11)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 7 Oct 2019 19:26:46 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n* Verse for Today:*\n\n*All of you, cloth yourselves with humility toward*\n\n*one another. *(I Pet. 5:5)\n\n\n\n* Thoughts for Today:*\n\nHumility *is *hard to define and even harder to live.\n\n*What is* sometimes thought to be humility* can be*\n\ninverse pride, as in being “proud of his humility.”\n\nChristian humility *is* a virtue, a fruit of faith. The\n\nhuman heart *is* by nature proud, but the Holy\n\nSpirit changed that* when* He brought us to faith\n\nin Christ. With faith He gave humility, *that is*,\n\nbeing what we are—no more--no less. It fits\n\nbeautifully with the fruit of the Spirit: love, joy,\n\npeace, patience, kindness, and all the rest.\n\n* It helps us to be more Christ-like.*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Peter 5:1-11",
    "found_reading": true
  },
  {
    "message_id": "16dade847e7778f0",
    "date_utc": "2019-10-09T00:25:44+00:00",
    "subject": "GOD CAN DO IT",
    "verse": "You will drink from the brook, and I have ordered the ravens\nto feed you there. (1 Kings 17:4)",
    "reflection": "Does God use lesser creatures to preserve the lives of\npeople? As a matter of fact, He does so regularly as He\nprovides for our bodily needs through things that grow in\nnature. God can do it also through special\ninterventions-miracles-as He did for the prophet Elijah. A\nmiracle in a special sense occurred when we came to saving\nfaith in Jesus Christ. Thank the Lord for His many\nkindnesses to you-especially for the miracle of bring you to\nfaith in Jesus Christ.",
    "prayer": "Lord God, You use all of Your creation to care for and\nsustain us, even lesser creatures like animals. Just as You\nsent ravens to feed Elijah and used a whale to redirect\nJonah, You intervene in our lives through the miraculous and\nthe ordinary. Thank You especially for the greatest miracle\nof all-the gift of saving faith in Jesus Christ. May we\nalways recognize Your hand in the world around us and give\nthanks for Your kindness and provision. Amen.  (AI)",
    "original_content": "message_id: 16dade847e7778f0\nsubject   : Subject for 10/9/19: GOD CAN DO IT\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 8 Oct 2019 19:25:44 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n(read I Kings. 17:1-6)\n\n\n\n*Verse for Today:*\n\n*You will drink from the brook, and I have ordered*\n\n*the ravens to feed you there. *(I Kings. 17:4)\n\n\n\n*Thought for Today:*\n\nDoes God use lesser creatures to preserve the lives\n\nof people? As a matter of fact, He does so regularly as He provides for our\nbodily needs through\n\nthings that grow in nature. God can do it also\n\nthrough special interventions—miracles—as\n\nHe did for the prophet Elijah. A miracle in a\n\nspecial sense occurred when we came to\n\nsaving faith in Jesus Christ.\n\n*Thank the Lord for His many kindnesses to *\n\n*you—especially **for the miracle of bring you *\n\n*to faith **in Jesus Christ.*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 145:15-16 AI",
    "found_reading": true
  },
  {
    "message_id": "16db2fe6683e82cd",
    "date_utc": "2019-10-10T00:08:00+00:00",
    "subject": "RETRACING ONE’S STEPS",
    "verse": "The Lord said to him, “Go back the way you came.” (1 Kings 19:15)",
    "reflection": "Many people try to run away from God, only to be found by\nHim and told, “Go back the way you came.” No disgrace\nfollows such a return. One does not lose self-respect or the\nesteem of others to admit the mistake of choosing a wrong\ndestination and the wrong way of getting there. People who\nlike the prodigal-son in Jesus’ parable, come back to God to\nfind His ready acceptance. Those who go into hiding because\nthey are discouraged, as Elijah was, can return to God and\nto the service into which He called them. “The problem . . .\nis to find out which way God is going and to go that way.",
    "prayer": "Lord God, thank You for Your unfailing love that welcomes us\nback no matter how far we have strayed. Like the prodigal\nson, help me to find the courage to return to Your embrace\nwithout shame or fear. Guide me to follow the path You have\nset, trusting in Your mercy and readiness to restore. May I\nalways listen for Your voice pointing the way and walk\nfaithfully in Your light. Amen.",
    "original_content": "message_id: 16db2fe6683e82cd\nsubject   : The Subject for The Day (10/10/19)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 9 Oct 2019 19:08:00 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*RETRACING ONE’S STEPS*\n\n(read I Kings 19:9-18)\n\n\n\n*Today’s Verse:*\n\n* The Lord said to him, “Go back the way you came.”*\n\n(I Kings 19:15)\n\n\n\n*Thoughts Relating to This Verse*\n\nMany people try to run away from God, only to be found\n\nby Him and told, “*Go back the way you came.” *No disgrace follows such a\nreturn. One does not lose self-respect or the esteem of others to admit the\nmistake of choosing a wrong destination and the wrong way of getting there.\nPeople who like the prodigal-son in Jesus’ parable, come back to God to\nfind His ready acceptance. Those who go into hiding because they are\ndiscouraged, as Elijah was, can return to God and to the service into\n\nwhich He called them. *“The problem . . . is to find out which **way God is\ngoing and to go that way.*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Peter 2:25 AI",
    "found_reading": true
  },
  {
    "message_id": "16db81fa3879b778",
    "date_utc": "2019-10-11T00:02:24+00:00",
    "subject": "NO ONE IS TO SMALL",
    "verse": "[Zacchaeus] wanted to see who Jesus was, but being a short man he could not see. (Luke 19:3)",
    "reflection": "Zacchaeus, the tax collector in Jericho, was small but that\ndid not keep him from seeing Jesus or Jesus from seeing him.\nLife’s circumstances height, age, income-are of no\nsignificance to Jesus. Because of original sin, we are all\non the same level in the sight of God. In Christ, the\nMediator, He has compassion on us all. Our Lord is concerned\nabout little people. He accepts and blesses the little\nchildren we bring to Him in Holy Baptism. The Lord has a\nheart for all.",
    "prayer": "Lord Jesus, just as You saw Zacchaeus despite his small\nstature and past, see me with compassion and love. Remind me\nthat life's circumstances do not limit Your care and grace.\nHelp me to trust in Your heart that embraces all, especially\nthe little and overlooked. May I come to You with childlike\nfaith, knowing that in Your sight, I am deeply valued and\nblessed. Amen. (AI)",
    "original_content": "message_id: 16db81fa3879b778\nsubject   : Subject for Today NO ONE IS TO SMALL\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 10 Oct 2019 19:02:24 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n(read Lk. 19:1-10)\n\n\n\n*Verse for Today:*\n\n*[Zacchaeus] wanted to see who Jesus was, but being a short **man he could\nnot see.* (read Lk. 19:3)\n\n\n\n*Thoughts Relating to This Verse:*\n\nZacchaeus, the tax collector in Jericho, was small but that did not keep\nhim from seeing Jesus or Jesus from seeing him. Life’s circumstances—\n\nheight, age, income—are of no significance to Jesus. Because of original\nsin, we are all on the same level in the sight of God. In Christ, the\nMediator, He has compassion on us all. Our Lord\n\nis concerned about little people. He accepts and\n\nblesses the little children we bring to Him in Holy Baptism.\n\n*The Lord has a heart for all.*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Luke 18:16 AI",
    "found_reading": true
  },
  {
    "message_id": "16dbd3b7f3462e6e",
    "date_utc": "2019-10-11T23:50:56+00:00",
    "subject": "GOD OVERRULES HUMAN ERROR",
    "verse": "You intended to harm me, but God intended it for good to accomplish what is now being done, the saving of many lives. (Genesis 50:20)",
    "reflection": "God has a way of turning human errors so it fulfills His\nwill. This truth clearly emerges from the story of Joseph in\nthe Old Testament, where his brothers because of their\njealousy sold him into slavery. Through this act Joseph rose\nfrom slavery into leadership. Turning to the New Testament,\nwe see even more clearly how God turned the hatred of Jesus’\nenemies into the good of mankind, turning the brutal\ncrucifixion into the once-for-all sacrifice of His Son.\nWhile God carries out His will, the evildoers are still\naccountable to Him for their sins. Let us praise our Lord\nfor all His blessings to us.",
    "prayer": "Lord God, Your ways are higher than ours, turning human\nmistakes into part of Your divine plan. Like Joseph, who was\nsold into slavery by his brothers but rose to save many, You\ntransform what seems broken into blessings. Through the\nsuffering and sacrifice of Your Son Jesus, You have redeemed\nthe world, turning evil into our salvation. Help us to trust\nin Your providence, praising You for Your mercy and\nfaithfulness in all things. Amen. (AI)",
    "original_content": "message_id: 16dbd3b7f3462e6e\nsubject   : Subject: GOD OVERRULES HUMAN ERROR (read Gen. 50:15-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 11 Oct 2019 18:50:56 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*You intended to harm me, but God intended it for good to **accomplish what\nis now being done, the saving of many lives. * (Gen, 50:20)\n\n\n\n*Thoughts Relating to This Verse:*\n\nGod has a way of turning human errors so it fulfills His will. This truth\nclearly emerges from the story of Joseph in the Old Testament, where his\nbrothers because of their jealousy sold him into slavery. Through this act\nJoseph rose from slavery into leadership.\n\nTurning to the New Testament, we see even more clearly how God turned the\nhatred of Jesus’ enemies into the good of mankind, turning the brutal\ncrucifixion into the once-for-all sacrifice of His Son. While God carries\nout His will, the evildoers are still accountable to Him for their sins.\n\n*Let us praise our Lord for all His blessings to us.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Genesis 50:15-21",
    "found_reading": true
  },
  {
    "message_id": "16dc22d2f96595e4",
    "date_utc": "2019-10-12T22:53:24+00:00",
    "subject": "ONE LORD JESUS CHRIST",
    "verse": "Is Christ divided? (1 Corinthians 1:13)",
    "reflection": "When Paul asked the Corinthian church, “Is Christ divided?”\nHe was referring to the division in the congregation with\nsome saying they followed Paul or Apollos or Cephas, and the\nlike. This Paul maintained, is dividing Christ and\neffectively destroying the unity of faith in Christ. Paul\ntold the church, “there is one body and one Spirit just as\nyou were called to one hope when you were called-one Lord,\none faith, one Baptism; one God and Father of all” (Ephesians 4:4-6). Satan as always tried to divide Christ, and so\ndestroying the unity in the church",
    "prayer": "Lord Jesus, You are the one true Head of the Church, and we\nthank You for calling us into unity through one Spirit, one\nfaith, and one baptism. Help us to resist divisions and\ninstead focus on You as our Lord and Savior. May we remember\nthat no human leader was crucified for us-only You-and that\nour loyalty belongs solely to You. Unite our hearts in love\nand purpose, so that we may reflect Your oneness and glory\nto the world. Amen. (AI)",
    "original_content": "message_id: 16dc22d2f96595e4\nsubject   : Subject: ONE LORD JESUS CHRIST (read I Cor. 1:10-17)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 12 Oct 2019 17:53:24 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*Is Christ divided? *(I Cor. 1:13)\n\n\n\n*Thoughts Relating to This Verse:*\n\nWhen Paul asked the Corinthian church, “Is Christ divided?” He was\nreferring to the division in the congregation with some saying they\nfollowed Paul or Apollos or Cephas, and the like. This Paul\n\nmaintained, is dividing Christ and effectively destroying the unity of\nfaith in Christ. Paul told\n\nthe church, “there is one body and one Spirit—\n\njust as you were called to one hope when you were called—one Lord, one\nfaith, one Baptism; one God and Father of all”\n\n(Eph. 4:4-6). *Satan as always tried to divide Christ, and so destroying\nthe unity in the church*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Corinthians 1:10-17",
    "found_reading": true
  },
  {
    "message_id": "16dc79e3ede950fa",
    "date_utc": "2019-10-14T00:15:00+00:00",
    "subject": "OUR WELL-STOCKED WARDROBE",
    "verse": "“What shall we wear?” (Matthew 6:31)",
    "reflection": "There is much more to the question that is asked in Matthew 6:31. If Jesus would not have come as our Savior, we would\nhave asked, “What shall we wear?” with regard to the\nspiritual clothes we need as we stand before God on the Last\nDay and every day. Thank God we know His answer to the\nquestion, “for He has clothed me in garments of salvation\nand arrayed me in a robe of righteousness” (Isaiah 61:10) The\nGospel bid us to trust in the atoning merit of Jesus Christ\nand be clothed in the robes of righteousness.",
    "prayer": "Righteous Father, thank You that in Christ You have clothed\nme with garments of salvation and a robe of righteousness.\nQuiet my anxious questions, and teach me to trust the\natoning merit of Jesus rather than my own efforts. Let me\nwalk each day robed in Your grace, rejoicing in the Gospel\nthat covers and renews me. Amen. (AI)",
    "original_content": "message_id: 16dc79e3ede950fa\nsubject   : Subject OUR WELL-STOCKED WARDROBE (read Mt. 6:25-34)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 13 Oct 2019 19:15:00 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*“What shall we wear?”* (Mt. 6:31)\n\n\n\n\n*Thought Relating to This Verse: *There is much more to the question that\nis asked in Mt. 6:31. If Jesus would not have come as our Savior, *we*\nwould have asked, “What shall *we *wear?” with regard to the spiritual clothes\nwe need as we stand before God on the Last Day\n\nand every day. Thank God we know His answer\n\nto the question, “for He has clothed me in garments of salvation and\narrayed me in a robe\n\nof righteousness” (Isa. 61:10) *The Gospel bid us*\n\n*to trust in the atoning merit of Jesus Christ and be clothed **in the\nrobes of righteousness.*\n\n* Pastor Al *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 6:25-34",
    "found_reading": true
  },
  {
    "message_id": "16dccc3b582bfe8f",
    "date_utc": "2019-10-15T00:14:01+00:00",
    "subject": "CONTENTMENT",
    "verse": "If we have food and clothing, we will be content with that.\n(1 Timothy 6:8)",
    "reflection": "How wonderful it is that the Lord Jesus has met our greatest\nneeds: our salvation, forgiveness, new life, and peace with\nGod! We are well supplied with food for our souls conveyed\nto us through the means of grace. We have spiritual\nclothing: the robe of Christ’s righteousness imparted by\nfaith. Truly, as Paul said, “Godliness with contentment is\ngreat gain” (I Timothy 6:6)",
    "prayer": "Lord Jesus, how wonderful it is that You have met our\ngreatest needs-salvation, forgiveness, new life, and peace\nwith God. You clothe us with Your robe of righteousness, a\ngift of grace that covers our sin and renews our souls. Help\nus to live in godliness and contentment, trusting fully in\nYour provision and walking faithfully each day as Your\nbeloved children. May our hearts rejoice in the food of Your\ngrace and the garments of Your salvation. Amen.  (AI)",
    "original_content": "message_id: 16dccc3b582bfe8f\nsubject   : Subject: CONTENTMENT (read I Tim 6:6-10)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 14 Oct 2019 19:14:01 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*If we have food and clothing, we will be content with that. *(I Tim. 6:8)\n\n\n\n*Thoughts relating to This Verse:*\n\nHow wonderful it is that the Lord Jesus has met our greatest needs: our\nsalvation, forgiveness, new life,\n\n*and *peace with God! We are well supplied with food\n\nfor our souls conveyed to us through the means of grace. We have spiritual\nclothing: the robe of Christ’s\n\nrighteousness imparted by faith. Truly, as Paul said,\n\n* “Godliness with contentment is great gain”*\n\n(I Tim. 6:6) *Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Timothy 6:6-10",
    "found_reading": true
  },
  {
    "message_id": "16dd1edbf50da3c8",
    "date_utc": "2019-10-16T00:18:02+00:00",
    "subject": "RAIN AND SHINE: BOTH REAL",
    "verse": "Sorrowful, yet always rejoicing; poor, yet making many rich;\nhaving nothing, and yet possessing everything. (2 Corinthians 6:10)",
    "reflection": "In the verse for today, Paul acknowledged the existence of\nsorrow and at the same time identified the reason for\nrejoicing: Christ Jesus, who redeemed us and rose victorious\nover all sorrow and every problem. Alongside the rain we\nhave the very real Son. If we have the Son, we can overcome\nmentally and Spiritually the storms of life.",
    "prayer": "Lord Jesus, You are the victorious Son who has redeemed us\nfrom every sorrow and trial. In the storms of life, help me\nremember that with You, I can overcome all challenges\nmentally and spiritually. Fill my heart with joy and peace,\neven amid difficulties, and strengthen my faith to trust in\nYour unfailing love. May Your victory be my hope and my\nconstant source of strength. Amen. (AI)",
    "original_content": "message_id: 16dd1edbf50da3c8\nsubject   : Subject: RAIN AND SHINE: BOTH REAL (read 2 Cor. 6:3-13)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 15 Oct 2019 19:18:02 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*Sorrowful, yet always rejoicing; poor, yet making many rich;*\n\n*having nothing, and yet possessing everything.* (2 Cor. 6:10)\n\n\n\n*Thoughts Relating to This Verse:*\n\nIn the verse for today, Paul acknowledged the existence of\n\nsorrow and at the same time identified the reason for rejoicing:\n\nChrist Jesus, who redeemed us and rose victorious over all\n\nsorrow and every problem. Alongside the rain *we have *the very\n\nreal *Son*. *If we have the Son*, *we can overcome mentally and*\n\n*Spiritually the storms of life.*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "2 Corinthians 6:3-13",
    "found_reading": true
  },
  {
    "message_id": "16dd6f9c5863fcfa",
    "date_utc": "2019-10-16T23:49:16+00:00",
    "subject": "PEOPLE COME FIRST",
    "verse": "For all the law is fulfilled in one word, even in this; Thou\nshalt love thy neighbor as thyself. (Galatians 5:14)",
    "reflection": "The well-being of the people was always to be of most\nimportance to the Lord. The Sabbath Law, Jesus taught, was\nnever intended to prevent works of love or needful action\nwhen someone was in need. The law of love always takes\nprecedence. For us as New Testament people, our freedom is\nclearly established. Jesus eliminated the ceremonial does\nand don’ts. He fulfilled the whole law of God for us by His\nobedience, His death on the cross, and His resurrection.",
    "prayer": "Lord Jesus, thank You for fulfilling the law and freeing us\nto walk in the law of love. Teach me to use my freedom to\nserve, to choose mercy over mere rule-keeping, and to meet\nneed with compassionate action. Let Your love be the measure\nof my Sabbath and the motive of my every deed. Amen. (AI)",
    "original_content": "message_id: 16dd6f9c5863fcfa\nsubject   : Subject: PEOPLE COME FIRST (read Mk. 2:23-28)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 16 Oct 2019 18:49:16 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*“The Sabbath was made for man, not man for the Sabbath.”*\n\n\n\n*Thoughts Regarding This Verse:*\n\nThe well-being of the people *was* always to be of most importance to the\nLord. The Sabbath Law, Jesus taught, was never intended to prevent works of\nlove or needful action when someone was in need. The *law of love* always takes\nprecedence. For us as New Testament people, our freedom is clearly\nestablished. Jesus eliminated the ceremonial does and don’ts. *He fulfilled\nthe whole* *law **of God for us* *by His obedience, His death on the\ncross, **and His resurrection.*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Mark 2:23-28",
    "found_reading": true
  },
  {
    "message_id": "16ddc35234a6dbca",
    "date_utc": "2019-10-18T00:12:13+00:00",
    "subject": "THE CALL TO CONSTANCY",
    "verse": "“You have neglected the more important matters of the\nlaw—justice, mercy and faithfulness. . . .you strain out a\ngnat but swallow a camel.” (Matthew 23:23-24)",
    "reflection": "Jesus, by precept and example, encourages constancy in one’s\nChristian faith and love. In His Sermon on the Mount, He\ntried to correct religious imbalance, such as this\ninconsistency: “You have heard that it was said, ‘Love your\nneighbor and hate your enemy.’ But I tell you: Love your\nenemies and pray for those who persecute you” (Matthew 5:43-44).\nJesus helped us to be consistent by setting this priority:\nSeek first His kingdom and His righteousness, and all these\nthings will be given to you as well” (Matthew 6:33).",
    "prayer": "Lord Jesus, help me to love without hesitation, even when it\nfeels difficult. Teach my heart to be steadfast in faith and\ngentle in spirit. May I seek Your kingdom in all that I do,\ntrusting that You alone provide what I truly need. Let my\nlife reflect Your constant love today and always. Amen. (AI)",
    "original_content": "message_id: 16ddc35234a6dbca\nsubject   : Subject: THE CALL TO CONSTANCY (read Mt. 23:23-32)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 17 Oct 2019 19:12:13 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*“You have neglected the more important matters of the *\n\n*law—justice, mercy and faithfulness. . . .you strain out *\n\n*a gnat but swallow a camel.” *(Mt. 23:23-24)\n\n\n\n*Thoughts Regarding This Verse:*\n\nJesus, by precept and example, encourages constancy in one’s\n\nChristian faith and love. In His Sermon on the Mount, He tried\n\nto correct religious imbalance, such as *this* inconsistency: “You\n\nhave heard that it was said, ‘Love your neighbor and hate your\n\nenemy.’ *But* I tell you: Love your enemies and pray for those who persecute\nyou” (Mt. 5:43-44). Jesus helped us to be consistent by setting this\npriority: *Seek first His kingdom and His righteousness, **and all these\nthings will be given to you *\n\n*as well” *(Mt. 6:33).\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 23:23-32",
    "found_reading": true
  },
  {
    "message_id": "16de154b4f5d3593",
    "date_utc": "2019-10-19T00:04:48+00:00",
    "subject": "THE WIND IN USE",
    "verse": "He mounted the cherubim and flew; He soared on the wings of\nthe wind. (Psalm 18:10)",
    "reflection": "The Bible tells of God using the wind to help the people of\nIsrael to flee from Egypt, by driving the sea back so the\nIsraelites could escape the Egyptians. The Holy Spirit-the\ncreating, life-giving Breath of God-“was hovering over the\nwaters” (Genesis 1:2) when the world was in the making. On\nPentecost, the Spirit came to the accom paniment of the\nsound of a strong wind, Paul and others let the wind drive\nthem as they sailed to many lands as witnesses of God’s\ngrace. God is at work as He grants us “The wings of the\nwind” (the Holy Spirt) to spread His message.",
    "prayer": "Holy Spirit, Breath of God, fill our sails and carry us\nwhere Your grace is needed most. As You once parted seas and\nrushed like a mighty wind, empower us to witness boldly and\nfaithfully, spreading the good news to every shore. Make us\nattentive to Your leading and swift to obey. Amen. (AI)",
    "original_content": "message_id: 16de154b4f5d3593\nsubject   : Subject: THE WIND IN USE (read Ps. 18:1-15\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 18 Oct 2019 19:04:48 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*He mounted the cherubim and flew; He soared on the *\n\n*wings of the wind. *(Ps. 18:10)\n\n\n\n*Thoughts Regarding This Verse:*\n\nThe Bible tells of God using the wind to help the people of Israel to flee\nfrom Egypt, by driving the sea back so the Israelites could escape the\nEgyptians. *The Holy Spirit*—the creating, life-giving Breath of God—“was\nhovering over the waters” (Gen. 1:2) when the world was in the making.\n*On **Pentecost,\n*the Spirit came to the accom-\n\npaniment of the sound of a strong wind, Paul and\n\nothers let the wind drive them as they sailed to many\n\nlands as witnesses of God’s grace. *God is at work **as He *\n\n*grants us “The wings of the **wind” *(the Holy Spirt) *to *\n\n*spread His message.*\n\n* Pastor Al *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 18:1-15",
    "found_reading": true
  },
  {
    "message_id": "16de685b3e1d650c",
    "date_utc": "2019-10-20T00:16:25+00:00",
    "subject": "A WORDLESS PRAYER",
    "verse": "[Jesus] asked him, “Do you want to get well?” (John 5:6)",
    "reflection": "Jesus visited a well-known pool near one of Jerusalem’s\ngates. The place was called Bethesda, literally a house of\nmercy. When an angel stirred the pool the first one to step\nin would be healed. Jesus approached a man who had lain\nbeside the pool for 38 years and asked if he wanted to get\nwell. The patient could have answered, “Of course I do, why\ndo you think I’ve been laying here?” But he answered Jesus,\nwho was unknown to him, with respect: “Sir ... I have no one\nto help me into the pool when the water is stirred. The man\nhad not spoken words of prayer, but Jesus knew the man’s\ndesire. He said, “Get up . . . and walk” (John 5:8).\nImmediately the man got up and walked. Sincere prayer may\nconsist of many words, a few words, or none-at-all. What is\nimportant is He who searches our hearts knows the mind of\nthe Spirit, who intercedes for the believer in accordance\nwith God’s will” (Romans 8:26-27). Our Lord knows what is in\nour heart when in faith we come to Him with words or\nwithout.",
    "prayer": "Lord Jesus, You see our need even before we speak, and You\nknow the desires we can’t put into words. Search my heart,\nmeet me with Your mercy, and speak the healing command that\nlifts me to walk in faith. Teach me to trust the Spirit’s\nintercession and to come to You—whether with many words,\nfew, or none at all. Amen. (AI)",
    "original_content": "message_id: 16de685b3e1d650c\nsubject   : Subject: A WORDLESS PRAYER (read Jn. 5:1-15)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 19 Oct 2019 19:16:25 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n[Jesus] *asked him, “Do you want to get well?” * (Jn. 5:6)\n\n\n\n*Thoughts Regarding This Verse:*\n\nJesus visited a well-known pool near one of Jerusalem’s\n\ngates. The place was called Bethesda, literally a house\n\nof mercy. When an angel stirred the pool the first one to\n\nstep in would be healed. Jesus approached a man who\n\nhad lain beside the pool for 38 years and asked if he wanted\n\nto get well. The patient *could have* answered, “Of course I\n\ndo, why do you think I’ve been laying here?” But he answered Jesus, who was\nunknown to him, with respect: “Sir *…* I have\n\nno one to help me into the pool when the water is stirred.\n\nThe man had not spoken words of prayer, but Jesus knew\n\nthe man’s desire. He said, “Get up *. . . *and walk” (Jn 5:8). Immediately the\nman got up and walked. Sincere prayer\n\nmay consist of many words, a few words, or none-at-all.\n\nWhat is important is He who searches our hearts knows\n\nthe mind of the Spirit, who intercedes for the believer in accordance with\nGod’s will” (Ro. 8:26-27). *Our Lord knows what is in our heart **when in\nfaith we come to Him with *\n\n*words or without.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "John 5:1-15",
    "found_reading": true
  },
  {
    "message_id": "16debad7a3059794",
    "date_utc": "2019-10-21T00:17:58+00:00",
    "subject": "JESUS COMES OUR WAY",
    "verse": "As Jesus and His disciple … were leaving the city, a blind\nman, Bartimaeus … was sitting by the roadside begging. (Mark 10:46)",
    "reflection": "Everyone of us, at one time or another, experience some kind\nof distress. If it isn’t a physical disability it is\nsomething else: financial worries, health concerns, career\nchallenges, loneliness, or any number of other challenges.\nBut there is help and hope. We are greatly blessed to have\nJesus, Helper and Healer, come our way. The Savior, having\nmade us His own, comes our way on the feet of human\nmessengers: friends, family, and fellow Christians in whose\nhearts the love of God is working. The question before every\nChristian should be: How can we be a messenger for Christ to\npeople in need.",
    "prayer": "Lord Jesus, Helper and Healer, meet us in every\ndistress—body, mind, and spirit—and bring Your comfort and\nhope. Fill our hearts with Your love so we become Your\nmessengers: attentive to needs, swift to pray, generous to\nserve, and brave to bear Your gospel. Send us to the lonely,\nthe worried, and the hurting, that through our hands and\nwords they may meet You. Amen. (AI)",
    "original_content": "message_id: 16debad7a3059794\nsubject   : Subject: JESUS COMES OUR WAY (read Mk. 10:46-52)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 20 Oct 2019 19:17:58 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*As Jesus and His disciple … were leaving the city,*\n\n*a blind man, Bartimaeus … was sitting by the*\n\n*roadside begging. *(Mk. 10:46)\n\n\n\n*Thoughts Regarding This Verse:*\n\nEveryone of us, at one time or another, experience\n\nsome kind of distress. If it isn’t a physical disability\n\nit is something else: financial worries, health concerns,\n\ncareer challenges, loneliness, or any number of other\n\nchallenges. *But* there is help and hope. We are greatly\n\nblessed to have Jesus, Helper and Healer, come our\n\nway. The Savior, having made us His own, comes our\n\nway on the feet of human messengers: friends, family,\n\nand fellow Christians in whose hearts the love of God\n\nis working. The question before every Christian should\n\nbe: *How can we be a messenger for Christ to people*\n\n*in need.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Mark 10:46-52",
    "found_reading": true
  },
  {
    "message_id": "16df0f7c2c11f87c",
    "date_utc": "2019-10-22T00:57:12+00:00",
    "subject": "PRAISING GOD IN OUR SONGS",
    "verse": "[The Lord] put a new song in my mouth, a hymn of praise to\nour God. (Psalm 40:3)",
    "reflection": "There are occasions when new songs are very much in order,\nsuch as the anniversary of a church or happy events in the\nlife of a Christian. But as we know there are some people\nwho are not fond of new songs, preferring the old, familiar\nones. Then we have others who prefer new things. Old songs\nor new, our intention should be to give praise to God,\nalways giving thanks to God the Father for everything, in\nthe name of our Lord Jesus Christ (Ephesians 5:19, 20). God led\nus out of sin right to Jesus Christ, whose atoning sacrifice\ngives us much to rejoice and sing about.",
    "prayer": "Lord, whether we sing old hymns or new songs, tune our\nhearts to praise You with gratitude in all things. Thank You\nfor leading us out of sin to Jesus Christ, whose atoning\nsacrifice gives us endless reasons to rejoice and sing. Let\nour worship—traditional or fresh—be pleasing to You and\nfilled with the Spirit. Amen. (AI)",
    "original_content": "message_id: 16df0f7c2c11f87c\nsubject   : Subject: PRAISING GOD IN OUR SONGS (read Ps. 40)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 21 Oct 2019 19:57:12 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n[The Lord] *put a new song in my mouth, a hymn *\n\n*of praise to our God. *(Ps. 40:3)\n\n\n\n*Some Thoughts on This Verse:*\n\nThere are occasions when new songs are very much\n\nin order, such as the anniversary of a church or happy\n\nevents in the life of a Christian. But as we know there\n\nare some people who are not fond of new songs,\n\npreferring the old, familiar ones. Then we have others\n\nwho prefer new things. Old songs or new, our intention\n\nshould be to give praise to God,* a**lways* giving thanks\n\nto God the Father for everything, in the name of our\n\nLord Jesus Christ (Eph. 5:19, 20). *God led us out of sin *\n\n*right to Jesus Christ, whose atoning sacrifice gives us*\n\n*much to rejoice and sing about.*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 40",
    "found_reading": true
  },
  {
    "message_id": "16df5db305e0123e",
    "date_utc": "2019-10-22T23:44:06+00:00",
    "subject": "A SPIRITUAL HARVEST",
    "verse": "“Unless a kernel of wheat falls to the ground and dies, it\nremains a single seed. But if it dies, it produces many\nseeds.” (John 12:24)",
    "reflection": "It’s amazing, how a germinated seed multiplies into many of\nits kind. It can’t be looked at in any other way then a\nmiracle, but because it occurs so regularly we call it a\nnatural process. Now Jesus had to die and be buried before\nthere could be fruits of His redemption. His resurrection\ngave the assurance of the sufficiency of His sacrifice. Our\nSavior is still gathering a harvest, With Us As His Workers!",
    "prayer": "Lord Jesus, thank You that Your death and resurrection have\nborne a harvest of redemption. Plant Your life deep within\nme, and make me a faithful worker in Your fields—sowing the\ngospel, watering with love, and trusting You for the growth.\nGather a plentiful harvest for Your glory in our day. Amen.\n(AI)",
    "original_content": "message_id: 16df5db305e0123e\nsubject   : Subject: A SPIRITUAL HARVEST (read Jn. 12:20-36)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 22 Oct 2019 18:44:06 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\nSubject: A SPIRITUAL HARVEST (read Jn. 12:20-36)\n\n\n\n*Verse for Today:*\n\n*“Unless a kernel of wheat falls to the ground and*\n\n*dies, it remains a single seed. But if it dies, it produces*\n\n*many seeds.” *(Jn. 12:24)\n\n\n\n*MY Thoughts for Today:*\n\nIt’s amazing, how a germinated seed multiplies into\n\nmany of its kind. It can’t be looked at in any other way\n\nthen a miracle, but because it occurs so regularly we\n\ncall it a natural process. Now Jesus *had to die* and be\n\nburied *before* there could be fruits of His redemption.\n\nHis resurrection gave the assurance of the sufficiency\n\nof His sacrifice. *Our Savior is still gathering a harvest,*\n\n*With Us As His Workers**!*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "John 12:20-36",
    "found_reading": true
  },
  {
    "message_id": "16dfb28a4853dd2f",
    "date_utc": "2019-10-24T00:26:48+00:00",
    "subject": "SPIRITUAL GROWTH",
    "verse": "Like newborn babies, crave spiritual milk, so that by it you\nmay grow up in your salvation. (1 Peter 2:2)",
    "reflection": "What Is Needed in This Life: The people the apostle\naddressed in his letter were New Christians. Spiritually\nspeaking they were babies. A good beginning had been made,\nbut newcomers in the faith need to grow. As we should see\nthe apostle clearly explained how spiritual growth comes\nabout. The proper nourishment for beginners is the “pure\nspiritual milk,” the simple Word of God. It teaches that all\npeople are sinners and that Jesus Christ is their only\nSavior: and are redeemed by the precious blood of Christ, a\nlamb without blemish or defect (I Peter 1:18-19) Our calling\nis to be Christians who daily grow in the knowledge and\nfaith of Christ.",
    "prayer": "Father, nourish me with the pure spiritual milk of Your\nWord, that I may grow daily in the knowledge and faith of\nChrist. Keep my heart humble like a newborn, hungry for\ntruth, and anchor me in the precious redemption won by\nJesus’ spotless blood. Make my beginnings mature into\nsteadfast obedience and living hope. Amen. (AI)",
    "original_content": "message_id: 16dfb28a4853dd2f\nsubject   : Subject: SPIRITUAL GROWTH (read I Pet. 2:1-3)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 23 Oct 2019 19:26:48 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*Like newborn babies, crave spiritual milk, so that*\n\n*by it you may grow up in your salvation. *(I Pet. 2:2)\n\n\n\n*What Is Needed in This Life:*\n\nThe people the apostle addressed in his letter were\n\nNew Christians. Spiritually speaking they were babies.\n\nA good beginning had been made, but newcomers in\n\nthe faith need to grow. As we should see the apostle\n\nclearly explained how spiritual growth comes about.\n\nThe proper nourishment for beginners is the *“pure*\n\n*spiritual milk,” *the simple Word of God. It teaches\n\nthat all people are sinners and that Jesus Christ is their\n\nonly Savior: and are redeemed by the precious blood\n\nof Christ, a lamb without blemish or defect (I Pet. 1:18-19)\n\n*Our calling is to be Christians who daily grow in the*\n\n*knowledge and faith of Christ.*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Peter 2:1-3",
    "found_reading": true
  },
  {
    "message_id": "16e004577ce23efd",
    "date_utc": "2019-10-25T00:16:23+00:00",
    "subject": "DOING THE CHURCH'S BUSINESS",
    "verse": "“It is written, … My house will be called a house of\nprayer.” (Matthew 21:13)",
    "reflection": "Jesus objected when in the temple courtyard merchants sold\nanimals intended for sacrifice and operated currency\nexchange for profit. He objects today when people turn God’s\nhouse into a marketplace and transact business. To us\n“church” is more then a building. It is God’s people, who\nbelieved themselves to be redeemed by Jesus Christ, serve\nHim on Sundays and weekdays and profess Him before the\nworld. Our Lord made it the business of the church to “make\ndisciples of all nations, baptizing them in the name of the\nFather and of the Son, and of the Holy Spirit, and teaching\nthem to obey everything I have commanded you” (Matthew 28:19-20)",
    "prayer": "Heavenly Father, we ask You to cleanse Your house and our\nhearts from anything that turns Your church into a\nmarketplace. May Your people serve You sincerely,\nproclaiming the Gospel and making disciples with humility\nand love. Help us to keep Christ at the center, honoring\nYour house as a place of worship, prayer, and service to the\nworld. Amen. (Al)",
    "original_content": "message_id: 16e004577ce23efd\nsubject   : Subject: DOING THE CHURCH'S BUSINESS (read Mt. 21:12-17)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 24 Oct 2019 19:16:23 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*“It is written, … My house will be called a house *\n\n*of prayer.” *(Mt. 21:13)\n\n\n\n*Thoughts to Keep in Mind:*\n\nJesus objected when in the temple courtyard merchants\n\nsold animals intended for sacrifice and operated currency\n\nexchange for profit. He objects today when people turn\n\nGod’s house into a marketplace and transact business. To\n\nus “church” is more then a building. It is God’s people, who\n\nbelieved themselves to be redeemed by Jesus Christ, serve\n\nHim on Sundays and weekdays and profess Him before the\n\nworld. *Our Lord made **it the business of the church ** to*\n\n* “make disciples of **all nations, baptizing them in** the name*\n\n* of the Father **and of the Son, and of the Holy Spirit, ** and*\n\n* teaching **them to obey everything I have commanded you”*\n\n(Mt. 28:19-20)\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 21:12-17",
    "found_reading": true
  },
  {
    "message_id": "16e055e8dafa27a3",
    "date_utc": "2019-10-26T00:01:53+00:00",
    "subject": "THE SON OF GOD SLEEPS",
    "verse": "Jesus was in the stern, sleeping on a cushion. (Mark 4:38)",
    "reflection": "That Jesus slept, is truly meaningful as well as comfort ing. It proves that God had assumed a true human nature. He\ndid not pretend to be human, was not an actor who came on\nstage as somebody else. He was in fact a true human-being\nwho fit Himself into our situation. He knows from personal\nexperience what it means to be bone tired, to need rest\nin-the-midst of life’s storms, to be able to bear only so\nmuch physically and emotionally. What this tells us is we\nhave a Savior who is able to “Sympathize with our weaknesses\n... one who has been tempted in every way, just as we are-yet\nwas without sin” (Hebrews 4:15)",
    "prayer": "Heavenly Father, thank You for the beautiful truth that\nJesus, fully human, experienced fatigue and rest just as we\ndo. In the midst of life's storms, may we find comfort\nknowing that our Savior sympathizes with our weaknesses and\nrests in perfect peace, fully trusting in Your sovereign\ncare. Teach us to trust You with the same confidence,\nresting in Your presence even when the storms rage around\nus. Amen. (AI)",
    "original_content": "message_id: 16e055e8dafa27a3\nsubject   : \nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 25 Oct 2019 19:01:53 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\nSubject: THE SON OF GOD SLEEPS (read Mk. 4:35-41)\n\n*Verse for Today:*\n\n*Jesus was in the stern, sleeping on a cushion*. (Mk. 4:38)\n\n\n\n*The True Meaning of This Verse:*\n\n*That Jesus slept*, is truly meaningful as well as comfort-\n\ning. It proves that God had assumed a true human nature. He did not pretend\nto be human, *was not* an actor who came on stage as somebody else. He *was*\nin fact a true human-being who fit Himself into our situation. He knows\nfrom personal experience what it means to be bone tired, to need rest\nin-the-midst of life’s storms, to be able to bear only so much physically\nand emotionally. What this tells us is we have a Savior who is able to\n“*Sympathize\nwith **our weaknesses … one who has been tempted in every **way, just as we\nare—yet was without sin*” (Heb. 4:15)\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Hebrews 4:15 AI",
    "found_reading": true
  },
  {
    "message_id": "16e0a7bf0c812dba",
    "date_utc": "2019-10-26T23:52:05+00:00",
    "subject": "NAMES WRITTEN IN THE LAMB'S BOOK OF LIFE",
    "verse": "O Lord, the hope of Israel, all who forsake You will be put\nto shame. Those who turn away from You will be written in\nthe dust. (Jeremiah 17:13)",
    "reflection": "To have one’s name written in the dust is to stand under\nGod’s judgment for one’s sins. When a woman taken in\nadultery was brought before Jesus, He bent down to write on\nthe ground with His finger. Jesus went to the cross so we\nmight have eternal life and have our names written, not in\nsand or dust, but in granite. Those who believe in Jesus as\ntheir Savior and Lord have been enrolled “In the Lamb’s book\nof life” (Revelation 21:27). They are not only saved, but safe safe in the hands of Jesus, where no enemy can reach them of\ndelete their names from God’s list.",
    "prayer": "Heavenly Father, we thank You for the powerful reminder in\nthe story of Jesus writing in the dust, showing Your mercy\nover judgment. Through Christ's sacrifice, our names are not\nwritten in dust but engraved eternally in the Lamb's Book of\nLife, securing our salvation and safety in Your loving\nhands. Help us to live with the assurance of Your grace,\nconfident that nothing can erase the salvation You've\nsecured for us. Amen. (AI)",
    "original_content": "message_id: 16e0a7bf0c812dba\nsubject   : \nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 26 Oct 2019 18:52:05 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Subject: NAMES WRITTEN IN THE LAMB'S BOOK OF LIFE*\n\n(read Col. 2:6-15)\n\n*The Verse for Today:*\n\n*O Lord, the hope of Israel, all who forsake You will*\n\n*be put to shame. Those who turn away from You*\n\n*will be written in the dust. *(Jer. 17:13)\n\n\n\n*Let’s Give This Verse Some Thought:*\n\nTo have one’s name written in the dust is to stand\n\nunder God’s judgement for one’s sins. When a woman\n\ntaken in adultery was brought before Jesus, He bent\n\ndown to write on the ground with His finger. Jesus\n\nwent to the cross so we might have eternal life and\n\nhave our names written, not in sand or dust, but in\n\ngranite. Those who believe in Jesus as their Savior\n\nand Lord have been enrolled *“In the Lamb’s book of*\n\n*life” *(Rev. 21:27). *They are not only saved, but safe—*\n\n*safe in the hands of Jesus, where no enemy can reach*\n\n*them of delete their names from God’s list.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Colossians 2:6-15",
    "found_reading": true
  },
  {
    "message_id": "16e0f460f16fe642",
    "date_utc": "2019-10-27T22:11:20+00:00",
    "subject": "SIN AND GRACE",
    "verse": "I know that nothing good lives in me, that is, in my nature.\n(Romans 7:18) The acts of a sinful nature are obvious. (Galatians 5:19)",
    "reflection": "This account illustrates the twofold aspect of sin: original\nand actual. The former is a condition, the latter its\nenactment. The apostle Paul wrote that nothing good dwells\nin our inner nature, and this pre-conversion hatred and\npersecutions of Christians prove it. Paul taught what Jesus\nstressed: “Flesh gives birth to flesh” (John 3:6) and “Out of\nthe heart come evil thoughts, murder, adultery, sexual\nimmorality, theft, false testimony, slander” (Matthew 15:19).\nBut there is salvation. Jesus, the sinless Son of God, was\nmade to be sin for us that we by faith might be made\nrighteous in God’s sight. How wonderful is God’s forgiving\ngrace: “Where sin increased, grace increased all-the-more”\n(Romans 5:20).",
    "prayer": "Heavenly Father, we acknowledge our sinfulness and the\ndarkness within us, yet we rejoice in Your abundant grace\nthat covers all our transgressions. Thank You for sending\nJesus, who was sinless yet made to be sin for us, so that by\nfaith we might become righteous in Your sight. Help us to\nlive in the freedom and hope of Your forgiveness, trusting\nin Your love that increases even as our sin does. Amen. (AI)",
    "original_content": "message_id: 16e0f460f16fe642\nsubject   : Subject:  SIN AND GRACE (read Gal. 5:16-26)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 27 Oct 2019 17:11:20 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*I know that nothing good lives in me, that is, in my *\n\n*nature. *(Ro. 7:18)\n\n\n\n*The acts of a sinful nature are obvious. *(Gal. 5:19)\n\n\n\n*Thoughts to Think About:*\n\nThis account illustrates the twofold aspect of sin:\n\noriginal and actual. The former is a condition, the\n\nlatter its enactment. The apostle Paul wrote that\n\nnothing good dwells in our inner nature, and this\n\npre-conversion hatred and persecutions of Christians\n\nprove it. Paul taught what Jesus stressed: “Flesh gives\n\nbirth to flesh” (Jn. 3:6) *and* “Out of the heart come\n\nevil thoughts, murder, adultery, sexual immorality,\n\ntheft, false testimony, slander” (Mt. 15:19). But there\n\nis salvation. Jesus, the sinless Son of God, was made to\n\nbe sin for us that we by faith might be made righteous\n\nin God’s sight. *How wonderful is **God’s forgiving** grace:*\n\n* “Where sin increased, grace **increased all-the-more”*\n\n(Ro. 5:20).\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Galatians 5:16-26",
    "found_reading": true
  },
  {
    "message_id": "16e14cd24d80385d",
    "date_utc": "2019-10-28T23:56:59+00:00",
    "subject": "SOLID NOURISHMENT",
    "verse": "Then Jesus declared, “I am the bread of Life.” (John 6:35)",
    "reflection": "“Man does not live by bread alone,” Jesus said, quoting\n(Deuteronomy 8:3).Moses pointed out that God taught the Israelites\na lesson when He gave them manna in the wilderness as an\nunearned gift. The point is: people depended on God’s power\nas the Provider. He supplies our spiritual provisions, the\nneeded soul food. Jesus taught the same lesson when He fed\nmultitudes in uninhabited places. Jesus declared Himself to\nbe the “Bread of life,” adding that “he who comes to Me will\nnever grow hungry”(John 6:35). The Gospel satisfies the\nhunger and thirst of the soul.",
    "prayer": "Heavenly Father, thank You for sending Jesus as the Bread of\nLife who satisfies the deepest hunger of our souls. Help us\nto come to Him daily, trusting in His provision and grace\nthat sustains us eternally. May we always remember that our\ntrue nourishment and life come from You alone. Amen. (AI)",
    "original_content": "message_id: 16e14cd24d80385d\nsubject   : \nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 28 Oct 2019 18:56:59 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\nTop of Form\n\n*Subject: SOLID NOURISHMENT *(read Jn. 6:35-40)\n\nBottom of Form\n\n*Verse for Today*\n\n*Then Jesus declared, “I am the bread of Life.”*\n\n(Jn. 6:35)\n\n\n\n*Thoughts Regarding This Verse:*\n\n“Man does not live by bread alone,” Jesus said,\n\nquoting (Deut. 8:3).Moses pointed out that God\n\ntaught the Israelites a lesson when He gave them\n\nmanna in the wilderness as an unearned gift. *The*\n\n*point is*: people depended on God’s power as the\n\nProvider. He supplies our spiritual provisions, the\n\nneeded soul food. Jesus taught the same lesson\n\nwhen He fed multitudes in uninhabited places.\n\nJesus declared Himself to be the “Bread of life,”\n\nadding that “he who comes to Me will never\n\ngrow hungry”(Jn. 6:35). *The Gospel satisfies the*\n\n*hunger and thirst of the soul.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "John 6:51 AI",
    "found_reading": true
  },
  {
    "message_id": "16e18f29fa887e41",
    "date_utc": "2019-10-29T19:16:24+00:00",
    "subject": "TEMPLES OF THE HOLY SPIRIT",
    "verse": "Do you not know that your body is a temple of the Holy\nSpirit, who is in you, whom you have received from God? (1 Corinthians 6:19)",
    "reflection": "Our whole makeup belongs to God. We confess God to be the\nmaker of heaven and earth, and so is also Creator of each\nperson’s body and soul. But there is more. Not only do we\nbelong to God because He made us and the Son of God redeemed\nus, but also because the Holy Spirit lives in us to\nenlighten us with His gifts, sanctify us, and keeps us in\nthe true faith. So it is important that we welcome Him\nthrough holy living.",
    "prayer": "Heavenly Father, Creator of body and soul, we thank You for\nmaking us and redeeming us through Your Son. We are grateful\nthat Your Holy Spirit dwells within us to enlighten,\nsanctify, and keep us in true faith. Help us to welcome and\nhonor the Spirit by living holy lives that reflect Your love\nand grace. Amen. (Al)",
    "original_content": "message_id: 16e18f29fa887e41\nsubject   : Subject: TEMPLES OF THE HOLY SPIRIT (read I Cor. 6:12-20)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 29 Oct 2019 14:16:24 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*Do you not know that your body is a temple of the Holy Spirit, *\n\n*who is in you, whom you have received from God? *(I Cor. 6:19)\n\n\n\n*Thoughts Regarding This Verse:*\n\nOur whole make-up belongs to God. We confess God to be\n\nthe maker of heaven and earth, and so is also Creator of each person’s body\nand soul. *But* *there is* *more*. Not only do we belong to God because He\nmade us and the Son of God redeemed us, *but also *because the Holy Spirit\nlives in us to enlighten us with His gifts, sanctify us, and keeps us in\nthe\n\ntrue faith. *So it is important that **we welcome Him through holy living.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Corinthians 6:12-20",
    "found_reading": true
  },
  {
    "message_id": "16e1f9e1c89348e9",
    "date_utc": "2019-10-31T02:21:26+00:00",
    "subject": "SIN and SALVATION",
    "verse": "All have sinned and fall short of the glory of God, and are\njustified freely by His grace through the redemption that\ncame by Christ Jesus. (Romans 3:23-24)",
    "reflection": "The first truth is law, The Bible’s message of the reality\nof sin. Through our first parents. Adam and Eve, sin has\ncome down on all humanity. Sin exacts death as the penalty.\nThe next truth is Gospel, God’s grace extending to all. This\ngrace means free, unearned, and unmerited salvation: the\nforgiveness of sins, the promise of eternal life, and\nspiritual newness. Salvation by God’s grace comes to us\nthrough the merits of Christ, who atoned for the sin of the\nworld. The triad of truths “by grace alone,” “for Christ’s\nsake alone,” and “though faith alone” has a fourth dimension\nsola Scriptura. This is to say that the Bible is the only\nsource of what is taught in the church. By believing in\nChrist as the risen Lord and Savior we become the\nbeneficiaries of His righteousness and holiness.",
    "prayer": "Heavenly Father, thank You for the gift of Your Law that\nreveals our need for salvation and Your Gospel that offers\ngrace through Jesus Christ. Help us to embrace Your Word\nfully, trusting not in our own works but in the\nrighteousness You provide by faith alone. May Your Spirit\nguide us to live in the freedom and newness that comes from\nYour grace, rooted firmly in Your Word. Amen. (AI)",
    "original_content": "message_id: 16e1f9e1c89348e9\nsubject   : Subject: SIN and SALVATION (read Ro. 3:21-26)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 30 Oct 2019 21:21:26 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Verse for Today:*\n\n*All have sinned and fall short of the glory of God,*\n\n*and are justified freely by His grace through the*\n\n*redemption that came by Christ Jesus. *(Romans 3:23-24)\n\n\n\n*Truths to Remember:*\n\nThe first truth is law, The Bible’s message of the\n\nreality of sin. Through our first parents. Adam\n\nand Eve, sin has come down on all humanity. Sin\n\nexacts death as the penalty.\n\nThe next truth is Gospel, God’s grace extending to\n\nall. This grace means *free*, *unearned*, and *unmerited*\n\n*salvation*: the forgiveness of sins, the promise of\n\neternal life, and spiritual newness. Salvation by God’s\n\ngrace comes to us through the merits of Christ, who\n\natoned for the sin of the world.\n\nThe triad of truths “by grace alone,” “for Christ’s sake\n\nalone,” and “though faith alone” has a fourth dimension\n\n*sola Scriptura. *This is to say that the Bible is the only\n\nsource of what is taught in the church.\n\n*By believing in Christ as the risen Lord and Savior we*\n\n*become the beneficiaries of His righteousness and*\n\n*holiness.*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 3:21-26",
    "found_reading": true
  }
]