[
  {
    "messageid": "1254eec406feb59c",
    "dateutc": "Tue, 1 Dec 2009 06:17:43 -0600",
    "subject": "thoughts to live by",
    "verse": "Look at the fig tree and all the trees. When they sprout leaves, you can see for yourselves and know that summer is near. Even so, when you see these things happening, you know that the kingdom of God is near. (Luke 21:29-31)",
    "reflection": "Do you know what a \"sure thing\" is? Jesus had just finished speaking of the signs that would precede His coming. Signs in nature like floods and earthquakes. Signs in society like wars and rumors of wars. Signs in the church like love for the Word growing cold and false Christ's arising. All these signs, He says, will occur before His return. All these signs, we might say, tell us that His coming is a sure thing. It's going to happen. Have we become so wrapped up in the signs that we have forgotten the reason for them? Have we become so wrapped up in our day to day activities that we haven't even noticed what is happening in nature, in society and even the church??? Yes all these things (signs) are happening, the signs themselves aren't that important ~ BUT Who they point to is, which is the King of course. He wants each of us to be a part of His Kingdom of grace. He wants His gospel to make us His very own. When He does, we are ready for His sure return. Then we can even pray for it to happen.",
    "prayer": "Dear Lord, this Advent season let the signs point my heart heavenward to Your return. Amen.",
    "reading": "",
    "originalcontent": "12/02/09~~~food for thought~~~A SURE THING...\n\nOur Bible Verses for Today:\nLook at the fig tree and all the trees. When they sprout leaves,\nyou can see for yourselves and know that summer is near.\nEven so, when you see these things happening, you know\nthat the kingdom of God is near. (Lk. 21:29-31)\n\nOur Lesson for Today:\nDo you know what a \"sure thing\" is? Jesus had just finished speaking of the \nsigns that would precede His coming. Signs in nature like floods and earthquakes.\nSigns in society like wars and rumors of wars. Signs in the church like love for\nthe Word growing cold and false Christ's arising...\n\nAll these signs, He says, will occur before His return. All these signs, we might say, \ntell us that His coming is a sure thing... It's going to happen...\n\nHave we become so wrapped up in the signs that we have forgotten the reason\nfor them? Have we become so wrapped up in our day to day activities that we\nhaven't even noticed what is happening in nature, in society and even the church???\n\nYes all these things (signs) are happening, the signs themselves aren't that important ~ \nBUT Who they point to is, which is the King of course. He wants each of us to be a part \nof His Kingdom of grace...\n\nHe wants His gospel to make us His very own. When He does, we are ready for His \nsure return. Then we can even pray for it to happen...\n\nPrayer Suggestion:\nDear Lord, this Advent season let the signs point my\nheart heavenward to Your return...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "1255422097963606",
    "dateutc": "Wed, 2 Dec 2009 05:12:14 -0600",
    "subject": "thoughts to live by",
    "verse": "Comfort, comfort my people, says your God. Speak tenderly to Jerusalem, and proclaim to her that her hard service has been completed, that her sin has been paid for, that she has received from the Lord's hand double for all her sins. (Isaiah 40:1, 2)",
    "reflection": "Yes, Isaiah had \"good news\" for Israel who was living in captivity. God was going to end her separation from the homeland of Canaan. Better still, He was going to end her separation from Him. Sin separates people from God. It builds a wall no sinner can crawl under, crash through, or climb over. Only the Holy God, from whom sin separates us, can break down that wall. Isaiah was to speak of \"double\" payment, so completely were her sins gone. We might ask, \"How?\" Isaiah in many other verses told of the coming virgin's Son. Of the Lamb going silently to the slaughter. Of the One on whom all sins were laid and by whom all sins were paid. Better news than this Israel would never hear, Nor will we. This Advent season it's time to kneel a little closer to Jesus' crib and beneath His cross. There we will hear the best news ever of how God sent Jesus to bring double payment for all our sins.",
    "prayer": "Lord, open my heart to receive anew the God News of sins forgiven through Jesus. Amen.",
    "reading": "",
    "originalcontent": "12/03/09~~~food for thought~~~HAVE I GOT GOOD NEWS FOR YOU!!!\n\nOur Bible Verses for Today:\nComfort, comfort my people, says your God. Speak tenderly to\nJerusalem, and proclaim to her that her hard service has been\ncompleted, that her sin has been paid for, that she has received\nfrom the Lord's hand double for all her sins...(Isa. 40:1, 2)\n\nOur lesson for Today:\nYes, Isaiah had \"good news\" for Israel who was living in captivity.\nGod was going to end her separation from the homeland of Canaan.\nBetter still, He was going to end her separation from Him. Sin\nseparates people from God...\n\nIt builds a wall no sinner can crawl under, crash through, or climb over.\nOnly the Holy God, from whom sin separates us, can break down that wall.\n\nIsaiah was to speak of \"double\" payment, so completely were her sins\ngone. We might ask, \"How?\" Isaiah in many other verses told of the coming\nvirgin's Son. Of the Lamb going silently to the slaughter. Of the One on \nwhom all sins were laid and by whom all sins were paid.\n\nBetter news than this Israel would never hear, Nor will we. This Advent season\nit's time to kneel a little closer to Jesus' crib and beneath His cross. There we \nwill hear the best news ever of how God sent Jesus to bring double payment for\nall our sins...\n\nPrayer Suggestion:\nLord, open my heart to receive anew the God News of sins\nforgiven through Jesus...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125593feda3338fe",
    "dateutc": "Thu, 3 Dec 2009 05:36:20 -0600",
    "subject": "thoughts to live by",
    "verse": "Make straight in the wilderness a highway for our God. Every valley shall be raised up, every mountain and hill be made low. (Isaiah 40:3, 4)",
    "reflection": "\"Every valley shall be raised up, \" Isaiah said. When we feel that we have more sin than God has forgiveness, we need Isaiah's words. We need to hear that God's love, like some earth-moving machine, has scooped up Christ's forgiveness and dumped it into our heart's swampy spots. We need to pray ~ away with the doubt that grows in my swamp. Let my heart be filled with the solid news of Jesus' forgiveness.\"Make straight in the wilderness a highway for our God.\" Let the world plot its bypasses and curves. The heart in which the Christ Child lives seeks to follow the straight middle line on life's road. The believer wants to walk according to God's Word.\"Repent and be saved, \" read the notice. Underneath, someone had wrote, \"If you've already repented, please disregard this notice.\" That is not so with Advent's road construction. It's necessary year around.",
    "prayer": "Dear Lord, knock my heart flat with Your Law, and then build it up with the \"Good News of Jesus Christ.\" Amen.",
    "reading": "",
    "originalcontent": "12/04/09~~~food for thought~~~ADVENT'S ROAD CONSTRUCTION...\n\nOur Bible Verses for Today:\nMake straight in the wilderness a highway for our God. Every valley shall \nbe raised up, every mountain and hill be made low...(Isa. 40:3, 4)\n\nOur Lesson for Today:\n\"Every valley shall be raised up,\" Isaiah said. When we feel that we have \nmore sin than God has forgiveness, we need Isaiah's words. We need to hear\nthat God's love, like some earth-moving machine, has scooped up Christ's \nforgiveness and dumped it into our heart's swampy spots...\n\nWe need to pray ~ away with the doubt that grows in my swamp. Let my heart \nbe filled with the solid news of Jesus' forgiveness...\n\n\"Make straight in the wilderness a highway for our God.\" \nLet the world plot its bypasses and curves.\nThe heart in which the Christ Child lives seeks to follow the straight middle line\non life's road. The believer wants to walk according to God's Word...\n\n\"Repent and be saved,\" read the notice. Underneath, someone had wrote, \n\"If you've already repented, please disregard this notice.\" That is not so with\nAdvent's road construction. It's necessary year around...\n\nPrayer Suggestion:\nDear Lord, knock my heart flat with Your Law, and then\nbuild it up with the \"Good News of Jesus Christ.\" Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "1255e45ef2414880",
    "dateutc": "Fri, 4 Dec 2009 05:16:39 -0600",
    "subject": "thoughts to live by",
    "verse": "In that day you will sing: \"Praise the Lord! He was angry with me, but now He comforts me. See God has come to comfort me. I will trust in Him and not be afraid. The Lord God is my strength and my song; He has become my salvation.\" (Isaiah 12:1, 2)",
    "reflection": "If you read all six verses of chapter 12 you will notice its all a hymn of praise. What is the praise about? It is a description of the people's joy when Jesus Christ comes to reign over the earth. Even now we need to express our gratitude to God, thanking Him, and telling others about Him. YES from the depths of our gratitude, we need to be praising Him. AND we should share the Good News with others. The Good News of how God turned His anger away and sent His Son to be our salvation, that is truly a reason for joy.",
    "prayer": "Dear Lord help me to share the joy of my salvation. Amen.",
    "reading": "",
    "originalcontent": "12/05/09~~~food for thought~~~WHAT ARE YOU DOING WITH THE GOOD NEWS?\n\nOur Bible Verses for Today:\nIn that day you will sing: \"Praise the Lord! He was angry with me,\nbut now He comforts me. See God has come to comfort me. I\nwill trust in Him and not be afraid. The Lord God is my strength\nand my song; He has become my salvation.\" (Isa. 12:1, 2)\n\nOur Lesson for Today:\nIf you read all six verses of chapter 12 you will notice its all a hymn\nof praise. What is the praise about? It is a description of the people's \njoy when Jesus Christ comes to reign over the earth...\n\nEven now we need to express our gratitude to God, thanking Him, and \ntelling others about Him. YES from the depths of our gratitude, we need\nto be praising Him. AND we should share the Good News with others...\nThe Good News of how God turned His anger away and sent His Son to\nbe our salvation, that is truly a reason for joy...\n\nPrayer Suggestion:\nDear Lord help me to share the joy of my salvation...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "1256394fc07ed92b",
    "dateutc": "Sat, 5 Dec 2009 04:45:07 -0600",
    "subject": "thoughts to live by",
    "verse": "Give thanks to the Lord, call on His name; make known among the nations what He has done, and proclaim that His name is exalted. (Isaiah 12:4)",
    "reflection": "\"Give thanks to the Lord, \" Isaiah says. Even if we sound like a bullfrog in some pond, we should sing to the One who gave us the newborn King. We should also use our life to thank the great Giver of Christmas.\"Make known among the nations what He has done, \" Isaiah also urged. One sure way to increase Christmas joy is to share it. Not only should we join the carolers at Christmastime in singing \"We Wish You a Merry Christmas.\" We should use every opportunity each day to help bring to others the Good News of the Savior sent by God's love. I want them to have the same Merry Christmas I do, shouldn't you? A Merry Christmas? Yes, when we rejoice in Jesus our Savior and share Him with others.",
    "prayer": "Dear Lord, help me to sing loudly all year through. Amen.",
    "reading": "",
    "originalcontent": "12/06.09~~~food for thought~~~LET'S JOIN THE CAROLERS...\n\nOur Bible Verse for Today:\nGive thanks to the Lord, call on His name; make known among\nthe nations what He has done, and proclaim that His name is\nexalted...(Isa. 12:4)\n\nOur Lesson for Today:\n\"Give thanks to the Lord,\" Isaiah says. Even if we sound like a bullfrog \nin some pond, we should sing to the One who gave us the newborn King.\nWe should also use our life to thank the great Giver of Christmas...\n\n\"Make known among the nations what He has done,\" Isaiah also urged.\nOne sure way to increase Christmas joy is to share it. Not only should we \njoin the carolers at Christmastime in singing \"We Wish You a Merry Christmas.\"\nWe should use every opportunity each day to help bring to others the Good News\nof the Savior sent by God's love...\n\nI want them to have the same merry CHRISTmas I do, shouldn't you?\nA merry Christmas? Yes, when we rejoice in Jesus our Savior and share\nHim with others...\n\nPrayer Suggestion:\nDear Lord, help me to sing loudly all year through...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "12568c0a651d3b33",
    "dateutc": "Sun, 6 Dec 2009 05:33:17 -0600",
    "subject": "thoughts to live by",
    "verse": "See, I will send My messenger, who will prepare the way before Me. Then suddenly the Lord you are seeking will come to His temple. (Mal. 3:1a)",
    "reflection": "\"Jesus is coming, \" Malachi told the Jews of his day. BUT it would still be 400 years before John the Baptist at the Jordan River would prepare people for the Savior's coming. But Malachi wrote as if it were today.\"Before you know it, the promised Savior will be standing in the midst of His people.\" Did you notice what Malachi called Him? \"The Lord, \" he said. The eternal God would come down to the earth He had created to work among the creatures He had made and who in sin had turned away from Him. That my friends is the miracle in the manger. That's the real reason for joy. To often many just see a poor baby wrapped in rags and miss the real meaning of Christmas. They see only a man and actually see nothing. If Jesus were only a human being, we would have no cause to celebrate. Then we could just as well forget about Christmas or change the name of the season to the \"holiday whatever.\" Who's coming this season? The Lord Himself, stooping low in love to save sinners like me.",
    "prayer": "Dear Lord, this season help me sing, \"Joy to the world, the Lord has come to me.\" Amen.",
    "reading": "",
    "originalcontent": "12/07/09~~~food for thought~~~THE LORD IS COMING\n\nOur Bible Verse for Today:\nSee, I will send My messenger, who will prepare the way before Me.\nThen suddenly the Lord you are seeking will come to His temple. (Mal. 3:1a)\n\nOur Lesson for Today:\n\"Jesus is coming,\" Malachi told the Jews of his day. BUT it would still be 400 years\nbefore John the Baptist at the Jordan River would prepare people for the Savior's \ncoming...But Malachi wrote as if it were today.\"Before you know it, the promised \nSavior will be standing in the midst of His people.\"\n\nDid you notice what Malachi called Him? \"The Lord,\" he said...The eternal God would \ncome down to the earth He had created to work among the creatures He had made and \nwho in sin had turned away from Him...\n\nThat my friends is the miracle in the manger. That's the real reason for joy. To often\nmany just see a poor baby wrapped in rags and miss the real meaning of Christmas.\nThey see only a man and actually see nothing...\n\nIf Jesus were only a human being, we would have no cause to celebrate. Then we \ncould just as well forget about Christmas or change the name of the season to the \n\"holiday whatever.\"\n\nWho's coming this season? The Lord Himself, stooping low in love to save sinners\nlike me...\n\nPrayer Suggestion:\nDear Lord, this season help me sing, \"Joy to the world,\nthe Lord has come to me.\" Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "1256de1560b41d0d",
    "dateutc": "Mon, 7 Dec 2009 05:30:36 -0600",
    "subject": "thoughts to live by",
    "verse": "The Messenger of the covenant, whom you desire, will come, says the Lord Almighty. (Mal 3:1b)",
    "reflection": "Somewhere I saw a painting of the nativity. Angels gathered round the Christ Child's manger with their songs of praise. But over in the corner one angel, holding a small cross it its hand, was wiping a tear from its eyes. What a reminder! God Himself came to the manger to go to the cross. That's what Malachi tells us. When he calls Jesus the \"Messenger of the covenant\" he refers to the beautiful one-sided agreement that God made with sinners already in the Garden of Eden. There God Promised to our fallen parents that He would send His Son as the seed of the woman to crush Satan's head. Malachi says with obvious joy, \"The Messenger of the covenant [the promised Savior] will come.\" This blessed season we can echo the prophets words but change the tense. \"The Savior has come\" By God's grace I can even add as I kneel at His manger bed, \"The Savior came for me.\" For me He left heaven's throne. For me He took on human flesh. To save me He lived and died. If that wonderful news doesn't fill me with joy, I might as well tear the December pages of the calendar or at least cancel the month's last week. Jesus my Savior, is coming again. that's why I celebrate Christmas.",
    "prayer": "Dear Lord, help me to sing with joy, Joy to the world the Lord, my Savior, has come. Amen.",
    "reading": "",
    "originalcontent": "12/08/09~~~food for thought~~~AND NOW FOR THE REST OF THE STORY...\n\nOur Bible Verse for Today:\n\"The Messenger of the covenant, whom you desire, will come,\"\nsays the Lord Almighty...(Mal 3:1b)\n\nSomewhere I saw a painting of the nativity. Angels gathered round\nthe Christ Child's manger with their songs of praise. But over in the \ncorner one angel, holding a small cross it its hand, was wiping a tear\nfrom its eyes. What a reminder! God Himself came to the manger\nto go to the cross...\n\nThat's what Malachi tells us. When he calls Jesus the \"Messenger of \nthe covenant,\" he refers to the beautiful one-sided agreement that God\nmade with sinners already in the Garden of Eden...\n\nThere God Promised to our fallen parents that He would send His Son \nas the seed of the woman to crush Satan's head. Malachi says with\nobvious joy, \"The Messenger of the covenant [the promised Savior] \nwill come.\"\n\nThis blessed season we can echo the prophets words but change \nthe tense.\"The Savior has come,\" By God's grace I can even add\nas I kneel at His manger bed, \"The Savior came for me.\" For me He \nleft heaven's throne. For me He took on human flesh. To save me He\nlived and died...\n\nIf that wonderful news doesn't fill me with joy, I might as well tear the \nDecember pages of the calendar or at least cancel the month's last week.\nJesus my Savior, is coming again. that's why I celebrate Christmas...\n\nPrayer Suggestion:\nDear Lord, help me to sing with joy, \"Joy to the world the Lord, \nmy Savior, has come...\" Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "1257311c4053a93a",
    "dateutc": "Tue, 8 Dec 2009 06:03:10 -0600",
    "subject": "thoughts to live by",
    "verse": "But who can endure the day of His coming? Who can stand when He appears? For He will be like a refiner's fire or a launderer's soap. (Mal. 3:2)",
    "reflection": "I love working with old ~ OLD tractors, but at the end of the day my hands are black and greasy. but I have a special soap which takes it all away.\"A launderer's soap, \" Malachi called the coming Savior. The word means strong stuff like I have in my shop. Like that soap, the coming Christ would scrub human hearts clean from the impossible-to-remove grease of sin.\"A refiner's fire, \" Malachi also said. Like a super-hot smelter, the coming of Christ would melt sin's impurities from precious human hearts. Hearts that the Savior has purified need not be afraid. They can stand holy when He returns in judgment. BUT hearts that reject the Christ will burn like the fire under the smelting furnace or like the lye eating away at the grease. Because of their unbelief, they will carry their sins into hell's everlasting pain. Who came for me at Christmas? Thank God I can answer, \"Jesus, my purifier from sin.\" Because of Jesus I can say: \"I am not what I ought to be. I am not what I wish to be. I am not what I hope to be. BUT by the grace of God I am not what I was.\"",
    "prayer": "Dear Lord, and Savior, wash me clean from sin's grease and power me for the fight against sin. Amen.",
    "reading": "",
    "originalcontent": "12/09/09~~~food for thought~~~THE PURIFIER IS COMING...\n\nOur Bible Verse for Today:\nBut who can endure the day of His coming? Who can stand when He \nappears? For He will be like a refiner's fire or a launderer's soap. (Mal. 3:2)\n\nOur Lesson for Today:\nI love working with old ~ OLD tractors, but at the end of the day my hands\nare black and greasy. but I have a special soap which takes it all away...\n\n\"A launderer's soap,\" Malachi called the coming Savior. The word means \nstrong stuff like I have in my shop. Like that soap, the coming Christ would\nscrub human hearts clean from the impossible-to-remove grease of sin...\n\n\"A refiner's fire,\" Malachi also said. Like a super-hot smelter, the coming of\nChrist would melt sin's impurities from precious human hearts. Hearts that the \nSavior has purified need not be afraid. They can stand holy when He returns\nin judgment...\n\nBUT hearts that reject the Christ will burn like the fire under the smelting furnace \nor like the lye eating away at the grease. Because of their unbelief, they will carry\ntheir sins into hell's everlasting pain...\n\nWho came for me at Christmas? Thank God I can answer, \"Jesus, my purifier \nfrom sin.\" Because of Jesus I can say: \"I am not what I ought to be. I am not what \nI wish to be. I am not what I hope to be. BUT by the grace of God I am not what I was.\"\n\nPrayer Suggestion:\nDear Lord, and Savior, wash me clean from sin's grease\nand power me for the fight against sin...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "1257816ac6a260ef",
    "dateutc": "Wed, 9 Dec 2009 05:42:36 -0600",
    "subject": "thoughts to live by",
    "verse": "So I will come near to you for judgment. I the Lord do not change. (Mal. 3:5, 6)",
    "reflection": "Unbeliever's will do more than shrink back when Jesus comes on the Last Day. They may have thought they could hide their sins from the One seemingly far away in the heavens. They may have thought His eyes couldn't see their hearts. But He is near. He does see. And He will punish. That threat is real. The Lord who does not change makes it. He will carry it out. The Judge is coming. No doubt about this fact, for the Lord does not change His mind. Nor will He change the forgiveness with which He covers me or anyone else who has asked Him into their heart. The one who judges me is the One who has already saved me.",
    "prayer": "Dear Lord, remind me of my salvation when I think of You as my judge. Amen.",
    "reading": "",
    "originalcontent": "12/10/09~~~food for thought~~~THE JUDGE IS COMING...\n\nOur Bible Verses for Today:\nSo I will come near to you for judgment...\nI the Lord do not change...(Mal. 3:5, 6)\n\nOur Lesson for Today:\nUnbeliever's will do more than shrink back when Jesus comes on the Last Day.\nThey may have thought they could hide their sins from the One seemingly far\naway in the heavens. They may have thought His eyes couldn't see their hearts...\n\nBut He is near...He does see...And He will punish...That threat is real...\nThe Lord who does not change makes it...He will carry it out...\n\nThe Judge is coming...No doubt about this fact, for the Lord does not change His mind.\nNor will He change the forgiveness with which He covers me or anyone else who has\nasked Him into their heart. The one who judges me is the One who has already saved me...\n\nPrayer Suggestion:\nDear Lord, remind me of my salvation when I think\nof You as my judge...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "1257d363503f1df9",
    "dateutc": "Thu, 10 Dec 2009 05:02:46 -0600",
    "subject": "thoughts to live by",
    "verse": "John came. preaching a baptism of repentance for the forgiveness of sins. After me will come one more powerful than I. He will baptize you with the Holy Spirit. (Mark 1:4, 7, 8)",
    "reflection": "What if John the Baptist came to be the guest speaker in your church? What would he preach about??? I'm sure he would have something to say about repentance. That means he would talk about my sins. Some seem they would rather ignore sin, putting a blindfold over the eyes of their conscience. They'd rather alibi for sin, pointing to others who are worse. They'd rather sugarcoat sin, dusting it with sweet phrases like, \"cultural change.\" But John would preach sin to me in plain terms. And I had better listen. If the Savior in the manger is going to mean anything to me, and you, we need to know how much we need Him. With even more gusto John would preach about the Savior. In his day he pointed hears all the way ahead to Christ's finished work. John saw Jesus, with His work of salvation finished, ascending back to heaven. He saw the ascended Savior sending His Holy Spirit to bring people to faith. He saw the Savior returning to judge the world. What would he preach to us if he filled the pulpit of our churches today? Above all, he'd say: \"Remember the Savior who went to the cross and then back to heaven. Remember how His salvation is complete. Remember how he's coming again to take you to heaven.\" Let us pray that our pastors will preach John's sermon to us this Advent.",
    "prayer": "Dear Lord, remind me of my sins each day so that I may rejoice on the day Jesus comes for me. Amen.",
    "reading": "",
    "originalcontent": "12/11?09~~~food for thought~~~WHAT WOULD HE PREACH?\n\nOur Bible Verses for Today:\nJohn came...preaching a baptism of repentance for the forgiveness of sins...\nAfter me will come one more powerful than I...He will baptize you with the Holy \nSpirit...(Mk. 1:4, 7, 8)\n\nOur Lesson for Today:\nWhat if John the Baptist came to be the guest speaker in your church?\nWhat would he preach about???\n\nI'm sure he would have something to say about repentance. That means he would \ntalk about my sins. Some seem they would rather ignore sin, putting a blindfold\nover the eyes of their conscience. They'd rather alibi for sin, pointing to others\nwho are worse. They'd rather sugarcoat sin, dusting it with sweet phrases like,\n\"cultural change.\"\n\nBut John would preach sin to me in plain terms. And I had better listen. If the Savior\nin the manger is going to mean anything to me, and you, we need to know how much \nwe need Him...\n\nWith even more gusto John would preach about the Savior. In his day he pointed hears \nall the way ahead to Christ's finished work. John saw Jesus, with His work of salvation \nfinished, ascending back to heaven. He saw the ascended Savior sending His Holy Spirit \nto bring people to faith. He saw the Savior returning to judge the world...\n\nWhat would he preach to us if he filled the pulpit of our churches today?\nAbove all, he'd say: \"Remember the Savior who went to the cross and then\nback to heaven. Remember how His salvation is complete. Remember how \nhe's coming again to take you to heaven.\"\n\nLet us pray that our pastors will preach John's sermon to us this Advent...\n\nPrayer Suggestion:\nDear Lord, remind me of my sins each day so that\nI may rejoice on the day Jesus comes for me...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "12582865b08adb60",
    "dateutc": "Fri, 11 Dec 2009 04:52:33 -0600",
    "subject": "thoughts to live by",
    "verse": "Mary was greatly troubled at his words. but the angel said to her, \"Do not be afraid, Mary, you have found favor with God.\" (Luke 1:29, 30)",
    "reflection": "Yes Mary was the first one to have Christmas anxiety! Yes, Mary was afraid. But put yourself in her shoes and you will see why. In her day people looked down on unwed pregnant women. Also, what about her fianc Joseph? How would she ever explain it to him? And that holy angel! Sinful people just simply cannot stand in the presence of the holy God. They can't even stand with heads erect before one of God's angels.\"Do not be afraid, Mary, ' the angel told her, \"you have found favor with God.\" God's favor flows from His grace. Yes this unexplainable pregnancy was the reason for anxiety ~ BUT Jesus was the answer to Mary's Christmas anxiety and can be ours too. Any anxiety in your heart this Advent? The Savior in the manger won't mean much to you if you don't reexamine the reason for His coming. We really need to look past the veneer we paste over our life and into our heart. The sight isn't pretty. We can no more kneel before Jesus' manger than Mary could stand before the angel. But God has favored us too. He sent His Son to remove our sins with His payment. He sent Jesus so we could stand without anxiety before Him this blessed Christmas season.",
    "prayer": "Dear Lord remove the fear from my sinful heart. Fill it with joy because of my Savior's birth. Amen.",
    "reading": "",
    "originalcontent": "11/12/09~~~food for thought~~~CHRISTMAS ANXIETY...\n\nOur Bible Verses for Today:\nMary was greatly troubled at his words...but the angel said to her, \n\"Do not be afraid, Mary, you have found favor with God.\" (Lk. 1:29, 30)\n\nOur Lesson for Today:\nYes Mary was the first one to have Christmas anxiety! Yes, Mary was afraid. \nBut put yourself in her shoes and you will see why. In her day people looked \ndown on unwed pregnant women. Also, what about her fianc Joseph? \nHow would she ever explain it to him?\n\nAnd that holy angel! Sinful people just simply cannot stand in the presence of\nthe holy God. They can't even stand with heads erect before one of God's angels.\n\n\"Do not be afraid, Mary,' the angel told her, \"you have found favor with God.\"\nGod's favor flows from His grace. Yes this unexplainable pregnancy was the\nreason for anxiety ~ BUT Jesus was the answer to Mary's Christmas anxiety\nand can be ours too...\n\nAny anxiety in your heart this Advent? The Savior in the manger won't mean much \nto you if you don't reexamine the reason for His coming. We really need to look past\nthe veneer we paste over our life and into our heart. The sight isn't pretty. We can no \nmore kneel before Jesus' manger than Mary could stand before the angel. But God\nhas favored us too...\n\nHe sent His Son to remove our sins with His payment. He sent Jesus so we could stand\nwithout anxiety before Him this blessed Christmas season...\n\nPrayer Suggestion:\nDear Lord remove the fear from my sinful heart.\nFill it with joy because of my Savior's birth...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "12587c011aad88a4",
    "dateutc": "Sat, 12 Dec 2009 05:33:50 -0600",
    "subject": "thoughts to live by",
    "verse": "\"How will this be, \" Mary answered, \"since I am a virgin?\" The angel answered, \"The Holy Spirit will come upon you, and the power of the Most High will overshadow you. So the holy one to be born will be called the Son of God.\" (Luke 1:34, 35)",
    "reflection": "Mary knew biology. She knew it took two people to conceive a baby. She also knew that she was still a virgin. In amazement she had to ask, \"How will this be?\" the angels answer must have taken her breath away. The Holy Spirit would miraculously begin Jesus' human life in her womb. The virgin birth of Jesus, though disputed by some, is a very important teaching. It reminds us that Jesus was \"the Holy One\" as the angel told Mary. If you add a human father to Jesus' conception you would eliminate Him as the Savior. From a human father and mother, Jesus would have inherited the same sinful heart that we did. Also, the virgin birth should remind us that it was totally God's work. Man had no part in it. How could man bring about the incredible miracle of God's infinite love taking the infinite shape of true man? Such a love-packed miracle can only be God's great doing. Yes Christmas means amazement ~ Joy beyond measure because of God's love-powered miracles for us.",
    "prayer": "Dear Lord, help me sing loudly of Your amazing love and what it has done for me in Jesus. Amen.",
    "reading": "",
    "originalcontent": "11/13/09~~~food for thought~~~CHRISTMAS AMAZEMENT...\n\nOur Bible Verses for Today:\n\"How will this be,\" Mary answered, \"since I am a virgin?\" The angel answered,\n\"The Holy Spirit will come upon you, and the power of the Most High will overshadow you. So the holy one to be born will be called the Son of God.\" (Lk. 1:34, 35)\n\nOur Lesson for Today:\nMary knew biology. She knew it took two people to conceive a baby.\nShe also knew that she was still a virgin. In amazement she had to ask,\n\"How will this be?\" the angels answer must have taken her breath away.\nThe Holy Spirit would miraculously begin Jesus' human life in her womb...\n\nThe virgin birth of Jesus, though disputed by some, is a very important\nteaching. It reminds us that Jesus was \"the Holy One\" as the angel told Mary.\nIf you add a human father to Jesus' conception you would eliminate Him as \nthe Savior...\n\nFrom a human father and mother, Jesus would have inherited the same\nsinful heart that we did. Also, the virgin birth should remind us that it was \ntotally God's work. Man had no part in it. How could man bring about the \nincredible miracle of God's infinite love taking the infinite shape of true man?\n\nSuch a love-packed miracle can only be God's great doing...\nYes Christmas means amazement ~ Joy beyond measure \nbecause of God's love-powered miracles for us...\n\nPrayer Suggestion:\nDear Lord, help me sing loudly of Your amazing love\nand what it has done for me in Jesus...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "1258cc0419dea980",
    "dateutc": "Sun, 13 Dec 2009 05:49:20 -0600",
    "subject": "thoughts to live by",
    "verse": "\"I am the Lord's servant, \" Mary answered.\"May it be to me as you have said.\" (Luke 1:38).",
    "reflection": "In 11 more days, Christmas will be here. In 12, Christmas will be past. Is that how it will go this year? Or will Christmas last all year? From Mary we can gain the answer. The angel's holy presence first filled Mary with fear. The angel's awesome message filled her with questions. With both fear and questions erased, Mary had only one reaction. In simple faith she said, \"I am the Lord's servant. May it be to me as you have said.\" As God's humble servant she was willing to follow His commands. She found joy in doing what her servant-God asked of her. When will Christmas end for you? The answer is obvious. Jesus wants to be our Savior throughout our life. He wants to serve us with His forgiveness all our days. He wants to take us to heaven on our final day. So we should want to serve Him all our days. So our question should be, \"What can I do for You, Lord Jesus, who has done so much for me?\" Willing obedience is the best gift we can give God during our lifelong Christmas.",
    "prayer": "Dear Lord, wrap my thoughts and my life around Jesus all the days of my life. Amen.",
    "reading": "",
    "originalcontent": "12?14/09~~~food for thought~~~CHRISTMAS ACCEPTANCE\n\nOur Bible Verse for Today:\n\"I am the Lord's servant,\" Mary answered.\"May it\nbe to me as you have said.\" (Lk. 1:38).\n\nOur Lesson for Today:\nIn 11 more days, Christmas will be here. In 12, Christmas will be past.\nIs that how it will go this year? Or will Christmas last all year? From Mary\nwe can gain the answer...\n\nThe angel's holy presence first filled Mary with fear. The angel's awesome\nmessage filled her with questions. With both fear and questions erased, \nMary had only one reaction. In simple faith she said, \"I am the Lord's\nservant. May it be to me as you have said.\" As God's humble servant \nshe was willing to follow His commands. She found joy in doing what her\nservant-God asked of her...\n\nWhen will Christmas end for you? The answer is obvious. Jesus wants to \nbe our Savior throughout our life. He wants to serve us with His forgiveness\nall our days. He wants to take us to heaven on our final day. So we should\nwant to serve Him all our days...\n\nSo our question should be, \"What can I do for You, Lord Jesus, who has done\nso much for me?\" Willing obedience is the best gift we can give God during\nour lifelong Christmas...\n\nPrayer Suggestion:\nDear Lord, wrap my thoughts and my life around Jesus \nall the days of my life...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "12591e674f58bd50",
    "dateutc": "Mon, 14 Dec 2009 05:05:41 -0600",
    "subject": "thoughts to live by",
    "verse": "Praise to the Lord. the God of Israel, because He has come and has redeemed His people. as He said through His holy prophets of long ago. (Luke 1:68, 70)",
    "reflection": "Zechariah, holding the baby John on his lap, didn't say, \"Who cares?\" He saw in the heavenly guest the one promised by God through His prophets. Centuries of waiting were almost over. In six months the Savior would come. No wonder Zechariah under the Spirit's guidance sang for joy. He saw even more. The Christ Child would be God Himself come to redeem His people. He would stand at the door as the eternal God come in the flesh. Just think of it! God the Almighty ~ a little baby! God the eternal ~ a few hours old! God the all-ruling ~ rocked in a mothers arms. How do we describe this miracle of the ages except to point to the overwhelming love behind it? Remember the first line of that song? it goes, \"The happy Christmas comes once more, the heavenly guest is at the door.\" Yes God Himself has come from heaven to be our Savior. That's reason enough to rejoice.",
    "prayer": "Dear Lord, fill my Christmas with happiness by reminding me how You came to save me. Amen",
    "reading": "",
    "originalcontent": "12/15/09~~~food for thought~~~THE HEAVENLY GUEST IS AT THE DOOR ~\nWHO IS HE?\n\nOur Bible Verses for Today:\nPraise to the Lord. the God of Israel, because He has come and\nhas redeemed His people...as He said through His holy prophets\nof long ago. (Lk. 1:68, 70)\n\nOur Lesson for Today:\nZechariah, holding the baby John on his lap, didn't say, \"Who cares?\"\nHe saw in the heavenly guest the one promised by God through His\nprophets. Centuries of waiting were almost over. In six months the\nSavior would come...\n\nNo wonder Zechariah under the Spirit's guidance sang for joy. He saw \neven more. The Christ Child would be God Himself come to redeem \nHis people. He would stand at the door as the eternal God come in\nthe flesh. Just think of it! God the Almighty ~ a little baby! God the\neternal ~ a few hours old! God the all-ruling ~ rocked in a mothers arms...\n\nHow do we describe this miracle of the ages except to point to the overwhelming love behind it? Remember the first line of that song? it goes,\n\"The happy Christmas comes once more, the heavenly guest is at\nthe door.\" Yes God Himself has come from heaven to be our Savior.\nThat's reason enough to rejoice...\n\nPrayer Suggestion:\nDear Lord, fill my Christmas with happiness by\nreminding me how You came to save me...Amen\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "12597104941a9bc3",
    "dateutc": "Tue, 15 Dec 2009 05:18:40 -0600",
    "subject": "thoughts to live by",
    "verse": "\"Praise be to the Lord, the God of Israel, because He has come and has redeemed His people. He has raised up a horn of salvation for us in the house of His Servant David, to shine on those living in darkness and in the shadow of death, to guide our feet into the path of peace.\" (Luke 1:68, 69, 79)",
    "reflection": "Can you imagine the joy if, when Christmas comes, people everywhere would reevaluate the gifts the Heavenly guest brings in His arms? Zechariah sang of those gifts.\"He has raised up a horn of salvation, \" he said. Like so much garbage, Jesus tossed aside, sin ~ death ~ and the devil forever. Victory over all three are the gifts the Savior brings. Like the rising sun, Zechariah said, \"Jesus came to shine on those living in darkness and in the shadow of death.\" More than a child afraid of the night's darkness, I had to be terrified of sin's blackness. Yes I was scared of death's darkness. No light ~ no hope ~ no joy ~ no heaven ~ no nothing ~ without the Savior at the door this blessed season. Does salvation's light seem as bright as ever? If not, it's time to go back to square one, to ask ourselves: \"Am I a sinner? How much, not how little, Have I sinned? Where do I deserve to go because of my sins? What would death be like without Jesus? Then perhaps we'll be ready to sing with joy, \"The happy Christmas comes once more, the Heavenly Guest with His precious gifts is at the door.",
    "prayer": "Dear Lord, and blessed Savior, let Your salvation light up my Christmas and my heart with joy. Amen",
    "reading": "",
    "originalcontent": "12/16/09~~~food for thought~~~THE HEAVENLY GUEST IS AT THE DOOR\nWHAT DOES HE BRING?\n\nOur Bible Verses for Today:\n\"Praise be to the Lord, the God of Israel, because He has come and \nhas redeemed His people. He has raised up a horn of salvation for us \nin the house of His Servant David, to shine on those living in darkness \nand in the shadow of death, to guide our feet into the path of peace.\"\n(Lk. 1:68, 69, 79)\n\nOur Lesson for Today:\nCan you imagine the joy if, when Christmas comes, people everywhere\nwould reevaluate the gifts the Heavenly guest brings in His arms?\n\nZechariah sang of those gifts.\"He has raised up a horn of salvation,\" he said.\nLike so much garbage, Jesus tossed aside, sin ~ death ~ and the devil forever.\nVictory over all three are the gifts the Savior brings...\n\nLike the rising sun, Zechariah said, \"Jesus came to shine on those living in darkness\nand in the shadow of death.\" More than a child afraid of the night's darkness, I had\nto be terrified of sin's blackness. Yes I was scared of death's darkness. No light ~\nno hope ~ no joy ~ no heaven ~ no nothing ~ without the Savior at the door this\nblessed season...\n\nDoes salvation's light seem as bright as ever? If not, it's time to go back to square \none, to ask ourselves: \"Am I a sinner? How much, not how little, Have I sinned?\nWhere do I deserve to go because of my sins? What would death be like without\nJesus? Then perhaps we'll be ready to sing with joy, \"The happy Christmas comes\nonce more, the Heavenly Guest with His precious gifts is at the door...\n\nPrayer Suggestion:\nDear Lord, and blessed Savior, let Your salvation light\nup my Christmas and my heart with joy...Amen\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "1259c2c0d70a06a1",
    "dateutc": "Wed, 16 Dec 2009 05:05:55 -0600",
    "subject": "thoughts to live by",
    "verse": "74 to rescue us from the hand of our enemies, and to enable us to serve him without fear 75 in holiness and righteousness before him all our days. (Luke 1:74-75)",
    "reflection": "Have you ever noticed that there are very few purple Christmas bulbs? There are all kinds of red, yellow, and blue ones. Someone once explained that purple glass cuts off light waves and as a result dims the brightness. And, of course, we want the lights of Christmas to shine. Isn't that what Zechariah tells us in our verse? He reminds us that the Savior comes to \"enable us to serve Him without fear in holiness and righteousness before Him all our days.\" Have you ever given any thought to the fact that Christians are to be Christmas bulbs shinning brightly long after Christmas passes??? As a believer in Christ, I'm to shine, not because I'm forced to but because I have to. It's the very nature of those who are plugged in to the Light of the world, to shine with His light. And there is no switch that turns me off so that I shine only once in a while.\"ALL OUR DAYS, \" Zechariah said.",
    "prayer": "Dear Heavenly Guest, thank you for the light of salvation. Help me shine it to others. Amen.",
    "reading": "",
    "originalcontent": "12/17/09~~~food for thought~~~THE HEAVENLY GUEST IS AT THE DOOR\nHOW SHALL I SERVE HIM?\n\nOur Bible Verses for Today:\nHave you ever noticed that there are very few purple Christmas bulbs?\nThere are all kinds of red, yellow, and blue ones. Someone once explained\nthat purple glass cuts off light waves and as a result dims the brightness.\nAnd, of course, we want the lights of Christmas to shine...\n\nIsn't that what Zechariah tells us in our verse? He reminds us that the Savior \ncomes to \"enable us to serve Him without fear in holiness and righteousness \nbefore Him all our days.\" Have you ever given any thought to the fact that \nChristians are to be Christmas bulbs shinning brightly long after Christmas\npasses???\n\nAs a believer in Christ, I'm to shine, not because I'm forced to but because \nI have to. It's the very nature of those who are plugged in to the Light of the\nworld, to shine with His light. And there is no switch that turns me off so that I\nshine only once in a while.\"ALL OUR DAYS,\" Zechariah said...\n\nPrayer Suggestion:\nDear Heavenly Guest, thank you for the light of salvation.\nHelp me shine it to others...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": false,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125a15d6024f9bc1",
    "dateutc": "Thu, 17 Dec 2009 05:47:27 -0600",
    "subject": "thoughts to live by",
    "verse": "Rejoice in the Lord always. I will say again: Rejoice! (Philippians 4:4)",
    "reflection": "Rejoice? Isn't that what the Christmas season is all about? What a shame it only comes once a year. Paul wasn't thinking about people or presents when he encouraged believers at Philippi, \"to rejoice always.\" How could he have been? The apostle was imprisoned at Rome, jailed unjustly for the crime of talking about his Savior. Oh he knew what the usual exit from a Roman jail was ~ a head lost to the executioner's axe. Yet he urged his fellow believers, \"Rejoice always.\" \"In the Lord, \" he reminded them. Here my friends is the key for joy that lasts from one Christmas to the next. As Paul put it, \"You know the grace of our Lord Jesus Christ, that though He was rich, yet for our sakes He became poor, so that you through His poverty might become rich.\" (2 Corinthians 8:9). And then he added, \"Thanks be to God for His indescribable gift.\" (2 Corinthians 9:15). As believers we have a joy that never ends because we have a God whose grace is unending. In Jesus He gave us the best gift He had, the Savior from sin in whom we can rejoice every day of our life.",
    "prayer": "Dear Lord, thank You for the gift of Your Son as my Savior. Fill me with joy because of Him. Amen.",
    "reading": "",
    "originalcontent": "12/18/09~~~food for thought~~~REJOICE IN THE LORD!\n\nOur Bible Verse for Today:\nRejoice in the Lord always. I will say again: Rejoice! (Phil. 4:4)\n\nOur Lesson for Today:\nRejoice? Isn't that what the Christmas season is all about?\nWhat a shame it only comes once a year...\n\nPaul wasn't thinking about people or presents when he encouraged believers\nat Philippi, \"to rejoice always.\" How could he have been? The apostle was\nimprisoned at Rome, jailed unjustly for the crime of talking about his Savior.\n\nOh he knew what the usual exit from a Roman jail was ~ a head lost to the \nexecutioner's axe. Yet he urged his fellow believers, \"Rejoice always.\"\n\n\"In the Lord,\" he reminded them. Here my friends is the key for joy that lasts \nfrom one Christmas to the next. As Paul put it, \"You know the grace of our\nLord Jesus Christ, that though He was rich, yet for our sakes He became poor, \nso that you through His poverty might become rich.\" (2 Cor. 8:9). And then he\nadded, \"Thanks be to God for His indescribable gift.\" (2 Cor. 9:15)...\n\nAs believers we have a joy that never ends because we have a God whose\ngrace is unending. In Jesus He gave us the best gift He had, the Savior from \nsin in whom we can rejoice every day of our life...\n\nPrayer Suggestion:\nDear Lord, thank You for the gift of Your Son as my Savior.\nFill me with joy because of Him...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125a6bd5d3b2b3cc",
    "dateutc": "Fri, 18 Dec 2009 05:21:05 -0600",
    "subject": "thoughts to live by",
    "verse": "Let your gentleness be evident to all. The Lord is near. (Philippians 4:5)",
    "reflection": "How big is Christmas to you? Is it just sharing a greeting, sending a card? What are your thoughts this time of the year? Is it what will I get from others? What I gave them last year cost more than what they gave me? Such thinking exhibits not a spirit of gentle concern for others but selfish concerns for self. Such thoughts rob one of the Christmas joy. an even greater robber of joy is preoccupation with oneself because of ones sins. Yes, of course, we need to be concerned about our failures. BUT, knowing the Lord is near means we bring those sins to Him in repentance. We need to trust His Word that He has plunged them into the depths of His forgiveness. I'm thrilled that in His gentleness He does not deal with me as I deserve but forgives me for the sake of His Son. Just as God in His gentle love sent His Son to wash away my sins, so I'm to respond with gentleness toward my fellowman. God's gentleness in Christ is contagious. When we have it, we spread it to others.",
    "prayer": "Dear Lord, help me to be like Jesus ~ meek ~ lowly ~ loving ~ mild. Amen.",
    "reading": "",
    "originalcontent": "12/19/09~~~food for thought~~~SEEK THE SPIRIT OF THE LORD!\n\nOur Bible Verse for Today:\nLet your gentleness be evident to all. The Lord is near...(Phil. 4:5)\n\nOur Lesson for Today:\nHow big is Christmas to you? Is it just sharing a greeting, sending a card?\nWhat are your thoughts this time of the year? Is it what will I get from others?\nWhat I gave them last year cost more than what they gave me?\n\nSuch thinking exhibits not a spirit of gentle concern for others but selfish \nconcerns for self. Such thoughts rob one of the Christmas joy. an even \ngreater robber of joy is preoccupation with oneself because of ones sins.\n\nYes, of course, we need to be concerned about our failures. BUT, knowing \nthe Lord is near means we bring those sins to Him in repentance. We need\nto trust His Word that He has plunged them into the depths of His forgiveness.\n\nI'm thrilled that in His gentleness He does not deal with me as I deserve but \nforgives me for the sake of His Son. Just as God in His gentle love sent His\nSon to wash away my sins, so I'm to respond with gentleness toward my\nfellowman. God's gentleness in Christ is contagious. When we have it, we\nspread it to others...\n\nPrayer Suggestion:\nDear Lord, help me to be like Jesus ~ meek ~ lowly ~\nloving ~ mild...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125abc9f419b0885",
    "dateutc": "Sat, 19 Dec 2009 06:29:03 -0600",
    "subject": "thoughts to live by",
    "verse": "Do not be anxious about anything, but in everything, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus. (Philippians 4:6, 7)",
    "reflection": "\"Don't be anxious about anything, \" Paul said. I think we've all said, \"Easier said than done.\" Who doesn't have cares, even in this joyous season? The experts tell us that during a holiday season like this, cares seem even greater. All around us we hear \"Merry Christmas, \" BUT often our lives are far from merry. Have you ever thought, that God is unconcerned about your cares? That's not the remedy Paul offers.\"Present your requests to God, \" he says. God knows and cares and wants to do something about our cares. So He gently invites us, His children: \"Tell me all about it. there is no fear I cannot remove. No burden I cannot help you carry. No broken heart I cannot heal. No tear so bitter I cannot wipe away. No sin, regardless how repeated, I have not forgiven.\" Paul reminds us to bring our cares to the Lord, \"With Thanksgiving.\" Complaints are out of order. Can He who gave us the Savior withhold what we need in the changing scenes of life???",
    "prayer": "Dear Lord, help me carry everything to You in prayer with the confidence that is mine in Jesus. Amen.",
    "reading": "",
    "originalcontent": "12/20/09~~~food for thought~~~RELAX ~ IN THE LORD...\n\nOur Bible Verses for Today:\nDo not be anxious about anything, but in everything, by prayer and petition,\nwith thanksgiving, present your requests to God. And the peace of God,\nwhich transcends all understanding, will guard your hearts and your minds\nin Christ Jesus. (Phil. 4:6, 7)\n\nOur Lesson for Today:\n\"Don't be anxious about anything,\" Paul said. I think we've all said, \"Easier\nsaid than done.\" Who doesn't have cares, even in this joyous season? The\nexperts tell us that during a holiday season like this, cares seem even greater...\n\nAll around us we hear \"Merry Christmas,\" BUT often our lives are far from merry.\nHave you ever thought, that God is unconcerned about your cares? That's not \nthe remedy Paul offers.\"Present your requests to God,\" he says...\n\nGod knows and cares and wants to do something about our cares. So He gently \ninvites us, His children: \"Tell me all about it. there is no fear I cannot remove. No\nburden I cannot help you carry. No broken heart I cannot heal. No tear so bitter\nI cannot wipe away. No sin, regardless how repeated, I have not forgiven.\"\n\nPaul reminds us to bring our cares to the Lord, \"With Thanksgiving.\" Complaints\nare out of order. Can He who gave us the Savior withhold what we need in the \nchanging scenes of life???\n\nPrayer Suggestion:\nDear Lord, help me carry everything to You in prayer\nwith the confidence that is mine in Jesus...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125b0cf7ba3f4989",
    "dateutc": "Sun, 20 Dec 2009 05:48:32 -0600",
    "subject": "thoughts to live by",
    "verse": "When the time had fully come, God sent His son, born of a woman, born under the law, that we might receive the full rights of sons. (Galatians 4:4, 5)",
    "reflection": "Jesus was \"born of a woman, \" ~ He was human ~ He was born a Jew ~ He was subject to God's law ~ He fulfilled it perfectly. Thus Jesus was a perfect sacrifice because, although He was fully human, He never sinned. His death brought freedom for us who were enslaved to sin so that we could be adopted into God's family. If Christ had not come, there would not be a Christian in the world. Imagine that!!!",
    "prayer": "Dear Lord, I thank You, for sending Jesus to set me free. Thank You for Your love. Amen.",
    "reading": "",
    "originalcontent": "12/21/09~~~food for thought~~~GOD IN CHRIST BECAME THE SON OF MAN \nTHAT WE MIGHT BECOME THE SONS OF GOD.\n\nOur Bible Verses for Today:\nWhen the time had fully come, God sent His son, born of a woman,\nborn under the law, that we might receive the full rights of sons. (Gal 4:4, 5)\n\nOur Lesson for Today:\nJesus was \"born of a woman,\" ~ He was human ~ He was born a Jew ~\nHe was subject to God's law ~ He fulfilled it perfectly. Thus Jesus was \na perfect sacrifice because, although He was fully human, He never \nsinned. His death brought freedom for us who were enslaved to sin so \nthat we could be adopted into God's family...\n\nIf Christ had not come, there would not be a Christian in the world.\nImagine that!!!\n\nPrayer Suggestion:\nDear Lord, I thank You, for sending Jesus to set me free.\nThank You for Your love...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125b5f8ed1ecb073",
    "dateutc": "Mon, 21 Dec 2009 05:25:03 -0600",
    "subject": "thoughts to live by",
    "verse": "The life appeared; we have seen it and testify to it, and we proclaim to you the eternal life, which was with the Father and has appeared to us. ( 1 John 1:2)",
    "reflection": "An old legend tell how at midnight on Christmas Eve all the animals pause wherever they are and kneel. In this way they honor the Son of God, who once used their manger for His cradle. As we pause to kneel this Holy Season, let us TRULY remember why. Sometime I wish I could see Jesus as John did. Then I remember that its not the physical but the spiritual closeness of Jesus that counts. Through the Word, the Holy Spirit gives me eyes to see and a heart to believe in the incarnate Word of life. With His gift of faith, I see in the manger the eternal God who came to bring me eternal life. That's why I kneel before Him.",
    "prayer": "Dear Lord, I thank You for faith's sight. Help me to kneel in humble awe before Your gift of life. (Jesus Christ). Amen.",
    "reading": "",
    "originalcontent": "12/22/09~~~food for thought~~~CHRISTMAS BEGAN IN THE HEART OF GOD. IT IS \nCOMPLETE ONLY WHEN IT REACHES THE HEART OF MAN...\n\nOur Bible Verse for Today:\nThe life appeared; we have seen it and testify to it, and \nwe proclaim to you the eternal life, which was with the \nFather and has appeared to us...( 1 Jn. 1:2)\n\nOur Lesson for Today:\nAn old legend tell how at midnight on Christmas Eve all the animals pause\nwherever they are and kneel. In this way they honor the Son of God, who \nonce used their manger for His cradle...\n\nAs we pause to kneel this Holy Season, let us TRULY remember why...\n\nSometime I wish I could see Jesus as John did. Then I remember that its\nnot the physical but the spiritual closeness of Jesus that counts...\n\nThrough the Word, the Holy Spirit gives me eyes to see and a heart to believe \nin the incarnate Word of life. With His gift of faith, I see in the manger the eternal\nGod who came to bring me eternal life. That's why I kneel before Him...\n\nPrayer Suggestion:\nDear Lord, I thank You for faith's sight. Help me to kneel\nin humble awe before Your gift of life. (Jesus Christ)...Amen.\n\nIt is Christmas in the heart that \nputs Christmas in the air...\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125bb2df64339444",
    "dateutc": "Tue, 22 Dec 2009 05:32:37 -0600",
    "subject": "thoughts to live by",
    "verse": "We proclaim to you what we have seen and heard, so that you may have fellowship with us. And our fellowship is with the Father and with His Son, Jesus Christ. (I John 1:3)",
    "reflection": "The word fellowship is a big one in the New Testament. It comes from a root meaning \"to have things in common.\" Listen to what John is telling us, He says: through the Christ Child, I can have back what Adam and Eve once had with God. They shared in all His blessings. They walked with Him in all His ways. For them life was a perpetual heaven because it was a perfect relationship with God. There is only one way back to such a blessed fellowship with the Father. Only one way for sinners like me to stand next to God. Only one way to look at Him and see Him smiling at me. Only one way to stretch out my hand and have Him fill it with blessing after blessing. Only one way for me to close my eyes for the last time and open them in heaven. Through the baby in the Bethlehem manger and the Christ on the Calvary cross! He came to earth: He took on my flesh. He became my brother, to make me His brother in God's family. He came to seek and save a lost family. He came to pay for my sins and plunged Himself into my hell so that I could again be one with my Father.",
    "prayer": "Thank You, Lord Jesus, for restoring the fellowship I now enjoy with the Father. Amen.",
    "reading": "",
    "originalcontent": "12/23/09~~~food for thought~~~CHRISTMAS AT ITS BEST MEANS THE ENTHRONEMENT\nOF JESUS CHRIST IN THE HUMAN HEART.\n\nOur Bible Verse for Today:\nWe proclaim to you what we have seen and heard, so that you may \nhave fellowship with us. And our fellowship is with the Father and\nwith His Son, Jesus Christ...(I Jn. 1:3)\n\nOur Lesson for Today:\nThe word fellowship is a big one in the New Testament. It comes from a root\nmeaning \"to have things in common.\" Listen to what John is telling us, He says:\nthrough the Christ Child, I can have back what Adam and Eve once had with God... \n\nThey shared in all His blessings. They walked with Him in all His ways. For them \nlife was a perpetual heaven because it was a perfect relationship with God... \n\nThere is only one way back to such a blessed fellowship with the Father.\nOnly one way for sinners like me to stand next to God.\nOnly one way to look at Him and see Him smiling at me.\nOnly one way to stretch out my hand and have Him fill it with blessing after blessing.\nOnly one way for me to close my eyes for the last time and open them in heaven.\nThrough the baby in the Bethlehem manger and the Christ on the Calvary cross!\n\nHe came to earth:\nHe took on my flesh.\nHe became my brother, to make me His brother in God's family.\nHe came to seek and save a lost family.\nHe came to pay for my sins and plunged Himself into my hell so that \nI could again be one with my Father...\n\nPrayer Suggestion:\nThank You, Lord Jesus, for restoring the fellowship\nI now enjoy with the Father...Amen.\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125c10f173b69b4c",
    "dateutc": "Wed, 23 Dec 2009 05:48:13 -0600",
    "subject": "thoughts to live by",
    "verse": "Today in the town of David a Savior has been born to you; He is Christ the Lord. (Luke 2:11)",
    "reflection": "Take a moment for this thought, If Jesus had never been born, there'd be no salvation. Then Adam and Eve would still be crying, not only at Eden's door but in hell. Then the thief on the cross would have no answer to his plea for just a corner in paradise. Then Paul would still be the chief of sinners. Then you and I would be along with all sinners most miserable and sure only of punishment in a never-ending hell. If Jesus had never been born, I wouldn't be going to any services this Christmas Eve. Nor tomorrow or ever, because what would I have to sing to hear about, to rejoice about? There would be no message of hope for my eager ears to hear. Its bad enough to celebrate Christmas separated from loved ones. But just think if there were no Jesus and no promise of eternal life. There's a thought to make even the angels weep.",
    "prayer": "Dear Lord, help me sing tonight, \"I am so glad when Christmas comes, the night of Jesus' birth.\" Amen.",
    "reading": "",
    "originalcontent": "12/24/09~~~food for thought~~~WHAT IF JESUS HAD NEVER BEEN BORN?\n\nOur Bible Verse for Today:\nToday in the town of David a Savior has been born to you;\nHe is Christ the Lord...(Lk. 2:11)\n\nOur Lesson for Today:\nTake a moment for this thought, If Jesus had never been born, there'd\nbe no salvation. \n\nThen Adam and Eve would still be crying, not only at Eden's door but in hell. \nThen the thief on the cross would have no answer to his plea for just a corner in paradise.\nThen Paul would still be the chief of sinners.\nThen you and I would be along with all sinners most miserable and sure only of punishment\nin a never-ending hell...\n\nIf Jesus had never been born, I wouldn't be going to any services this\nChristmas Eve. Nor tomorrow or ever, because what would I have to sing \nto hear about, to rejoice about? There would be no message of hope for \nmy eager ears to hear...\n\nIts bad enough to celebrate Christmas separated from loved ones.\nBut just think if there were no Jesus and no promise of eternal life.\nThere's a thought to make even the angels weep...\n\nPrayer Suggestion:\nDear Lord, help me sing tonight, \"I am so glad when Christmas\ncomes, the night of Jesus' birth.\" Amen.\n\nLets keep Christ alive in our Christmas celebrations!!!\n\nLet us look over our Christmas giving list. Let us be honest,\nwill the best gift we give be to Him whose birthday it is?\n\nPastor Al & Marcie Sather",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125c58a488c68faa",
    "dateutc": "Thu, 24 Dec 2009 14:18:23 -0600",
    "subject": "thoughts to live by",
    "verse": "Thanks be to God for His indescribable Gift! (II Corinthians 9:15)",
    "reflection": "Once in a while we hear about the perfect gift for someone who has everything. BUT, what about the perfect gift for someone who has nothing and needs everything? That's what God gave me at Christmas. When God put His Son into the manger, He gave me everything, I needed for salvation. He gave me His Son from heaven to wash away my sins with His precious blood. I needed peace with God, He gave me the Prince of Peace, who brought back a blessed relationship with the Father. I needed power against sin, He gave me the Mighty Lord, who defeated Satan in the wilderness and even more so on the cross. How can the devil keep sin's handcuffs on me when Christ is the key that unlocks them? We often need comfort in life's sorrows, He gave us the living Savior, who wipes away our tears. We need assurance at the time of death, He gave us the risen Savior who has already conquered death, not just for Himself but for us. I had nothing, but with the gift of the Savior, God gave me everything I needed. Thanks be to God for His indescribable gift.",
    "prayer": "Thank you, Lord, for giving me just what I needed in the Savior, Help me praise Your love forever. Amen.",
    "reading": "",
    "originalcontent": "12/25/09~~~food for thought~~~THE PREFECT GIFT...\n\nOur Bible Verse for Today:\nThanks be to God for His indescribable Gift! (II Cor. 9:15)\n\nOur Lesson for Today:\nOnce in a while we hear about the perfect gift for someone who has everything.\nBUT, what about the perfect gift for someone who has nothing and needs everything?\nThat's what God gave me at Christmas...\n\nWhen God put His Son into the manger, He gave me everything, I needed for salvation.\nHe gave me His Son from heaven to wash away my sins with His precious blood.\nI needed peace with God, He gave me the Prince of Peace, who brought back a\nblessed relationship with the Father.\n\nI needed power against sin, He gave me the Mighty Lord, who defeated Satan in the \nwilderness and even more so on the cross. How can the devil keep sin's handcuffs on\nme when Christ is the key that unlocks them?\n\nWe often need comfort in life's sorrows, He gave us the living Savior, who wipes away\nour tears. We need assurance at the time of death, He gave us the risen Savior who has\nalready conquered death, not just for Himself but for us...\n\nI had nothing, but with the gift of the Savior, God gave me everything I needed. \nThanks be to God for His indescribable gift...\n\nPrayer Suggestion:\nThank you, Lord, for giving me just what I needed\nin the Savior, Help me praise Your love forever...Amen.\n\nPs. remember your greatest Christmas cheer comes \nwhen you dispense cheer... \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. No one can come to he father except through me.\" - John: 14:6",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125ca928b74a4cf5",
    "dateutc": "Fri, 25 Dec 2009 05:46:27 -0600",
    "subject": "thoughts to live by",
    "verse": "So they hurried off and found Mary and Joseph, and the baby, who was lying in the manger. (Luke 2:16)",
    "reflection": "Shepherds came to kneel at Jesus' manger bed. These were people who held one of the more menial jobs in life hurried to worship the newborn Savior. That comforts me ~ by bring the shepherds, God is reminding us that whatever our station in life, we have a Savior. From the moment of His birth, Jesus was ready to receive all sinners. That baby was born to save me. Mary and Joseph were there at Jesus' bed. From the little Scripture records about these two, we can learn something important about our faith. They didn't hesitate but took God at His word, even when His words seemed impossible. God help me to do the same, especially with His promise of salvation. Yes Jesus was laid in a manger, never before or again will the world see a baby like Him. ~ Only He was from all eternity ~ Only His birth was foretold centuries before ~ Only He was virgin born ~ Only at His birth did angels sing ~ Only He was born to die for His fellowman ~ Only He deserves our worship.",
    "prayer": "God, help me celebrate Christmas every day. Amen.",
    "reading": "",
    "originalcontent": "12/26/09~~~food for thought~~~CELEBRATE CHRISTMAS EVERY DAY...\n\nOur Bible Verse for Today:\nSo they hurried off and found Mary and Joseph, and the baby,\nwho was lying in the manger...(Lk. 2:16)\n\nOur Lesson for Today:\nShepherds came to kneel at Jesus' manger bed. These were people\nwho held one of the more menial jobs in life hurried to worship the\nnewborn Savior. That comforts me ~ by bring the shepherds, God is \nreminding us that whatever our station in life, we have a Savior...\n\nFrom the moment of His birth, Jesus was ready to receive all sinners.\nThat baby was born to save me...\n\nMary and Joseph were there at Jesus' bed. From the little Scripture \nrecords about these two, we can learn something important about our faith.\nThey didn't hesitate but took God at His word, even when His words seemed \nimpossible. God help me to do the same, especially with His promise of\nsalvation..\n\nYes Jesus was laid in a manger, never before or again will the world see a\nbaby like Him. ~ Only He was from all eternity ~ Only His birth was foretold\ncenturies before ~ Only He was virgin born ~ Only at His birth did angels sing ~ \nOnly He was born to die for His fellowman ~ Only He deserves our worship...\n\nPrayer Suggestion:\nGod, help me celebrate Christmas every day...Amen.\n\nPs.\nSince God appeared in a manger, should we be \nsurprised to find Him everywhere?\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. No one can come to the father except through me.\" - John: 14:6",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125cf915393b2aea",
    "dateutc": "Sat, 26 Dec 2009 05:30:47 -0600",
    "subject": "thoughts to live by",
    "verse": "and He will be called Wonderful Counselor. (Isaiah 9:6)",
    "reflection": "In Isaiah's day a counselor was one who stood at your side to offer good advice in all matters. Isn't that a good name for the babe of Bethlehem? Wouldn't we even say that the Christ of Christmas is a Counselor more wonderful than any other??? He needs no teachers but is Truth Himself. He needs no counselors but is the Counselor above every counselor. His advice is never lacking and is always correct. To wayward ones He says, \"Your sins are forgiven.\" To weary ones He says, \"Cast all your cares on Me because I care for you.\" To worried ones He says, \"Will not My heavenly Father much more care for you?\" To weeping ones He says, \"Let not your heart be troubled, believe in Me.\" This Jesus has experienced my wrestling against sin and Satan ~ my pains and my death. Even something I shall never know, the agonies of hell. That's why the name Wonderful Counselor fits Him so well. He not only advises; He does. He did His work on the cross and now stands ready to help in every step of life as, my Wonderful Counselor.",
    "prayer": "Dear Lord and Savior, be with me as my Wonderful Counselor, to guide me in life and in death. Amen.",
    "reading": "",
    "originalcontent": "12/27/09~~~food for thought~~~BEYOND WONDERFUL\n\nOur Bible Verse for Today:\nand He will be called Wonderful Counselor...(Isa. 9:6)\n\nOur Lesson for Today:\nIn Isaiah's day a counselor was one who stood at your side to offer good advice in all matters.\nIsn't that a good name for the babe of Bethlehem? Wouldn't we even say that the Christ of\nChristmas is a Counselor more wonderful than any other???\n\nHe needs no teachers but is Truth Himself.\nHe needs no counselors but is the Counselor above every counselor.\nHis advice is never lacking and is always correct.\n\nTo wayward ones He says, \"Your sins are forgiven.\"\nTo weary ones He says, \"Cast all your cares on Me because I care for you.\"\nTo worried ones He says, \"Will not My heavenly Father much more care for you?\"\nTo weeping ones He says, \"Let not your heart be troubled, believe in Me.\"\n\nThis Jesus has experienced my wrestling against sin and Satan ~ my pains and my death.\nEven something I shall never know, the agonies of hell.\nThat's why the name Wonderful Counselor fits Him so well. He not only advises; He does.\nHe did His work on the cross and now stands ready to help in every step of life as,\nmy Wonderful Counselor...\n\nPrayer Suggestion:\nDear Lord and Savior, be with me as my Wonderful Counselor,\nto guide me in life and in death...Amen.\n\n[thanks be unto God for His unspeakable gift!] (II Cor. 9:15)\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \n\nNo one can come to the Father except through me.\" - John: 14:6",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125d4dc8d380ab9d",
    "dateutc": "Sun, 27 Dec 2009 04:43:34 -0600",
    "subject": "thoughts to live by",
    "verse": "And He will be called. Mighty God. (Isaiah 9:6b)",
    "reflection": "When we look at the baby in the manger, one may fail to see Him as the might God. One may say, \"that's God who is to be my Rock and my fortress?\" \"Why, a rock could so easily crush him in his helplessness.\" One may say, \"That's God who is my shield and my defender?\" \"He himself must be defended from harm and shielded from the cold by His mother's arms.\" I would answer, \"Yes my friend, that baby will become the Horn of our salvation, the Mighty God who with His power will toss our enemies of sin and death into the air.\" Let's see Him for who He truly is. That baby is the Mighty God who calms storms and heals men. Even more do we see His might when with His powerful Word He sends the devil packing in the wilderness. We also see His might when He shouts of sin's payment on the cross, \"It is finished.\" Yes, we see His might even more when He leaves His tomb empty and assures us, \"Because I live, you also will live.\" And yes even more do we see His might when He arms us for our daily battle against Satan by giving us the \"Sword of the Spirit which is the Word of God.\" Yes, when Jesus, our Savior, stands at our side as the Mighty God, victory is always within reach. With Him we can face any foe.",
    "prayer": "Dear Lord, be with me as my Mighty God so that I may have power against all my enemies. Amen.",
    "reading": "",
    "originalcontent": "12/28/09~~~food for thought~~~TRULY SEEING HIM...\n\nOur Bible Verse for Today:\nAnd He will be called...Mighty God. (Isa. 9:6b)\n\nOur Lesson for Today:\nWhen we look at the baby in the manger, one may fail to see Him as the might God...\nOne may say, \"that's God who is to be my Rock and my fortress?\"\n\"Why, a rock could so easily crush him in his helplessness.\"\nOne may say, \"That's God who is my shield and my defender?\"\n\"He himself must be defended from harm and shielded from the cold by His mother's arms.\"\n\nI would answer, \"Yes my friend, that baby will become the Horn of our salvation,\nthe Mighty God who with His power will toss our enemies of sin and death into the air.\"\nLet's see Him for who He truly is...\n\nThat baby is the Mighty God who calms storms and heals men.\nEven more do we see His might when with His powerful Word He sends the devil packing\nin the wilderness. We also see His might when He shouts of sin's payment on the cross,\n\"It is finished.\"\n\nYes, we see His might even more when He leaves His tomb empty and assures us,\n\"Because I live, you also will live.\" And yes even more do we see His might when He arms us \nfor our daily battle against Satan by giving us the \"Sword of the Spirit which is the Word of God.\"\n\nYes, when Jesus, our Savior, stands at our side as the Mighty God, victory is always within reach.\nWith Him we can face any foe...\n\nPrayer Suggestion:\nDear Lord, be with me as my Mighty God so that I\nmay have power against all my enemies...Amen.\n\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. No one can come to the father except through me.\" - John: 14:6",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125d9fb664270eed",
    "dateutc": "Mon, 28 Dec 2009 05:30:32 -0600",
    "subject": "thoughts to live by",
    "verse": "And He will be called. Everlasting Father. (Isaiah 9:6c)",
    "reflection": "Everlasting Father, is another name Isaiah gives the Christ Child. What tenderness, love, and comfort are in His name. To His followers the babe of Bethlehem is like a father because of what He does. He doesn't leave His people to fend for themselves. Instead, He does perfectly for them what an earthly father can only try to do for his children. An earthly father tries to provide what he thinks is best for his children. The Savior always provides what He knows is best. He's my Everlasting Father. Always He walks with me ~ Always His love forgives me ~ Always His power protects me ~ He'll be there to lead me even through the valley of the shadow to His heaven. My earthly father meant much to me. Jesus, my Everlasting Father, means so much more.",
    "prayer": "Dear Lord and Savior, take my hand and lead me as my Everlasting Father to Your heavenly home. Amen.",
    "reading": "",
    "originalcontent": "12/29/09~~~food for thought~~~THE CARE OF A LOVING FATHER...\n\nOur Bible Verse for Today:\nAnd He will be called.....Everlasting Father. (Isa. 9:6c)\n\nOur Lesson for Today:\nEverlasting Father, is another name Isaiah gives the Christ Child.\nWhat tenderness, love, and comfort are in His name...\n\nTo His followers the babe of Bethlehem is like a father because of what He does.\nHe doesn't leave His people to fend for themselves. Instead, He does perfectly for \nthem what an earthly father can only try to do for his children...\n\nAn earthly father tries to provide what he thinks is best for his children. The Savior\nalways provides what He knows is best...\n\nHe's my Everlasting Father. Always He walks with me ~ Always His love forgives me ~\nAlways His power protects me ~ He'll be there to lead me even through the valley of \nthe shadow to His heaven. My earthly father meant much to me. \nJesus, my Everlasting Father, means so much more...\n\nPrayer Suggestion:\nDear Lord and Savior, take my hand and lead me as my \nEverlasting Father to Your heavenly home...Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. No one can come to the father except through me.\" - John: 14:6",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125df010225deabe",
    "dateutc": "Tue, 29 Dec 2009 05:10:45 -0600",
    "subject": "thoughts to live by",
    "verse": "And He will be called ~ Prince of peace. (Isaiah 9:6f)",
    "reflection": "Wouldn't it be great if one morning when we turned on the TV that the headlines were, \"No War Anywhere in the World Today\"? When Isaiah calls the Christ Child the \"Prince of Peace.\" he has more in mind than world peace ~ He means more than the peace that would result if no nation anywhere had any nuclear weapons of chemical bombs. If every one of us choked off his selfishness and loved his neighbor as himself ~ if everyone practiced the Golden Rule, doing unto others as he wanted them to do to him. Such earthly peace would come about more if more people in this world were filled with Jesus' real peace. The heavenly Prince of Peace came to bring the peace that results when the war between God and man, cause by sin, is over. He came to prepare the peace that floods the heart when man knows God is his dear friend, not his dreaded Foe. He came to make possible the peace that assures the dying that heaven is their beautiful home, that their inevitable destination is not hell. Yes I agree Jesus' peace surpasses all understanding ~ It enables me to live in my tense world ~ It sustains me in moments of sorrow ~ It equips me to face eternity unafraid ~ Yes I still need outward peace on this earth, but even more soI need the kind the Christ Child prepared with His manger and cross.",
    "prayer": "Dear Lord, fill my heart with the peace that comes only through your payment for my sins. Amen",
    "reading": "",
    "originalcontent": "12/30/09~~~food for thought~~~YET ANOTHER NAME OF LOVE\n\nOur Bible Verse for Today:\nAnd He will be called ~ Prince of peace...(Isa. 9:6f)\n\nOur Lesson for Today:\nWouldn't it be great if one morning when we turned on the TV that the headlines\nwere, \"No War Anywhere in the World Today\"?\n\nWhen Isaiah calls the Christ Child the \"Prince of Peace.\" he has more in mind than\nworld peace ~ He means more than the peace that would result if no nation anywhere\nhad any nuclear weapons of chemical bombs...\n\nIf every one of us choked off his selfishness and loved his neighbor as himself ~ if\neveryone practiced the Golden Rule, doing unto others as he wanted them to do to him...\nSuch earthly peace would come about more if more people in this world were filled\nwith Jesus' real peace. The heavenly Prince of Peace came to bring the peace that\nresults when the war between God and man, cause by sin, is over...\n\nHe came to prepare the peace that floods the heart when man knows God is his dear\nfriend, not his dreaded Foe. He came to make possible the peace that assures the dying \nthat heaven is their beautiful home, that their inevitable destination is not hell...\n\nYes I agree Jesus' peace surpasses all understanding ~ It enables me to live in my tense\nworld ~ It sustains me in moments of sorrow ~ It equips me to face eternity unafraid ~ Yes\nI still need outward peace on this earth, but even more soI need the kind the Christ Child \nprepared with His manger and cross...\n\nPrayer Suggestion:\nDear Lord, fill my heart with the peace that comes\nonly through your payment for my sins...Amen \n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. No one can come to the father except through me.\" - John: 14:6",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125e4597348ab2df",
    "dateutc": "Wed, 30 Dec 2009 05:00:32 -0600",
    "subject": "thoughts to live by",
    "verse": "You know with all your heart and soul that not one of the good promises the Lord your God gave you has failed. Every promise has been fulfilled. (Jos. 23:14)",
    "reflection": "What do you see when you look back at the highway of this past year? You know what I see? I see so many of my thoughts, words and deeds lying in the ditch like so much litter. How can I pick back up the trash of my words with which I've hurt people, not to mention my Savior? ~ How can I pay the fine for littering the road of life with my sinful words and deeds? Oh how I've blown another year. From the look back, I can only look up. ~ What do I see when I raise faith's eyes to Jesus, who is the same yesterday, today, and forever? ~ Wasn't He there each time I came with the penitent plea, \"God be merciful to me a sinner\"? Wasn't He there in His Word and Holy Supper to assure me: \"Your sins are forgiven. Go in peace\"? ~ Isn't He here today at the end of another year too one last time repeat His sweet promises to me? ~ Hasn't He kept His promises also for the lesser needs of my body? ~ Wont He continue to make all things work together for my good? That's right ~ not one of His good promises has failed. ~ That's why I comfortably close out the old year and confidently enter the new one.",
    "prayer": "Dear Lord, thanks for all Your mercies this past year. Please walk with me into the new one. Amen.",
    "reading": "",
    "originalcontent": "12/31/09~~~food for thought~~~GOD'S MERCIES ARE AS OLD AS ETERNITY\nAND YET THEY ARE NEW EVERY MORNING.\n\nOur Bible Verse for Today:\nYou know with all your heart and soul that not one of the good promises the\nLord your God gave you has failed. Every promise has been fulfilled...(Jos. 23:14)\n\nOur Lesson for Today:\nWhat do you see when you look back at the highway of this past year?\nYou know what I see? I see so many of my thoughts, words and deeds\nlying in the ditch like so much litter...\n\nHow can I pick back up the trash of my words with which I've hurt people,\nnot to mention my Savior? ~ How can I pay the fine for littering the road of \nlife with my sinful words and deeds? Oh how I've blown another year...\n\nFrom the look back, I can only look up. ~ What do I see when I raise faith's \neyes to Jesus, who is the same yesterday, today, and forever? ~ Wasn't He\nthere each time I came with the penitent plea, \"God be merciful to me a sinner\"?\nWasn't He there in His Word and Holy Supper to assure me: \"Your sins are \nforgiven. Go in peace\"? ~ Isn't He here today at the end of another year too one\nlast time repeat His sweet promises to me? ~ Hasn't He kept His promises\nalso for the lesser needs of my body? ~ Wont He continue to make all things\nwork together for my good?\n\nThat's right ~ not one of His good promises has failed. ~ That's why I comfortably\nclose out the old year and confidently enter the new one...\n\nPrayer Suggestion:\nDear Lord, thanks for all Your mercies this past year.\nPlease walk with me into the new one...Amen.\n\nREMEMBER: New Year's Day is but a milepost on the way to eternity!\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. No one can come to the father except through me.\" - John: 14:6",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  },
  {
    "messageid": "125e96eaafb84993",
    "dateutc": "Thu, 31 Dec 2009 05:29:24 -0600",
    "subject": "thoughts to live by",
    "verse": "Jesus is the same yesterday and today and forever. (Hebrews 13:8)",
    "reflection": "More of the same ~ that's what life seems to be for many of us. Oh yes, some may have new experiences and excitement this new year, but life for many of us will be one day strung behind the other with the same tasks hovering over us and the same troubles settling on our shoulders. It doesn't make much difference what number we write for the year. But let us thank God one thing never changes: Would we want a Lord who changes His mind and issues a recall for promises He made yesterday? Would we want, a Lord who forgets His full payment for all our sins and now demands that we cover sin's debt? Would we want, a Lord who closes the door to heaven on a whim that He once opened with His resurrection? More of the same! That's what we need and that's what we have in our Savior Jesus, who is the same yesterday and today and forever.",
    "prayer": "Dear Lord Jesus, fill our lives each day of this new year with more of Your unchanging love. Amen.",
    "reading": "",
    "originalcontent": "01/01/10~~~food for thought~~~MORE OF THE SAME\n\nOur Bible Verse for Today:\nJesus is the same yesterday and today and forever...(Heb. 13:8)\n\nOur Lesson for Today:\nMore of the same ~ that's what life seems to be for many of us.\nOh yes, some may have new experiences and excitement this new year, but\nlife for many of us will be one day strung behind the other with the same tasks\nhovering over us and the same troubles settling on our shoulders. It doesn't\nmake much difference what number we write for the year...\n\nBut let us thank God one thing never changes:\nWould we want a Lord who changes His mind and issues a recall for promises He made yesterday?\nWould we want, a Lord who forgets His full payment for all our sins and now demands that we cover sin's debt?\nWould we want, a Lord who closes the door to heaven on a whim that He once opened with His resurrection?\n\nMore of the same! That's what we need and that's what we have in our Savior Jesus, \nwho is the same yesterday and today and forever...\n\nPrayer Suggestion:\nDear Lord Jesus, fill our lives each day of this new year\nwith more of Your unchanging love...Amen. \n\nHave nothing to do with that which will not bear the test of time.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. No one can come to the father except through me.\" - John: 14:6",
    "foundverse": true,
    "foundreflection": true,
    "foundprayer": true,
    "foundreading": false
  }
]