[
  {
    "message_id": "12ad1e11afaef255",
    "date_utc": "Wed, 1 Sep 2010 06:08:20 -0500",
    "subject": "thoughts to live by",
    "verse": "Whoever believes in Me, as the Scripture has said, streams of living water will flow from within him. (John 7:37)",
    "reflection": "Jesus did not say, \"He who believes in Me will realize all the blessings of the fullness of God\" but, in essence, \"He who believes in Me will have everything he receives escape out of him.\" Our Lord's teaching was always anti-self-realization. His purpose is not the development of a person ~ His purpose is to make a person exactly like Himself, and the Son of God is characterized by self-expenditure. Remember, if we believe in Jesus, it is not what we gain but what He pours through us that really counts~ ~ ~ Now is the time to stop seeking our own satisfaction, and to pour out our lives before Him. Our Lord is asking who of us will do it for Him.",
    "prayer": "Dear Lord, take my life and let it be ~ consecrated Lord to Thee. Amen.",
    "reading": "",
    "original_content": "09/02/2010~~~food for thought~~~A LIFE OF PURE AND HOLY SACRIFICE\n\nOur Bible Verse for Today:\nWhoever believes in Me, as the Scripture has said, streams of living water\nwill flow from within him. (Jn. 7:37)\n\nOur Lesson for Today:\nJesus did not say, \"He who believes in Me will realize all the blessings\nof the fullness of God,\" but, in essence, \"He who believes in Me will\nhave everything he receives escape out of him.\"\n\nOur Lord's teaching was always anti-self-realization. His purpose is \nnot the development of a person ~ His purpose is to make a person\nexactly like Himself, and the Son of God is characterized by self-expenditure.\n\nRemember, if we believe in Jesus, it is not what we gain but what He\npours through us that really counts~ ~ ~ Now is the time to stop seeking\nour own satisfaction, and to pour out our lives before Him. Our Lord is\nasking who of us will do it for Him.\n\nPrayer Suggestion:\nDear Lord, take my life and let it be ~ \nconsecrated Lord to Thee. Amen.\n\nPastor Alvin & Marcie Sather\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12ad6ed9f8c54bfb",
    "date_utc": "Thu, 2 Sep 2010 06:41:41 -0500",
    "subject": "thoughts to live by",
    "verse": "The three mighty men broke through the Philistine lines, drew water from the well near the gate of Bethlehem and carried it back to David. But he refused to drink it; instead, he poured it out before the Lord. (II Samuel 23:16)",
    "reflection": "What has been like \"water from the well of Bethlehem\" to you recently ~ love ~ friendship ~ or maybe some spiritual blessing (23:16)? Have you taken whatever it may be, even at the risk of damaging your own soul, simply to satisfy yourself? ~~~ If you have, then you cannot pour it out \"to the Lord. \" You can never set apart for God something that you desire for yourself to achieve your own satisfaction. ~ If you try to satisfy yourself with a blessing from God, it will corrupt you. You must sacrifice it, pouring it out to God even if your common sense says, 'its a waste. ' Do not hoard God's blessings.",
    "prayer": "Dear Lord, Give me the wisdom to do what is right in Your eyes. Amen.",
    "reading": "",
    "original_content": "09/03/2010~~~food for thought~~~SHARING GOD'S BLESSINGS\n\nOur Bible Verse for Today:\nThe three mighty men broke through the Philistine lines, \ndrew water from the well near the gate of Bethlehem and \ncarried it back to David. But he refused to drink it; instead, \nhe poured it out before the Lord. (II Sam. 23:16)\n\nOur Lesson for Today:\nWhat has been like \"water from the well of Bethlehem\" to you recently ~\nlove ~ friendship ~ or maybe some spiritual blessing (23:16)?\n\nHave you taken whatever it may be, even at the risk of damaging your \nown soul, simply to satisfy yourself? ~~~ If you have, then you cannot \npour it out \"to the Lord.\"\n\nYou can never set apart for God something that you desire for yourself\nto achieve your own satisfaction. ~ If you try to satisfy yourself with a \nblessing from God, it will corrupt you. You must sacrifice it, pouring it \nout to God even if your common sense says, 'its a waste.'\n\nDo not hoard God's blessings...\n\nPrayer Suggestion:\nDear Lord, Give me the wisdom to do what is right in Your eyes...Amen.\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12adc40dd2f85016",
    "date_utc": "Fri, 3 Sep 2010 05:49:44 -0500",
    "subject": "thoughts to live by",
    "verse": "(Jesus prays for His disciples) \"I have told these men about You. They were in the world, but then You gave them to Me. Actually they were always Yours, and You gave them to Me: and they have kept Your Word. \" (John 17:6)",
    "reflection": "In Luke 14:26 Jesus said: \"If anyone comes to Me and does not hate his father. and mother, wife and children, brothers and sisters, yes, and his own life also, he cannot be My disciple. \" Jesus was not saying that this person cannot be good and upright, but that he cannot be someone over whom Jesus can write the word Mine. If we are not careful anyone of these relationships that are mentioned in (Luke 14:26) can compete with our relationship with Him. Jesus wants to be first in our lives ~ That means He wants us to \"Love less\" those mentioned in our worldly relationships and love Him more, that is what makes us truly His.",
    "prayer": "Dear Lord, help me each and everyday to put You first and worldly relationships second. Amen",
    "reading": "",
    "original_content": "09/04/2010~~~food for thought~~~HIS!\n\nOur Bible Verse for Today:\n(Jesus prays for His disciples)\n\"I have told these men about You. They were in the world, but then\nYou gave them to Me. Actually they were always Yours, and You\ngave them to Me: and they have kept Your Word.\" (Jn. 17:6)\n\nOur Lesson for Today:\nIn Lk. 14:26 Jesus said: \"If anyone comes to Me and does not hate his \nfather. and mother, wife and children, brothers and sisters, yes, and his \nown life also, he cannot be My disciple.\"\n\nJesus was not saying that this person cannot be good and upright, but that\nhe cannot be someone over whom Jesus can write the word Mine. If we are\nnot careful anyone of these relationships that are mentioned in (Lk. 14:26) can \ncompete with our relationship with Him. \n\nJesus wants to be first in our lives ~ That means He wants us to \"Love less\"\nthose mentioned in our worldly relationships and love Him more, that is what\nmakes us truly His...\n\nPrayer Suggestion:\nDear Lord, help me each and everyday to put\nYou first and worldly relationships second...Amen \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12ae11e2a314dc21",
    "date_utc": "Sat, 4 Sep 2010 06:46:28 -0500",
    "subject": "thoughts to live by",
    "verse": "Then Jesus told them, \"My soul is overwhelmed with sorrow to the point of death. Stay here and keep watch with Me.\" (John 12:27)",
    "reflection": "We see here that Jesus was in great anguish over His approaching physical pain, separation from the Father, and death for the sins of the whole world. The divine course was set, but He, in His human nature, still struggled (Hebrews 5:7-9). Because of the anguish Jesus experienced, He can relate to our suffering. Jesus' strength to obey came from His relationship with God the Father, who is also the source of our strength (John 17:11, 15-16, 21, 26).",
    "prayer": "Dear Lord, I long for a closer relationship with You, so that I can stand against the powers of this world. Amen",
    "reading": "",
    "original_content": "09/05/2010~~~food for thought~~~WATCHING WITH JESUS\n\nOur Bible Verse for Today:\nThen Jesus told them, \"My soul is overwhelmed with sorrow to the point\nof death. Stay here and keep watch with Me.\"\n\nOur Lesson for Today:\nWe see here that Jesus was in great anguish over His approaching physical\npain, separation from the Father, and death for the sins of the whole world.\nThe divine course was set, but He, in His human nature, still struggled (Heb. 5:7-9).\n\nBecause of the anguish Jesus experienced, He can relate to our suffering.\nJesus' strength to obey came from His relationship with God the Father, who\nis also the source of our strength (Jn. 17:11, 15-16, 21, 26).\n\nPrayer Suggestion:\nDear Lord, I long for a closer relationship with You,\nso that I can stand against the powers of this world...Amen\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12ae6879f754274c",
    "date_utc": "Sun, 5 Sep 2010 04:44:28 -0500",
    "subject": "thoughts to live by",
    "verse": "\"He who believes in Me. out of his heart will flow rivers of living water. \" (John 7:38)",
    "reflection": "Jesus used the term living water in 4:10 to indicate eternal life. here He uses the term to refer to the Holy Spirit. ~ The two go together. Whenever the Holy Spirit is accepted, He brings eternal life. Jesus teaches more about the Holy Spirit in chapters 14-16. The Holy Spirit empowered Jesus' followers at Pentecost (Acts 2) and has since been available to all who believe in Jesus Christ.",
    "prayer": "Dear Lord, help me to be ever sensitive to Your Holy Spirit's work, so that my witness will flow according to You will. Amen.",
    "reading": "",
    "original_content": "09/06/2010~~~food for thought~~~FAR REACHING RIVERS OF LIFE\n\nOur Bible Verse for Today:\n\"He who believes in Me. out of his heart will flow\nrivers of living water.\" (Jn. 7:38)\n\nOur Lesson for Today:\nJesus used the term living water in 4:10 to indicate eternal life.\nhere He uses the term to refer to the Holy Spirit. ~ The two go\ntogether. Whenever the Holy Spirit is accepted, He brings eternal life.\n\nJesus teaches more about the Holy Spirit in chapters 14-16.\nThe Holy Spirit empowered Jesus' followers at Pentecost (Acts 2) and \nhas since been available to all who believe in Jesus Christ...\n\nSuggested Prayer:\nDear Lord, help me to be ever sensitive to Your Holy Spirit's\nwork, so that my witness will flow according to You will...Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12aeb94b42a30ddf",
    "date_utc": "Mon, 6 Sep 2010 06:31:41 -0500",
    "subject": "thoughts to live by",
    "verse": "\"The water I give him will become in him a spring of water welling up to eternal life. \" (John 4:14b)",
    "reflection": "The picture our Lord described here is not that of a simple stream of water, but an overflowing fountain. Continue to \"be filled\" (Ephesians 5:18) and the sweetness of your vital relationship to Jesus will flow as generously out of you as it has been given to you. If you find that His life is not spring up as it should, you are to blame ~ something is obstructing the flow. Was Jesus saying to stay focused on the Source so that you may be blessed personally? ? ? No, you are to focus on the Source so that out of you \"will flow rivers of living water\" ~ irrepressible life (John 7:38). We are to be fountains through which Jesus can flow as \"rivers of living water\" in blessing to everyone. Have you become like the Dead Sea, always receiving but never giving, because your relationship is not right with the Lord Jesus? Then here is a,",
    "prayer": "Dear Lord, instill a new heart within me today so that my relationship with You will be renewed andso that \"rivers of living water\" may flow out of me. Amen.",
    "reading": "",
    "original_content": "09/07/2010~~~food for thought~~~A FOUNTAIN OF BLESSING\n\nOur Bible Verse for Today:\n\"The water I give him will become in him a spring of water\nwelling up to eternal life.\" (Jn. 4:14b)\n\nOur Lesson for Today:\nThe picture our Lord described here is not that of a simple stream of water,\nbut an overflowing fountain. Continue to \"be filled\" (Eph. 5:18) and the sweetness\nof your vital relationship to Jesus will flow as generously out of you as it has\nbeen given to you.\n\nIf you find that His life is not spring up as it should, you are to blame ~ something\nis obstructing the flow. Was Jesus saying to stay focused on the Source so that\nyou may be blessed personally? ? ? No, you are to focus on the Source so that\nout of you \"will flow rivers of living water\" ~ irrepressible life (Jn. 7:38).\n\nWe are to be fountains through which Jesus can flow as \"rivers of living water\"\nin blessing to everyone. Have you become like the Dead Sea, always receiving\nbut never giving, because your relationship is not right with the Lord Jesus?\nThen here is a,\n\nPrayer Suggestion:\nDear Lord, instill a new heart within me today so that\nmy relationship with You will be renewed andso that \n\"rivers of living water\" may flow out of me.Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12af0a4434730cb6",
    "date_utc": "Tue, 7 Sep 2010 06:08:23 -0500",
    "subject": "thoughts to live by",
    "verse": "We demolish arguments and every pretension that sets itself up against the knowledge of God, and we take captive every thought to make it obedient to Christ. (II Corinthians 10:5)",
    "reflection": "We, like Paul, are merely weak humans, but we don't need to use human plans and methods to win our battles. God's mighty weapons are available to us as we fight against the Devil's \"strongholds.\" A Christian must choose whose methods to use, God's or the worlds. Paul's assures us that God's mighty weapons ~ prayer, faith, hope, love, God's Word, the Holy Spirit, are powerful and effective (see Ephesians 6:13-18). These weapons can break down the proud human arguments against God and the walls that Satan builds to keep people from finding God. When dealing with people's proud arguments that keep them from a relationship with God, we may be tempted to use our own methods. but nothing can break down these barriers like God's weapons.",
    "prayer": "Dear Lord, Help me to remember, that the best way to win my battles is by using Your weapons. Amen.",
    "reading": "",
    "original_content": "09/08/2010~~~food for thought~~~\n\nOur Bible verse for Today: (Here we have Paul's defense of his ministry.)\nWe demolish arguments and every pretension that sets itself up\nagainst the knowledge of God, and we take captive every thought\nto make it obedient to Christ. (II Cor. 10:5)\n\nOur Lesson for Today:\nWe, like Paul, are merely weak humans, but we don't need to use human \nplans and methods to win our battles. God's mighty weapons are available \nto us as we fight against the Devil's \"strongholds.\"\n\nA Christian must choose whose methods to use, God's or the worlds.\nPaul's assures us that God's mighty weapons ~ prayer, faith, hope, love,\nGod's Word, the Holy Spirit, are powerful and effective (see Eph. 6:13-18).\n\nThese weapons can break down the proud human arguments against God\nand the walls that Satan builds to keep people from finding God. When \ndealing with people's proud arguments that keep them from a relationship\nwith God, we may be tempted to use our own methods. but nothing can\nbreak down these barriers like God's weapons. \n\nPrayer Suggestion:\nDear Lord, Help me to remember, that the best way to win\nmy battles is by using Your weapons. Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12af5ca50767993c",
    "date_utc": "Wed, 8 Sep 2010 05:34:39 -0500",
    "subject": "thoughts to live by",
    "verse": "The weapons we fight with are not the weapons of this world. On the contrary, they have divine power to demolish strong holds. (II Corinthians 10:4)",
    "reflection": "In the Christian life we battle against the powerful evil forces of fallen angels headed by Satan. To withstand their attacks, we must depend on God's strength and use every piece of His armor. (Ephesians 6:10-17) Now Paul is not giving counsel only to the church, but also to individuals within the church. The whole body needs to be armed. It is only by the Holy Spirit's power that we can be victorious.",
    "prayer": "Dear Lord, You know that every day Satan wages new wars in my life, without your Spirit's power I can do nothing to stand against him. So here I am again today begging for Your strength to be victorious. Amen.",
    "reading": "",
    "original_content": "09/09/2010~~~food for thought~~~\n\nOur Bible Verse for Today:\nThe weapons we fight with are not the weapons of this world. \nOn the contrary, they have divine power to demolish strong holds.\n(II Cor. 10:4)\n\nOur Lesson for Today:\nIn the Christian life we battle against the powerful evil forces of fallen angels\nheaded by Satan. To withstand their attacks, we must depend on God's\nstrength and use every piece of His armor. (Eph. 6:10-17)\n\nNow Paul is not giving counsel only to the church, but also to individuals within\nthe church. The whole body needs to be armed. It is only by the Holy Spirit's\npower that we can be victorious.\n\nPrayer Suggestion:\nDear Lord, You know that every day Satan wages new wars in my\nlife, without your Spirit's power I can do nothing to stand against him.\nSo here I am again today begging for Your strength to be victorious. Amen.\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12afaf531f3d60cd",
    "date_utc": "Thu, 9 Sep 2010 05:13:59 -0500",
    "subject": "thoughts to live by",
    "verse": "\"How do you know about me?\" Nathaniel asked. Jesus replied, \"I could see you under the fig tree before Philip found you. \" (John 1:48)",
    "reflection": "Yes Jesus knew about Nathaniel before the two ever met. Jesus also knows what we are like. An honest person will feel comfortable with the thought that Jesus knows him or her through and through. A dishonest person will feel uncomfortable. You can not pretend to be something you're not. God knows the real you and wants you to follow Him.",
    "prayer": "Dear Lord, I thank You for the invitation to follow You even though you know me through and through. Please forgive me of the sins I have committed, know and unknown. Amen.",
    "reading": "",
    "original_content": "09/10/2010~~~food for thought~~~YOU CAN NOT HIDE WHAT YOU ARE\n\nOur Bible Verse for Today:\n\"How do you know about me?\" Nathanael asked.\nJesus replied, \"I could see you under the fig tree\nbefore Philip found you.\" (Jn. 1:48)\n\nOur Lesson for Today:\nYes Jesus knew about Nathanael before the two ever met.\nJesus also knows what we are like. \n\nAn honest person will feel comfortable with the thought that \nJesus knows him or her through and through. A dishonest \nperson will feel uncomfortable.\n\nYou can not pretend to be something you're not. God knows \nthe real you and wants you to follow Him.\n\nPrayer Suggestion:\nDear Lord, I thank You for the invitation to follow You even \nthough you know me through and through. Please forgive \nme of the sins I have committed, know and unknown. Amen.\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b000847bb7d33a",
    "date_utc": "Fri, 10 Sep 2010 05:37:12 -0500",
    "subject": "thoughts to live by",
    "verse": "Now that I, your Lord and Teacher, have washed your feet, you also should wash one another's feet. (John 13:14)",
    "reflection": "Jesus said, \"I have given you an example, that you should do as I have done to you\" (John 13:15). Take notice of the kind of people that God brings around you, and you will be humiliated once you realize that this is actually His way of revealing to you the kind of person you have been to Him. Now He says we should exhibit to those around us exactly what He has exhibited to us. Do you find yourself responding by saying, \"Oh, I will do all that once I'm out on the mission field\"? ~ Talking in this way is like trying to produce the weapons of war while in the trenches of the battlefield ~ you will be killed while trying to do it.",
    "prayer": "Dear Lord, Help me to minister in my everyday opportunities, so that I will be more prepared when a real crisis comes. Amen.",
    "reading": "",
    "original_content": "09/11/2010~~~food for thought~~~MINISTERING IN EVERYDAY OPPORTUNITIES\n\nOur Bible Verse for Today:\nNow that I, your Lord and Teacher, have washed your feet,\nyou also should wash one another's feet. (Jn. 13:14)\n\nOur Lesson for Today:\nJesus said, \"I have given you an example, that you should do as I have\ndone to you\" (Jn. 13:15).\n\nTake notice of the kind of people that God brings around you, and you will\nbe humiliated once you realize that this is actually His way of revealing to you\nthe kind of person you have been to Him. Now He says we should exhibit to \nthose around us exactly what He has exhibited to us.\n\nDo you find yourself responding by saying, \"Oh, I will do all that once I'm\nout on the mission field\"? ~ Talking in this way is like trying to produce the\nweapons of war while in the trenches of the battlefield ~ you will be killed \nwhile trying to do it.\n\nPrayer Suggestion:\nDear Lord, Help me to minister in my everyday opportunities,\nso that I will be more prepared when a real crisis comes. Amen. \n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b0536d0dace88d",
    "date_utc": "Sat, 11 Sep 2010 04:46:42 -0500",
    "subject": "thoughts to live by",
    "verse": "(The mother of Zebedee's son's came to Jesus with a request) \"Grant that one of these two sons of mine may sit at Your right and the other at the left in Your Kingdom. \" ~~~ \"You don't know what you are asking, \" Jesus said to them. \"Can you drink the cup, I am going to drink?\" (Matthew 20:21, 22)",
    "reflection": "There are times in our spiritual life when there is confusion, and the way out of it is not simply to say that we should not be confused. ~ It is not a matter of right and wrong, but a matter of God taking us through a way that we temporarily do not understand. ~ But it is only by going through the spiritual confusion that we will come to the understanding of what God wants for us. \"When the Son of Man comes will He really find faith on the earth?\" (Luke 18:8) Will He find the kind of faith that counts on Him in spite of the confusion? Stand firm in faith, believing that what Jesus said is true, although in the meantime you do not understand what God is doing. He has bigger issues at stake than the particular things you are asking Him right now.",
    "prayer": "Dear Lord, I don't always understand why I have to go through certain trials, so I ask for the faith to stand firm while You work it out. Amen.",
    "reading": "",
    "original_content": "09/12/2010~~~food for thought~~~SPIRITUAL CONFUSION\n\nOur Bible Verse for Today:\n(The mother of Zebedee's son's came to Jesus with a request)\n\"Grant that one of these two sons of mine may sit at Your right\nand the other at the left in Your Kingdom.\" ~~~\n\"You don't know what you are asking,\" Jesus said to them.\n\"Can you drink the cup, I am going to drink?\" (Mt. 20:21, 22)\n\nOur Lesson for Today:\nThere are times in our spiritual life when there is confusion, and the way out \nof it is not simply to say that we should not be confused. ~ It is not a matter \nof right and wrong, but a matter of God taking us through a way that we temporarily \ndo not understand. ~ But it is only by going through the spiritual confusion that \nwe will come to the understanding of what God wants for us...\n\n\"When the Son of Man comes will He really find faith on the earth?\" (Lk. 18:8)\nWill He find the kind of faith that counts on Him in spite of the confusion?\n\nStand firm in faith, believing that what Jesus said is true, although in the meantime \nyou do not understand what God is doing. He has bigger issues at stake than the \nparticular things you are asking Him right now.\n\nPrayer Suggestion:\nDear Lord, I don't always understand why I have to go through\ncertain trials, so I ask for the faith to stand firm while You work\nit out...Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life.\nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b0a5820ea1d243",
    "date_utc": "Sun, 12 Sep 2010 05:28:05 -0500",
    "subject": "thoughts to live by",
    "verse": "I have brought You glory on earth by completing the work You gave Me to do. (John 17:4)",
    "reflection": "True surrender is not simply surrender of our external life but surrender of our will ~ and once that is done, surrender is complete. The greatest crisis we will ever face is the surrender of our will. Yet God never forces a person's will to surrender, and He never begs. He patiently waits until that person willingly yields to Him. And once that battle has been fought, it never needs to be fought again. In (Matthew 11:28) Jesus gives this invitation \"Come to Me. \" The accepting of this invitation is a voluntary coming. Remember He is waiting will you accept His invitation today?",
    "prayer": "Dear Lord, by Your Holy Spirits work, help me to surrender my will to You, so that my name will be written into the Lamb's book of life. Amen.",
    "reading": "",
    "original_content": "09/13/2010~~~food for thought~~~AFTER SURRENDER THEN WHAT\n\nOur Bible;e Verse for Today:\nI have brought You glory on earth by completing the work You\ngave Me to do. (Jn. 17:4)\n\nOur Lesson for Today:\nTrue surrender is not simply surrender of our external life but surrender\nof our will ~ and once that is done, surrender is complete. The greatest \ncrisis we will ever face is the surrender of our will.\n\nYet God never forces a person's will to surrender, and He never begs.\nHe patiently waits until that person willingly yields to Him. And once that\nbattle has been fought, it never needs to be fought again.\n\nIn (Mt. 11:28) Jesus gives this invitation \"Come to Me.\" The accepting\nof this invitation is a voluntary coming. Remember He is waiting will\nyou accept His invitation today?\n\nPrayer Suggestion:\nDear Lord, by Your Holy Spirits work, help me to surrender\nmy will to You, so that my name will be written into the Lamb's\nbook of life. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b0f94af7ebb4e9",
    "date_utc": "Mon, 13 Sep 2010 05:53:11 -0500",
    "subject": "thoughts to live by",
    "verse": "I am afraid that just as Eve was deceived by the serpent's cunning, your minds may somehow be led astray from your sincere and pure devotion to Christ. (II Corinthians 11:3)",
    "reflection": "The Corintians' pure and simple devotion to Christ was being threatened by false teaching. Paul did not want the believers to lose their simpleminded love for Christ. Keeping Christ first in our life can be very difficult when we have so many distractions threatening to sidetrack our faith. Just as Eve lost her focus by listening to the serpent, we, too, can lose our focus by letting our life become overcrowded and confused. Is there anything that weakens your commitment to keep Christ first in your life? Let us minimize any and all distractions that threaten our devotion to Christ.",
    "prayer": "Dear Lord, You know that Satan puts many distractions in my life, so that my faith in You is often threatened. Help me Lord to be more focused on You. Amen.",
    "reading": "",
    "original_content": "09/14/2010~~~food for thought~~~TO MAY DISTRACTIONS\n\nOur Bible Verse for Today:\nI am afraid that just as Eve was deceived by the serpent's cunning,\nyour minds may somehow be led astray from your sincere and pure \ndevotion to Christ.(II Cor. 11:3)\n\nOur Lesson for Today:\nThe Corintians' pure and simple devotion to Christ was being threatened\nby false teaching. Paul did not want the believers to lose their simple-minded\nlove for Christ. \n\nKeeping Christ first in our life can be very difficult when we have so many\ndistractions threatening to sidetrack our faith.\n\nJust as Eve lost her focus by listening to the serpent, we, too, can lose our \nfocus by letting our life become overcrowded and confused. Is there anything\nthat weakens your commitment to keep Christ first in your life?\n\nLet us minimize any and all distractions that threaten our devotion to Christ.\n\nPrayer Suggestion:\nDear Lord, You know that Satan puts many distractions in my life, \nso that my faith in You is often threatened. Help me Lord to be \nmore focused on You. Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b14b10b92e0baa",
    "date_utc": "Tue, 14 Sep 2010 05:50:32 -0500",
    "subject": "thoughts to live by",
    "verse": "We have renounced secret and shameful ways; we do not use deception, nor do we distort the word of God. on the contrary, by setting forth the truth plainly we commend ourselves to every man's conscience in the sight of God. (2 Corinthians 4:2)",
    "reflection": "Preachers, teachers, and anyone else who talks about Jesus Christ must remember that they stand in God's presence ~ He hears every word. When you tell people about Christ, be careful not to distort the message to please your audience. Have you \"renounced the hidden things of shame\" in your life? If not then renounce it as soon as it comes to mind. We must maintain continual watchfulness so that nothing arises in our life that would cause us shame.",
    "prayer": "Dear Lord, help me to be victorious over Satan's attempts to ruin my witness. Amen.",
    "reading": "",
    "original_content": "09/15/2010~~~food for thought~~~WHAT TO RENOUNCE\n\nOur Bible Verse for Today:\nWe have renounced secret and shameful ways; we do not use \ndeception, nor do we distort the word of God. on the contrary, by\nsetting forth the truth plainly we commend ourselves to every man's\nconscience in the sight of God. (2 Cor. 4:2)\n\nOur Lesson for Today:\nPreachers, teachers, and anyone else who talks about Jesus Christ must\nremember that they stand in God's presence ~ He hears every word. When\nyou tell people about Christ, be careful not to distort the message to please \nyour audience.\n\nHave you \"renounced the hidden things of shame\" in your life?\nIf not then renounce it as soon as it comes to mind. We must maintain continual \nwatchfulness so that nothing arises in our life that would cause us shame.\n\nPrayer Suggestion:\nDear Lord, help me to be victorious over Satan's attempts \nto ruin my witness. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b19f91b5c1f33a",
    "date_utc": "Wed, 15 Sep 2010 05:14:13 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus says: \"When you pray, go into your room and close the door, and pray to your Father, who is unseen. Then your Father, who sees what is done in secret, will reward you. (Matthew 6:6)",
    "reflection": "The main thought in the area of religion is ~ Keep your eyes on God, not on people. Our motivation should not be the desire to be known as a praying person. Find an inner room in which to pray, where no one even knows you are praying, shut the door, and talk to God in secret. We should have no other motivation than to know our Father in heaven. It is impossible to carry on your life as a disciple without definite times of secret prayer.",
    "prayer": "Dear Lord, the Father of all mercy help me to remember to draw near to You each day in a time of prayer. Amen.",
    "reading": "",
    "original_content": "09/16/2010~~~food for thought~~~PRAYING IN SECRET\n\nOur Bible Verse for Today:\nJesus says: \"When you pray, go into your room and close the\ndoor, and pray to your Father, who is unseen. Then your Father,\nwho sees what is done in secret, will reward you. (Mt. 6:6)\n\nOur Lesson for Today:\nThe main thought in the area of religion is ~ Keep your eyes on \nGod, not on people. Our motivation should not be the desire to\nbe known as a praying person.\n\nFind an inner room in which to pray, where no one even knows you\nare praying, shut the door, and talk to God in secret.\n\nWe should have no other motivation than to know our Father in\nheaven. It is impossible to carry on your life as a disciple\nwithout definite times of secret prayer.\n\nPrayer Suggestion:\nDear Lord, the Father of all mercy help me to remember to\ndraw near to You each day in a time of prayer.Amen.\n\nPastor Alvin & Marcie Sather\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b1efe42784be55",
    "date_utc": "Thu, 16 Sep 2010 06:00:09 -0500",
    "subject": "thoughts to live by",
    "verse": "No temptation has overtaken you except what is common to man. (I Corinthians 10:13a)",
    "reflection": "We live in a culture much like the Corinthians did, it is a culture filled with moral depravity and sin-inducing pressures. Paul's encouragement is that, (1) Temptation happens to everyone so don't feel you have been singled out; (2) Others have resisted temptation and so can you; (3) any temptation can be resisted because God will show you a way out. God will help you in resisting temptation by helping you (1) recognize those people and situations that give you trouble, (2) run from anything you know is wrong, (3) choose to do only what is right, (4) pray for God's help, and (5) seek friends who love God and can offer help when you are tempted. Running from a tempting situation is you first step on the way to victory (2 Tim. 2:22)",
    "prayer": "Dear Lord, I don't always recognize temptation when it begins, so I ask for a keener eye to what I'm getting into. Amen.",
    "reading": "",
    "original_content": "09/17/2010~~~food for thought~~~IS THERE GOOD IN TEMPTATION\n\nOur Bible Verse for Today:\nNo temptation has overtaken you except what is common to man.\n(I Cor. 10:13a)\n\nOur Lesson for Today:\nWe live in a culture much like the Corinthians did, it is a culture filled with\nmoral depravity and sin-inducing pressures.\n\nPaul's encouragement is that, (1) Temptation happens to everyone so\ndon't feel you have been singled out; (2) Others have resisted temptation\nand so can you; (3) any temptation can be resisted because God will\nshow you a way out.\n\nGod will help you in resisting temptation by helping you (1) recognize those\npeople and situations that give you trouble, (2) run from anything you know\nis wrong, (3) choose to do only what is right, (4) pray for God's help, and\n(5) seek friends who love God and can offer help when you are tempted.\n\nRunning from a tempting situation is you first step on the way to victory (2 Tim. 2:22)\n\nPrayer Suggestion:\nDear Lord, I don't always recognize temptation when it\nbegins, so I ask for a keener eye to what I'm getting into. Amen.\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b245454165be87",
    "date_utc": "Fri, 17 Sep 2010 05:54:10 -0500",
    "subject": "thoughts to live by",
    "verse": "\"We do not have a High Priest who cannot sympathize with our weakness, but was in all points tempted as we are, yet without sin\" (Hebrews 4:15).",
    "reflection": "Temptation means, a test of possessions held within the inner, spiritual part of our being by a power outside us and foreign to us. This makes the temptation of our Lord explainable, After Jesus' baptism, having accepted His mission of being the One \"who takes away the sin of the world\" (John 1:29) He \"was led up by the Spirit into the wilderness\" (Matthew 4:1) and into the testing devices of the devil. Yet He did not become weary or exhausted. He went through the temptations \"without sinning\" and He retained all the possessions of His Spiritual nature completely intact.",
    "prayer": "Dear Lord, I pray that You would keep me unsaved by temptation. Amen.",
    "reading": "",
    "original_content": "09/18/2010~~~food for thought~~~HIS TEMPTATION AND OURS\n\nOur Bible Verse for Today:\n\"We do not have a High Priest who cannot sympathize with our weakness,\nbut was in all points tempted as we are, yet without sin\" (Heb. 4:15).\n\nOur Lesson for Today:\nTemptation means, a test of possessions held within the inner, spiritual part\nof our being by a power outside us and foreign to us.\n\nThis makes the temptation of our Lord explainable, After Jesus' baptism, having\naccepted His mission of being the One \"who takes away the sin of the world\" \n(Jn. 1:29) He \"was led up by the Spirit into the wilderness\" (Mt. 4:1) and into the\ntesting devices of the devil. Yet He did not become weary or exhausted.\n\nHe went through the temptations \"without sinning\" and He retained all the possessions\nof His Spiritual nature completely intact.\n\nPrayer Suggestion:\nDear Lord, I pray that You would keep me unshaved\nby temptation. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b294dca4a25230",
    "date_utc": "Sat, 18 Sep 2010 05:56:29 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus says to His disciples, \" \"You have remained true to Me in My trials\". (Luke 22:28)",
    "reflection": "It is true that Jesus is with us through, but are going on with Him? Many of us turn back from going on with Jesus the very moment we have an experience of what He can do. Watch when God changes your circumstances to see whether you are going on with Jesus, or siding with the world, the flesh, and the devil. We wear His name, but are we going on with Him? \"From that time many of His disciples went back and walked with Him no more. \" (John 6:66) Are you going on with Jesus? His voice is still calling. \"Follow Me\". (Matthew 4:19)",
    "prayer": "Dear Lord, Help me to be a true follower. Help me to never stray from Your path. Amen.",
    "reading": "",
    "original_content": "09/19/2010~~~food for thought~~~ARE YOU GOING ON WITH JESUS\n\nOur Bible Verse for Today:\nJesus says to His disciples, \" \"You have remained true\nto Me in My trials\". (Lk. 22:28)\n\nOur Lesson for Today:\nIt is true that Jesus is with us through, but are going on with Him?\nMany of us turn back from going on with Jesus the very moment\nwe have an experience of what He can do.\n\nWatch when God changes your circumstances to see whether you\nare going on with Jesus, or siding with the world, the flesh, and the \ndevil.\nWe wear His name, but are we going on with Him? \"From that time \nmany of His disciples went back and walked with Him no more.\" (Jn. 6:66)\n\nAre you going on with Jesus? His voice is still calling.\n\"Follow Me\".(Mt. 4:19)\n\nPrayer Suggestion:\nDear Lord, Help me to be a true follower.\nHelp me to never stray from Your path. Amen.\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b299551f89e04d",
    "date_utc": "Sun, 19 Sep 2010 05:40:05 -0500",
    "subject": "thoughts to live by",
    "verse": "\". be perfect, just as your Father in heaven is perfect. \" (Matthew 5:48)",
    "reflection": "How can we be perfect? (1) 'In Character' ~ In this life we cannot be flawless, BUT we can work at being as much like Christ as possible. (2) 'In Holiness' ~ Like the Pharisees, we are to separate ourselves from the worlds sinful values. BUT unlike the Pharisees, we are to be devoted to God's desires rather than our own and carry His love and mercy into the world. (3) 'In maturity' ~ we can't achieve Christ-like character and holy living all at once, BUT we must grow toward maturity and wholeness. (4) 'In love' ~ We can seek to love others as completely as God loved us. We can be perfect IF our behavior is appropriate for our maturity level. Perfect, yet with much room to grow. Our tendency to sin must never deter us from striving to be more like Christ.",
    "prayer": "Dear Lord, Help me to grow and become mature in my spiritual life so that daily I might become more Christ-like. Amen",
    "reading": "",
    "original_content": "09/20/2010~~~food for thought~~~THE DIVINE COMMANDMENT OF LIFE\n\nOur Bible Verse for Today:\n\".be perfect, just as your Father in heaven is perfect.\" (Mt. 5:48)\n\nOur Lesson for Today:\nHow can we be perfect?\n(1) 'In Character' ~ In this life we cannot be flawless, BUT we can work at\nbeing as much like Christ as possible.\n(2) 'In Holiness' ~ Like the Pharisees, we are to separate ourselves from\nthe worlds sinful values. BUT unlike the Pharisees, we are to be devoted to\nGod's desires rather than our own and carry His love and mercy into the world.\n(3) 'In maturity' ~ we can't achieve Christ-like character and holy living all at\nonce, BUT we must grow toward maturity and wholeness.\n(4) 'In love' ~ We can seek to love others as completely as God loved us.\n\nWe can be perfect IF our behavior is appropriate for our maturity level.\nPerfect, yet with much room to grow. Our tendency to sin must never\ndeter us from striving to be more like Christ.\n\nPrayer Suggestion:\nDear Lord, Help me to grow and become mature in my spiritual\nlife so that daily I might become more Christ-like.Amen\n\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b339c50ec61ea9",
    "date_utc": "Mon, 20 Sep 2010 05:29:47 -0500",
    "subject": "thoughts to live by",
    "verse": "Now the Lord says, who formed me in the womb to be His servant. (Isaiah 49:5a)",
    "reflection": "We must always remember the fact that God's creative purpose for us is, to be one of His servants, and not ever confuse or cloud it with our own intentions. If we do, God will have to force our intentions aside no matter how much it may hurt. Once we realize that it is through the salvation of Jesus Christ that we are made perfectly fit for the purpose of God, we will understand why Jesus Christ is so strict and relentless in His demands. He demands absolute righteousness from His servants, because He has put into them the very nature of God.",
    "prayer": "Dear Lord, Help me to never forget Your purpose for me. Help me to also remember, that You know my every thought word and deed. Forgive me Lord for my wayward ways. Amen.",
    "reading": "",
    "original_content": "09/21/2010~~~food for thought~~~WE HAVE A PREDESTINED PURPOSE\n\nOur Bible Verse for Today:\nNow the Lord says, who formed me in the womb to\nbe His servant. (Isa. 49:5a)\n\nOur Lesson for Today:\nWe must always remember the fact that God's creative purpose\nfor us is, to be one of His servants, and not ever confuse or cloud\nit with our own intentions. \n\nIf we do, God will have to force our intentions aside no matter how much\nit may hurt. Once we realize that it is through the salvation of Jesus \nChrist that we are made perfectly fit for the purpose of God, we will\nunderstand why Jesus Christ is so strict and relentless in His demands.\n\nHe demands absolute righteousness from His servants, because He has\nput into them the very nature of God.\n\nPrayer Suggestion:\nDear Lord, Help me to never forget Your purpose for me.\nHelp me to also remember, that You know my every thought\nword and deed. Forgive me Lord for my wayward ways. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b38cf1fda1f148",
    "date_utc": "Tue, 21 Sep 2010 05:41:50 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus says, \"You call Me Teacher and Lord, and you say well, for so I am. I say to you, a servant is not greater than his master. \" (John 13:13, 16)",
    "reflection": "Do you call Him Teacher and Lord? ~ But is He? ~ Teacher, Master, and Lord seem to have a very small place in our vocabulary. We seem to prefer the words Savior, Sanctified, and Healer. The only word that truly describes the experience of being mastered is love and we seem to know very little about love as God reveals it in His Word. The way we use the word obey is proof of this. In the Bible, obedience is based on a relationship between equals; for example, that of a son with his father. Our Lord was not simply God's servant - He was God's Son. \". though He was a Son, yet He learned obedience. \" (Hebrews 5:8) He wants us in a relationship where He is so easily our Mater and Teacher that we have no conscious awareness of it - a relationship where all we know is that we are His to obey.",
    "prayer": "Dear Lord, help me to walk in a relationship with You that is pleasing to You. Amen.",
    "reading": "",
    "original_content": "09/22/2010~~~food for thought~~~IS HE TRULY YOUR MASTER? ? ?\n\nOur Bible Verse for Today:\nJesus says, \"You call Me Teacher and Lord, and you say well,\nfor so I am. I say to you, a servant is not greater than his \nmaster.\" (Jn. 13:13, 16)\n\nOur Lesson for Today:\nDo you call Him Teacher and Lord? ~ But is He? ~ Teacher, Master, and \nLord seem to have a very small place in our vocabulary. We seem to prefer \nthe words Savior, Sanctifier, and Healer.\n\nThe only word that truly describes the experience of being mastered is love\nand we seem to know very little about love as God reveals it in His Word. The\nway we use the word obey is proof of this.\n\nIn the Bible, obedience is based on a relationship between equals; for example,\nthat of a son with his father. Our Lord was not simply God's servant - He was God's \nSon. \".though He was a Son, yet He learned obedience.\" (Heb. 5:8)\n\nHe wants us in a relationship where He is so easily our Mater and Teacher that we\nhave no conscious awareness of it - a relationship where all we know is that we are\nHis to obey.\n\nPrayer Suggestion:\nDear Lord, help me to walk in a relationship with You\nthat is pleasing to You.Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b3dcc2bd1a52fc",
    "date_utc": "Wed, 22 Sep 2010 06:10:25 -0500",
    "subject": "thoughts to live by",
    "verse": "Gathering the twelve disciples around Him, Jesus told them, \"as you know, we are going to Jerusalem. (Luke 18:31a)",
    "reflection": "In our Lord's life, Jerusalem was the place where He would reach the end of God's plan for all of mankind through His Son's death on the cross, and unless we go there with Him, we will have no friendship or fellowship with Him. Nothing ever diverted our Lord on His way to Jerusalem. He never hurried through certain villages where He was persecuted, or lingered in others where He was blessed. Neither gratitude nor ingratitude turned our Lord even in the slightest degree away form His purpose to go \"up to Jerusalem. \" As Jesus' followers we will not end in crucifixion; BUT by the Lord's grace we will end up in glory. In the meantime our watch word should be summed up by each of us saying, \"I too go 'up to Jerusalem. ' \"",
    "prayer": "Dear Lord, help me stay true to the course, You have set for me. Amen.",
    "reading": "",
    "original_content": "09/23/2010~~~food for thought~~~STAYING TRUE TO THE COURSE\n\nOur Bible Verse for Today:\nGathering the twelve disciples around Him, Jesus told them,\n\"as you know, we are going to Jerusalem. (Lk.18:31a)\n\nOur Lesson for Today:\nIn our Lord's life, Jerusalem was the place where He would reach the end\nof God's plan for all of mankind through His Son's death on the cross, and \nunless we go there with Him, we will have no friendship or fellowship with\nHim.\n\nNothing ever diverted our Lord on His way to Jerusalem. He never hurried\nthrough certain villages where He was persecuted, or lingered in others where \nHe was blessed. Neither gratitude nor ingratitude turned our Lord even in \nthe slightest degree away form His purpose to go \"up to Jerusalem.\"\n\nAs Jesus' followers we will not end in crucifixion; BUT by the Lord's grace we \nwill end up in glory. In the meantime our watch word should be summed up by\neach of us saying, \"I too go 'up to Jerusalem. ' \" \n\nPrayer Suggestion:\nDear Lord, help me stay true to the course, \nYou have set for me. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b43007def9f931",
    "date_utc": "Thu, 23 Sep 2010 06:14:38 -0500",
    "subject": "thoughts to live by",
    "verse": "\"If you are offering your gift at the altar and there remember that your brother has something against you, ~ leave your gift there in front of the altar. First go and be reconciled to your brother; then come and offer your gift. (Matthew 5:23, 24)",
    "reflection": "We should, never, ever disregard a conviction that the Holy Spirit brings to our mind. If it is important enough for the Holy Spirit of God to bring it to your mind, it is the very thing He is detecting in you. Here is a question you should ask yourself. \"Am I looking for some big thing to give up, while God is telling me there are some tiny things that must go?\" Broken relationships can hinder our relationship with God. If we have a problem or grievance with someone, we should resolve the problem as soon as possible. Scriptures tell us we are hypocrites and liars if we claim to love God while we hate others. Really, our attitude toward others reflect our relationship with God (1 John 4:20)",
    "prayer": "Dear Lord, bring to my mind any and all grievances I have against others so that I may confess them as sins that are really hindering my relationship with You. Amen.",
    "reading": "",
    "original_content": "09/24/2010~~~food for thought~~~THE \"GO\" OF PREPARATION\n\nOur Bible Verse for Today:\n\"If you are offering your gift at the altar and there remember that your\nbrother has something against you, ~ leave your gift there in front of\nthe altar. First go and be reconciled to your brother; then come and \noffer your gift. (Mt. 5: 23, 24)\n\nOur Lesson for Today:\nWe should, never, ever disregard a conviction that the Holy Spirit brings to\nour mind. If it is important enough for the Holy Spirit of God to bring it to your\nmind, it is the very thing He is detecting in you.\n\nHere is a question you should ask yourself. \"Am I looking for some big thing\nto give up, while God is telling me there are some tiny things that must go?\"\n\nBroken relationships can hinder our relationship with God. If we have a problem \nor grievance with someone, we should resolve the problem as soon as possible.\nScriptures tell us we are hypocrites and liars if we claim to love God while we hate \nothers.\n\nReally, our attitude toward others reflect our relationship with God (1 Jn. 4:20)\n\nPrayer Suggestion:\nDear Lord, bring to my mind any and all grievances I have against\nothers so that I may confess them as sins that are really hindering \nmy relationship with You. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b48426e3f75fa4",
    "date_utc": "Fri, 24 Sep 2010 05:38:09 -0500",
    "subject": "thoughts to live by",
    "verse": "\"If someone forces you to go one mile, go with him two miles. \" (Matthew 5:41)",
    "reflection": "IF we are disciples of Jesus, we must be made disciples supernaturally. And as long as we consciously maintain the determined purpose to be His disciples, we can be sure that we are not His disciples. Jesus says, \"You did not choose Me, but I chose you. \" (John 15:16) That is the way the grace of God begins. It is a constraint we can never escape; we can disobey it, but we can never start it or produce it ourselves. We are drawn to God by a work of His supernatural grace, and we can never trace back to find where it began. Our Lord's making of a disciple is supernatural. He does not build on any natural capacity of ours at all. You may have noticed that God does not ask us to do the things that are naturally easy for us ~ He only asks us to do the things that we are perfectly fit to do through His grace and that is where the cross we must bear will always come.",
    "prayer": "Dear Lord, I pray that today through Your grace I may become obedient to Your will. Amen.",
    "reading": "",
    "original_content": "09/25/2010~~~food for thought~~~ONLY BY GOD'S GRACE\n\nOur Bible Verse for Today:\n\"If someone forces you to go one mile, go with him two miles.\" (Mt. 5:41)\n\nOur Lesson for Today:\nIF we are disciples of Jesus, we must be made disciples supernaturally.\nAnd as long as we consciously maintain the determined purpose to be His \ndisciples, we can be sure that we are not His disciples.\n\nJesus says, \"You did not choose Me, but I chose you.\" (Jn. 15:16)\nThat is the way the grace of God begins. It is a constraint we can never escape;\nwe can disobey it, but we can never start it or produce it ourselves.\n\nWe are drawn to God by a work of His supernatural grace, and we can never trace \nback to find where it began. Our Lord's making of a disciple is supernatural.\nHe does not build on any natural capacity of ours at all.\n\nYou may have noticed that God does not ask us to do the things that are naturally\neasy for us ~ He only asks us to do the things that we are perfectly fit to do \nthrough His grace and that is where the cross we must bear will always come.\n\nPrayer Suggestion:\nDear Lord, I pray that today through Your grace I may\nbecome obedient to Your will.Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life.\nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b4d6d48d390317",
    "date_utc": "Sat, 25 Sep 2010 05:43:43 -0500",
    "subject": "thoughts to live by",
    "verse": "\"If you ~~~ remember ~ that your brother has something against you. \" (Matthew 5:23b)",
    "reflection": "This verse says, If you bring your gift to the altar, and there remember that your brother has something against you. \" It is not saying, \"If you search and find something because of your unbalanced sensitivity, \" but, \"If you ~~~ remember. \" In other words, if something is brought to your conscious mind by the Holy Spirit of God ~ \"First be reconciled to your brother, and then come and offer your gift\" (5:24). Never object to the intense sensitivity of the Spirit of God in you when He is instructing you down to the smallest detail.",
    "prayer": "Dear Lord, it is only by Your Spirit's leading that I am able to follow faithfully, so help me to become more sensitive to Your Holy Spirit. Amen.",
    "reading": "",
    "original_content": "09/26/2010~~~food for thought~~~THE ART OF REMEMBERING\n\nOur Bible Verse for Today:\n\"If you ~~~ remember ~ that your brother has something against you. \"\n(Mt. 5:23b)\n\nOur Lesson for Today:\nThis verse says, If you bring your gift to the altar, and there remember\nthat your brother has something against you.\" It is not saying, \"If you\nsearch and find something because of your unbalanced sensitivity,\" but, \n\"If you ~~~ remember.\"\n\nIn other words, if something is brought to your conscious mind by the \nHoly Spirit of God ~ \"First be reconciled to your brother, and then come\nand offer your gift\" (5:24).\n\nNever object to the intense sensitivity of the Spirit of God in you when He is\ninstructing you down to the smallest detail.\n\nPrayer Suggestion:\nDear Lord, it is only by Your Spirit's leading that I am able \nto follow faithfully, so help me to become more sensitive \nto Your Holy Spirit.Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b4da7784343836",
    "date_utc": "Sun, 26 Sep 2010 05:46:32 -0500",
    "subject": "thoughts to live by",
    "verse": "\". someone said to Him, 'Lord I will follow You wherever You go' (Luke 9:57).",
    "reflection": "Our Lord's attitude toward this man was one of severe discouragement, \"for He knew what was in man\" (John 2:25). I'm pretty sure that many of us would have said, \"I can't imagine why He lost the opportunity of winning that man! Imagine being so cold to him and turning him away so discouraged!\" Let us never apologize for our Lord. The words of the Lord hurt and offend until there is nothing left to be hurt of offended. Jesus Christ had no tenderness whatsoever toward anything that was ultimately going to ruin a person in his service to God. Our Lord's answers were not based on some whim or impulsive thought, but on the knowledge of \"what was in the man. \" If the Spirit of God brings to your mind a word of the Lord that hurts you, you can be sure that there is something in you that He wants to hurt to the point of death.",
    "prayer": "Dear Lord, make me aware of the things in my life that are a hindrance to serving you as I should. Amen.",
    "reading": "",
    "original_content": "09/27/2010~~~food for thought~~~MAKING SURE OF OUR PROMISES\n\nOur Bible Verse for Today:\n\".someone said to Him, 'Lord I will follow You wherever\nYou go' (Lk. 9:57).\n\nOur Lesson for Today:\nOur Lord's attitude toward this man was one of severe discouragement,\n\"for He knew what was in man\" (Jn. 2:25). I'm pretty sure that many of us \nwould have said, \"I can't imagine why He lost the opportunity of winning that \nman! Imagine being so cold to him and turning him away so discouraged!\"\n\nLet us never apologize for our Lord. The words of the Lord hurt and offend \nuntil there is nothing left to be hurt of offended. Jesus Christ had no tenderness\nwhatsoever toward anything that was ultimately going to ruin a person in his\nservice to God.Our Lord's answers were not based on some whim or impulsive \nthought, but on the knowledge of \"what was in the man.\"\n\nIf the Spirit of God brings to your mind a word of the Lord that hurts you, you\ncan be sure that there is something in you that He wants to hurt to the point of death.\n\nPrayer Suggestion:\nDear Lord, make me aware of the things in my life that\nare a hindrance to serving you as I should. Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b527edd0416bb1",
    "date_utc": "Sun, 26 Sep 2010 05:46:32 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Someone said to Him, 'Lord I will follow You wherever You go' (Luke 9:57).",
    "reflection": "Our Lord's attitude toward this man was one of severe discouragement, \"for He knew what was in man\" (John 2:25). I'm pretty sure that many of us would have said,\"I can't imagine why He lost the opportunity of winning that man! Imagine being so cold to him and turning him away so discouraged!\" Let us never apologize for our Lord. The words of the Lord hurt and offend until there is nothing left to be hurt of offended. Jesus Christ had no tenderness whatsoever toward anything that was ultimately going to ruin a person in his service to God. Our Lord's answers were not based on some whim or impulsive thought, but on the knowledge of \"what was in the man.\" If the Spirit of God brings to your mind a word of the Lord that hurts you, you can be sure that there is something in you that He wants to hurt to the point of death.",
    "prayer": "Dear Lord, make me aware of the things in my life that are a hindrance to serving you as I should. Amen.",
    "reading": "",
    "original_content": "09/27/2010~~~food for thought~~~MAKING SURE OF OUR PROMISES\n\nOur Bible Verse for Today:\n\".someone said to Him, 'Lord I will follow You wherever\nYou go' (Lk. 9:57).\n\nOur Lesson for Today:\nOur Lord's attitude toward this man was one of severe discouragement,\n\"for He knew what was in man\" (Jn. 2:25). I'm pretty sure that many of us \nwould have said, \"I can't imagine why He lost the opportunity of winning that \nman! Imagine being so cold to him and turning him away so discouraged!\"\n\nLet us never apologize for our Lord. The words of the Lord hurt and offend \nuntil there is nothing left to be hurt of offended. Jesus Christ had no tenderness\nwhatsoever toward anything that was ultimately going to ruin a person in his\nservice to God.Our Lord's answers were not based on some whim or impulsive \nthought, but on the knowledge of \"what was in the man.\"\n\nIf the Spirit of God brings to your mind a word of the Lord that hurts you, you\ncan be sure that there is something in you that He wants to hurt to the point of death.\n\nPrayer Suggestion:\nDear Lord, make me aware of the things in my life that\nare a hindrance to serving you as I should. Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b57b7dc71c3302",
    "date_utc": "Mon, 27 Sep 2010 05:50:06 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus said to him, One thing you lack: Go your way, sell whatever you have and give to the poor. and come, take up your cross, and follow Me. (Mark 10:21)",
    "reflection": "Question: What does your money mean to you? Although Jesus wanted this man to sell everything and give his money to the poor, this does not mean that all believers should sell all their possessions. Most of His followers did not sell everything, although they used their possessions to serve others. Instead, this incident shows us that we must not let our possessions or money keep us from following Jesus. We must remove all barriers to serving Him fully. If Jesus asked, could you give up your house? ~ Your car? ~ You position on the ladder of promotion? ~ ~ ~ Your reaction may show your attitude toward money ~ whether it is your servant or your master.",
    "prayer": "Dear Lord, Help me to realize who or what is truly master of my life. Amen.",
    "reading": "",
    "original_content": "09/28/2010~~~food for thought~~~RECOGNIZING WHAT IS IMPORTANT\n\nOur Bible Verse for Today:\nJesus said to him, \"One thing you lack: Go your way, \nsell whatever you have and give to the poor. \nand come, take up your cross, and follow Me. (Mk. 10:21)\n\nOur Lesson for Today:\nQuestion: What does your money mean to you?\n\nAlthough Jesus wanted this man to sell everything and give his money to the poor,\nthis does not mean that all believers should sell all their possessions. Most of His\nfollowers did not sell everything, although they used their possessions to serve others.\n\nInstead, this incident shows us that we must not let our possessions or money keep\nus from following Jesus. We must remove all barriers to serving Him fully.\n\nIf Jesus asked, could you give up your house? ~ Your car? ~ You position on the\nladder of promotion? ~ ~ ~ Your reaction may show your attitude toward money ~\nwhether it is your servant or your master.\n\nPrayer Suggestion:\nDear Lord, Help me to realize who or what is truly master of my life. Amen. \nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life.\nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b5d0f285afc2db",
    "date_utc": "Tue, 28 Sep 2010 05:25:41 -0500",
    "subject": "thoughts to live by",
    "verse": "Yet when I preach the Gospel, I cannot boast for I am compelled to preach. Woe to me if I do not preach the Gospel ! (I Corinthians 9:16)",
    "reflection": "Preaching the Gospel was Paul's gift and calling, and he said he couldn't stop preaching even if He wanted to. ~ Paul was driven by the desire to do what God wanted; using his gifts for God's glory. What specail gifts has God given you? Are you motivated, like Paul to honor God with your gifts? Like Paul, both freedom and discipline should be important tools to be used in God's service.",
    "prayer": "Dear Lord, help we to de as dedicated to your service, as Paul was. Amen.",
    "reading": "",
    "original_content": "09/29/2010~~~food for thought~~~THE AWARENESS OF THE CALL\n\nOur Bible Verse for Today:\nYet when I preach the Gospel, I cannot boast for I am compelled\nto preach. Woe to me if I do not preach the Gospel ! (I Cor. 9:16)\n\nOur Lesson for Today:\nPreaching the Gospel was Paul's gift and calling, and he said he couldn't \nstop preaching even if He wanted to. ~ Paul was driven by the desire to do \nwhat God wanted; using his gifts for God's glory.\n\nWhat specail gifts has God given you?\nAre you motivated, like Paul to honor God with your gifts?\n\nLike Paul, both freedom and discipline should be important tools \nto be used in God's service.\n\nPrayer Suggestion:\nDear Lord, help we to de as dedicated to your service, \nas Paul was. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to The father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b621e8a3edf2b7",
    "date_utc": "Wed, 29 Sep 2010 06:40:16 -0500",
    "subject": "thoughts to live by",
    "verse": "I am glad when I suffer for you in my body, for I am completing what remains of Christ's suffering for His body the church. (Colossians 1:24)",
    "reflection": "When Paul says, \"I am completing what remains of Christ's sufferings,\" he does not mean that Christ's suffering was inadequate to save him, nor does he mean that there is a predetermined amount of suffering that must be paid by all believers. What Paul is says is there could be an unavoidable suffering to bring the Good News of Christ to the world. It is called 'Christ's suffering' because all Christians are related to Christ. When we suffer Christ feels it with us. But this suffering can be endured joyfully because it changes lives and brings people into God's Kingdom. (See I Peter 4:1, 2; 12-19)",
    "prayer": "Dear Lord, my prayer once again is for the help to remain faithful no matter what the consequences. Amen.",
    "reading": "",
    "original_content": "09/30/2010~~~food for thought~~~FAITHFUL TO THE CALL\n\nOur Bible Verse for Today:\nI am glad when I suffer for you in my body, for I am completing what remains\nof Christ's suffering for His body the church.(Col. 1:24)\n\nOur Lesson for Today:\nWhen Paul says, \"I am completing what remains of Christ's sufferings,\" he does\nnot mean that Christ's suffering was inadequate to save him, nor does he mean\nthat there is a predetermined amount of suffering that must be paid by all believers.\n\nWhat Paul is says is there could be an unavoidable suffering to bring the Good News \nof Christ to the world. It is called 'Christ's suffering' because all Christians are related\nto Christ. When we suffer Christ feels it with us.\n\nBut this suffering can be endured joyfully because it changes lives and brings people\ninto God's Kingdom. (See I Pet. 4:1, 2; 12-19)\n\nPrayer Suggestion:\nDear Lord, my prayer once again is for the help to remain faithful\nno matter what the consequences. Amen.\nPastor Alvin & Marcie Sather\n\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "12b6737c552cb325",
    "date_utc": "Thu, 30 Sep 2010 08:15:02 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus took Peter, James, and John to the top of the mountain. (Mark 9:2a)",
    "reflection": "I believe we have all experienced times of exaltation on the mountain, when we have seen things from God's perspective and have wanted to stay there. But God will never allow us to stay there. ~ The true test of our spiritual life is in exhibiting the power to descend from the mountain. If we only have the power to go up, something is wrong. It is a wonderful thing to be on the mountain with God, but a person only gets there so that he may later go down and lift up the people in the valley (see 9:14-18). We are not made for the mountains, for sunrises, or for the other beautiful attractions in life ~ those are simply intended to be moments of inspiration. We are made for the valley and the ordinary things of life, and that is where we have to prove our stamina and strength. Yet our spiritual selfishness always wants repeated moments on the mountain. I think we feel that we could talk and live like perfect angels, if we could only stay on the mountaintop. Those times of exaltation are exceptional and they have their meaning in our life with God, But we must beware to prevent our spiritual selfishness from wanting to make them the only time.",
    "prayer": "Dear Lord, I do thank You for the mountaintop experiences, but I do know that the valley type experiences are also good for me because they help me to grow in my faith for You. Amen.",
    "reading": "",
    "original_content": "10/01/2010~~~food for thought~~~THE PLACE OF EXALTATION\n\nOur Bible Verse for Today:\nJesus took Peter, James, and John to the top of the mountain.\n(Mk. 9:2a)\n\nOur Lesson for Today:\nI believe we have all experienced times of exaltation on the mountain, when we have\nseen things from God's perspective and have wanted to stay there. But God will\nnever allow us to stay there. ~ The true test of our spiritual life is in exhibiting the\npower to descend from the mountain.\n\nIf we only have the power to go up, something is wrong. It is a wonderful thing to\nbe on the mountain with God, but a person only gets there so that he may later go \ndown and lift up the people in the valley (see 9:14-18).\n\nWe are not made for the mountains, for sunrises, or for the other beautiful attractions\nin life ~ those are simply intended to be moments of inspiration. We are made for\nthe valley and the ordinary things of life, and that is where we have to prove our stamina \nand strength. Yet our spiritual selfishness always wants repeated moments on the mountain.\n\nI think we feel that we could talk and live like perfect angels, if we could only stay on the \nmountaintop. Those times of exaltation are exceptional and they have their meaning in \nour life with God, But we must beware to prevent our spiritual selfishness from wanting\nto make them the only time.\n\nPrayer Suggestion:\nDear Lord, I do thank You for the mountaintop experiences,\nbut I do know that the valley type experiences are also good\nfor me because they help me to grow in my faith for You. Amen.\n\nPastor Alvin & Marcie Sather\nThe Lord said, \"I am the way, the truth, and the life. \nNo one can come to the Father except through me.\" - John: 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]