[
  {
    "message_id": "179c9bbb3a76fa3a",
    "date_utc": "2021-06-01T22:39:52+00:00",
    "subject": "WARNING ABOUT SELF-CONFIDENCE",
    "verse": "Look here, you people who say, “Today or tomorrow we are going to a certain town and stay there a year. We will do business and make a profit.” How do you know what will happen tomorrow? For your life is like the morning fog—it is here a little while, then it is gone. (James 4:13, 14)",
    "reflection": "It is good to make plans, but they will disappoint us if we leave God out of them. There is no point in making plans as though God does not exist, because the future is in His hands. What would you like to be doing ten years from now? One year from now? Tomorrow? How will you\nreact if God steps in and rearranges your plans?",
    "prayer": "Plan ahead, BUT ask for Gods guidance, seek God’s will in your planning, He will never disappoint you.",
    "original_content": "message_id: 179c9bbb3a76fa3a\nsubject   : Subject: WARNING ABOUT SELF-CONFIDENCE (6-1-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 1 Jun 2021 17:39:52 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*Look here, you people who say, “Today or tomorrow we **are going to a\ncertain town and stay there a year. We will **do business and make a\nprofit.” How do you know what **will happen tomorrow? For your life is like\nthe morning fog—it is here a little while, then *\n\n*it is gone. *Jm. 4:13, 14)\n\n\n\n*Today’s Reflection:*\n\nIt is good to make plans, *but* they will disappoint\n\nus *if* we leave God out of them. There is no point\n\nin making plans as though God does not exist, because the future is in His\nhands*. *What would\n\nyou like to be doing ten years from now*? *One\n\nyear from now? Tomorrow? How will you\n\nreact if God steps in and rearranges your plans?\n\n*Pastor Sather*\n\n*Plan ahead, *BUT ask for Gods guidance, seek God’s will in your planning,\nHe will never disap-point you.\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 16:9 AI",
    "found_reading": true
  },
  {
    "message_id": "179c9fed70343f8a",
    "date_utc": "2021-06-01T23:53:12+00:00",
    "subject": "OUR FAITH MUST EXPRESS ITSELF IN ACTIONS",
    "verse": "Remember, it is sin to know what you ought to  do and not do it. (James 4:17)",
    "reflection": "We tend to think that doing wrong is sin. But James tells us that, sin is also not doing right. (these two kinds of sin are sometimes called sins of commission and sins of omissions.) It is a sin to lie, it can also be a sin to know the truth and not tell it. It is a sin to speak evil of someone; it is also a sin to avoid that person when you know he or she needs your friendship. You should be willing to help as the Holy Spirit guides you. If God has directed you to do a kind act, to render a service, or to restore a relationship, do it.",
    "prayer": "If you do so, you will experience a renewed and refreshed vitality to your Christian faith.",
    "original_content": "message_id: 179c9fed70343f8a\nsubject   : Subject: OUR FAITH MUST EXPRESS ITSELF IN ACTIONS\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 1 Jun 2021 18:53:12 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n(6-2-21)\n\n*Today’s Verse:*\n\n*Remember, it is sin to know what you ought to *\n\n*do and not do it. *(Jm. 4:17)\n\n*Today’s Reflection:*\n\nWe tend to think that doing wrong is sin. But\n\nJames tells us that, sin is also not doing right.\n\n(these two kinds of sin are sometimes called\n\nsins of commission and sins of omissions.)\n\nIt is a sin to lie, it can also be a sin to know\n\nthe truth and not tell it. It is a sin to speak\n\nevil of someone; it is also a sin to avoid that\n\nperson when you know he or she needs your friendship. You should be willing\nto help as\n\nthe Holy Spirit guides you. If God has directed\n\nyou to do a kind act, to render a service, or to\n\nrestore a relationship, *do it.*\n\n*Pastor Sather*\n\n*If you do so, you will experience a renewed *\n\n*and refreshed vitality to your Christian faith.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "James 2:14-17 AI",
    "found_reading": true
  },
  {
    "message_id": "179cee08cc186a72",
    "date_utc": "2021-06-02T22:38:13+00:00",
    "subject": "PATIENCE--PATIENCE",
    "verse": "Dear brothers and sisters, you must be patient as  you wait for the Lord’s return. Consider the farmers who eagerly look for the rains in the fall and the spring. They patiently wait for the precious harvest  to ripen. You too, must be patient! (James 5:7, 8a)",
    "reflection": "I think we all know that the farmer cannot rush the growth of his crops. But he does not take the summer off. There is a lot of work to do to ensure a good crop. In the same way, we must wait patient ly for Christ’s return. We can not make Him come back any sooner. But while we wait, there is much work that we can do to advance God’s Kingdom. Both the Christian and the farmer must look toward the future reward for their labors.",
    "prayer": "Don’t live as though Christ will never return . . . . . .",
    "original_content": "message_id: 179cee08cc186a72\nsubject   : Subject: PATIENCE--PATIENCE (6-3-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 2 Jun 2021 17:38:13 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*Dear brothers and sisters, you must be patient as *\n\n*you wait for the Lord’s return. Consider the farmers who eagerly look for\nthe rains in the fall and the spring. They patiently wait for the precious\nharvest *\n\n*to ripen. You too, must be patient! *(Jm. 5:7, 8a)\n\n\n\n*Today’s Reflection:*\n\nI think we all know that the farmer cannot rush\n\nthe growth of his crops. But he does not take the summer off. There is a\nlot of work to do to ensure\n\na good crop. In the same way, we must wait patient-\n\nly for Christ’s return. We can not make Him come back any sooner. But while\nwe wait, there is much work that we can do to advance God’s Kingdom. Both\nthe Christian and the farmer must look toward the future reward for their\nlabors.\n\n*Pastor Sather*\n\n*Don’t live as though Christ will never return . . . . . . *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Colossians 3:23-24 AI",
    "found_reading": true
  },
  {
    "message_id": "179d3e902af22c5a",
    "date_utc": "2021-06-03T22:05:34+00:00",
    "subject": "COURAGE WITH PATIENCE",
    "verse": "Don’t grumble about each other, my brothers  and sisters, or God will judge you. For look!  The great judge is coming, He is standing at  the door. (James 5: 9)",
    "reflection": "When things go wrong, we tend to grumble and blame others for our miseries. Blaming others is easier than owning our share of the respond sibility, it can be both destructive and sinful. Before you blame others for their shortcomings, remember that Christ the judge will come to evaluate each of us. (Matthew 7:1-5).",
    "prayer": "He will not let us get away with shifting the blame to others.",
    "original_content": "message_id: 179d3e902af22c5a\nsubject   : Subject: COURAGE WITH PATIENCE (5-4-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 3 Jun 2021 17:05:34 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Don’t grumble about each other, my brothers *\n\n*and sisters, or God will judge you. For look! *\n\n*The great judge is coming, He is standing at *\n\n*the door. *(Jm. 5: 9)\n\n\n\n*Today’s Reflection:*\n\nWhen things go wrong, we tend to grumble and blame others for our miseries.\nBlaming others\n\nis easier than owning our share of the respon-\n\nsibility, it can be both destructive and sinful.\n\nBefore you blame others for their short-comings, remember that Christ the\njudge will come to eval-uate each of us. (Mt. 7:1-5).\n\n*Pastor Sather*\n\n*He will not let us get away with shifting the blame to others.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "James 4:11-12 AI",
    "found_reading": true
  },
  {
    "message_id": "179d92dcde35c35a",
    "date_utc": "2021-06-04T22:38:48+00:00",
    "subject": "A SIMPLE YES OR NO",
    "verse": "Most of all my brothers and sisters, never take  an oath,by heaven and earth or anything else.  Just say a simple yes or no, so that you will  not sin and be condemned for it. (James 5:12)",
    "reflection": "A person with the reputation of exaggerating or lying often can’t get anyone to believe him or his word alone. Christians should never be like that. Always be honest so that others will believe your simple yes or no. By avoiding lies, and half-truths, and the omissions of the truth, you will become known as a trustworthy person.",
    "prayer": "Make a reputation of being honest at all times.",
    "original_content": "message_id: 179d92dcde35c35a\nsubject   : Subject: A SIMPLE YES OR NO (6-5-12)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 4 Jun 2021 17:38:48 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Most of all my brothers and sisters, never take *\n\n*an oath,**by heaven and earth or anything else. *\n\n*Just say a simple **yes or no, so that you will *\n\n*not **sin and be condemned for **it. *(Jm. 5:12)\n\n\n\n*Today’s Reflection:*\n\nA person with the reputation of exaggerating\n\nor lying often can’t get anyone to believe him\n\nor his word alone. Christians should never be\n\nlike that. Always be honest so that others will\n\nbelieve your simple yes or no. *By avoiding* lies,\n\nand half-truths, and the omissions of the truth,\n\nyou will become known as a trustworthy person.\n\n*Pastor Sather*\n\n*Make a reputation of being honest at all times.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 5:37 AI",
    "found_reading": true
  },
  {
    "message_id": "179ddde585e3399e",
    "date_utc": "2021-06-05T20:30:07+00:00",
    "subject": "A FALLEN BELIEVER",
    "verse": "My dear brothers and sisters, if anyone among  you wonders from the truth and is brought back again, you can be sure that the one who brings  that person back will save that sinner from death  and bring about the forgiveness of many sins. (James 5:19, 20)",
    "reflection": "We have come to the end of the book of James. What we should have leaned is the importance of faith in action. Right living should be the evid ence and result of faith. The church must serve with compassion, speak lovingly and truthfully, live in obedience to God’ commands, and love one another. The body of believers ought to be an example of heaven on earth , drawing people to Christ through love for God and each other. If we truly believe God’s Word, we will live it day by day. God’s Word is not merely something we read or think about, but something we do.",
    "prayer": "REMEMBER, belief, faith and trust must have hands and feet-ours.",
    "original_content": "message_id: 179ddde585e3399e\nsubject   : Subject: A FALLEN BELIEVER (6-6-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 5 Jun 2021 15:30:07 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*My dear brothers and sisters, if anyone among *\n\n*you won**ders from the truth and is brought back again, you can be sure\nthat the one who brings *\n\n*that person back will save** that sinner from death *\n\n*and bring about the forgiveness **of many sins.*\n\n\n\n\n*Today’s Reflection: *We have come to the end of the book of James.\n\nWhat we should have leaned is the importance\n\nof faith in action. Right living should be the evid-\n\nence and result of faith. The church *must* serve\n\nwith compassion, speak lovingly and truthfully*, *\n\nlive in obedience to God’ commands, and love\n\none another. The body of believers ought to be\n\nan example of heaven *on *earth*, *drawing people\n\nto Christ through love for God and each other.\n\nIf we truly believe God’s Word, we will live it day\n\nby day. God’s Word is not merely something we\n\nread or think about, *but something we do.*\n\n*Pastor Sather*\n\n*REMEMBER, belief, faith and trust must have hands **and feet—ours.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Ephesians 2:8-10 AI",
    "found_reading": true
  },
  {
    "message_id": "179e264cbdffd58f",
    "date_utc": "2021-06-06T17:35:27+00:00",
    "subject": "STUDY OF PROVERBS",
    "verse": "As we go through Proverbs, from each section I will share one or two verses, then reflect on the whole section. Today’s Verse The fear of the Lord is the beginning of wisdom  and instruction. (Proverbs 9:10)",
    "reflection": "of today’s section:\nSolomon’s introduction reminds us of the difference between true wisdom and the wisdom of the world. True Wisdom is from the Lord, a message that is foolish ess to those who reject it, but it is God’s very power to us who are being saved (I Corinthians 1:18).",
    "prayer": "Prayer: Lord, teach us true wisdom and give us its power to love and serve You. Amen.",
    "original_content": "message_id: 179e264cbdffd58f\nsubject   : Subject: STUDY OF PROVERBS (July 7-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 6 Jun 2021 12:35:27 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Home Work**—read--Verses: *(Pro. 1:1-7)\n\n\n\nAs we go through Proverbs, from each section\n\nI will share one or two verses, then reflect on the\n\nwhole section.\n\n\n*Today’s Verse*\n\n*The fear of the Lord is the beginning of wisdom *\n\n*and instruction. *(vs. 7)\n\n\n\n*The Reflection of today’s section:*\n\nSolomon’s introduction reminds us of the\n\ndifference between true wisdom and the\n\nwisdom of the world. *True Wisdom*—\n\nis from the Lord, a message that is foolish-\n\ness to those who reject it, *but* *it *is God’s\n\nvery power to us who are being saved\n\n(I Cor. 1:18).\n\n*Pastor Sather*\n\n\n*Prayer:** Lord, teach us true wisdom and give *\n\n*us its** power to love and serve You. Amen.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "(Proverbs 1:19)",
    "found_reading": true
  },
  {
    "message_id": "179e880cc6f31d6c",
    "date_utc": "2021-06-07T22:03:46+00:00",
    "subject": "THE ENTICEMENT OF SINNERS",
    "verse": "Such are the ways of everyone who is greedy for unjust gain;\nit takes away the life of it’s possessors. (Proverbs 1:19)",
    "reflection": "In vss. 8-19 Solomon warns against joining sinners in their adventurous plots, cautioning that the greedy and violent will eventually receive their due reward-a well deserved punishment. But through the means of grace, God in Christ, strengthens and preserves His people, that is every true believer, just as He forgives all our sins for Jesus sake.",
    "prayer": "Dear Lord, keep us from drifting into temptation, but deliver us from evil. Amen.",
    "original_content": "message_id: 179e880cc6f31d6c\nsubject   : Subject: THE ENTICEMENT OF SINNERS\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 7 Jun 2021 17:03:46 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*PLEASE Read: Pro. 1:8-19*\n\n\n\n*Today’s Verse: *(Pro. 1:19)\n\n*Such are the ways of everyone who is greedy for unjust **gain; it takes\naway the life of it’s possessors. *(Pro.1:19)\n\n\n\n*Today’s Reflection: *\n\nIn vss. 8-19 Solomon warns against joining sinners\n\nin their adventurous plots, cautioning that the greedy and violent will\neventually receive their due reward—a well deserved punishment. *But\nthrough *the means of grace, God in Christ, strengthens and preserves His\npeople, that is every true believer,\n\njust as He forgives all our sins for Jesus sake.\n\n*Pastor Sather*\n\n*Dear Lord, keep us from drifting into temptation, but deliver us from\nevil. **Amen.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 15:27 AI",
    "found_reading": true
  },
  {
    "message_id": "179f2a3d8e806dc5",
    "date_utc": "2021-06-09T21:18:15+00:00",
    "subject": "TOTAL REVERANCE FOR GOD",
    "verse": "If you seek wisdom like silver and search for it like hidden  treasures, then you will understand the fear of the Lord and find the knowledge of God. (Proverbs 2:4, 5) ",
    "reflection": "The fear of God is reverence for God and the spiritual worship of Him. This phrase is found throughout Scriptures. we need to remember, that the worship of God does not consist of works, no matter how great and holy they may be. God promises to give understanding to those who revere Him as their God and Father.",
    "prayer": "Dear Heavenly Father, I pray that Your Holy Spirit would fulfill in me a healthy reverence for You, so that I would grow in total respect for you as Abraham did. Amen. . .",
    "original_content": "message_id: 179f2a3d8e806dc5\nsubject   : Subject: TOTAL REVERANCE FOR GOD\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 9 Jun 2021 16:18:15 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Please read* (Pro. 2:1-10)\n\n*Today's Verses:*\n*If you seek wisdom like silver and search for it like hidden *\n*treasures, **then you will understand the fear of the Lord and*\n*find the knowledge of God. *(Pro. 2:4, 5)\n\n*Today's Reflection:*\n*The fear of God* is reverence for God and the spiritual worship\nof Him. This phrase is found throughout Scriptures. we need\nto remember, that the *worship* of God does not consist of\nworks, no matter how great and holy they may be. God\npromises to give understanding to those who revere Him\nas their God and Father.\n*Pastor Sather*\n*Dear Heavenly Father, I pray that Your Holy Spirit*\n*would fulfill in me a healthy reverence for You, so*\n*that I would grow in total respect for you as*\n*Abraham did. Amen.*\n. *. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 9:10 AI",
    "found_reading": true
  },
  {
    "message_id": "179f831f936a5c6b",
    "date_utc": "2021-06-10T23:11:35+00:00",
    "subject": "DISCRETION THE BETTER PART OF VALOR",
    "verse": "Discretion will watch over you, understanding  will guard you, delivering you from the way of  evil, from men of perverted speech.  (Proverbs 2:11, 12)",
    "reflection": "As you continue to read Proverbs you will notice that it often teaches a “two way” theology. There are two ways, one of life, and one of death., you will notice there is a great difference between the two ways. The way of goodness is followed by those who trust in the Lord for salvation,and of course the way of evil, followed by the ungod ly. Those who leave the right path for the way of evil eventually come to realize and delight in the way they have chosen. It all happened through the effective working of the devil, what is repulsive at first becomes interesting, then acceptable, and finally a source of sinful delight.",
    "prayer": "Dear Lord help us not to fall into the devious path Satan sets for us. Amen.",
    "original_content": "message_id: 179f831f936a5c6b\nsubject   : Subject: DISCRETION THE BETTER PART OF VALOR\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 10 Jun 2021 18:11:35 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Please read * (Pro. 2:10-15)\n\n\n\n*Today’s Verses:*\n\n*Discretion will watch over you, understanding *\n\n*will guard you, delivering you from the way of *\n\n*evil, from men of per-verted speech. *\n\n(Pro. 2:11, 12)\n\n\n\n*Today’s Reflection:*\n\nAs you continue to read Proverbs you will notice\n\nthat it often teaches a “*two way” *theology. There\n\nare two ways, one of life, and one of death., you\n\nwill notice there is a great difference between the\n\n*two ways. *The *way of good**ness* is followed by\n\nthose who trust in the Lord for salvation,and\n\nof course *the way of evil*, followed by the ungod-\n\nly. Those who leave the *right* path for the way of\n\nevil eventually come to realize and delight in the\n\nway they have chosen. *It all happened through *\n\n*the effective working** of the devil, what is repul-sive at first becomes\ninteres**ting, then acceptable, and finally a source of sinful delight.*\n\n* Pastor Sather*\n\n*Dear Lord help us not to fall into the devious *\n\n*path **Satan sets for us. **Amen.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 4:14-15 AI",
    "found_reading": true
  },
  {
    "message_id": "17a01d1a6bb64467",
    "date_utc": "2021-06-12T20:02:35+00:00",
    "subject": "A TOTAL TRUST IN GOD Please Read",
    "verse": "Never let loyalty and kindness get away from you! Wear them like a necklace; write them deep within  your heart. (Proverbs 3:3)",
    "reflection": "Loyalty and kindness are important character traits.\nBoth involve actions as well as attitudes. A loyal\nperson acts responsibly. A kind person works for justice for others.\nThoughts and words are not enough. Our life reveals whether we are truly loyal and kind. Do your actions measure up to your attitudes? IF you read vs. 6 you would have seen that it said; “Seek the Lord in all you do, and He will direct your paths.” Please remember He knows what is best for us. He is a better judge of what is best for us.",
    "prayer": "Dear Heavenly Father, help me to always put my complete trust in You. Amen.",
    "original_content": "message_id: 17a01d1a6bb64467\nsubject   : Subject: A TOTAL TRUST IN GOD Please Read (Pro. 3:1-6)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 12 Jun 2021 15:02:35 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*My Verse:*\n\n*Never let loyalty and kindness get away from you!*\n\n*Wear them like a necklace; write them deep within *\n\n*your heart. *(Pro. 3:3)\n\n\n\n*Today’s Reflection:*\n\nLoyalty and kindness are important character traits.\n\nBoth involve actions as well as attitudes. A loyal\n\nperson acts responsibly. A kind person works for\n\njustice for others. Thoughts and words are not enough.\n\nOur life reveals whether we are truly loyal and kind.\n\nDo your actions measure up to your attitudes? * IF*\n\nyou read vs. 6 you would have seen that it said;\n\n*“Seek the Lord in all you do, and He will direct **your *\n\n*paths.” *Please remember He knows what is best for\n\nus. He is a better judge of what is best for us.\n\n*Pastor Sather*\n\n*Dear Heavenly Father, help me to always put *\n\n*my **complete trust in You. **Amen.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 3:1-6",
    "found_reading": true
  },
  {
    "message_id": "17a0c6ed104009f1",
    "date_utc": "2021-06-14T21:30:27+00:00",
    "subject": "TO TEACH AND TO TRAIN",
    "verse": "My child do not ignore it when the Lord disciplines you,  and do not be discouraged when He correctsyou. For the  Lord corrects those He loves, just as a father corrects a  child in whom he delights. (Proverbs 3:10-11)",
    "reflection": "It is difficult to know when God has be disciplining us until we look back on the situation later. Not every calamity comes from God, of course. But if we rebel against God and refuse to repent when God has identified some sin in our life, He may\nuse guilt, crises, or bad experiences to bring us back to Him. Sometimes, however, difficult times come even when there is no flagrant sin in our life. Then our response should be patience, integrity, and confidence that God will show us what to do.",
    "prayer": "Dear Heavenly Father, it is my eternal wish that I will make You a vital part of my life. Amen.",
    "original_content": "message_id: 17a0c6ed104009f1\nsubject   : \nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 14 Jun 2021 16:30:27 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Subject: TO TEACH AND TO TRAIN *(Pro. 3:10-11)\n\n\n*Today’s Verses:*\n\n*My child do not ignore it when the Lord disciplines **you,*\n\n*and do **not be discouraged when He corrects**you. For **the *\n\n*Lord corrects those He loves, just as **a father corrects **a *\n\n*child in whom he delights.*\n\n\n\n*Today’s Reflection:*\n\nIt is difficult to know when God has be disciplining us until\n\nwe look back on the situation later. Not every calamity comes\n\nfrom God, of course. But if we rebel against God and refuse\n\nto repent when God has identified some sin in our life, He may\n\nuse guilt, crises, or bad experiences to bring us back to Him.\n\nSometimes, however, difficult times come even when there\n\nis no flagrant sin in our life. Then our response should be\n\npatience, integrity, and confidence that God will show us what\n\nto do.\n\n*Pastor Sather*\n\n*Dear Heavenly Father, it is my eternal wish that **I will make *\n\n*You a vital part of my life. **Amen.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Hebrews 12:5-6 AI",
    "found_reading": true
  },
  {
    "message_id": "17a11b32876252ca",
    "date_utc": "2021-06-15T22:03:12+00:00",
    "subject": "SEEK OUT THOSE IN NEED",
    "verse": "Do not withhold good from those who deserve it when  it is in your power to help them. If you can help your  neighbor now, don’t say, “come back tomorrow, and then I will help you.” (Proverbs 3:27, 28)",
    "reflection": "Withholding good is inconsiderate and unfair, whether\nit is repaying a loan, returning a tool, or fulfilling a\npromise. Withholding destroys trust and creates a great\ninconvenience for the other person. Be as eager to do good as you are to have good done to you.",
    "prayer": "Dear Heavenly Father help me become secure in and steady in Your Word as I walk in Your path.",
    "original_content": "message_id: 17a11b32876252ca\nsubject   : Subject: SEEK OUT THOSE IN NEED (Please Read Pro. 3:21-28)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 15 Jun 2021 17:03:12 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*My Verse:*\n\n*Do not withhold good from those who deserve it when *\n\n*it is in your power to help them. If you can help your *\n\n*neighbor now, don’t say, “come back tomorrow, and*\n\n*then I will help you.” *(Pro. 3:27, 28)\n\n\n\n*Today’s Reflection:*\n\nWithholding good is inconsiderate and unfair, whether\n\nit is repaying a loan, returning a tool, or fulfilling a\n\npromise*. *Withholding destroys trust and creates a great\n\ninconvenience for the other person. *Be as eager to do*\n\n*good as you are to have good done to you**.*\n\n* Pastor Sather*\n\n*Dear Heavenly Father help me become secure in*\n\n*and steady in Your Word** as I walk in Your path*.\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 3:21-28",
    "found_reading": true
  },
  {
    "message_id": "17a1710ddd56ec73",
    "date_utc": "2021-06-16T23:03:39+00:00",
    "subject": "FIVE DON'TS",
    "verse": "Do not plot against your neighbors; don't copy their ways. Do not make accusations against someone who hasn't wronged you. do not envy evil people; do not copy their ways. (Proverbs 3:29-31)",
    "reflection": "Romans 12:18 tells us, we are to do our part to live in peace with everyone, as far as possible. We should never envy evil people, even though some may be extremely popular, or extremely rich. No matter how much they have, it will fade and vanish like grass that withers and dies. those who follow God live differently from the wicked, and in the end, will have treasures in heaven.",
    "prayer": "Dear Lord help me remain faithful so that I will receive the eternal price.",
    "original_content": "message_id: 17a1710ddd56ec73\nsubject   : Subject: FIVE DON'TS (Read Pro. 3:29-36)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 16 Jun 2021 18:03:39 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*My Verse:*\n*Do not* plot against your neighbors; *don't cop*y their ways.\n*Do not* make accusations against someone who hasn't\nwronged you. *do not* envy evil people; *do not *copy their\nways. (Pro. 3:29-31)\n\n*Today's Reflection:*\nRo. 12:18 tells us, we are to do our part to live in peace\nwith everyone, as far as possible. We should never envy\nevil people, even though some may be extremely popular,\nor extremely rich. No matter how much they have, it will\nfade and vanish like grass that withers and dies. those\nwho follow God live differently from the wicked, and in the\nend, will have treasures in heaven.\n*Pastor Sather*\n*Dear Lord help me remain faithful so that I will receive*\n*the eternal price. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 3:29-36",
    "found_reading": true
  },
  {
    "message_id": "17a1bc879f74774e",
    "date_utc": "2021-06-17T21:02:41+00:00",
    "subject": "A FATHER'S WISE ADVICE",
    "verse": "My father told me, “Take my words to heart. Follow my instructions and you will live. (Proverbs 4:4)",
    "reflection": "One of the greatest responsibilities of parents is to\nencourage their children to become wise. Here Sol omon tells how his father, David, encouraged him\nto seek wisdom when he was young see (I kings\n2:1-9)\nfor David’s charge to his son. This encourage ment may have prompted Solomon to ask God for\nan understanding mind above everything else (I\nKings 3:9). Wisdom can be passed from parents\nto children, from generation to generation. Ultim ately, of course, all wisdom comes from God,\nparents can only urge their children to turn to Him.\nIf your parent never taught you in this way, you\ncan learn from the Scriptures, and then create a\nlegacy of wisdom as you teach your own children.",
    "prayer": "Forgive me for missing this opportunity, please give me the opportunity to make this correction with my grandchildren. Amen.",
    "original_content": "message_id: 17a1bc879f74774e\nsubject   : Subject: A FATER'S WISE ADVICE\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 17 Jun 2021 16:02:41 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Subject: A FATHER’S WISE ADVICE *\n\n*Please read* (Pro. 4:1-4)\n\n*My Verse: *\n\n*My father told me, “Take my words to heart. Follow*\n\n*my instructions and you will live. *(Pro. 4:4)\n\n\n\n*Today’s Reflection:*\n\nOne of the greatest responsibilities of parents is to\n\nencourage their children to become wise. Here Sol-\n\nomon tells how his father, David, encouraged him\n\nto seek wisdom when he was young see (I kings\n\n2:1-9) for David’s charge to his son. This encourage-\n\nment may have prompted Solomon to ask God for\n\nan understanding mind above everything else (I\n\nKings 3:9). Wisdom can be passed from parents\n\nto children, from generation to generation. Ultim-\n\nately, of course, all wisdom comes from God,\n\nparents can only urge their children to turn to Him.\n\nIf your parent never taught you in this way, you\n\ncan learn from the Scriptures, and then create a\n\nlegacy of wisdom as you teach your own children.\n\n*Pastor Sather*\n\n*Forgive me for missing this opportunity, please *\n\n*give me the opportunity to make this correction*\n\n*with my grandchildren. **Amen.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 22:6 AI",
    "found_reading": true
  },
  {
    "message_id": "17a20fc1fca77004",
    "date_utc": "2021-06-18T21:17:12+00:00",
    "subject": "LET IT BE YOUR FIRST CHOICE",
    "verse": "Getting wisdom is the most important thing you can do! And whatever else you do, get good judgment. \n(Proverbs 4:7)",
    "reflection": "If you want wisdom, you must decide to go after it.\nIt takes resolve-a determination not to abandon the\nsearch once you begin, no matter how difficult the\nroad may become. This is not a-once-in-a-life-time\nstep, but a daily process of choosing between two\npaths the wicked (Proverbs 4:14- 17, 19) and the right eous (4: 18). Nothing else is more important or more\nvaluable.",
    "prayer": "Dear Heavenly Father as You well know, too often we have sought to find riches instead wisdom for this we ask Your forgiveness...Amen.",
    "original_content": "message_id: 17a20fc1fca77004\nsubject   : Subject: LET IT BE YOUR FIRST CHOICE (Please Read Pro. 4:5-9)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 18 Jun 2021 16:17:12 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*My Verse:*\n\n*Getting wisdom is the most important thing you can*\n\n* do! And whatever else you do, get good judgement. *\n\n(Pro. 4:7)\n\n\n\n*Today’s Reflection:*\n\nIf you want wisdom, you must decide to go after it.\n\nIt takes resolve—a determination not to abandon the\n\nsearch once you begin, no matter how difficult the\n\nroad may become. This is not a-once-in-a-life-time\n\nstep*,* but a daily process of choosing between two\n\npaths*—*the wicked (Pro. 4:14*—*17, 19) and the right-\n\neous (4: 18)*.* Nothing else is more important or more\n\nvaluable.\n\n*Pastor Sather*\n\n*Dear Heavenly Father as You well know, too often*\n\n*we have sought to find riches instead wisdom for *\n\n*this we ask Your forgiveness…**Amen.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 4:5-9",
    "found_reading": true
  },
  {
    "message_id": "17a25f44efb2174a",
    "date_utc": "2021-06-19T20:26:46+00:00",
    "subject": "IMPORTANCE OF WISE JUDGEMENT",
    "verse": "Do not do as the wicked do, or follow the path of evil- doers.\nAvoid their haunts. Turn away and go some- where  else, for evil people cannot sleep until they have done their evil deed for the day, (Proverbs 4:14-16a) ",
    "reflection": "Even friends can make you fall. It is difficult for people\nto accept the fact that friends and acquaintance may lure\nthem to do wrong. Young people want to be accepted, so\nthey would never confront or criticize a friend for wrong\nplans or actions. Many other people can’t see how their\nfriend’s actions could lead to trouble. While we should\nbe accepting of others, we need a healthy skepticism\nabout human behavior. When you feel yourself being\nheavily influenced, proceed with caution. Don’t let your\nfriends cause you to fall into sin.",
    "prayer": "Dear Heavenly Father I pray that I may glean true wisdom while choosing new friends. . . Amen",
    "original_content": "message_id: 17a25f44efb2174a\nsubject   : Subject: IMPORTANCE OF WISE JUDGEMENT (Please Read Pro. 4:10-17)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 19 Jun 2021 15:26:46 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*My Verses:*\n\n*Do not do as the wicked do, or follow the path of evil-*\n\n*doers. Avoid their haunts. Turn away and go some-*\n\n*where* *else, for evil people cannot sleep until they have*\n\n*done their evil deed for the day, *(Pro. 4:14-16a)\n\n\n\n*Today’s Reflection:*\n\nEven friends can make you fall. It is difficult for people\n\nto accept the fact that friends and acquaintance may lure\n\nthem to do wrong. Young people want to be accepted, so\n\nthey would never confront or criticize a friend for wrong\n\nplans or actions. Many other people can’t see how their\n\nfriend’s actions could lead to trouble. While we should\n\nbe accepting of others, we need a healthy skepticism\n\nabout human behavior. When you feel yourself being\n\nheavily influenced, proceed with caution. Don’t let your\n\nfriends cause you to fall into sin.\n\n*Pastor Sather*\n\n*Dear Heavenly Father I pray that I may glean true*\n\n*wisdom while choosing new friends. . . **Amen*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 4:10-17",
    "found_reading": true
  },
  {
    "message_id": "17a2ad52fa510e71",
    "date_utc": "2021-06-20T19:10:52+00:00",
    "subject": "SET BOUNDARIES",
    "verse": "Look straight ahead, and fix your eyes on what lies before you. Mark out a straight path for you feet; then stick to the path and stay safe. (Proverbs 4: 25, 26)",
    "reflection": "Our heart our feelings of love and desire dictates\nto a great extent how we live because we always find\ntime to do what we enjoy. Solomon tells us to guard\nour heart above all else, making sure we concentrate\non those desires that will keep us on the right path.\nMake sure your affection lead you in the right dir section. Put boundaries on your desires. Don’t go after everything you see. Look straight ahead, keep your\neyes fix on your goal, and don’t get side tracked\non detours that lead to sin. . .",
    "prayer": "Dear Lord you know my every weakness, so You will hear me continuously make this request, keep me from falling into sin. . . Amen.",
    "original_content": "message_id: 17a2ad52fa510e71\nsubject   : Subject: SET BOUNDARIES (Please Read Pro. 4:23-27)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 20 Jun 2021 14:10:52 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*My Verses:*\n\n*Look straight ahead, and fix your eyes on what lies*\n\n*before you. Mark out a straight path for you feet;*\n\n*then stick to the path and stay safe. *(Pro. 4: 25, 26)\n\n\n\n*Todays Reflection:*\n\nOur heart*—*our feelings of love and desire*—*dictates\n\nto a great extent how we live because we always find\n\ntime to do what we enjoy*.* Solomon tells us to guard\n\nour heart above all else*, *making sure we concentrate\n\non those desires that will keep us on the right path*.*\n\nMake sure your affection lead you in the right dir*-*\n\nection*.* Put boundaries on your desires*. *Don’t go after\n\neverything you see*. *Look straight ahead*, keep *your\n\neyes fix on your goal*,* and don’t get side tracked\n\non detours that lead to sin*. . .*\n\n* Pastor Sather*\n\n*Dear Lord you know my every weakness, so You*\n\n*will hear me continuously make this request,*\n\n*keep me from falling into sin. . . **Amen. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 4:23-27",
    "found_reading": true
  },
  {
    "message_id": "17a30589a241f5e7",
    "date_utc": "2021-06-21T20:52:31+00:00",
    "subject": "THE TRUTH WHEN WISDOM IS APPLIED (please read",
    "verse": "My son, pay attention to my wisdom; listen carefully to my  wise counsel. Then you will learn to be discreet and will store up knowledge. (Proverbs 5:1)",
    "reflection": "The book of Proverbs tells us about people who have wisdom and enjoy its benefits The person who has wisdom - is loving is faithful trusts the Lord puts God first turns away from evil knows right from wrong listens and learns does what is right. The benefits of wisdom - long prosperous life favor with God and people reputation for good judgment success health, vitality riches, honor, pleasure, peace protection--You must agree wisdom speak volumes",
    "prayer": "Dear Heavenly Father Scriptures tell us all things are possible with You, so, I pray for wisdom from You!",
    "original_content": "message_id: 17a30589a241f5e7\nsubject   : Subject: THE TRUTH WHEN WISDOM IS APPLIED (please read (Pro. 5:1-6)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 21 Jun 2021 15:52:31 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*My Verse:*\n\n*My son, pay attention to my wisdom; listen carefully to my *\n\n*wise counsel. Then you will learn to be discreet and will*\n\n*store up knowledge. *(5:1)\n\n\n\n*Today’s Reflection:*\n\nThe book of Proverbs tells us about people who have wisdom\n\nand enjoy its benefits*—**The person who has **wisdom**—*\n\nis loving*—*is faithful*—*trusts the Lord*—*puts God first*—*\n\nturns away from evil*—*knows right from wrong*—*\n\nlistens and learns*—*does what is right.\n\n*The benefits of wisdom**—**long prosperous life—favor *\n\n*with God and people—reputation for good judgement—*\n\n*success—health, vitality—riches, honor, pleasure, peace—*\n\n*protection--You must agree wisdom speak volumes*\n\n*Pastor Sather*\n\n*Dear Heavenly Father Scriptures tell us all things are*\n\n*possible with You, so, I pray for wisdom from You! *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 5:1-6",
    "found_reading": true
  },
  {
    "message_id": "17a356f4f86ed6d2",
    "date_utc": "2021-06-22T20:35:25+00:00",
    "subject": "IF ONLY I HAD!",
    "verse": "Oh why didn’t I listen to my teachers? Why didn’t I pay  attention to those who gave me instruction? (Proverbs 5:13)",
    "reflection": "At the end of our life, it will be to late to ask for advice.\nWhen desire is fully activated, people don’t want advice they want satisfaction. The best time to learn the dangers\nof foolishness, of going after forbidden sex (or anything\nelse that is harmful) is long before temptation comes.\nResistance is easier if the decision has already been\nmade.\nDon’t wait to see what happens. Prepare for temp station by deciding now how you will act when you face it.",
    "prayer": "Dear heavenly Father, I pray that I will always follow Your Holy Spirit’s guidance. Amen.",
    "original_content": "message_id: 17a356f4f86ed6d2\nsubject   : Subject: IF ONLY I HAD! (please read Pro. 5:11-14)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 22 Jun 2021 15:35:25 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*My Verse:*\n\n*Oh why didn’t I listen to my teachers? Why didn’t I pay *\n\n*attention to those who gave me instruction? *(Pro. 5:13)\n\n\n\n*Today’s Reflection:*\n\nAt the end of our life, it will be to late to ask for advice.\n\nWhen desire is fully activated, people don’t want advice—\n\nthey want satisfaction. The best time to learn the dangers\n\nof foolishness, of going after forbidden sex (or anything\n\nelse that is harmful) is long before temptation comes.\n\nResistance is easier if the decision has already been\n\nmade. Don’t wait to see what happens. Prepare for temp-\n\ntation by deciding now how you will act when you face it.\n\n* Pastor Sather*\n\n*Dear heavenly Father, I pray that I will always follow*\n\n*Your Holy Spirit’s guidance. **Amen. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 5:11-14",
    "found_reading": true
  },
  {
    "message_id": "17a3ab9f7d8c313a",
    "date_utc": "2021-06-23T21:15:04+00:00",
    "subject": "Message: TO MARRIED COUPLES",
    "verse": "Drink water from your own well— share your love only with your wife. (  Proverbs 5:15)",
    "reflection": "God never intended that marriage become boring,\nlifeless, pleasureless, and dull. Sex is a gift God\ngives to married people for their mutual enjoyment\nReal happiness comes when we decide to find plea Sure in the spouse God has given us and to commit\nourselves to meeting his or her needs.The real danger\nis in doubting that God knows And cares for us. We\nthen may resent His timing and carelessly pursue sex tual pleasure without His blessing.",
    "prayer": "Dear Lord help us to always respect the gift You have blessed us with, we thank You for understand ing our every need.",
    "original_content": "message_id: 17a3ab9f7d8c313a\nsubject   : Message: TO MARRIED COUPLES (Please Read Pro. 5:15-23)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 23 Jun 2021 16:15:04 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*MY Verse:*\n\n*Drink water from your own well—share your love*\n\n*only with your wife. *( Pro 5:15)\n\n\n\n*Today’s Reflection:*\n\nGod never intended that marriage become boring,\n\nlifeless*,* pleasureless*, *and dull. Sex is a gift God\n\ngives to married people for their mutual enjoyment\n\nReal happiness comes when we decide to find plea-\n\nSure in the spouse God has given us and to commit\n\nourselves to meeting his or her needs.The real danger\n\nis in doubting that God knows And cares for us*. *We\n\nthen may resent His timeing and carelessly pursue sex-\n\ntual pleasure without His blessing.\n\n*Pastor Sather*\n\n*Dear Lord help us to always respect the gift You*\n\n*have blessed us with, we thank You for understand-*\n*ing our every need.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 5:15-23",
    "found_reading": true
  },
  {
    "message_id": "17a5a11491331357",
    "date_utc": "2021-06-29T23:18:40+00:00",
    "subject": "WISDOM CALLS FOR HEARING",
    "verse": "I, Wisdom, live together with good judgment. I know where to discover knowledge and discernment. All who fear the Lord will hate evil. That is why I hate pride,  arrogance, corruption, and perverted speech. (Proverbs 8:12-13)",
    "reflection": "The more a person fears and respects God, the more he\nor she will hate evil. Love for God and love for sin can not coexist. Harboring secret sins means that you are tolerating evil within yourself.",
    "prayer": "Dear Heavenly Father, help me make a clean break, with sin so that I can commit myself completely to You. Amen.",
    "original_content": "message_id: 17a5a11491331357\nsubject   : Subject: WISDOM CALLS FOR HEARING (Please read Pro. 8:12-16)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 29 Jun 2021 18:18:40 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*My Verses:*\n\n*I, Wisdom, live together with good judgement. I know*\n\n*where to discover knowledge and discernment. All who*\n\n* fear the Lord will hate evil. That is why I hate pride, *\n\n*arrogance, corruption, and perverted speech.* (Pro. 8:12-13)\n\n\n\n*Today’s Reflection:*\n\nThe more a person fears and respects God, the more he\n\nor she will hate evil. Love for God and love for sin can-\n\nnot coexist. Harboring secret sins means that you are\n\ntolerating evil within yourself.\n\n* Pastor Sather*\n\n*Dear Heavenly Father, help me make a clean break,*\n\n*with sin so that I can commit myself completely to You. *\n\n*Amen. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 8:12-16",
    "found_reading": true
  },
  {
    "message_id": "17a073a4843dbe04",
    "date_utc": "Sun, 13 Jun 2021 16:14:58 -0500",
    "subject": "WORK TO ACCOMPLISH HIS WILL (Please Read Proverbs 3:7-10)",
    "verse": "Don't be impressed with your own wisdom. Instead, fear the Lord, and turn your back on evil. (Proverbs 3:7)",
    "reflection": "Solomon has said more than once in Scriptures, \"We must seek God's will in all we do. This means turning every area of our life over to Him. We need to make Him a vital part of everything we do, then He will guide us, because we will be working to accomplish His purpose. What do you present to God--for your sins or what kind of plea for His forgiveness?",
    "prayer": "Dear Heavenly Father, help me to be a better manager of the many blessings you have showered upon me. Amen.",
    "original_content": "*My Verse:*\n*Don't be impressed with your own wisdom. Instead, fear the Lord,*\n*and turn your back on evil. *(Pro. 3:7)\n\n*Today's Reflection:*\nSolomon has said more than once in Scriptures, \"We must seek God's\nwill in all we do. *This means* turning *every *area of our life over to\nHim. We need to make Him a vital part of everything we do, then He\nwill guide us, because we will be working to accomplish His purpose.\nWhat do you present to God--for your sins *or* what kind of plea for His\nforgiveness?\n*Pastor Sather*\n*Dear Heavenly Father, help me to be a better manager of the many *\n*blessings you have showered upon me. Amen.*",
    "original_content_flat": "My Verse: Don't be impressed with your own wisdom. Instead, fear the Lord, and turn your back on evil. (Pro. 3:7) Today's Reflection: Solomon has said more than once in Scriptures, \"We must seek God's will in all we do. This means turning every area of our life over to Him. We need to make Him a vital part of everything we do, then He will guide us, because we will be working to accomplish His purpose. What do you present to God--for your sins or what kind of plea for His forgiveness? Pastor Sather Dear Heavenly Father, help me to be a better manager of the many blessings you have showered upon me. Amen.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "17a16b8fd8865d64",
    "date_utc": "Wed, 16 Jun 2021 16:27:40 -0500",
    "subject": "Five Don'ts",
    "verse": "Do not plot against your neighbors; don't copy their ways. Do not make accusations against someone who hasn't wronged you.. Do not envy violent people;' do not copy their ways. (Proverbs 3:29-31)",
    "reflection": "Romans 12-18 tells us, we are to do our part to live in peace with everyone, as far as possible. We should never envy evil people even though some may be extremely popular, or extremely rich. No matter how much they have, it will fade and vanish like grass that withers and dies, Those who follow God live differently from the wicked, and in the end, will have treasures in heaven.",
    "prayer": "Dear Lord help me remain faithful so that I will receive the eternal price. Amen.",
    "reading": "Proverbs 3:29-36",
    "original_content": "*Subject: FIVE DON'TS (Read Pro. 3:29-36)*\n\n\n\n*MY Verses:*\n\n*Do not** plot against your neighbors; don't copy their ways.*\n\n*Do no**t make accusations against someone who hasn't *\n\n*wronged you.. Do not envy violent people;' do not copy *\n\n*their ways. (Pro. 3:29-31)*\n\n\n\n*Today's Reflection:*\n\nRo. 12 18 tells us, we are to do our part to live in peace\n\nwith everyone, as far as possible. We should *never* envy\n\nevil people even though some may be extremely popular,\n\nor extremely rich. No matter how much they have, it will\n\nfade and vanish like grass that withers and dies, Those\n\nwho follow God live differently from the wicked, and in\n\nthe end, will have treasures in heaven.\n\n* Pastor Sather*\n\n*Dear Lord help me remain faithful so that I will receive*\n\n*the eternal price.*",
    "original_content_flat": "Subject: FIVE DON'TS (Read Pro. 3:29-36) MY Verses: Do not plot against your neighbors; don't copy their ways. Do not make accusations against someone who hasn't wronged you.. Do not envy violent people;' do not copy their ways. (Pro. 3:29-31) Today's Reflection: Ro. 12 18 tells us, we are to do our part to live in peace with everyone, as far as possible. We should never envy evil people even though some may be extremely popular, or extremely rich. No matter how much they have, it will fade and vanish like grass that withers and dies, Those who follow God live differently from the wicked, and in the end, will have treasures in heaven. Pastor Sather Dear Lord help me remain faithful so that I will receive the eternal price.",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": true
  }
]