[
  {
    "message_id": "170936c45d4b564b",
    "date_utc": "2020-03-01T00:08:31+00:00",
    "subject": "A THOROUGH AND COMPLETE SEARCH",
    "verse": "Search me, O God, and know my heart; test me and know my thoughts. Point out anything in me that offends You, and lead me along the path of ever- lasting life. (Psalm 139:23-24)",
    "reflection": "Sometimes we think we see the whole picture, but in reality we need someone to help us see those things we cannot see. Oftentimes in my prayers, I ask Jesus to reveal those things in me that are unpleasing in His sight, those things I cannot see. It is important to me that my thoughts and actions are pleasing in His sight. Jesus alone can test our thoughts and shape our heart to look like His.",
    "prayer": "Holy God, open our eyes to see ourselves as You see us, and grant us the humility to seek Your guidance in revealing our hidden faults. Shape our hearts and minds to reflect Your character, that we may live in a way that is pleasing to You. (AI)",
    "original_content": "message_id: 170936c45d4b564b\nsubject   : Subject: A THOROUGH AND COMPLETE SEARCH (3-1-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 29 Feb 2020 18:08:31 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\nToday’s Verse:\nSearch me, O God, and know my heart; test me and\nknow my thoughts. Point out anything in me that\noffends You, and lead me along the path of ever-\nlasting life. (Ps. 139:23-24)\n\nToday’s Reflection:\nSometimes we think we see the whole picture, but in\nreality we need someone to help us see those things\nwe cannot see. Oftentimes in my prayers, I ask Jesus\nto reveal those things in me that are unpleasing in His\nsight, those things I cannot see. It is important to me\nthat my thoughts and actions are pleasing in His sight.\nJesus alone can test our thoughts and shape our\nheart to look like His.\nPastor Al\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 3:5-6 AI",
    "found_reading": true
  },
  {
    "message_id": "17098a0c16f8fc2c",
    "date_utc": "2020-03-02T00:23:57+00:00",
    "subject": "TIME TO REJOICE",
    "verse": "This is the day that the Lord has made. Let us  rejoice and be glad in it! (Psalm 118:24) ",
    "reflection": "Wouldn’t be great if we could feel enthusiastic every\nday?\nI think we’ve all had days that we did not feel\nlike rejoicing. Our mood was down, our situation was\nout of hand, and our sorrow or guilt was overwhelming.\nWhen you don’t feel like rejoicing. Tell God how you\ntruly feel. You will find that God will give you some thing to rejoice about. God has given you this day to live and serve Him-be glad!",
    "prayer": "Gracious God, even when our hearts are heavy and we struggle to find joy, help us to be honest with You about our feelings and trust that You will reveal reasons to rejoice. May we embrace each day as a gift from You, finding purpose and gladness in serving You. (AI)",
    "original_content": "message_id: 17098a0c16f8fc2c\nsubject   : Subject: TIME TO REJOICE (3-2-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 1 Mar 2020 18:23:57 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*This is the day that the Lord has made. Let us *\n\n*rejoice **and be glad in it! *(Ps. 118:24)\n\n\n\n*Today’s Reflection:*\n\nWouldn’t be great if we could feel enthusiastic every\n\nday? I think we’ve all had days that we did not feel\n\nlike rejoicing. Our mood was down, our situation was\n\nout of hand, and our sorrow or guilt was overwhelming.\n\nWhen you don’t feel like rejoicing. Tell God how you\n\ntruly feel. You will find that God will give you some-\n\nthing to rejoice about*. God has given you* *this day to *\n\n*live and serve Him—be glad!*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Philippians 4:4 AI",
    "found_reading": true
  },
  {
    "message_id": "1709de3503ca6a45",
    "date_utc": "2020-03-03T00:54:45+00:00",
    "subject": "PURE UNQUESTIONABLE HUMILITY",
    "verse": "He must increase, but I must decrease. (John 3:30) ",
    "reflection": "John’s willingness to decrease in importance shows unusual humility.\nPastor, (yes pastors) and other Christian leaders can be tempted to focus more on the success of their ministries than on Christ. Beware of those who put more emphasis on on their own achievements than on God’s Kingdom. If you find that you have a problem with pride, pray this prayer. Jesus, release me from all personal ambitions and selfish motives.",
    "prayer": "Lord Jesus, help us to emulate John's humility and decrease our own importance so that You may increase in our lives and ministries. Release us from personal ambitions and selfish motives, focusing our hearts solely on advancing Your Kingdom rather than our own achievements. (AI)",
    "original_content": "message_id: 1709de3503ca6a45\nsubject   : Subject: PURE UNQUESTIONABLE HUMILITY (3-3-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 2 Mar 2020 18:54:45 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*He must increase, but I must decrease. *(Jn. 3:30)\n\n\n\n*Today’s Reflection:*\n\nJohn’s willingness to decrease *in* importance shows unusual humility.\nPastor, (yes pastors) and other Christian leaders can be tempted to focus\nmore on the success of their ministries than on Christ. Beware of those who\nput more emphasis on on their own achievements than on God’s Kingdom. If\nyou find\n\nthat you have a problem with pride, pray this prayer.\n\n*Jesus, release me from all personal ambitions and selfish **motives.*\n\n* Pastor Al *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Philippians 2:3-4 AI",
    "found_reading": true
  },
  {
    "message_id": "170a28d144931afa",
    "date_utc": "2020-03-03T22:38:40+00:00",
    "subject": "AMAZING PRAYER!",
    "verse": "Ask, and it shall be given to you; seek, and you shall find;\nknock, and it shall be opened to you. (Matthew 7:7)",
    "reflection": "I believe that miracles happen every day, and Jesus knows what I need before I make my requests, BUT I’m still required to pray.\nHave you ever wondered why? It is to open ourselves up to a personal relationship with the Savior. As I make bold requests from the Lord, I boldly receive His abundance and provisions for family, friends, and myself. So why don't we all come boldly to the throne of grace each morning?",
    "prayer": "Almighty God, open our hearts to seek You daily in prayer, deepening our relationship with You and boldly receiving Your abundant provisions. Help us to approach Your throne of grace with confidence, knowing that You hear us and desire to bless us and those we love. (AI)",
    "original_content": "message_id: 170a28d144931afa\nsubject   : Subject: AMAZING PRAYER! (3-4-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 3 Mar 2020 16:38:40 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Ask, and it shall be given to you; seek, and you shall*\n\n*find; knock, and it shall be opened to you. *(Mat. 7:7)\n\n\n\n*Today’s Reflection:*\n\nI believe that miracles happen every day, and Jesus knows what I need\nbefore I make my requests, BUT\n\nI’m still required to pray. Have you ever wondered\n\nwhy? It is to open ourselves up to a personal relationship with the Savior.\nAs I make bold requests from the Lord,\n\nI boldly receive His abundance and provisions for family, friends, and\nmyself. *So why don't we all c**ome boldly to **the throne of grace each\nmorning?*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Hebrews 4:16 AI",
    "found_reading": true
  },
  {
    "message_id": "170a81141baf431f",
    "date_utc": "2020-03-05T00:21:08+00:00",
    "subject": "THE HEAVENLY BENEFITS",
    "verse": "You will show me the way of life, granting me the joy of Your presence and the pleasures of living with You forever. (Psalm 16:11)",
    "reflection": "The joys and benefits of a life lived in companion ship with God are beyond human comprehension. And the greatest thing of all is, these benefits are now and forever.\nI think that to often we read verses and don’t stop and really think about what the verse has really revealed. So let’s give this some time to soak in. What are the benefits?\nI believe He is offering a structure, open to\nheaven, framing our pathway home in a way that adds clarity, beauty and a hint of greatness. But He still allows room for natural growth already in progress. It’s all about the on-the-way-there moments. Is Jesus smiling down on you today and saying, Thanks For Following Me!",
    "prayer": "Loving God, we thank You for the incomprehensible joys and benefits of walking with You, both now and for eternity. Help us to fully appreciate Your presence in our lives, recognizing the beauty and clarity You bring to our journey as we follow Jesus. (AI)",
    "original_content": "message_id: 170a81141baf431f\nsubject   : Subject: THE HEAVENLY BENEFITS (3-5-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 4 Mar 2020 18:21:08 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*You will show me the way of life, granting me the joy **of Your presence\nand the pleasures of living with You **forever. *(Ps. 16:11)\n\n\n\n*Today’s Reflection:*\n\nThe joys and benefits of a life lived in companion-\n\nship with God are beyond human comprehension. And the greatest thing of all\nis, these benefits are now and forever. I think that to often we read\nverses and don’t stop and really think about what the verse has really\nrevealed. So let’s give this some time to soak in. What are the benefits? I\nbelieve He is offering a structure, open to\n\nheaven, framing our pathway home in a way that adds clarity, beauty and a\nhint of greatness. *But *\n\nHe still allows room for natural growth already in progress. It’s all about\nthe on-the-way-there moments. *Is Jesus **smiling down on you today and\nsaying, Thanks For **Following Me**!*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "John 15:11 AI",
    "found_reading": true
  },
  {
    "message_id": "170ad64275a6de11",
    "date_utc": "2020-03-06T01:09:47+00:00",
    "subject": "LIVING IN READINESS",
    "verse": "Be dressed for service. . . . Be like people waiting for  the master to come home. (Luke 12:35—36)",
    "reflection": "From the context of this passage, it’s obvious “dressed” doesn’t mean wearing an apron at all times or dressing in what used to be called our “Sunday best” in case Jesus returns before our next breath. But it seems clear He meant it to include anytime He calls on us, not just when He calls us home. Let us spend time today considering how we can be royal-ready for whatever He requires.",
    "prayer": "Holy God, help us to be prepared in spirit and action for Your call at any moment, living with purpose and readiness to serve You. May we clothe ourselves in righteousness and be ever-vigilant for opportunities to fulfill Your will. (AI)",
    "original_content": "message_id: 170ad64275a6de11\nsubject   : Subject: LIVING IN READINESS (3-6-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 5 Mar 2020 19:09:47 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Be dressed for service. . . . Be like people waiting for *\n\n*t**he master to come home. *(Lk. 12:35—36)\n\n\n\n*Today’s Reflection:*\n\nFrom the context of this passage, it’s obvious “dressed”\n\ndoesn’t mean wearing an apron at all times *or* dressing\n\nin what used to be called our “Sunday best” in case Jesus\n\nreturns before our next breath. But it seems clear He\n\nmeant it to include anytime He calls on us, not just when\n\nHe calls us home. *Let us spend time today*\n\n*considering how we can be royal-ready for what**ever *\n\n*He requires.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 24:44 AI",
    "found_reading": true
  },
  {
    "message_id": "170b249f5469e3fd",
    "date_utc": "2020-03-06T23:59:16+00:00",
    "subject": "HONEST EVALUATION",
    "verse": "Two men went up to the temple to pray, one a Pharisee and the other a tax collector. The Pharisee stood by himself and prayed, “God I thank You that I am not like other people—robbers, evildoers, adulterers—or even like this tax-collector. (Luke 18:10-11)",
    "reflection": "Like the pharisee, we can be influenced by mixed\nemotions in our daily lives: pride, fear, winning the praise of people, or a desire to control. We can often do the right things for the wrong reasons. Jesus challenges us to go deeper. To make choices motivated by trust and love. At times, He will encourage us to step forward boldly. Other times He will call us to step back and rest. Both actions require trust and an honest evaluation of our selves.",
    "prayer": "Gracious God, help us to examine our hearts and motivations, that we may act from a place of genuine trust and love rather than pride or fear. Guide us to discern when to step forward boldly and when to rest, always seeking to align our choices with Your will. (AI)",
    "original_content": "message_id: 170b249f5469e3fd\nsubject   : Subject: HONEST EVALUATION (3-7-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 6 Mar 2020 17:59:16 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Two men went up to the temple to pray, one a Pharisee **and the other a\ntax collector. The Pharisee stood by **himself and prayed, “God I thank You\nthat I am not **like other people—robbers, evildoers, adulterers—or **even\nlike this tax-collector. *(Lk. 18:10-11)\n\n\n\n*Today’s Reflection:*\n\nLike the pharisee, we can be influenced by mixed\n\nemotions in our daily lives: pride, fear, winning\n\nthe praise of people, or a desire to control. We can often do the\n*right *things\nfor the *wrong *reasons. Jesus challenges us to go deeper. To make choices\nmotivated by trust and love. At times, He will encourage us to step forward\nboldly. Other times He will call us to step back and rest. *Both actions\nrequire trust and an honest evaluation of our-*\n\n*selves.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "James 4:6 AI",
    "found_reading": true
  },
  {
    "message_id": "170b765ea2912ae6",
    "date_utc": "2020-03-07T23:47:55+00:00",
    "subject": "NEVER FEAR",
    "verse": "Jesus asked Simon Peter, “. . . Do you love me  More than these?” (John 21:15)",
    "reflection": "Jesus’s faithful, unchanging nature is a rock-sold\ntruth we can count on. When Jesus invites us by\nsaying, “follow me,” He is also saying, “you can\ncount on Me. The road may be treacherous, but\nI’ll keep you safe. I’ll light the way for you, and\nyou can rely on my strength. I don’t mind carrying\nyou.\nAnd I don’t get distracted, or consumed by\nother issues, or relax my grip on you.”\nRemember Jesus has promised to never leave you or forsake you-What are your vows to Him?",
    "prayer": "Faithful God, as we follow Jesus, strengthen our resolve to remain steadfast in our commitment to Him, just as He is unfailingly devoted to us. Help us to trust in Your guiding light and unwavering support, even when the path seems uncertain. (AI)",
    "original_content": "message_id: 170b765ea2912ae6\nsubject   : Subject: NEVER FEAR (3-8-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 7 Mar 2020 17:47:55 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Jesus asked Simon Peter, “. . . Do you love me *\n\n*More than these?” *(Jn. 21:15)\n\n\n\n*Today’s Reflection:*\n\nJesus’s faithful, unchanging nature is a rock-sold\n\ntruth we can count on. When Jesus invites us by\n\nsaying, “follow me,” He is also saying, “you can\n\ncount on Me. The road may be treacherous, but\n\nI’ll keep you safe. I’ll light the way for you, and\n\nyou can rely on my strength. I don’t mind carrying\n\nyou. And I don’t get distracted, or consumed by\n\nother issues, or relax my grip on you.”\n\n*Remember Jesus has promised to never leave you **or forsake you—What are\nyour vows to Him?*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Hebrews 13:5 AI",
    "found_reading": true
  },
  {
    "message_id": "170c185b6c89812b",
    "date_utc": "2020-03-09T22:58:51+00:00",
    "subject": "LOVE FOR ALL",
    "verse": "Teachers of the religious law asked . . . “Why does He eat with tax collectors and sinners?” When  Jesus heard this, He told them, “Those who are well don’t need a doctor, but the sick do need one.\n(Mark 2:16-17)",
    "reflection": "Jesus spent time with whoever needed or wanted\nto hear the message-poor, rich, bad, and good.\nWe too, must befriend those who need Christ,\neven if they do not seem to be ideal companions.\nAre there people you are neglecting because of\ntheir reputation? They may be the ones who most\nneed to hear and see the message of Christ’s love in and from you. Are you trying the “get a grip” instead of resting in the grip of Jesus.",
    "prayer": "Loving God, help us to follow Jesus' example by embracing all people with compassion, regardless of their status or reputation. May we rest in Your loving embrace and extend that same unconditional love to those around us who need to experience Your grace. (AI)",
    "original_content": "message_id: 170c185b6c89812b\nsubject   : Subject: LOVE FOR ALL (3-10-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 9 Mar 2020 17:58:51 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Teachers of the religious law asked . . . “Why does*\n\n*He eat with tax collectors and sinners?” When *\n\n*Jesus heard this, He told them, “Those who are*\n\n*well don’t need a doctor, but the sick do need one.*\n\n(Mk. 2:16-17)\n\n\n\n*Today’s Reflection:*\n\nJesus spent time with whoever needed or wanted\n\nto hear the message—poor, rich, bad, and good.\n\nWe too, must befriend those who need Christ,\n\neven if they do not seem to be ideal companions.\n\nAre there people you are neglecting because of\n\ntheir reputation? They may be the ones who most\n\nneed to hear and see the message of Christ’s love\n\nin and from you. *Are you trying the “get a grip” instead **of resting* *in\nthe grip of Jesus.*\n\n*Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Luke 15:1-2 AI",
    "found_reading": true
  },
  {
    "message_id": "170c6a7bacb2626e",
    "date_utc": "2020-03-10T22:54:06+00:00",
    "subject": "GIVING HIM HUMBLE THANKS",
    "verse": "Sing and make music from your hear to the Lord always giving thanks to God the Father for every- thing, in the name of our Lord Jesus Christ. (Ephesians 5:19-20)",
    "reflection": "When you feel down, you may find it difficult to give thanks. But take heart-in all things God works for our good if we love him and are called by Him (Romans 8:28). Thank God not for your problems, but for the strength He is building in you through the difficult experiences in your life. You can be sure that God’s perfect love will see your through.",
    "prayer": "Holy God, we thank You not for our trials, but for the strength You are cultivating within us through life's challenges. Help us to trust in Your perfect love and guidance, knowing that You are working all things for our good. (AI)",
    "original_content": "message_id: 170c6a7bacb2626e\nsubject   : Subject: GIVING HIM HUMBLE THANKS (3-11-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 10 Mar 2020 17:54:06 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Sing and make music from your hear to the Lord*\n\n*always **giving thanks to God the Father for every-*\n\n*thing, in the **name of our Lord Jesus Christ.*\n\n(Eph. 5:19-20)\n\n\n*Today’s Reflection:*\n\nWhen you feel down, you may find it difficult to\n\ngive thanks. *But *take heart—in all things God works\n\nfor our good if we love him and are called by Him\n\n(Ro. 8:28). Thank God not for your problems, but\n\nfor the strength He is building in you through the\n\ndifficult experiences in your life. *You can be **sure *\n\n*that **God’s perfect love will see your through.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Colossians 3:16 AI",
    "found_reading": true
  },
  {
    "message_id": "170cbef8523026de",
    "date_utc": "2020-03-11T23:30:37+00:00",
    "subject": "BEING ONE WITH JESUS",
    "verse": "My sheep know my voice; I know them and they follow me.\nI give them eternal life, and they shall never perish; no one will snatch them out of my hand. (John 10:27, 28)",
    "reflection": "Jesus has promised an eternal home to those who become one with Him. A place where we can live within His eternal glory forever. A place where no one can harm us. A place where no one can steal us from the safety of His hand. We have been adopted into a kingdom beyond anything we have\never dreamed possible, where hope and power and love reign. And we need never go hungry or fear again.",
    "prayer": "Eternal God, thank You for the promise of an everlasting home in Your glorious kingdom, where we will dwell secure in Your presence, free from harm and filled with hope, power, and love. May we cling to this assurance as we journey through life, trusting in Your unfailing protection and provision. (AI)",
    "original_content": "message_id: 170cbef8523026de\nsubject   : Subject: BEING ONE WITH JESUS (3-12-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 11 Mar 2020 18:30:37 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse: *\n\n*My sheep know my voice; I know them and they follow **me. I give them\neternal life, and they shall never perish; **no one will snatch them out of\nmy hand. *(Jn. 10:27, 28)\n\n\n\n*Today’s Reflection:*\n\nJesus has promised an eternal home to those who become one with Him. A\nplace where we can live within His eternal glory forever. A place where\n\nno one can harm us. A place where no one can steal us from the safety of\nHis hand. We have been\n\nadopted into a kingdom beyond anything we have\n\never dreamed possible, where hope and power and love reign. *And we need\nnever go hungry or fear again.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Revelation 7:16-17 AI",
    "found_reading": true
  },
  {
    "message_id": "170d0f637af35342",
    "date_utc": "2020-03-12T22:56:02+00:00",
    "subject": "A LOOSE TONGUE",
    "verse": "The tongue is a flame of fire. It is full of wickedness that can ruin your whole life. It can turn the entire course of your whole life into a blazing flame of destruction, for it is set on fire by hell itself.\n(James 3:6)",
    "reflection": "James says, the source of the wicked tongue comes from hell itself. Satan uses the tongue to divide people and pit themselves against one another. Idle and hateful words are damaging because they spread destruction quickly, and no one can stop the results once they are spoken. We dare not be careless with what we say, thinking we can apologize latter, because even if we do, the scares remain. Before we speak remember words are like fire-you can neither control or reverse the damage they can do.",
    "prayer": "Gracious God, help us to guard our tongues and speak with wisdom and kindness, recognizing the power of our words to build up or tear down. May we be mindful of the lasting impact of our speech and use it to spread love and unity rather than division and destruction. (AI)",
    "original_content": "message_id: 170d0f637af35342\nsubject   : Subject: A LOOSE TONGUE (3-13-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 12 Mar 2020 17:56:02 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*The tongue is a flame of fire. It is full of wickedness*\n\n*that can ruin your whole life. It can turn the entire*\n\n*course of your whole life into a blazing flame of*\n\n*destruction, for it is set on fire by hell itself.*\n\n(Jm. 3:6)\n\n\n\n*Today’s Reflection:*\n\nJames says, the source of the wicked tongue comes from hell itself. *Satan\n*uses the tongue to divide people and pit themselves against one another.\nIdle and hateful words are damaging because they spread destruction\nquickly, and no one can stop the results once they are spoken. We dare not\nbe careless with what we say, thinking we can apologize latter, because\neven if we do, the scares remain. *Before **we speak* *remember words are\nlike fire—you **can neither* *control or reverse the damage they **can do.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 18:21 AI",
    "found_reading": true
  },
  {
    "message_id": "170d619ddc47ab4d",
    "date_utc": "2020-03-13T22:53:04+00:00",
    "subject": "THE DIVIDING LINE",
    "verse": "I know your deeds, that they are neither cold nor hot. I wish you were one or the other! So, because you are lukewarm—neither hot nor cold—I am about to spit you out of my mouth. (Revelation 3:15-16)",
    "reflection": "Today we see lines everywhere. They are in parking lots, at intersections, baseball diamonds, basketball courts, and football fields. Lines can be very important. They help us know where we stand. Jesus too, drew a line when He called those from the multitude to follow Him. Jesus’ words make a very perfect line: either you are for Christ or you are against Him. That same line exists today. We must decide on which side of the line we will stand. There is no middle ground with the Lord. If fact, for those who try, it makes Him sick to His stomach. “He will spit them out.” A lot of people want to serve God, BUT only on an advisory capacity.",
    "prayer": "Faithful God, help us to stand firmly on Your side of the line, committing ourselves fully to following Jesus without hesitation or compromise. May we serve You wholeheartedly, not merely as advisors but as devoted disciples. (AI)",
    "original_content": "message_id: 170d619ddc47ab4d\nsubject   : Subject: THE DIVIDING LINE (3-14-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 13 Mar 2020 17:53:04 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*I know your deeds, that they are neither cold nor hot. I **wish you were\none or the other! So, because you are **lukewarm—neither hot nor cold—I am\nabout to spit you **out of my mouth. *(Rev. 3:15-16)\n\n\n\n*Today’s Reflection:*\n\nToday we see lines everywhere. They are in parking lots, at intersections,\nbaseball diamonds, basketball courts, and football fields. Lines can\n\nbe very important. They help us know where we stand. Jesus too, drew a line\nwhen He called those from the multitude to follow Him. Jesus’ words make a\nvery perfect line: either you are for Christ or you are against Him. That\nsame line exists today. We must decide on which side of the line\n\nwe will stand. There is no middle ground with the Lord. If fact, for those who\ntry, it makes Him sick to His stomach. “He will spit them out.”\n\n*A lot of people want to serve God, BUT only*\n\n*on an advisory capacity. *\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 12:30 AI",
    "found_reading": true
  },
  {
    "message_id": "170db6f4693a4c91",
    "date_utc": "2020-03-14T23:44:28+00:00",
    "subject": "A FAITHFUL SHEPHERD",
    "verse": "He call’s His own sheep by name and leads them out. After He has gather His own flock, He walks ahead of them, and they follow Him because they know His voice. (John 10:3-4)",
    "reflection": "Everything changes when we regard Jesus as our shepherd. He protect, guides, and provides for us. Knowing that we don’t need to fend for ourselves floods us with a sense of security, thus we find peace. Read Psalm 23 as a prayer to Jesus.\nVerses one and two might sound like this: ”Jesus, you’re my Shepherd and provide everything I need. Thanks for letting me rest in green meadows and leading me beside peaceful streams.",
    "prayer": "Lord Jesus, as our Good Shepherd, we thank you for your constant protection, guidance, and provision in our lives. Help us to find true peace and security in your loving care, resting in the green meadows and peaceful streams of your presence. (AI)",
    "original_content": "message_id: 170db6f4693a4c91\nsubject   : Subject: A FAITHFUL SHEPHERD (3-15-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 14 Mar 2020 18:44:28 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*He call’s His own sheep by name and leads them out. **After He has gather\nHis own flock, He walks ahead **of them, and they follow Him because they\nknow His **voice. *Jn. 10:3—4)\n\n\n\n*Today’s Reflection:*\n\nEverything changes when we regard Jesus as our shepherd. He protect,\nguides, and provides for us. Knowing that we don’t need to fend for\nourselves floods us with a sense of security, thus we find peace. Read Ps.\n23 as a prayer to Jesus. Verses one and two might sound like this: ”\n*Jesus, **you’re my *\n\n*Shepherd and provide everything I need.*\n\n*Thanks **for letting me rest in green meadows and leading **me beside\npeaceful streams.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 23:1-3 AI",
    "found_reading": true
  },
  {
    "message_id": "170e0552e3c9c921",
    "date_utc": "2020-03-15T22:34:04+00:00",
    "subject": "GENEROSITY AND DILIGENCE",
    "verse": "Give generously, for your gifts will return to you latter. Divide your gifts among many, for you do not know what risks might lie ahead.  (Ecclesiastes 11:1-2)",
    "reflection": "In these verses Solomon summarizes that life involves both risk and opportunity. Because life has no guarantees, we must be prepared. “Give generously,” because life has opportunities and we must seize them. Solomon does not support a stingy, despairing attitude. Just because life is\nuncertain does not mean we should do nothing. We need a spirit of trust and adventure, facing life’ risk and opportunities with God-directed enthusiasm and faith. Waiting for perfect conditions will mean inactivity.",
    "prayer": "Almighty God, grant us the wisdom to embrace life's uncertainties with faith and courage, seizing opportunities to give generously and act boldly in Your name. Help us trust in Your providence as we face both risks and rewards, never allowing fear to hinder our service to You and others. (AI)",
    "original_content": "message_id: 170e0552e3c9c921\nsubject   : Subject: GENEROSITY AND DILIGENCE (3-16-20)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 15 Mar 2020 17:34:04 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Give generously, for your gifts will return to you latter. **Divide your\ngifts among many, for you do not know **what risks might lie ahead. *\n\n(Eccl. 11:1-2)\n\n\n\n*Today’s Reflection:*\n\nIn these verses Solomon summarizes that life involves both risk and\nopportunity. Because life has no guarantees, we must be prepared. “Give\ngenerously,” because life has opportunities and\n\nwe must seize them. Solomon does not support\n\na stingy, despairing attitude. Just because life is\n\nuncertain does not mean we should do nothing.\n\nWe need a spirit of trust and adventure, facing\n\nlife’ risk and opportunities with God-directed enthusiasm and faith. *Waiting\nfor perfect conditions will mean inactivity.*\n\n* Pastor Al*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Luke 6:38 AI",
    "found_reading": true
  },
  {
    "message_id": "170e5eb294aa9a9b",
    "date_utc": "2020-03-17T00:35:59+00:00",
    "subject": "PRACTICING CHRIST-LIKENESS",
    "verse": "Be still, and know that I am God. (Psalm 46:10) Be holy because I am holy. (Leviticus 11:46)",
    "reflection": "The most important use of our day is to practice being like Jesus.\nEven when we have-to-deal with a difficult person OR when we receive bad news. Every-day we can expect to encounter plenty of opportunities to choose between behaving like Christ would, and acting on the basis of our natural instincts. In those moments, what we do will reflect who we are becoming. AND that is much more important than crossing off every item on the longest to-do list.",
    "prayer": "Gracious God, help us to prioritize becoming more like Jesus in our daily lives, especially when faced with challenging people or situations. May our actions reflect Your love and grace, shaping us into the image of Christ with each choice we make. (AI)",
    "original_content": "message_id: 170e5eb294aa9a9b\nsubject   : Subject: PRACTICING CHRIST-LIKENESS (3-17-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 16 Mar 2020 19:35:59 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*Be still, and know that I am God. *(Ps. 46:10)\n\n*Be holy because I am holy. *(Lev. 11:46)\n\n\n\n*Today’s Reflection:*\n\nThe most important use of our day is to practice being like Jesus. *Even*\nwhen we have-to-deal with a difficult person *OR *when we receive bad news.\nEvery-day we can expect to encounter plenty of opportunities to choose\nbetween behaving like Christ would, and acting on the basis of our natural\ninstincts. In those moments, what we do *will* reflect who we are\nbecoming. *AND\nthat is much more important **than crossing off every item on the longest\nto-do list.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 5:48 AI",
    "found_reading": true
  },
  {
    "message_id": "170eada7fc65a485",
    "date_utc": "2020-03-17T23:35:53+00:00",
    "subject": "INVITED TO BE REBORN",
    "verse": "You are among those who have been called to belong to Jesus Christ, dear friends in Rome.  God loves you dearly, and He has called you  to be His very own people.\nMay grace and  peace be yours from God our Father and the  Lord Jesus Christ. (Romans 1:6-7)",
    "reflection": "Paul says that those who become Christians are\ninvited by Jesus to (1) belong to God’s family\nand (2) be His very own people. What-a-wonderful\nexpression of what it means to be a Christian! In\nbeing reborn into God’s family we have the great est experience of love and the greatest inheritance.\nBecause of all that God has done for us, we should strive to be His holy people.",
    "prayer": "Holy God, we thank You for inviting us into Your family and making us Your own people through Jesus Christ. Help us to live as Your holy people, embracing the love and inheritance You have given us. (AI)",
    "original_content": "message_id: 170eada7fc65a485\nsubject   : Subject: INVITED TO BE REBORN (3-18-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 17 Mar 2020 18:35:53 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*You are among those who have been called to belong **to Jesus Christ, dear\nfriends in Rome. *\n\n*God loves you **dearly, and He has called you *\n\n*to be His very own **people. May grace and *\n\n*peace be yours from God **our Father and the *\n\n*Lord Jesus Christ. *(Ro. 1:6-7)\n\n\n\n*Today’s Reflection:*\n\nPaul says that those who become Christians are\n\ninvited by Jesus to (1) belong to God’s family\n\nand (2) be His very own people. *What-a-wonderful*\n\nexpression of what it means to be a Christian! In\n\nbeing reborn into God’s family we have the great-\n\nest experience of love and the greatest inheritance.\n\n*Because of all that God has done for us, we *\n\n*should strive to be His holy people. *\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Peter 2:9-10 AI",
    "found_reading": true
  },
  {
    "message_id": "170effb9846585d5",
    "date_utc": "2020-03-18T23:30:08+00:00",
    "subject": "HAVING A PURPOSE",
    "verse": "The Lord has made everything for His own purpose. (Proverbs 14:4)",
    "reflection": "Jesus’s purpose on earth was to preach the gospel,\nheal the sick and brokenhearted, and to set the\ncaptives free. He had an appointed time to work\non earth before He fulfilled His other purpose,\nwhich was dying to save us. When He left, Jesus\npurposed us with continuing the work He started\non earth with each of us working as a sole example\nbring hope, beauty, and truth to the world. Like\nthe bees that spread pollen, we are meant to spread\nthe love of Jesus. When we seek Jesus, He helps us to fulfill our purpose in our jobs, churches, families, and communities.",
    "prayer": "Lord Jesus, help us to continue Your work on earth by spreading Your love and bringing hope, beauty, and truth to the world. Guide us in fulfilling our purpose in our jobs, churches, families, and communities, as we seek to follow Your example. (AI)",
    "original_content": "message_id: 170effb9846585d5\nsubject   : Subject: HAVING A PURPOSE (3-19-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 18 Mar 2020 18:30:08 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*The Lord has made everything for His own purpose. *(Pro. 14:4)\n\n\n\n*Today’s Reflection:*\n\nJesus’s purpose on earth was to preach the gospel,\n\nheal the sick and brokenhearted, and to set the\n\ncaptives free. He had an appointed time to work\n\non earth before He fulfilled His other purpose,\n\nwhich was dying to save us. *When He left*, Jesus\n\npurposed us with continuing the work He started\n\non earth with each of us working *as a sole example*\n\nbring hope, beauty, and truth to the world. Like\n\nthe bees that spread pollen, we are meant to spread\n\nthe love of Jesus. When we seek Jesus, *He helps*\n\n*us to fulfill our purpose in our jobs, churches,*\n\n*families, and communities.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Luke 4:18-19 AI",
    "found_reading": true
  },
  {
    "message_id": "170f8a546c67b584",
    "date_utc": "2020-03-20T15:52:26+00:00",
    "subject": "seeking true security",
    "verse": "The rich think of their wealth as an impregnable  defense, they imagine it is a high wall of safety.\n(Psalm 18:11)",
    "reflection": "In imagining that their wealth is their strongest\ndefense, rich people are sadly mistaken. Money\ncannot provide safety-there are to many ways\nfor it to lose its power. The Government may\ncease to back it; thieves may steal it; inflation\nmay rob it of its value. But God never loses His\npower.\nHe is always dependable. Where do you\nlook for your security and safety-in uncertain wealth OR God who is always faithful?",
    "prayer": "Almighty God, help us to place our trust in Your unfailing power and faithfulness rather than in the fleeting security of earthly riches. May we find true safety and peace in Your eternal love and protection. (AI)",
    "original_content": "message_id: 170f8a546c67b584\nsubject   : Subject: seeking true security (3-20-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 20 Mar 2020 10:52:26 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*The rich think of their wealth as an impregnable *\n\n*defense, they imagine it is a high wall of safety.*\n\n(Ps. 18:11)\n\n\n\n*Today’s Reflection:*\n\nIn imagining that their wealth is their strongest\n\ndefense, rich people are sadly mistaken. Money\n\ncannot provide safety—there are to many ways\n\nfor it to lose its power. The Government may\n\ncease to back it; thieves may steal it; inflation\n\nmay rob it of its value. But God never loses His\n\npower. He is always dependable. Where do you\n\nlook for your security and safety—*in uncertain*\n\n*wealth OR God who is always faithful?*\n\n* Pastor Sather *\n\n\n(sorry for the delay I was having computer problems)\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Proverbs 18:10-11 AI",
    "found_reading": true
  },
  {
    "message_id": "170fa455b2365aae",
    "date_utc": "2020-03-20T23:26:54+00:00",
    "subject": "ARE YOUR PRAYERS SINCERE?",
    "verse": "Your prayers and your compassionate gifts to the poor have not gone unnoticed by God!\n(Acts 10:4)",
    "reflection": "God saw Cornelius’s sincere faith. His prayers\nand his generous giving had not gone unnoticed\nby God. God answers the sincere prayers of those\nwho seek Him by sending the right person or the\nright information at the right time. Jesus’s life\nwas consumed with prayer and compassionate\nacts.\nCan the same be said about yours? [To many people offer God prayer with claw marks all over them!]",
    "prayer": "Gracious God, help us to cultivate a life of sincere prayer and compassionate acts, following the example of Jesus and Cornelius. May our faith be evident through our generosity and devotion, trusting that You hear and answer the prayers of those who earnestly seek You. (AI)",
    "original_content": "message_id: 170fa455b2365aae\nsubject   : Subject: ARE YOUR PRAYERS SINCERE? (3-21-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 20 Mar 2020 18:26:54 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Your prayers and your compassionate gifts to*\n\n*the poor have not gone unnoticed by God!*\n\n(Acts 10:4)\n\n\n\n*Today’s Reflection:*\n\nGod saw Cornelius’s sincere faith. His prayers\n\nand his generous giving had not gone unnoticed\n\nby God. God answers the sincere prayers of those\n\nwho seek Him by sending the right person or the\n\nright information at the right time. Jesus’s life\n\nwas consumed with prayer and compassionate\n\nacts. *Can the same be said about yours?*\n\n*[To many people offer God prayer with claw marks*\n\n*all over them!**] *\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 6:3-4 AI",
    "found_reading": true
  },
  {
    "message_id": "170ff4031a0d9900",
    "date_utc": "2020-03-21T22:39:22+00:00",
    "subject": "TODAY'S CHALLENGE",
    "verse": "For I want you to understand what really matters, so that you may live pure and blameless lives until Christ  returns. (Philippians 1:10 NLT)",
    "reflection": "Paul prayed that the Philippian believers would have the ability to differentiate between right and wrong, good and bad, vital and trivial. We need to pray for moral discernment so we can maintain our Christian morals and values. Hebrews 5:14 emphasizes the need of discernment. We need to remember to live each day as if this is the day Christ will return.\nLet us not forget to pray every day for the courageous health care workers and nursing home attendants",
    "prayer": "Holy God, grant us the wisdom to discern right from wrong and the strength to uphold our Christian values in all we do. May we live each day with purpose, remembering those who care for the sick and vulnerable, as we await Christ's return. (AI)",
    "original_content": "message_id: 170ff4031a0d9900\nsubject   : Subject: TODAY'S CHALLENGE (3-22-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 21 Mar 2020 17:39:22 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*For I want you to understand what really matters, **so that you may live\npure and blameless lives until **Christ *\n\n*returns. *(Phil. 1:10 NLT)\n\n\n\n*Today’s Reflection:*\n\nPaul prayed that the Philippian believers would have the ability to\n\ndifferentiate between right and wrong, good and bad, vital and trivial. We\nneed to pray for moral discernment so\n\nwe can maintain our Christian morals\n\nand values. Heb. 5:14 emphasizes the need of discernment. *We need to\nremember to live each **day as if *\n\n*this is the day Christ will return.*\n\n\n*Let us not forget to pray every day for the courageous **health care\nworkers and nursing home attendants*\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Thessalonians 5:21-23 AI",
    "found_reading": true
  },
  {
    "message_id": "1710452f4b7f93f3",
    "date_utc": "2020-03-22T22:17:58+00:00",
    "subject": "THERE'S FORGIVENESS",
    "verse": "I live by faith in the Son of God, who love me and gave Himself for me. (Galatians 2:20)",
    "reflection": "Don’t struggle alone, in fear and distress. As if there’s no hope, just your ugliness. Our Lord offers grace not judgment deserving. He longs for your love and your soon returning. REMEMBER THERE’S FORGIVENESS",
    "prayer": "Merciful God, we thank You for Your boundless grace and forgiveness that offers hope even in our darkest moments. Help us to turn to You in times of struggle and fear, knowing that Your love and mercy await our return. (AI)",
    "original_content": "message_id: 1710452f4b7f93f3\nsubject   : Subject:THERE'S FORGIVENESS (3-23-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 22 Mar 2020 17:17:58 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*I live by faith in the Son of God, who love me and gave **Himself for\nme. *(Gal.\n2:20)\n\n\n\n*Today's Reflection:*\n\nDon’t struggle alone, in fear and distress.\n\nAs if there’s no hope, just your ugliness. Our Lord offers grace not judgment\ndeserving.\n\nHe longs for your love and your soon\n\nreturning.\n\n*REMEMBER THERE’S FORGIVENESS*\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 8:38-39 AI",
    "found_reading": true
  },
  {
    "message_id": "1710980fa0c10231",
    "date_utc": "2020-03-23T22:26:20+00:00",
    "subject": "YES THERE'S FORGIVENESS",
    "verse": "The thief’s purpose is to steal and kill and destroy. My purpose is to give life in all it’s fullness. (John 10:10)",
    "reflection": "It’s tough cutting through the darkness of sin. Striving for answers, His favor to win.\nHe stands with His arms outstretched and extended.To hold and restore you, just mercy intended.\nRemember there’s forgiveness.",
    "prayer": "Loving God, help us to embrace Your outstretched arms of mercy and forgiveness, even when we feel lost in the darkness of sin. May we find comfort and restoration in Your unconditional love, always remembering that Your grace is freely given. (AI)",
    "original_content": "message_id: 1710980fa0c10231\nsubject   : Subject: YES THERE'S FORGIVENESS (3-24-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 23 Mar 2020 17:26:20 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*The thief’s purpose is to steal and kill and destroy. **My purpose is to\ngive life in all it’s fullness. *(Jn. 10:10)\n\n*Today’s Reflection:*\n\nIt’s tough cutting through the darkness of sin. Striving for answers, His\nfavor to win.\n\nHe stands with His arms outstretched and extended.To hold and restore you,\njust mercy intended.\n\n*Remember there’s forgiveness.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 5:8 AI",
    "found_reading": true
  },
  {
    "message_id": "1710ea8132227576",
    "date_utc": "2020-03-24T22:27:08+00:00",
    "subject": "RECEIVING ANSWERS",
    "verse": "O lord, You are so good, so ready to forgive, so full of unfailing love for all who ask your aid. (Psalm 86:5)",
    "reflection": "Why search other places your answers to find; to fill the vast void and touch the divine. Lay down your excuses and learn to confess; your sins and your shame to His holiness.\nTHERE’S FORGIVENESS",
    "prayer": "Gracious God, help us to seek You earnestly, laying aside our excuses and confessing our sins with humility and honesty. May we find Your forgiveness and experience the fullness of Your grace in our lives. (AI)",
    "original_content": "message_id: 1710ea8132227576\nsubject   : Subject: RECEIVING ANSWERS (3-25-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 24 Mar 2020 17:27:08 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*O lord, You are so good, so ready to forgive, **so full of unfailing love\nfor all who ask your **aid. *(Ps. 86:5)\n\n\n\n*Today’s Reflection:*\n\nWhy search other places your answers to find; to fill the vast void and\ntouch the divine. Lay down your excuses and learn to confess; your sins and\nyour shame to His holiness.\n\n* THERE’S FORGIVENESS*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 John 1:9 AI",
    "found_reading": true
  },
  {
    "message_id": "17113bb4f65b3103",
    "date_utc": "2020-03-25T22:06:15+00:00",
    "subject": "A TIME TO DECIDE",
    "verse": "And now God is building you, as living stones, into His Spiritual temple. What’s more, you are God’s holy priests, who  offer the spiritual sacrifices that please  Him because of Jesus Christ. (I Peter 2:5)  ",
    "reflection": "There’s healing and fellowship waiting for you; the moment you turn, His face to pursue you are the temple, His place for abiding.The only thing missing is your mind deciding. We can safely put our confidence in Him because of the eternal life He promises is certain.",
    "prayer": "Faithful God, help us to turn our hearts and minds fully toward You, trusting in Your promise of eternal life and embracing the healing and fellowship You offer. May we recognize ourselves as Your temple and choose to abide in Your presence always. (AI)",
    "original_content": "message_id: 17113bb4f65b3103\nsubject   : Subject: A TIME TO DECIDE (3-26-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 25 Mar 2020 17:06:15 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*And now God is building you, as living stones, into **His Spiritual\ntemple. What’s more, you are God’s **holy priests, who *\n\n*offer the spiritual sacrifices that **please *\n\n*Him because of Jesus Christ. *(I Pet. 2:5)\n\n\n\n*Today’s Reflection:*\n\nThere’s healing and fellowship waiting\n\nfor you; the moment you turn, His face\n\nto pursue you are the temple, His place\n\nfor abiding.The only thing missing is your mind deciding.\n\n*We can safely put our confidence in *\n\n*Him **because of the eternal life He promises is **certain.*\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Ephesians 2:21-22 AI",
    "found_reading": true
  },
  {
    "message_id": "1711919f6c45d6fd",
    "date_utc": "2020-03-26T23:07:44+00:00",
    "subject": "WOULD YOU ENLIST",
    "verse": "Pray without ceasing. (I Thessalonians 5:17)",
    "reflection": "We are living in a difficult time, when it is very important that we truly pray without ceasing. Just how are we to do this?\nWell Paul gives this advise; he says: “be joyful” and “pray without ceasing” he also says “no matter what happens, always be thankful,” for this is God’s will. It goes\nwithout saying we cannot spend all our time on our knees, but it is possible, to have a prayerful attitude, at all times.\nThis attitude is built upon acknowledging our dependence, on God realizing His presence within us, and determining to obey Him fully. Then we will find it natural to pray frequently, spontaneously, short prayers. Would you enlist and become a faithful prayer warrior?",
    "prayer": "Holy God, instill in us a prayerful attitude that acknowledges our dependence on You, recognizes Your constant presence, and strengthens our resolve to obey You fully. Help us to become faithful prayer warriors, offering spontaneous and frequent prayers throughout our days, so that we may truly pray without ceasing. (AI)",
    "original_content": "message_id: 1711919f6c45d6fd\nsubject   : Subject: WOULD YOU ENLIST (3-27-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 26 Mar 2020 18:07:44 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Pray without ceasing. *(I Thess. 5:17)\n\n\n\n*Today’s Reflection:*\n\nWe are living in a difficult time, when it is very important that we truly\npray without ceasing. Just how are we to do this? Well\n\nPaul gives this advise; he says: “be joyful” and “pray without ceasing” he\nalso says “no matter what happens, always be thankful,” for this is God’s\nwill. It goes\n\nwithout saying we cannot spend all our time on our knees, but it is\npossible, to have a prayerful attitude, at all times.\n\nThis attitude is built upon acknowledging our dependence, on God realizing\nHis presence within us, and determining to\n\nobey Him fully. Then we will find it natural to pray frequently,\nspontaneously, short prayers.* Would you **enlist and become a faithful\nprayer warrior?*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Philippians 4:6-7 AI",
    "found_reading": true
  },
  {
    "message_id": "1711dfcf630726b8",
    "date_utc": "2020-03-27T21:54:10+00:00",
    "subject": "A TRUE RELATIONSHIP",
    "verse": "Then Jesus prayed this prayer: “O Father, Lord of heaven and earth, thank for hiding the truth from those who think themselves so wise and clever, and for revealing it to the childlike. (Matthew 11:25) ",
    "reflection": "Jesus mentions two kinds of people; “the wise and cleaver” arrogant in their own knowledge-and the “childlike”-\nhumbly open to receive the truth of God’s Word. Are you wise in your own eyes, or do you seek the truth in childlike faith, realizing that only God holds all the answers. In the O. T. to “know” means more than knowledge. It means to have an intimate relationship.",
    "prayer": "Lord of Life, open our hearts to receive your truth with childlike faith and humility, drawing us into a deeper, more intimate relationship with you. May we set aside our own wisdom and arrogance, recognizing that true knowledge comes from knowing you. (AI)",
    "original_content": "message_id: 1711dfcf630726b8\nsubject   : Subject: A TRUE RELATIONSHIP (3-28-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 27 Mar 2020 16:54:10 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Then Jesus prayed this prayer: “O Father, Lord of heaven **and earth,\nthank for hiding the truth from those who think **themselves so **wise and\nclever, and for revealing it to the **childlike. *(Mt. 11:25)\n\n\n\n*Today’s Reflection:*\n\nJesus mentions two kinds of people; “the wise and cleaver” arrogant in\ntheir own knowledge—and the “childlike”—\n\nhumbly open to receive the truth of God’s Word. Are you wise in your own\neyes, or do you seek the truth in childlike faith,\n\nrealizing that only God holds all the answers. *In the O. T. to “know”\nmeans more than knowledge. It **means to have an intimate relationship.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 18:3-4 AI",
    "found_reading": true
  },
  {
    "message_id": "171234b00a24421f",
    "date_utc": "2020-03-28T22:37:30+00:00",
    "subject": "OBEYING THE GREATEST",
    "verse": "One of the Pharisees in order to trap Jesus asked, “Teacher, which is the most important commandment in the law of Moses?” Jesus replied, “You must love  the Lord your God with all your heart, with all your soul, and with all your mind. (Matthew 22:36-38) ",
    "reflection": "The Pharisee who asked this question was attempting to stump Jesus. But Jesus reminded the Pharisee, and He reminds us, that when we feel overwhelmed by\ncommands and rules, we can come back to the core truth.\nOur God wants to be in a relationship with us. Because of Jesus, that relationship is restored. We never go wrong when we poor our hearts, souls, and minds into love for our Lord. Jesus said, “This is the greatest command.”",
    "prayer": "Loving God, help us to focus on the core truth of Your desire for relationship with us, and guide us to pour our hearts, souls, and minds into loving You above all else. May we always remember that through Jesus, our relationship with You is restored, and loving You is the greatest commandment we can follow. (AI)",
    "original_content": "message_id: 171234b00a24421f\nsubject   : Subject: OBEYING THE GREATEST (3-29-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 28 Mar 2020 17:37:30 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*One of the Pharisees in order to trap Jesus asked, **“Teacher, which is\nthe most important commandment **in the law of Moses?” Jesus replied, “You\nmust **love *\n\n*the Lord your God with all your heart, with **all your soul, and with all\nyour mind. *(Mt. 22:36-38)\n\n\n\n*Today’s Reflection:*\n\nThe Pharisee who asked this question was attempting to stump Jesus. But\nJesus reminded the Pharisee, and He reminds\n\nus, that when we feel overwhelmed by\n\ncommands and rules, we can come back\n\nto the core truth. Our God wants to be in\n\na relationship with us. Because of Jesus,\n\nthat relationship is restored. We never\n\ngo wrong when we poor our hearts, souls, and minds into love for our\nLord. *Jesus\nsaid, “This is **the greatest command.”*\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Mark 12:30 AI",
    "found_reading": true
  },
  {
    "message_id": "17128a0399d59d7c",
    "date_utc": "2020-03-29T23:28:41+00:00",
    "subject": "GOD DEALING WITH EGYPTIAN IDOL WORSHIP",
    "verse": "“You shall have no other gods before Me. You shall not make for yourself a carved image.” (Exodus 20:3-4b)",
    "reflection": "Read these two verses once again. Don't you think that we should be concerned? GOD DEALING WITH TODAY’S IDOL WORSHIP\nIn three short months just like God did with the plagues In Egypt, God has taken away everything we worship. We are known for the worship of athletes, so I will\nShut down your stadiums. We worship our musicians, I will shut down your Civic Centers. We worship actors, I will shut down the theaters. We worship money, I\nwill shut down the economy and crush the stock market. You don’t want to go to church and worship me, I will make it so you can’t go to church. If my people called by my name will humble them selves and pray and keep the faith, and turn from their wicked ways, then I will hear them from heaven and forgive their\nsins and heal their land. Maybe we don’t need a vaccine! maybe instead we should take the time to avoid the distractions of the world and have a personal revival where we focus on the only thing in the world that really matters, Jesus Christ.",
    "prayer": "Almighty God, we humbly acknowledge our misplaced worship and ask for Your forgiveness; help us turn our hearts fully toward You, finding true meaning and purpose in Jesus Christ alone. (AI)",
    "original_content": "message_id: 17128a0399d59d7c\nsubject   : Subject: GOD DEALING WITH EGYPTIAN IDOL WORSHIP\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 29 Mar 2020 18:28:41 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today's Verses:*\n\n*“You shall have no other gods before Me. You shall not make **for yourself\na carved image.” *(Exodus 20:3-4b)\n\n\n*Today's Reflection:*\n\nRead these two verses once again. Don't you think that we should be\nconcerned?\n\nGOD DEALING* WITH TODAY’S IDOL WORSHIP*\n\nIn three short months just like God did with the plagues In Egypt, God has\ntaken away everything we worship. We are\n\nknown for the worship of athletes, so I will\n\nShut down your stadiums. We worship our musicians, I will shut down your\nCivic Centers. We worship actors, I will shut down the theaters. We worship\nmoney, I\n\nwill shut down the economy and crush the stock market. You don’t want to go\nto church and worship me, I will make it so\n\nyou can’t go to church. If my people\n\ncalled by my name will humble them-\n\nselves and pray and keep the faith, and turn from their wicked ways, then I\nwill hear them from heaven and forgive their\n\nsins and heal their land. Maybe we don’t need a vaccine*!* maybe instead we\nshould take the time to avoid the distractions of the world *and have a\npersonal revival where we focus **on the only thing in the world that\nreally matters, Jesus **Christ. ** Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Isaiah 44:9-11 AI",
    "found_reading": true
  },
  {
    "message_id": "1712d9342ee93b28",
    "date_utc": "2020-03-30T22:32:38+00:00",
    "subject": "PATIENCE PAYS",
    "verse": "Happy are those servants whom the master finds waiting up when he arrives. . . . he will dress himself to serve, seat them at the table as honored guests, and wait on them. (Luke 12:37)",
    "reflection": "Jesus is asking us to be dressed and ready, like a well-trained and beloved servant anticipating our Master’s arrival. But He added more to the story from Luke 12. He said that the servants who are “Waiting up” when He arrives home, no matter\nthe hour, are happy and blessed. Not tired. Not exhausted.\nNot impatient. Happy. Then if you notice the tables are turned. The master dresses himself to serve, seats us in a place of honor, and waits on us. I can’t imagine a more humbling\nexperience than having Jesus serve me in that way. Won’t that be something to write home about?",
    "prayer": "Gracious God, help us to remain vigilant and joyful as we await Your return, and grant us the humility to receive Your loving service with grateful hearts. May we always be ready to welcome You, our Master who became a servant. (AI)",
    "original_content": "message_id: 1712d9342ee93b28\nsubject   : Subject: PATIENCE PAYS (3-31-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 30 Mar 2020 17:32:38 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Happy are those servants whom the master finds **waiting up when he\narrives. . . . he will dress him**self to serve, seat them at the table as\nhonored **guests, and wait on them. *(Lk. 12:37)\n\n\n\n*Today’s Reflection:*\n\nJesus is asking us to be dressed and ready, like a well-trained and beloved\nservant anticipating our Master’s arrival. But He added more to the story from\nLuke 12. He said that the servants who are “Waiting up” when He arrives\nhome, no matter\n\nthe hour, are happy and blessed. Not tired. Not exhausted. Not impatient.\nHappy. Then if you notice the tables are turned. The master dresses himself\nto *serve,* seats us in a place of honor, and waits on us. I can’t imagine\na more humbling\n\nexperience than having Jesus serve me in that way. *Won’t that be something\nto write home **about?*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 25:21 AI",
    "found_reading": true
  },
  {
    "message_id": "17132ca76ff07172",
    "date_utc": "2020-03-31T22:51:02+00:00",
    "subject": "TRUSTING IN JESUS PAYS OFF",
    "verse": "At dawn Jesus called out “Friends, have you caught any fish?” “No,” they replied. “Throw out your net on the right-hand side of the boat, and you’ll get plenty of fish!” So they did, and they couldn’t draw in the net because there were so many fish in it. (John 21:5-6)",
    "reflection": "Give this some thought: they had been casting out their nets all night long. They were tired and ready to go home eat some breakfast and go to bed. If you read verse four, it says they didn’t even recognize who was on the beach. I can hear one\nof them saying to the rest, why not we have nothing to lose. Well we know what happened, they caught so many fish they could not get them into the boat. I think that once in-a-while we need to be reminded to trust Jesus. I also think that\nif we did we’d be much better off. So let us remember to ask Jesus to teach us to trust that He will provide for us.",
    "prayer": "Holy God, teach us to trust in Your provision even when we are weary and uncertain, and help us to recognize Your presence in our daily lives. May we cast our nets at Your command and be amazed by Your abundant blessings. (AI)",
    "original_content": "message_id: 17132ca76ff07172\nsubject   : Subject: TRUSTING IN JESUS PAYS OFF (4:1-2020)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 31 Mar 2020 17:51:02 -0500\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\nAt dawn Jesus called out “Friends, have you caught any fish?” “No,” they\nreplied. “Throw out your net on the right-hand side of the boat, and you’ll\nget plenty of fish!” So they did, and they couldn’t draw in the net because\nthere were so many fish in it.\n\n\n*Today’s Reflection:*\n\nGive this some thought: they had been casting out their nets all night\nlong. They were tired and ready to go home eat some breakfast and go to\nbed. If you read verse four, it says they didn’t even recognize who was on\nthe beach. I can hear one\n\nof them saying to the rest, why not we have nothing to lose. Well we know\nwhat happened, they caught so many fish they\n\ncould not get them into the boat. I think that once in-a-while we need to\nbe reminded to trust Jesus. I also think that\n\nif we did we’d be much better off. *So let us remember to **ask Jesus to\nteach us to trust that He will provide for us.*\n\n* Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "John 14:1 AI",
    "found_reading": true
  }
]
