[
  {
    "message_id": "13f1e3ba65ea56ce",
    "date_utc": "Fri, 7 Jun 2013 05:43:06 -0500",
    "subject": "thoughts to live by",
    "verse": "You who are lovers of the Lord, be haters of evil; He keeps the souls of His saints; He takes them out of the hand of sinners. (Psalm 97:10)",
    "reflection": "A sincere desire to please God will result in an alignment of your desires with God's desires-You will love what God loves-and hate what God hates-if you love the Lord, you will hate evil. If you do not despise the actions of people who take advantage of othersif you admire people who only look out for themselves-or if you envy those who get ahead using any means to accomplish their ends-then your primary desire in life is not to please God. Learn to love God's ways and hate evil in every form-not only the obvious sins but also the socially acceptable. .",
    "prayer": "Dear Lord guide my footsteps by Your Word, and make my heart sincere; let sin have no place in my life, Lord, but keep my conscience clear. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Ps. 97:10 \n\nYou who are lovers of the Lord, be haters of evil; He keeps the souls of His\nsaints; \n\nHe takes them out of the hand of sinners.\n\n\n\nToday's Lesson:\n\nA sincere desire to please God will result in an alignment of your desires\nwith God's\n\ndesires-You will love what God loves-and hate what God hates-if you love the\n\nLord, you will hate evil.\n\nIf you do not despise the actions of people who take advantage of othersif you admire people who only look out for themselves-or if you envy those \n\nwho get ahead using any means to accomplish their ends-then your primary \n\ndesire in life is not to please God. .\n\nLearn to love God's ways and hate evil in every form-not only the obvious\n\nsins but also the socially acceptable. .\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord guide my footsteps by Your Word,\n\nand make my heart sincere; let sin have no place\n\nin my life, Lord, but keep my conscience clear. Amen.\n\n\n\nPs (please pray for the little congregation we have began here in this\napartment)\n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f2357b48a8a92a",
    "date_utc": "Sat, 8 Jun 2013 05:31:52 -0500",
    "subject": "thoughts to live by",
    "verse": "Work hard so you can present yourself to God and receive his approval. Be a good worker, one who does not need to be ashamed and who correctly explains the word of truth. (II Tim. 2:15)",
    "reflection": "Because God will examine what kind of workers we have been for Him, we should build our life on His Word and build His Word into our life. It alone tells us how we are to live for Him and serve Him. Believers who ignore the Bible will certainly be ashamed at the judgment. Consistent and diligent study of God's Word is vital other wise we will be lured into neglecting God and our true purpose for living.",
    "prayer": "Dear Lord, Help me build Your Word into my life. I need Your guidance each and every day. Help me to be sensitive to Your Holy Spirit leading and guidance otherwise I will be tempted to neglect Your Word. Amen.",
    "reading": "",
    "original_content": "Today's Scripture: II Tim. 2:15\nWork hard so you can present yourself to God and receive his approval. \nBe a good worker, one who does not need to be ashamed and who correctly \nexplains the word of truth. \n\nToday's Lesson: \nBecause God will examine what kind of workers we have been for Him,\nwe should build our life on His Word and build His Word into our life.\nIt alone tells us how we are to live for Him and serve Him. .\n\nBelievers who ignore the Bible will certainly be ashamed at the judgment.\nConsistent and diligent study of God's Word is vital other wise we will\nbe lured into neglecting God and our true purpose for living. .\n\nSuggested Prayer:\nDear Lord, Help me build Your Word into my life. I need Your guidance\neach and every day. Help me to be sensitive to Your Holy Spirit leading\nand guidance otherwise I will be tempted to neglect Your Word. Amen.\n\nPastor Alvin and Marcie Sather\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-_1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f2dac94b242026",
    "date_utc": "Mon, 10 Jun 2013 05:40:49 -0500",
    "subject": "thoughts to live by",
    "verse": "\"We live unto the Lord.\" (Romans 14:8)",
    "reflection": "If God had willed it, each of us might have entered heaven at the moment of conversion. It was not absolutely necessary for our preparation for immortality that we should tarry here. It is possible for a man to be taken to heaven, and to be a partaker of the inheritance of the saints in light, though he has but just believed in Jesus. It is true that our sanctification is a long and continued process, and we shall not be perfected till we lay aside our bodies and enter within the veil; but nevertheless, had the Lord so willed it, He might have changed us from imperfection to perfection, and have taken us to heaven at once. Why then are we here? Would God keep His children out of paradise a single moment longer than was necessary? Why is the army of the living God still on the battlefield when one charge might give them the victory? Why are His children still wandering through a maze, when a solitary word from His lips would bring them into the center of their hopes in heaven? The answer is-they are here that they may \"live unto the Lord, \" and may bring others to know His love. We remain on earth as sowers to scatter good seed; as ploughmen to break up the fallow ground; as heralds publishing salvation. We are here as the \"salt of the earth, \" to be a blessing to the world. We are here to glorify Christ in our daily life. We are here as workers for Him, and as \"workers together with Him. \" Let us see that our life answers its end. Let us live earnest, useful, holy lives, to \"the praise of the glory of His grace. \" Meanwhile we long to be with Him.",
    "prayer": "Dear Lord, help me in my walk to be a faithful-Sower-Ploughmen-Heraldso that I may work with others in bring the lost to the fold. Amen.",
    "reading": "",
    "original_content": "Today's Verse: \"We live unto the Lord.\" Romans 14:8\n<http://www.crossbooks.com/verse.asp?ref=Ro+14%3A8> \n\n\n\nToday's Food For Thought:\n\nIf God had willed it, each of us might have entered heaven at the moment of\nconversion. It was not absolutely necessary for our preparation for\nimmortality that we should tarry here. It is possible for a man to be taken\nto heaven, and to be a partaker of the inheritance of the saints in light,\nthough he has but just believed in Jesus. It is true that our sanctification\nis a long and continued process, and we shall not be perfected till we lay\naside our bodies and enter within the veil; but nevertheless, had the Lord\nso willed it, He might have changed us from imperfection to perfection, and\nhave taken us to heaven at once. Why then are we here? Would God keep His\nchildren out of paradise a single moment longer than was necessary? Why is\nthe army of the living God still on the battle-field when one charge might\ngive them the victory? Why are His children still wandering through a maze,\nwhen a solitary word from His lips would bring them into the center of their\nhopes in heaven? The answer is-they are here that they may \"live unto the\nLord,\" and may bring others to know His love. We remain on earth as sowers\nto scatter good seed; as ploughmen to break up the fallow ground; as heralds\npublishing salvation. We are here as the \"salt of the earth,\" to be a\nblessing to the world. We are here to glorify Christ in our daily life. We\nare here as workers for Him, and as \"workers together with Him.\" Let us see\nthat our life answers its end. Let us live earnest, useful, holy lives, to\n\"the praise of the glory of His grace.\" Meanwhile we long to be with Him.\n\nToday's Prayer Suggestion:\n\nDear Lord, help me in my walk to be a faithful-Sower-Ploughmen-Heraldso that I may work with others in bring the lost to the fold. .Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-_1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f32b14b161c0f0",
    "date_utc": "Tue, 11 Jun 2013 05:04:04 -0500",
    "subject": "thoughts to live by",
    "verse": "He arose, and came to his father. But when he was yet a great way off, his father saw him, and ran, and fell on his neck, and kissed him. (Luke 15:20)",
    "reflection": "In Luke 15:1-10 We have the story of the lost coin and the lost sheep-which could not return by themselves. In this parable the father watched and waited. He was dealing with a human-being with a will of his own, but he was ready to greet his son if he returnedIn the same way God's love is constant and patient and welcoming. He will search for us and give us opportunity to respond, but He will not force us to come to Him. Like the father in this story God waits patiently for us to come to our senses.",
    "prayer": "I thank You for Your grace and mercies which are new every day. I thank You for Your love and patience and Your willingness to welcome us back when we stray from You-so I pray forgive me Lord for my unfaithfulness. Amen.",
    "reading": "Luke 15:1-10",
    "original_content": "Today's Verse: Luke 15:20\n<http://www.crossbooks.com/verse.asp?ref=Lk+15%3A20> \n\nHe arose, and came to his father. But when he was yet a great way off,\n\nhis father saw him, and ran, and fell on his neck, and kissed him.\n\n\n\nToday's Lesson:\n\nIn Luke 15:1-10 We have the story of the lost coin and the lost sheep-which\ncould not return\n\nby themselves. In this parable the father watched and waited. He was dealing\nwith a human-being\n\nwith a will of his own, but he was ready to greet his son if he returnedIn the same way God's love is constant and patient and welcoming. He will\nsearch for us and give\n\nus opportunity to respond, but He will not force us to come to Him. .Like\nthe father in this story\n\nGod waits patiently for us to come to our senses. .\n\n\n\nPrayer Suggestion:\n\nI thank You for Your grace and mercies which are new every day.\n\nI thank You for Your love and patience and Your willingness to \n\nwelcome us back when we stray from You-so I pray forgive \n\nme Lord for my unfaithfulness. .Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-_1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": false,
    "found_reading": false
  },
  {
    "message_id": "13f37df0aefa8817",
    "date_utc": "Wed, 12 Jun 2013 05:12:03 -0500",
    "subject": "thoughts to live by",
    "verse": "Thou art weighed in the balances and art found wanting. (Daniel 5:27)",
    "reflection": "It is good to weigh ourselves in the scale of God's Word. You will find it a holy exercise to read some psalm of David, and, as you meditate upon each verse, to ask yourself, Can I say this? Have I felt as David felt? Has my heart ever been broken on account of sin, as his was when he penned his penitent psalms? Do I take the cup of salvation and call upon the name of the Lord? Then turn to the life of Christ, and as you read, ask yourselves how far you are conformed to His likeness. Seek to discover whether you have the meekness, the humility, the lovely spirit which He constantly displayed. Take then, the epistles, and see whether you can go with the apostle Paul in what he said of his experience. Have you ever cried out as he did-wretched man that I am! who shall deliver me from the body of this death? Have you seemed to yourself the chief of sinners, and less than the least of all saints? Have you known anything of his devotion? Could you join with him and say, For me to live is Christ, and to die is gain? If we read God's Word as a test of our spiritual condition, we shall have good reason to stop many times and say, Lord, give me true penitence, give me real faith; instill in me greater love; grant me the grace of meekness; make me more like Jesus. Let me no longer be 'found wanting, ' lest I be found wanting in the scales of judgment.  Judge yourselves that ye be not judged.",
    "prayer": "Dear Lord, I confess that I need Your deliverance from sin. I need Your Spirit's leading and guidance in order that I might become more Christ like. Amen",
    "reading": "",
    "original_content": "Today's Verse: Daniel 5:27\n<http://www.crossbooks.com/verse.asp?ref=Da+5%3A27> \n\n\"Thou art weighed in the balances and art found wanting.\" \n\nIt is good to weigh ourselves in the scale of God's Word. You will find it a\nholy exercise to read some psalm of David, and, as you meditate upon each\nverse, to ask yourself, \"Can I say this? Have I felt as David felt? Has my\nheart ever been broken on account of sin, as his was when he penned his\npenitent psalms? Do I take the cup of salvation and call upon the name of\nthe Lord?\" Then turn to the life of Christ, and as you read, ask yourselves\nhow far you are conformed to His likeness. Seek to discover whether you have\nthe meekness, the humility, the lovely spirit which He constantly displayed.\nTake then, the epistles, and see whether you can go with the apostle Paul in\nwhat he said of his experience. Have you ever cried out as he did-\"O\nwretched man that I am! who shall deliver me from the body of this death\"?\nHave you seemed to yourself the chief of sinners, and less than the least of\nall saints? Have you known anything of his devotion? Could you join with him\nand say, \"For me to live is Christ, and to die is gain\"? If we read God's\nWord as a test of our spiritual condition, we shall have good reason to stop\nmany times and say, \"Lord, give me true penitence, give me real faith;\ninstill in me greater love; grant me the grace of meekness; make me more\nlike Jesus. Let me no longer be 'found wanting,' lest I be found wanting in\nthe scales of judgment.\" \"Judge yourselves that ye be not judged.\"\n\nPrayer Suggestion:\n\nDear Lord, I confess that I need Your deliverance from sin. I need Your\nSpirit's leading\n\nand guidance in order that I might become more Christ like. .Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-_1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f422ac06f4cdab",
    "date_utc": "Fri, 14 Jun 2013 05:11:04 -0500",
    "subject": "thoughts to live by",
    "verse": "Delight yourself in the LORD, and he will give you the desires of your heart. (Psalm 37:4)",
    "reflection": "David tells us to take \"delight\" in the Lord, and commit everything we have and do to Him. But how do we do this? To delight in someone means to experience great pleasure and Joy in his or her presence. This only happens when we know them well. So, to delight in the Lord, we must know Him better. Knowledge of God's great love for us will surely give us delight. To commit ourselves to the Lord means entrusting everything-our lives, families, job, possessions-to His control and guidance. To commit to the Lord means to trust in Him (Psalm 37:5), believing that He can care for us better then we can for ourselves. We should be willing to wait patiently (Psalm 37:7), for Him to work out what is best for us.",
    "prayer": "Dear Lord I confess that at times I find myself doing what I do not want to do, and sometime not doing what I know I should do. For this I ask for Your mercy. send Your Holy Spirit into my heart that I may grow in grace and in the knowledge of Jesus Christ, my Savior. Help me to grow in those things which are pleasing to You. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Psalm 37:4\n<http://www.crossbooks.com/verse.asp?ref=Ps+37%3A4> \n\n\"Delight thyself also in the Lord.\" \n\nToday's Lesson:\n\nDavid tells us to take \"delight\" in the Lord, and commit everything we have\nand do to Him. .\n\nBut how do we do this? To delight in someone means to experience great\npleasure and\n\nJoy in his or her presence. This only happens when we know them well. .\n\n\n\nSo, to delight in the Lord, we must know Him better. Knowledge of God's\ngreat love for\n\nus will surely give us delight. .\n\n\n\nTo commit ourselves to the Lord means entrusting everything-our lives,\nfamilies, job,\n\npossessions-to His control and guidance. To commit to the Lord means to\ntrust in Him\n\n(Ps. 37:5), believing that He can care for us better then we can for\nourselves. .\n\n\n\nWe should be willing to wait patiently (Ps. 37:7), for Him to work out what\nis best for us. .\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord I confess that at times I find myself doing what I do not want to\ndo,\n\nand sometime not doing what I know I should do. For this I ask for Your\nmercy.\n\nsend Your Holy Spirit into my heart that I may grow in grace and in the\nknowledge \n\nof Jesus Christ, my Savior. Help me to grow in those things which are\npleasing to You. Amen.\n\n\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"He says, \"Be still, and know that I am God;\" Psalm 46:10",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f476d50065b958",
    "date_utc": "Sat, 15 Jun 2013 05:39:51 -0500",
    "subject": "thoughts to live by",
    "verse": "Write this letter to the angel of the church in Philadelphia. This is the message from the one who is holy and true, the one who has the key of David. What he opens, no one can close; and what he closes, no one can open. (Revelation 3:7)",
    "reflection": "Jesus is the keeper of the gates of paradise and before every believing soul He places an open door, which no man or devil shall be able to close against it. What joy it will be to find that faith in Him is the golden key to the everlasting doors. Every believing soul, carries this key in his heart-what are you trusting in? Have you allowed some deceitful lock-pick, to move in who will fail you at last? Hear this parable of a great preacher who once lived, and remember it. The Great King has made a banquet, and He has proclaimed to all the world that none shall enter but those who bring with them the fairest flower that blooms. The spirits of men advance to the gate by thousands, and they bring each one the flower which he esteems the queen of the garden; but in crowds they are driven from the royal presence, and enter not into the festive halls. Some bear in their hand the deadly nightshade of superstition, or the flaunting poppies of Rome, or the hemlock of self- righteousness, but these are not dear to the King, the bearers are shut out of the pearly gates. Have you gathered the rose of Sharon? Do you wear the lily of the valley in your bosom constantly? If so, when you come up to the gates of heaven you will know its value, for you have only to show this choicest of flowers, and the Gate Keeper will open: not for a moment will He deny you admission, for to that rose the Gate Keeper will open. You shall find your way with the rose of Sharon in your hand, up to the throne of God Himself, for heaven itself possesses nothing that excels its radiant beauty, and of all the flowers that bloom in paradise there is none that can rival the lily of the valley. Dear soul, get Calvary's blood-red rose into your hand by faithby love wear it-by communion preserve it-by daily watchfulness make it yours-and you shall be blessed beyond all bliss-happy beyond a dream. May Jesus, be your Lord forever-your Key to heaven's gate.",
    "prayer": "Dear Heavenly Father, may Your will be done on earth as it is in heaven. Grant that Your will be done in the hearts and lives of people everywhere, and grant me the grace to always be aware of Your will that I would submit to it in all things. Give me faithfulness in my work, and crown my labors with Your blessing. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Revelation 3:7\n<http://www.crossbooks.com/verse.asp?ref=Rev+3%3A7> \"He openeth, and no\nman shutteth.\" \n\nToday's Lesson:\n\nJesus is the keeper of the gates of paradise and before every believing soul\nHe places an open door, which no man or devil shall be able to close against\nit. \n\nWhat joy it will be to find that faith in Him is the golden key to the\neverlasting doors. Every believing soul, carries this key in his heart-what\nare you trusting in? \n\nHave you allowed some deceitful lock-pick, to move in who will fail you at\nlast? \n\n\n\nHear this parable of a great preacher who once lived, and remember it. The\nGreat King has made a banquet, and He has proclaimed to all the world that\nnone shall enter\n\nbut those who bring with them the fairest flower that blooms. The spirits of\nmen advance to the gate by thousands, and they bring each one the flower\nwhich he esteems the queen of the garden; but in crowds they are driven from\nthe royal presence, and enter not into the festive halls. Some bear in their\nhand the deadly nightshade of superstition, or the flaunting poppies of\nRome, or the hemlock of self- righteousness, but these are not dear to the\nKing, the bearers are shut out of the pearly gates. \n\nHave you gathered the rose of Sharon? Do you wear the lily of the valley in\nyour bosom constantly? If so, when you come up to the gates of heaven you\nwill know its value, for you have only to show this choicest of flowers, and\nthe Gate Keeper will open: not for a moment will He deny you admission, for\nto that rose the Gate Keeper will open. \n\n\n\nYou shall find your way with the rose of Sharon in your hand, up to the\nthrone of God Himself, for heaven itself possesses nothing that excels its\nradiant beauty, \n\nand of all the flowers that bloom in paradise there is none that can rival\nthe lily of the valley. Dear soul, get Calvary's blood-red rose into your\nhand by faithby love wear it-by communion preserve it-by daily watchfulness make it\nyours-and you shall be blessed beyond all bliss-happy beyond a dream. \n\nMay Jesus, be your Lord forever-your Key to heaven's gate.\n\n\n\nToday's Prayer Suggestion:\n\nDear Heavenly Father, may Your will be done on earth as it is in heaven.\n\nGrant that Your will be done in the hearts and lives of people everywhere,\n\nand grant me the grace to always be aware of Your will that I would submit\n\nto it in all things. Give me faithfulness in my work, and crown my labors\n\nwith Your blessing. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-_1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f4c77c74f8240b",
    "date_utc": "Sun, 16 Jun 2013 05:11:28 -0500",
    "subject": "thoughts to live by",
    "verse": "\"And I give unto them eternal life, and they shall never perish.\" (John 10:28)",
    "reflection": "The Christian should never think or speak lightly of unbelief. For a child of God to mistrust His love, His truth, His faithfulness, must be greatly displeasing to Him. How can we ever grieve Him by doubting His upholding grace? Christian! it is contrary to every promise of God's precious Word that you should ever be forgotten or left to perish. If it could be so, how could He be true who has said, \"Can a woman forget her sucking child, that she should not have compassion on the son of her womb? Yea, they may forget, yet will I never forget thee. \" What were the value of that promise -\"The mountains shall depart, and the hills be removed; but My kindness shall not depart from thee, neither shall the covenant of My peace be removed, saith the Lord that hath mercy on thee. \" Where were the truth of Christ's words-\"I give unto My sheep eternal life; and they shall never perish, neither shall any man pluck them out of My hand. My Father, which gave them Me, is greater than all; and no man is able to pluck them out of My Father's hand. \" Where were the doctrines of grace? They would be all disproved if one child of God should perish. Where is the truthfulness of God, His honor, His power, His grace, His covenant, His oath, if any of those for whom Christ has died, and who have put their trust in Him, should nevertheless be cast away? Put away those unbelieving fears which so dishonor God. Remember it is sinful to doubt His Word where He has promised that you shall never perish. Let the eternal life within you express itself in confident joy.",
    "prayer": "Dear Heavenly Father, remove from me any and all doubts that may arise today That may dishonor You. I pray that You would forgive me for all such thoughts. Amen.",
    "reading": "",
    "original_content": "Today's Verse: John 10:28\n<http://www.crossbooks.com/verse.asp?ref=Jn+10%3A28> \"And I give unto\nthem eternal life, and they shall never perish.\" \n\n\n\nToday's Lesson:\n\nThe Christian should never think or speak lightly of unbelief. For a child\nof God to mistrust His love, His truth, His faithfulness, must be greatly\ndispleasing to Him. How can we ever grieve Him by doubting His upholding\ngrace?\n\nChristian! it is contrary to every promise of God's precious Word that you\nshould ever be forgotten or left to perish. If it could be so, how could He\nbe true who has said, \"Can a woman forget her sucking child, that she should\nnot have compassion on the son of her womb? Yea, they may forget, yet will I\nnever forget thee.\"\n\nWhat were the value of that promise-\"The mountains shall depart, and the\nhills be removed; but My kindness shall not depart from thee, neither shall\nthe covenant of My peace be removed, saith the Lord that hath mercy on\nthee.\" \n\nWhere were the truth of Christ's words-\"I give unto My sheep eternal life;\nand they shall never perish, neither shall any man pluck them out of My\nhand. My Father, which gave them Me, is greater than all; and no man is able\nto pluck them out of My Father's hand.\" \n\nWhere were the doctrines of grace? They would be all disproved if one child\nof God should perish. Where is the truthfulness of God, His honor, His\npower, His grace, His covenant, His oath, if any of those for\nwhom Christ has died, and who have put their trust in Him, should\nnevertheless be cast away? Put away those unbelieving fears which so\ndishonor God. \n\nRemember it is sinful to doubt His Word where He has promised that you shall\nnever perish. Let the eternal life within you express itself in confident\njoy.\n\nToday's Prayer Suggestion:\n\nDear Heavenly Father, remove from me any and all doubts that may arise today\n\nThat may dishonor You. I pray that You would forgive me for all such\nthoughts. Amen. \n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f519b50ce70181",
    "date_utc": "Mon, 17 Jun 2013 05:08:25 -0500",
    "subject": "thoughts to live by",
    "verse": "\"The Lord is my light and my salvation; whom shall I fear? The Lord is the strength of my life; of whom shall I be afraid?\" (Psalm 27:1)",
    "reflection": "The Lord is my light and my salvation. Here is personal interest, \"my light,\" \"my salvation\"; the soul is assured of it, and therefore declares it boldly. Into the soul at the new birth divine light is poured as the precursor of salvation; where there is not enough light to reveal our own darkness and to make us long for the Lord Jesus, there is no evidence of salvation. After conversion our God is our joy, comfort, guide, teacher, and in every sense our light: He is light within, light around, light reflected from us, and light to be revealed to us. Note, it is not said merely that the Lord gives light, but that He is light; nor that He gives salvation, but that He is salvation; he, then, who by faith has laid hold upon God, has all covenant blessings in his possession. This being made sure as a fact, the argument drawn from it is put in the form of a question, \"Whom shall I fear?\" A question which is its own answer. The powers of darkness are not to be feared, for the Lord, our light, destroys them; and the damnation of hell is not to be dreaded by us, for the Lord is our salvation. This rests, not upon the conceited vigor of an arm of flesh, but upon the real power of the omnipotent I AM. \"The Lord is the strength of my life. \" We may well accumulate terms of praise where the Lord lavishes deeds of grace. Our life derives all its strength from God; and if He deigns to make us strong, we cannot be weakened by any evil plotting of the adversary. \"Of whom shall I be afraid?\" The bold question looks into the future as well as the present. \"If God be for us, \" who can be against us, either now or in time to come?",
    "prayer": "Dear Lord, I pray that you would keep me firm in the faith-watchful in temptationhumble in my success-and-joyful in the face of affliction, for without You, I can do nothing-but I can do all things through You who strengthens me. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Psalm 27:1\n<http://www.crossbooks.com/verse.asp?ref=Ps+27%3A1> \n\n\"The Lord is my light and my salvation; whom shall I fear? The Lord is the\nstrength of my life; of whom shall I be afraid?\" \n\n\n\nToday's Lesson:\n\n\"The Lord is my light and my salvation.\" Here is personal interest, \"my\nlight,\" \"my salvation\"; the soul is assured of it, and therefore declares it\nboldly. \n\nInto the soul at the new birth divine light is poured as the precursor of\nsalvation; where there is not enough light to reveal our own darkness and to\nmake \n\nus long for the Lord Jesus, there is no evidence of salvation. \n\nAfter conversion our God is our joy, comfort, guide, teacher, and in every\nsense our light: He is light within, light around, light reflected from us, \n\nand light to be revealed to us.\n\nNote, it is not said merely that the Lord gives light, but that He is light;\nnor that He gives salvation, but that He is salvation; he, then, who by\nfaith has \n\nlaid hold upon God, has all covenant blessings in his possession.\n\nThis being made sure as a fact, the argument drawn from it is put in the\nform of a question, \"Whom shall I fear?\" A question which is its own answer.\n\n\nThe powers of darkness are not to be feared, for the Lord, our light,\ndestroys them; and the damnation of hell is not to be dreaded by us, for the\nLord is our salvation. \n\nThis rests, not upon the conceited vigor of an arm of flesh, but upon the\nreal power of the omnipotent I AM. \"The Lord is the strength of my life.\" \n\nWe may well accumulate terms of praise where the Lord lavishes deeds of\ngrace. Our life derives all its strength from God; and if He deigns to make\nus strong, \n\nwe cannot be weakened by any evil plotting of the adversary. \"Of whom shall\nI be afraid?\" The bold question looks into the future as well as the\npresent. \n\n\"If God be for us,\" who can be against us, either now or in time to come?\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord, I pray that you would keep me firm in the faith-watchful in\ntemptationhumble in my success-and-joyful in the face of affliction, for without You,\nI can\n\ndo nothing-but I can do all things through You who strengthens me. .Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nWorship the LORD with gladness; \ncome before him with joyful songs. Psalm 100:2",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f56be47761c7d2",
    "date_utc": "Tue, 18 Jun 2013 05:04:42 -0500",
    "subject": "thoughts to live by",
    "verse": "Thy Redeemer. (Isaiah 54:5)",
    "reflection": "Jesus, the Redeemer, is altogether ours and ours forever. All the offices of Christ are held on our behalf. He is king for us, priest for us, and prophet for us. Whenever we read a new title of the Redeemer, let us appropriate Him as ours under that name as much as under any other. The shepherd's staff, the father's rod, the captain's sword, the priest's mitre, the prince's scepter, the prophet's mantle, all are ours. Jesus hath no dignity which He will not employ for our exaltation, and no prerogative which He will not exercise for our defense. His fullness of Godhead is our unfailing, inexhaustible treasure-house. His manhood also, which he took upon himself for us, is ours in all its perfection. To us our gracious Lord communicates the spotless virtue of a stainless character; to us he gives the meritorious efficacy of a devoted life; on us he bestows the reward procured by obedient submission and incessant service. He makes the glittering virtues of his character our ornaments and jewels; and the superhuman meekness of his death our boast and glory. He bequeaths us his manger, from which to learn how God came down to man; and his Cross to teach us how man may go up to God. All His thoughts, emotions, actions, utterances, miracles, and intercessions, were for us. He trod the road of sorrow on our behalf, and hath made over to us as his heavenly legacy the full results of all the labors of his life. Christ everywhere and every way is our Christ, for ever and ever most richly to enjoy. O my soul, by the power of the Holy Spirit! call him this morning, \"thy Redeemer. \"",
    "prayer": "Dear Heavenly Father, I thank You for Your care and protection-for the health and strength That I will need for the work of this day. Protect Your children everywhere. Amen.",
    "reading": "",
    "original_content": "Today's Verse: \"Thy Redeemer.\" Isaiah 54:5\n<http://www.crossbooks.com/verse.asp?ref=Isa+54%3A5> \n\nToday's Lesson:\n\nJesus, the Redeemer, is altogether ours and ours forever. All the offices of\nChrist are held on our behalf. He is king for us, priest for us, and prophet\nfor us. Whenever we read a new title of the Redeemer, let us appropriate Him\nas ours under that name as much as under any other. The shepherd's staff,\nthe father's rod, the captain's sword, the priest's mitre, the prince's\nsepter, the prophet's mantle, all are ours. Jesus hath no dignity which He\nwill not employ for our exaltation, and no prerogative which He will not\nexercise for our defense. His fullness of Godhead is our unfailing,\ninexhaustible treasure-house. His manhood also, which he took upon himself\nfor us, is ours in all its perfection. To us our gracious Lord communicates\nthe spotless virtue of a stainless character; to us he gives the meritorious\nefficacy of a devoted life; on us he bestows the reward procured by obedient\nsubmission and incessant service. He makes the glittering virtues of his\ncharacter our ornaments and jewels; and the superhuman meekness of his death\nour boast and glory. He bequeaths us his manger, from which to learn how God\ncame down to man; and his Cross to teach us how man may go up to God. All\nHis thoughts, emotions, actions, utterances, miracles, and intercessions,\nwere for us. He trod the road of sorrow on our behalf, and hath made over to\nus as his heavenly legacy the full results of all the labors of his life.\nChrist everywhere and every way is our Christ, for ever and ever most richly\nto enjoy. O my soul, by the power of the Holy Spirit! call him this morning,\n\"thy Redeemer.\"\n\nToday's Prayer Suggestion:\n\nDear Heavenly Father, I thank You for Your care and protection-for the\nhealth and strength\n\nThat I will need for the work of this day. Protect Your children everywhere.\n. Amen.\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-_1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f5c0902fb747a9",
    "date_utc": "Wed, 19 Jun 2013 05:41:59 -0500",
    "subject": "thoughts to live by",
    "verse": "\"And they were all filled with the Holy Spirit.\" (Acts 2:4)",
    "reflection": "Rich were the blessings of this day if all of us were filled with the Holy Spirit. The consequences of this sacred filling of the soul would be impossible to overestimate. Life-comfort-light-purity-power-peace-and many other precious blessings are inseparable from the Spirit's gracious presence. As sacred oil, He anoints the head of the believer, sets him apart to the priesthood of saints, and gives him grace to execute his office rightly. As the only truly purifying water He cleanses us from the power of sin and sanctifies us unto holiness, working in us to will and to do the Lord's good pleasure. As the light, He manifested to us at first our lost estate, and now He reveals the Lord Jesus to us and in us, and guides us in the way of righteousness.",
    "prayer": "Dear Lord, I pray that Your Holy Spirit, would cleanse my heart from all thoughts of hate-of envy-and help me to live peaceably with all people. Make me more helpful-kind-and considerate that I may live my life for you and for others. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Acts 2:4 <http://www.crossbooks.com/verse.asp?ref=Ac+2%3A4>\n\"And they were all filled with the Holy Spirit.\"\n\nToday's Lesson:\n\nRich were the blessings of this day if all of us were filled with the Holy\nSpirit. The consequences of this sacred filling of the soul would be\nimpossible to overestimate. Life-comfort-light-purity-power-peace-and many\nother precious blessings are inseparable from the Spirit's gracious\npresence. As sacred oil, He anoints the head of the believer, sets him apart\nto the priesthood of saints, and gives him grace to execute his office\nrightly. As the only truly purifying water He cleanses us from the power of\nsin and sanctifies us unto holiness, working in us to will and to do the\nLord's good pleasure. As the light, He manifested to us at first our lost\nestate, and now He reveals the Lord Jesus to us and in us, and guides us in\nthe way of righteousness. \n\nToday's Prayer Suggestion:\n\nDear Lord, I pray that Your Holy Spirit, would cleanse my heart from\n\nall thoughts of hate-of envy-and help me to live peaceably with all\n\npeople. Make me more helpful-kind-and considerate that I may live\n\nmy life for you and for others. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nWorship the LORD with gladness; \ncome before him with joyful songs. Psalm 100:2",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f6116d82b1bc20",
    "date_utc": "Thu, 20 Jun 2013 05:17:40 -0500",
    "subject": "thoughts to live by",
    "verse": "Jesus Christ is the same yesterday-today-and forever. (Hebrews 13:8)",
    "reflection": "Though human leaders have much to offer, we need to keep our eyes onChrist, our ultimate leader. Unlike any human leaders He will never change. Christ has been and will be the same forever. In a changing world we can trust our unchanging Lord.",
    "prayer": "Dear Lord I thank You for Your unchanging love and mercy. I pray that You would look with tender mercy upon all those who are without the comfort of Your Gospel. I pray that you would turn their hearts in repentant faith toward Your Son, and cause Your Gospel of forgiveness to be proclaimed to all who have not yet heard of Your great grace in Christ Jesus. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Heb. 13:8\n\nJesus Christ is the same yesterday-today-and forever. .\n\n\n\nToday's Lesson:\n\nThough human leaders have much to offer, we need to keep our eyes onChrist, our ultimate leader. Unlike any human leaders He will never change.\n\nChrist has been and will be the same forever. In a changing world we can\ntrust\n\nour unchanging Lord. .\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord I thank You for Your unchanging love and mercy. I pray that You\n\nwould look with tender mercy upon all those who are without the comfort\n\nof Your Gospel. I pray that you would turn their hearts in repentant faith\n\ntoward Your Son, and cause Your Gospel of forgiveness to be proclaimed\n\nto all who have not yet heard of Your great grace in Christ Jesus. Amen.\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-_1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f66160bb7068c3",
    "date_utc": "Fri, 21 Jun 2013 04:34:56 -0500",
    "subject": "thoughts to live by",
    "verse": "Anyone who belongs to Christ has become a new person. The old life is gone; a new life has begun! (2 Corinthians 5:17)",
    "reflection": "Christians are brand new people-on the inside. The Holy Spirit gives them new life. And they are not the same anymore. We are not reformed, rehabilitated, or reeducated, we are recreated (new creations) living in vital union with Christ (Colossians 2:6, 7). At conversion we do not merely turn over a new leaf we begin a new life under a New Master.",
    "prayer": "Dear Lord, I pray that I would become more sensitive to Your Holy Spirit's guidance, that I would be dead to sin and alive to holiness. Use me today to bring Your Gospel to some person who is as a sheep without a shepherd, so that person may learn to know You-the Good Shepherd-and find in You rest and peace for his soul. Amen.",
    "reading": "",
    "original_content": "Today's Verse: 2 Cor. 5:17\n\nAnyone who belongs to Christ has become a new person. The old life is gone;\na new life has begun! \n\nToday's Thoughts:\n\nChristians are brand new people-on the inside.\n\nThe Holy Spirit gives them new life. And they are not the same anymore.\n\n\n\n\nWe are not reformed, rehabilitated, or reeducated, we are re-created (new\ncreations)\n\nliving in vital union with Christ (Col. 2:6, 7).\n\n\n\nAt conversion we do not merely turn over a new leaf we begin a new life\nunder a New Master.\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord, I pray that I would become more sensitive to Your Holy Spirit's\n\nguidance, that I would be dead to sin and alive to holiness. Use me today to\n\nbring Your Gospel to some person who is as a sheep without a shepherd, so\n\nthat person may learn to know You-the Good Shepherd-and find in You \n\nrest and peace for his soul. Amen.\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"He says, \"Be still, and know that I am God;\" Psalm 46:10",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f6b5992bfa6681",
    "date_utc": "Sat, 22 Jun 2013 05:06:49 -0500",
    "subject": "thoughts to live by",
    "verse": "\"No eye has seen, no ear has heard, and no mind has imagined what God has prepared for those who love him.\" (1 Corinthians 2:9)",
    "reflection": "We can not begin to imagine all that God has in store for us, both in this live and eternity. He will create a new heaven and a new earth (Isaiah 65:17; Revelation 21:1), and we will live with Him foreverUntil then, His Holy Spirit comforts and guides us. Knowing the wonderful and eternal future that awaits us gives us hope and courage to press on in this life, to endure hardship, and to avoid giving in to temptation. This world is not all there is. The Best is yet to come.",
    "prayer": "Dear Lord, regardless of the number of my days on earth, help me to always be prepared when You call me home. I know that the road of my life leads finally to that Heavenly mansion You have prepared. Equip me for the trials and pitfalls that await me on my way through this life and teach me to preform in Your holy name each duty which confronts me. Remind me each day that I am but a pilgrim here and help me to assist my fellow travelers with their burdens showing the glory of the new life in You. Amen.",
    "reading": "",
    "original_content": "Today's Verse: 1 Cor. 2:9\n\n\"No eye has seen, no ear has heard, and no mind has imagined what God \n\nhas prepared for those who love him.\" \n\nToday's Thoughts:\n\nWe can not begin to imagine all that God has in store for us, both in this\nlive\n\nand eternity. He will create a new heaven and a new earth (Isa. 65:17;\nRev.21:1),\n\nand we will live with Him foreverUntil then, His Holy Spirit comforts and guides us. Knowing the wonderful\nand\n\neternal future that awaits us gives us hope and courage to press on in this\nlife,\n\nto endure hardship, and to avoid giving in to temptation. .\n\n\n\nThis world is not all there is. The Best is yet to come. .\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord, regardless of the number of my days on earth, help me to always \n\nbe prepared when You call me home. I know that the road of my life leads\n\nfinally to that Heavenly mansion You have prepared. Equip me for the trials \n\nand pitfalls that await me on my way through this life and teach me to\npreform \n\nin Your holy name each duty which confronts me. Remind me each day that I\n\nam but a pilgrim here and help me to assist my fellow travelers with their\nburdens\n\nshowing the glory of the new life in You. Amen.\n\n\n\n\n\nPs. I'm sorry that you received only half a message earlier today\n\nI hit send by mistake. \n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f706aec76ae347",
    "date_utc": "Sun, 23 Jun 2013 04:43:53 -0500",
    "subject": "thoughts to live by",
    "verse": "If my people who are called by my name will humble themselves and pray and seek my face and turn from their wicked ways, I will hear from heaven and will forgive their sins and restore their land. (2 Chronicles 7:14)",
    "reflection": "In chapter 6 we see that Solomon had asked God to make provisions for the people when they sinned. God answered with four conditions for forgiveness(1) Humble yourself by admitting your sins. (2) Pray to God asking for forgiveness. (3) Seek God continually. (4) Turn from sinful behavior. We need to remember that true repentance is more than mere talkIt is a changed behavior. Whether we sin individually, as a group, or as a nationFollowing these steps will lead to forgiveness-God will answer our earnest prayers.",
    "prayer": "Dear Lord, whatever activities come my way, give me the wisdom to recognize what is evil before I become ensnared in it. Grant me the strength to resist every temptation to sin. Let me never be ashamed to say, \"How can I do this great wickedness and sin against God?\" Amen.",
    "reading": "",
    "original_content": "Today's Verse: 2 Chron 7:14 \n\nIf my people who are called by my name will humble themselves and pray and\nseek my face and turn from their wicked ways,\n\nI will hear from heaven and will forgive their sins and restore their land. \n\n\n\nToday's thoughts:\n\nIn chapter 6 we see that Solomon had asked God to make provisions for the\npeople when they sinned.\n\nGod answered with four conditions for forgiveness(1) Humble yourself by admitting your sins.\n\n(2) Pray to God asking for forgiveness.\n\n(3) Seek God continually.\n\n(4) Turn from sinful behavior.\n\nWe need to remember that true repentance is more than mere talkIt is a changed behavior. .\n\n\n\nWhether we sin individually, as a group, or as a nationFollowing these steps will lead to forgiveness-God will answer our earnest\nprayers. .\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord, whatever activities come my way, give me the wisdom to recognize \n\nwhat is evil before I become ensnared in it. Grant me the strength to resist\n\nevery temptation to sin. Let me never be ashamed to say, \"How can I do this\n\ngreat wickedness and sin against God?\" Amen.\n\n\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-_1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f75a65ea16672d",
    "date_utc": "Mon, 24 Jun 2013 05:06:56 -0500",
    "subject": "thoughts to live by",
    "verse": "Do not judge others, and you will not be judged. Do not condemn others, or it will all come back against you. Forgive others, and you will be forgiven. (Luke 6:37)",
    "reflection": "A forgiving spirit demonstrates that a person has received God's forgiveness. If we are critical rather than compassionate, we will also receive criticism. If we treat others generously, graciously, and compassionately-these qualities will come back to us in full measure. We are to love others-not judge them. .",
    "prayer": "Dear Lord, grant me the opportunity today to do good to someone in need of love. Show me how to live in a manner worthy of Your holy name. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Luke 6:37 (Jesus says)\n\n\"Do not judge others, and you will not be judged. Do not condemn others, \n\nor it will all come back against you. Forgive others, and you will be\nforgiven \n\n\n\nToday's Thoughts:\n\nA forgiving spirit demonstrates that a person has received God's\nforgiveness.\n\nIf we are critical rather than compassionate, we will also receive\ncriticism.\n\nIf we treat others generously, graciously, and compassionately-these\nqualities\n\nwill come back to us in full measure. .\n\n\n\nWe are to love others-not judge them. .\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord, grant me the opportunity today to do good to someone in need of\nlove.\n\nShow me how to live in a manner worthy of Your holy name. Amen.\n\n\n\nPastor Alvin and Marcie Sather\n\nWorship the LORD with gladness; \ncome before him with joyful songs. Psalm 100:2",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f7ad6b90f4d593",
    "date_utc": "Tue, 25 Jun 2013 05:17:33 -0500",
    "subject": "thoughts to live by",
    "verse": "I tell you not to worry about everyday life-whether you have enough food and drink, or enough clothes to wear. Isn't life more than food, and your body more than clothing? (Matt 6:25)",
    "reflection": "Because of the ill effects of worry, Jesus tells us not the worry about those needs God has promised to supply. Worry may: (1) Damage your health. (2) Disrupt your productivity. (3) Negatively effect the way you treat others-and(4) Reduce your ability to trust God. How many ill effects of worry are you experiencing? ? ? Here is the difference between worry and genuine concern: Worry immobilizes-BUT-concerns moves people to action.",
    "prayer": "Dear Lord Jesus, You are my strength and my hope. Without You I am nothing-but all things are possible for those who trust in You. Give me the grace to see my sins and confess them to You. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Matt 6:25\n\nI tell you not to worry about everyday life-whether you have enough food and\ndrink, or enough clothes to wear. \n\nIsn't life more than food, and your body more than clothing?\n\n\n\nToday's Thoughts: \n\nBecause of the ill effects of worry, Jesus tells us not the worry about\nthose needs\n\nGod has promised to supply.\n\nWorry may:\n\n(1) Damage your health.\n\n(2) Disrupt your productivity.\n\n(3) Negatively effect the way you treat others-and(4) Reduce your ability to trust God. .\n\n\n\nHow many ill effects of worry are you experiencing? ? ?\n\nHere is the difference between worry and genuine concern:\n\nWorry immobilizes-BUT-concerns moves people to action. .\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord Jesus, You are my strength and my hope.\n\nWithout You I am nothing-but all things are possible\n\nfor those who trust in You. Give me the grace to see my \n\nsins and confess them to You. Amen.\n\n\n\n\n\nPastor Alvin and Marcie Sather \n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f8000077e7784a",
    "date_utc": "Wed, 26 Jun 2013 05:20:47 -0500",
    "subject": "thoughts to live by",
    "verse": "But the Lord will have mercy on the descendants of Jacob. He will choose Israel as His special people once again. He will bring them back to settle once again in their own land. And people from many different nations will come and join them there and unite with the people of Israel. (Isaiah 14:1)",
    "reflection": "A prominent theme in Isaiah is that non-Israelites would join the returning Israelites. (Isaiah 56:6, 7; 60:10; 61:15) God's intention was that through His faithful people all the world would be blest. Through the family of David, the whole world could be saved by Christ. We must never limit God's love to our own people. God loves the whole world.",
    "prayer": "Dear Lord Jesus, how great is Your mercy that You would have people to be saved and come to the knowledge of the truth! Keep me mindful of Your command to go into all the world and preach the gospel to every creature, so that people everywhere may come to know the truth of Your saving love. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Isaiah 14:1 \n\n1 But the Lord will have mercy on the descendants of Jacob. He will choose\nIsrael as His special people once again.\n\nHe will bring them back to settle once again in their own land. And people\nfrom many different nations will come and \n\njoin them there and unite with the people of Israel.\n\n\n\nToda's Thoughts:\n\nA prominent theme in Isaiah is that non-Israelites would join the returning\nIsraelites. (Isa. 56:6, 7; 60:10; 61:15)\n\nGod's intention was that through His faithful people all the world would be\nblest. .\n\n\n\nThrough the family of David, the whole world could be saved by Christ. \n\nWe must never limit God's love to our own people. God loves the whole world.\n\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord Jesus, how great is Your mercy that You would have people to \n\nbe saved and come to the knowledge of the truth! Keep me mindful of Your\n\ncommand to \"Go into all the world and preach the gospel to every creature,\"\n\nso that people everywhere may come to know the truth of Your saving love. .\n. Amen.\n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"He says, \"Be still, and know that I am God;\" Psalm 46:10",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f851ad7cfa81b2",
    "date_utc": "Thu, 27 Jun 2013 05:08:13 -0500",
    "subject": "thoughts to live by",
    "verse": "Morning, noon, and night I cry out in my distress, and the Lord hears my voice. (Psalm 55:17)",
    "reflection": "Praying in this way is certainly an excellent way to maintain correct priorities throughout every day. Daniel followed this pattern (Daniel 6:10) and so did Peter (Acts 10:9-10). The prayers of God's people are effective against the overwhelming evil in the world. Let us pray for our countries leaders, both federal, state, and local.",
    "prayer": "Dear Lord, I thank You for hearing my prayers, help me to be faithful in my prayer life like Daniel and Peter. I ask this for I know that I need Your Spirit's directive because of the sinful times we are living in. Be with those who are struggling with the different issues of this life, whether it be financialphysical-or domestic-lay Your hand of comfort on them and give them the peace that only You can give. I pray for godly wisdom for our countries leaders in Jesus name. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Psalm 55:17\n\nMorning, noon, and night I cry out in my distress, and the Lord hears my\nvoice. \n\n\n\nToday's Thoughts:\n\nPraying in this way is certainly an excellent way to maintain correct\npriorities throughout every day.\n\nDaniel followed this pattern (Dan. 6:10) and so did Peter (Acts 10:9-10).\n\nThe prayers of God's people are effective against the overwhelming evil in\nthe world. .\n\nLet us pray for our countries leaders, both federal, state, and local. .\n\n\n\nToday's Prayer Suggestion:\n\nDear Lord, I thank You for hearing my prayers, help me to be faithful in my\nprayer life like Daniel and Peter.\n\nI ask this for I know that I need Your Spirit's directive because of the\nsinful times we are living in.\n\nBe with those who are struggling with the different issues of this life,\nwhether it be financialphysical-or domestic-lay Your hand of comfort on them and give them the\npeace\n\nthat only You can give. I pray for godly wisdom for our countries leaders\nin Jesus name. Amen. \n\n\n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f8a327a1765162",
    "date_utc": "Fri, 28 Jun 2013 04:52:09 -0500",
    "subject": "thoughts to live by",
    "verse": "\"Looking unto Jesus, the champion who initiates and perfects our faith.\" (Hebrews 12:2)",
    "reflection": "It is forever the Holy Spirit's work to turn our eyes away from self to Jesus; but Satan's work is just the opposite of this, for he is constantly trying to make us regard ourselves instead of Christ. He insinuates, \"Your sins are too great for pardon-you have no faith-you do not repent enough-you will never be able to continue to the end-you do not have the joy of His children-you have such a wavering hold of Jesus. \" All these are thoughts about self, and we shall never find comfort or assurance by looking within. But the Holy Spirit turns our eyes entirely away from self: He tells us that we are nothing-but that \"Christ is all in all. \" Remember, it is not your hold of Christ that saves you-it is Christ-it is not your joy in Christ that saves you-it is Christ-it is not even faith in Christ-though that is the instrument-it is Christ's blood and merits; so, look not so much to your hand with which you are grasping Christ, as to Christ-look not to your hope, but to Jesus, the source of your hope-look not to your faith, but to Jesus, the author and finisher of your faith. We will never find happiness by looking at our prayers-our works-or our feelings-it is what Jesus is, not what we are, that gives rest to the soul. If we would at once overcome Satan and have peace with God-it must be by \"looking to Jesus. \" Keep your eye simply on Him-let His death-His sufferings-His merits-His glories-His intercession-be totally on your mind-when you wake in the morning look to Him-when you lie down at night look to Him. DON'T! let your hopes or fears come between you and Jesus; follow Him, with all your mite, and He will never fail you.",
    "prayer": "Dear Lord, I pray that I would always be sensitive to Your Holy Spirit's leading. Bind Satin's attempts to draw my eyes from You to myself, for without You I am nothing. Help me cling to the path that leads to eternal life. Amen.",
    "reading": "",
    "original_content": "Today's Verses: Heb. 12:2\n\n\"Looking unto Jesus, the champion who initiates and perfects our faith.\" \n\n\n\nToday's Thoughts:\n\nIt is forever the Holy Spirit's work to turn our eyes away from self to\nJesus; but Satan's work is just the opposite of this, for he is constantly\ntrying to make us regard ourselves instead of Christ. He insinuates, \"Your\nsins are too great for pardon-you have no faith-you do not repent enough-you\nwill never be able to continue to the end-you do not have the joy of His\nchildren-you have such a wavering hold of Jesus.\" \n\nAll these are thoughts about self, and we shall never find comfort or\nassurance by looking within. But the Holy Spirit turns our eyes entirely\naway from self: He tells us that we are nothing-but that \"Christ is all in\nall.\" Remember, it is not your hold of Christ that saves you-it is Christ-it\nis not your joy in Christ that saves you-it is Christ-it is not even faith\nin Christ-though that is the instrument-it is Christ's blood and merits; so,\nlook not so much to your hand with which you are grasping Christ, as to\nChrist-look not to your hope, but to Jesus, the source of your hope-look not\nto your faith, but to Jesus, the author and finisher of your faith. We will\nnever find happiness by looking at our prayers-our works-or our feelings-it\nis what Jesus is, not what we are, that gives rest to the soul. If we would\nat once overcome Satan and have peace with God-it must be by \"looking to\nJesus.\" Keep your eye simply on Him-let His death-His sufferings-His\nmerits-His glories-His intercession-be totally on your mind-when you wake\nin the morning look to Him-when you lie down at night look to Him. DON'T!\nlet your hopes or fears come between you and Jesus; follow Him, with all\nyour mite, and He will never fail you.\n\nToday's Prayer Suggestion:\n\nDear Lord, I pray that I would always be sensitive to Your Holy Spirit's\nleading.\n\nBind Satin's attempts to draw my eyes from You to myself, for without You I\nam\n\nnothing. Help me cling to the path that leads to eternal life. .Amen. \n\n\n\nPastor Alvin and Marcie Sather\n\n\"Shout for joy to the LORD, all the earth.\" Palsm 100-_1",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "13f8f70444e4304b",
    "date_utc": "Sat, 29 Jun 2013 05:17:45 -0500",
    "subject": "thoughts to live by",
    "verse": "For the word of the Lord holds true, and we can trust everything He does. (Psalm 33:4)",
    "reflection": "All of God's Words are true and trustworthy. The Bible is reliable becauseunlike people, God does not lie-forget-change his Words-or leave His promises unfulfilled. We can trust the Bible because-it contains Words of a-holy-trustworthy-and unchangeable God.",
    "prayer": "Dear Heavenly Father, I thank You for the reliability of Your WordI thank You that it is trustworthy-true-and unchanging. I thank You that You do not leave one promise unfulfilled. Help me Lord to be true to Your word. Amen.",
    "reading": "",
    "original_content": "Today's Verse: Ps. 33:4\n\n\n\nFor the word of the Lord holds true, and we can trust everything He does. \n\nToday's Thoughts:\n\nAll of God's Words are true and trustworthy. The Bible is reliable becauseunlike people, God does not lie-forget-change his Words-or leave His\npromises\n\nunfulfilled. .\n\n\n\nWe can trust the Bible because-it contains Words of a-holy-trustworthy-and\n\nunchangeable God. .\n\n\n\nToday's Prayer Suggestion:\n\nDear Heavenly Father, I thank You for the reliability of Your WordI thank You that it is trustworthy-true-and unchanging. \n\nI thank You that You do not leave one promise unfulfilled.\n\nHelp me Lord to be true to Your word. Amen.\n\n\n\nI will be leaving for Medora N. D. this morning ao there will not be any\nDevos. \n\nUntil Tue. Morning. .\n\n\n\nPastor Alvin and Marcie Sather\n\n\"I am the way and the truth and the life.\n\nNo one comes to the Father except through me.\" John 14:6",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]