[
  {
    "message_id": "118743bc0a33dbb2",
    "date_utc": "Sun, 2 Mar 2008 18:00:26 -0600",
    "subject": "thoughts to live by",
    "verse": "If anyone is hungry he should eat at home, so that when you meet together it may not result in judgment. And when I come I will give further directions. (I Corinthians 11:34) NIV",
    "reflection": "We should come to the Lord's Table desiring to fellowship with other believers and come in an attitude of faith that we are receiving the true body and blood of our Lord Jesus Christ. We should always partake of the Lord's Supper in the right frame of mind. We should never, ever, come to the Lord's Supper with a grudge against someone. If we don't forgive how can we expect God to forgive us??? When we pray the Lord's prayer, don't we pray, \"Forgive us our trespasses as we forgive those who trespass against us.\"",
    "prayer": "Dear Heavenly Father, refresh my memory of any sin or thought I hold against another person. Cleanse me of all unrighteousness. Amen.",
    "reading": "",
    "original_content": "Hi!!!~~~(food for thought)~~~The measure of a person is not how great his faith is\nBUT how great his love is...(I Cor. 13:13)\n\nOur Bible Verse for Today:\n\nIf anyone is hungry he should eat at home, so that when you meet together\nit may not result in judgment. And when I come I will give further directions.\n(I Cor. 11:34) NIV\n\nOur Lesson for Today:\n\nWe should come to the Lord's Table desiring to fellowship\nwith other believers and come in an attitude of faith that we\nare receiving the true body and blood of our Lord Jesus Christ. \n\nWe should always partake of the Lord's Supper in the right \nframe of mind...\n\nWe should never, ever, come to the Lord's Supper with a\ngrudge against someone...\n\nIf we don't forgive how can we expect God to forgive us???\n\nWhen we pray the Lord's prayer, don't we pray, \"Forgive us\nour trespasses as we forgive those who trespass against us.\"\n\nOur Prayer for Today:\nDear Heavenly Father, refresh my memory of any sin or thought\nI hold against another person...Cleanse me of all unrighteousness. Amen.\n\nKeep looking up, He is our sustainer/provider...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11879512f3cd5a67",
    "date_utc": "Mon, 3 Mar 2008 15:34:21 -0600",
    "subject": "thoughts to live by",
    "verse": "Now about spiritual gifts, brothers, I do not want you to be ignorant. You know that when you were pagans, somehow or another you were influenced and led astray to mute idols. Therefore I tell you that no one who is speaking by the Spirit of God says, \"Jesus be cursed, \" and no one can say, \"Jesus is Lord, \" except by the Holy Spirit. (I Corinthians 12:1-3) NIV",
    "reflection": "It is a reality that anyone can claim to speak for God, and the world is full of false teachers. Paul gives us a test to help us discern whether or not a message is really from God: Does he or she confess Christ as Lord? Don't naively accept the words of all who claim to speak for God. Test their credentials by finding out what they teach about Christ.",
    "prayer": "Dear Heavenly Father, I pray for wisdom to discern the teaching of others so that I and others would not be led astray, by false teaching. Help me to be sensitive to Your Holy Spirit's teaching. Amen.",
    "reading": "",
    "original_content": "Hi!!!~~~(food for thought)~~~Real friends are those who, when you've made a fool\nof yourself, don't feel you've done a permanent job. (I Cor. 13:7, 8)\n\nOur Bible Verses for Today:\n\nNow about spiritual gifts, brothers, I do not want you to be ignorant.\n\nYou know that when you were pagans, somehow or another you were \ninfluenced and led astray to mute idols...\n\nTherefore I tell you that no one who is speaking by the Spirit of God \nsays, \"Jesus be cursed,\" and no one can say, \"Jesus is Lord,\" except\nby the Holy Spirit...(I Cor. 12:1-3) NIV\n\nOur Lesson for Today:\n\nIt is a reality that anyone can claim to speak for God, and the world is\nfull of false teachers...\n\nPaul gives us a test to help us discern whether or not a message is \nreally from God:\n\nDoes he or she confess Christ as Lord?\nDon't naively accept the words of all who claim to speak for God.\nTest their credentials by finding out what they teach about Christ...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray for wisdom to discern\nthe teaching of others so that I and others would not \nbe led astray, by false teaching. Help me to be sensitive\nto Your Holy Spirit's teaching...Amen.\n\nKeep looking up, for discernment...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1187e24de98c436b",
    "date_utc": "Tue, 4 Mar 2008 16:52:20 -0600",
    "subject": "thoughts to live by",
    "verse": "To each one the manifestation of the Spirit is given for the common good. to one there is given through the Spirit the message of wisdom, to another the message of knowledge by means of the same Spirit. to another faith by the same Spirit, to another gifts of healing by that one Spirit. (I Corinthians 17:7-9)",
    "reflection": "No matter what gifts we have been given they all have come from the Holy Spirit. We are responsible to use and sharpen our gifts, but we can take no credit for what God has freely given.",
    "prayer": "Dear Heavenly Father, I pray that I would become more responsible for the gifts you have given. Forgive me for not always using my gifts as You would have me to do. Amen.",
    "reading": "",
    "original_content": "Hi!!!~~~(food for thought)~~~Be careful that your marriage doesn't become\na duel instead of a duet...(Ro. 14:19).\n\nOur Bible Verses for Today:\n\nTo each one the manifestation of the Spirit is given for \nthe common good...\n\nto one there is given through the Spirit the message of \nwisdom, to another the message of knowledge by means\nof the same Spirit...\n\nto another faith by the same Spirit, to another gifts of healing\nby that one Spirit...(( Cor. 17:7-9) NIV.\n\nOur Lesson for Today:\n\nNo matter what gifts we have been given they all have \ncome from the Holy Spirit...\n\nWe are responsible to use and sharpen our gifts, but\nwe can take no credit for what God has freely given...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that I would become more\nresponsible for the gifts you have given. Forgive me for \nnot always using my gifts as You would have me to do...Amen.\n\nKeep looking up, He has a work for you to do...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11883ab79a2936ec",
    "date_utc": "Wed, 5 Mar 2008 13:43:28 -0600",
    "subject": "thoughts to live by",
    "verse": "The body is a unit, though it is made up of many parts; and though all its parts are many, they form on body. So it is with Christ. (I Corinthians 12:12) NIV",
    "reflection": "Paul compares the body of Christ with a human body. Each part as a specific function that is necessary to the body as a whole. The parts are different for a purpose, and in their difference they must work together. Christians have to avoid two common errors: (1) Being proud of their abilities, ~ or (2) Thinking they have nothing to give to the body of believers. Instead of comparing ourselves to one another, we should use our different gifts, together, to spread the Good News of salvation.",
    "prayer": "Dear Heavenly Father, Help me to never doubt my usefulness. I know I was created for a purpose, so use me as You choose. Amen.",
    "reading": "",
    "original_content": "Hi!!!~~~(food for thought)~~~Sorry yesterdays devotion was not I Cor. 17:7-9\nIt was I Cor. 12:7-9)...\n\nOur Bible Verse for Today:\n\nThe body is a unit, though it is made up of many parts; \nand though all its parts are many, they form on body.\nSo it is with Christ...(I Cor. 12:12) NIV\n\nOur Lesson for Today:\n\nPaul compares the body of Christ with a human body.\nEach part as a specific function that is necessary to\nthe body as a whole...\n\nThe parts are different for a purpose, and in their difference\nthey must work together. Christians have to avoid two common\nerrors:\n\n(1) Being proud of their abilities, ~ or\n(2) Thinking they have nothing to give\nto the body of believers...\n\nInstead of comparing ourselves to one another, we should use\nour different gifts, together, to spread the Good News of salvation.\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to never doubt my usefulness.\nI know I was created for a purpose, so use me as You choose...Amen.\n\nKeep looking up, He will make His wishes known...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1188879b60135778",
    "date_utc": "Thu, 6 Mar 2008 18:00:29 -0600",
    "subject": "thoughts to live by",
    "verse": "For we are all baptized by one Spirit into one body whether Jew or Greek, slave or free ~ and we were all given the one Spirit to drink. (I Corinthians 12:13) NIV",
    "reflection": "We need to remember that the church is composed of many types of people from a variety of backgrounds with a multitude of gifts and abilities. It is easy for these differences to divide people as was the case in Corinth. BUT despite the differences, all believers have one thing in common ~ faith in Christ. On this essential truth the church can find unity. All believers are baptized by the one Holy Spirit into one body of believers, the church. We don't lose our individual identities, but we have an overriding oneness in Christ. When we become a Christian the Holy Spirit takes up residence in us, and we are born into God's family.\"We have all received the same Spirit\" means that we have all received the same Holy Spirit. As members of God's family, we may have different interests and gifts, but we are united by the Spirit into one spiritual body.",
    "prayer": "Dear Heavenly Father, I thank You for making me a part of Your family. I pray for a greater unity between the believers of Your church. Amen.",
    "reading": "",
    "original_content": "Hi!!!~~~(food for thought)~~~The secret of achievement is to not let what you're\ndoing get to you before you get to it...(Pro. 16:3)\n\nOur Bible Verse for Today:\n\nFor we are all baptized by one Spirit into one body whether\nJew or Greek, slave or free ~ and we were all given the one\nSpirit to drink...(I Cor 12:13) NIV\n\nOur Lesson for Today:\n\nWe need to remember that the church is composed of many\ntypes of people from a variety of backgrounds with a multitude\nof gifts and abilities...\n\nIt is easy for these differences to divide people as was the \ncase in Corinth. BUT despite the differences, all believers\nhave one thing in common ~ faith in Christ...\n\nOn this essential truth the church can find unity. All believers\nare baptized by the one Holy Spirit into one body of believers,\nthe church...\n\nWe don't lose our individual identities, but we have an overriding\noneness in Christ. When we become a Christian the Holy Spirit \ntakes up residence in us, and we are born into God's family.\n\n\"We have all received the same Spirit\" means that we have all \nreceived the same Holy Spirit...As members of God's family,\nwe may have different interests and gifts, but we are united by\nthe Spirit into one spiritual body...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for making me a part\nof Your family. I pray for a greater unity between the believers\nof Your church...Amen.\n\nKeep looking up, He is seeking unity in the body, the church\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1188dfd3da1bc3a1",
    "date_utc": "Fri, 7 Mar 2008 12:10:48 -0600",
    "subject": "thoughts to live by",
    "verse": "Please read these verses before going any farther (I Corinthians 12:14-24) ~ don't cheat!",
    "reflection": "Using the analogy of the body, Paul emphasizes the importance of each church member. If a seemingly insignificant part is taken away, the whole body becomes less effective. BUT thinking your gift is more important than someone else's IS an expression of spiritual pride. We should not look down on those who seem unimportant, and we should not be jealous of others who have more visible gifts. Instead, we should use the gifts we have been given and encourage others to use theirs. If we don't, the body of believers will be less effective.",
    "prayer": "Dear Heavenly Father, Help me to see how to better use the gifts You have given me. Help me be a better encourage to those who have not found their place in the body of believers. Amen.",
    "reading": "",
    "original_content": "Wop-pee its Saturday!!!~~~(food for thought)~~~Most people wish to serve God ~ BUT\nonly in an advisory capacity...(I Pet. 5:6)\n\nOur Bible Verses for Today:\n\nPlease read these verses before going any farther\n(I Cor. 12:14-24) ~ don't cheat!\n\n\n\nOur Lesson for Today:\n\nUsing the analogy of the body, Paul emphasizes the importance of\neach church member...\n\nIf a seemingly insignificant part is taken away, the whole body becomes\nless effective. BUT thinking your gift is more important than someone\nelse's IS an expression of spiritual pride...\n\nWe should not look down on those who seem unimportant, and we\nshould not be jealous of others who have more visible gifts...\n\nInstead, we should use the gifts we have been given and encourage\nothers to use theirs. If we don't, the body of believers will be less\neffective...\n\nOur Prayer for Today:\nDear Heavenly Father, Help me to see how to better use the gifts \nYou have given me. Help me be a better encourager to those who\nhave not found their place in the body of believers...Amen.\n\nKeep looking up, He answers prayer...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11897c5f107450b3",
    "date_utc": "Sun, 9 Mar 2008 13:14:54 -0600",
    "subject": "thoughts to live by",
    "verse": "There should be no divisions in the body, but that its parts should have equal concern for each other. If one part suffers, every part suffers with it; if one part is honored, every part rejoices with it. (I Corinthians 12:25 26) NIV",
    "reflection": "Its time for an honest assessment of ourselves. What is your response when a fellow Christian is honored? How do you respond when someone is suffer? Scriptures tell us we are to be happy with those who are happy, and if they are sad, share their sorrow (Romans 12:15). Too often, unfortunately, we are jealous of those who rejoice and apathetic to those who weep ~ As believers we are in the world together ~ there is no such thing as private or individualistic Christianity. We need to get involved in the lives of others and not just enjoy our own relationship with God.",
    "prayer": "Dear Heavenly Father remove from me all forms of envy. Help me to be thankful for all that I have ~ and rejoice with those who seemingly have more. Help me to prepare myself for your loving purpose. Amen.",
    "reading": "",
    "original_content": "Hi!!!~~~(food for thought)~~~Conscience is God's built-in warning system. Be very happy \nwhen it hurts you. Be very worried when it doesn't.\n\nOur Bible verses for Today:\n\nThere should be no divisions in the body, but that its parts should\nhave equal concern for each other...\n\nIf one part suffers, every part suffers with it; if one part is honored,\nevery part rejoices with it...(I Cor. 12:25 26) NIV\n\nOur Lesson for Today:\n\nIts time for an honest assessment of ourselves...\n\nWhat is your response when a fellow Christian is honored?\nHow do you respond when someone is suffer?\n\nScriptures tell us we are to be happy with those who are happy,\nand if they are sad, share their sorrow (Ro. 12:15).\n\nToo often, unfortunately, we are jealous of those who rejoice\nand apathetic to those who weep ~ As believers we are in the \nworld together ~ there is no such thing as private or individualistic\nChristianity...\n\nWe need to get involved in the lives of others and not just enjoy\nour own relationship with God...\n\nOur Prayer for Today:\nDear Heavenly Father remove from me all forms of envy.\nHelp me to be thankful for all that I have ~ and rejoice with\nthose who seemingly have more. Help me to prepare myself\nfor your loving purpose...Amen.\n\nKeep looking up, He has a purpose for your life...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1189d194397f9f95",
    "date_utc": "Mon, 10 Mar 2008 12:29:50 -0600",
    "subject": "thoughts to live by",
    "verse": "Are all apostle? Are all prophet? are all teachers? Do all work miracles? Do all have gifts of healing? Do all speak in tongues? Do all interpret? But eagerly desire the greater gifts. (I Corinthians 12:29-31) NIV",
    "reflection": "The most helpful gifts are those that are beneficial to the body of Christ. Paul has already made it clear that one gift is not superior to another, but he urges the believers to discover how they can serve Christ's body with the gifts God has given them. Your spiritual gifts are not for your own self-advancement. They were given to you for serving God and enhancing the spiritual growth of the body of believers.",
    "prayer": "Dear Heavenly Father, Help me Lord to make myself available to You and the body of believers. Help me Lord to see how best to serve. Amen.",
    "reading": "",
    "original_content": "Tue. 11th!!!~~~(food for thought)~~~So many forget God all day and \nask Him to remember them at night...\n\nOur Bible Verses for Today:\n\nAre all apostle? Are all prophet? are all teachers? Do all work miracles? \n\nDo all have gifts of healing? Do all speak in tongues? Do all interpret? \n\nBut eagerly desire the greater gifts...(I Cor. 12:29-31) NIV\n\nOur Lesson for Today:\n\nThe most helpful gifts are those that are beneficial to the body of \nChrist. Paul has already made it clear that one gift is not superior\nto another, but he urges the believers to discover how they can\nserve Christ's body with the gifts God has given them...\n\nYour spiritual gifts are not for your own self-advancement. They \nwere given to you for serving God and enhancing the spiritual\ngrowth of the body of believers...\n\nOur Prayer for Today:\nDear Heavenly Father, Help me Lord to make myself\navailable to You and the body of believers. Help me\nLord to see how best to serve...Amen.\n\nKeep looking up, He has the answers...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118a267f6f270416",
    "date_utc": "Tue, 11 Mar 2008 11:46:27 -0600",
    "subject": "thoughts to live by",
    "verse": "Love is patient, love is kind. It does not envy, it does not boast, it is not proud. It is not rude, it is not self-seeking, it is not easily angered, it keeps no record of wrongs. Love does not delight in evil but rejoices with the truth. It always protects, always trusts, always hopes, always perseveres. (I Corinthians 13:4-7) NIV",
    "reflection": "To often today our society confuses love with lust. Unlike lust God's kind of love is directed outward toward others, not inward toward ourselves. It is utterly unselfish. This kind of love goes against our natural inclinations. It is impossible to have this love unless God helps us set aside our own natural desires so that we can love and not expect anything in return. The more we become like Christ, the more love we will show to others.",
    "prayer": "Dear Heavenly Father, help me to set aside my sinful desires. Help me to be more loving. Help me to be more sensitive and obedient to Your Spirit's leading and guiding. Amen.",
    "reading": "",
    "original_content": "Wed. 12th~~~(food for thought)~~If you don't stand for something\nyou'll fall for anything...(Isa. 7:9b) NIV\n\nOur Bible Verses for Today:\n\nLove is patient, love is kind. It does not envy, it does not boast,\nit is not proud...\n\nIt is not rude, it is not self-seeking, it is not easily angered, it keeps\nno record of wrongs...\n\nLove does not delight in evil but rejoices with the truth...\n\nIt always protects, always trusts, always hopes, always persevers...\n(I Cor. 13:4-7) NIV\n\nOur Lesson for Today:\n\nTo often today our society confuses love with lust. Unlike lust God's \nkind of love is directed outward toward others, not inward toward\nourselves...\n\nIt is utterly unselfish. This kind of love goes against our natural inclinations.\nIt is impossible to have this love unless God helps us set aside our own\nnatural desires so that we can love and not expect anything in return...\n\nThe more we become like Christ, the more love we will show to others...\n\nOur Prayer for Today:\nDear Heavenly Father, help me to set aside my sinful desires.\nHelp me to be more loving. Help me to be more sensitive and \nobedient to Your Spirit's leading and guiding...Amen.\n\nKeep looking up, follow His leading...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118a78a3481122c4",
    "date_utc": "Wed, 12 Mar 2008 09:51:18 -0600",
    "subject": "thoughts to live by",
    "verse": "Again, if the trumpet does not sound a clear call, who will get ready for battle? So it is with you. Unless you speak intelligible words with your tongue, how will anyone know what you are saying? You will just be speaking into the air. Undoubtedly there are all sorts of languages in the world, yet none of them is without meaning. (I Corinthians 14:8-10) NIV",
    "reflection": "What are you using your God given gifts for??? God gives us spiritual gifts in order to build up, serve, and strengthen fellow Christians ~ the church. In eternity we will be made perfect and complete and will be in the very presence of God. We will no longer need spiritual gifts, so they will come to an end.",
    "prayer": "Dear Heavenly Father, I pray that You would forgive me for not always using the gifts You have give to build, serve, and strengthen the body of believers. I thank You for those who have ministered to me in my moments of weakness. Amen.",
    "reading": "",
    "original_content": "Thur, 3/13/08~~~(food for thought)~~~The measure of a person's character is not what he gets from his \nancestors, but what he leaves his descendents. Pro. 13:22\n\nOur Bible Verses for Today:\n\nAgain, if the trumpet does not sound a clear call, who will get\nready for battle?\n\nSo it is with you. Unless you speak intelligible words with your\ntongue, how will anyone know what you are saying? You will\njust be speaking into the air...\n\nUndoubtedly there are all sorts of languages in the world, yet \nnone of them is without meaning...(I Cor. 14:8-10) NIV\n\n\nOur Lesson for Today:\n\nWhat are you using your God given gifts for???\n\nGod gives us spiritual gifts in order to build up, serve,\nand strengthen fellow Christians ~ the church...\n\nIn eternity we will be made perfect and complete and will\nbe in the very presence of God. We will no longer need\nspiritual gifts, so they will come to an end...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that You would forgive me for\nnot always using the gifts You have give to build, serve, \nand strengthen the body of believers. I thank You for those\nwho have ministered to me in my moments of weakness...Amen.\n\nKeep looking up, He will show you the way...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118acc88dab6c7a2",
    "date_utc": "Thu, 13 Mar 2008 15:58:38 -0600",
    "subject": "thoughts to live by",
    "verse": "Anyone who speaks in a tongue should pray that he may interpret what he says. For if I pray in a tongue, my spirit prays, but my mind is unfruitful. So what shall I do? I will pray with my spirit, but I will also pray with my mind; I will sing with my spirit, but I will also sing with my mind. (I Corinthians 14:13-15) NIV",
    "reflection": "What Paul is saying is there is a proper place for the intellect in Christianity. In praying and singing, both the mind and the spirit should be fully engaged. When we sing, we should also be thinking about the meaning ~ (message) in the words. When we poor out our feelings to God in prayer, we should not turn off our capacity to think. Let us remember ~ 'True Christianity' is neither barren intellectualism nor thoughtless emotionalism.",
    "prayer": "Dear Heavenly Father, I thank you for giving mean the capability to reason. I pray that you would forgive me when my mind seems to wonder in the middle of a prayer. I want to be open to Your Spirit's leading, but I also want to be focused on the needs that I want You to address. I pray this in Jesus name. Amen.",
    "reading": "",
    "original_content": "03/14/08~~~(food for thought)~~~Although the tongue weighs very little,\nfew people are able to hold it...(Jm.3:5)\n\nOur Bible Verses for Today:\n\nAnyone who speaks in a tongue should pray that he may interpret \nwhat he says...\n\nFor if I pray in a tongue, my spirit prays, but my mind is unfruitful...\n\nSo what shall I do? I will pray with my spirit, but I will also pray\nwith my mind; I will sing with my spirit, but I will also sing with my\nmind...(I Cor. 14:13-15) NIV\n\nOur Lesson for Today:\n\nWhat Paul is saying is there is a proper place for the intellect\nin Christianity...\n\nIn praying and singing, both the mind and the spirit should be\nfully engaged. When we sing, we should also be thinking about\nthe meaning ~ (message) in the words...\n\nWhen we poor out our feelings to God in prayer, we should not \nturn off our capacity to think...\n\nLet us remember ~ 'True Christianity' is neither barren intellectualism\nnor thoughtless emotionalism...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank you for giving mean the capability to\nreason. I pray that you would forgive me when my mind seems to \nwonder in the middle of a prayer. I want to be open to Your Spirit's\nleading, but I also want to be focused on the needs that I want You\nto address...I pray this in Jesus name...Amen.\n\nKeep looking up, for His will to fulfill...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118b1d2b400881b7",
    "date_utc": "Fri, 14 Mar 2008 18:20:51 -0600",
    "subject": "thoughts to live by",
    "verse": "Tongues, then, are a sign, not for believers but for unbelievers; Prophecy, however, is for believers, not for unbelievers. So if the whole church comes together and everyone speaks in tongues, and some who do not understand or some unbelievers come in, will they not say that you are out of your mind? But if an unbeliever or someone who does not understand comes in while everybody is prophesying, he will be convinced by all, that he is a sinner and will be judged by all, and the secrets of the heart will be laid bare, so he will fall down and Worship God, exclaiming, \"God is really among you!\" (I Corinthians 14:22-25 NIV",
    "reflection": "The way the Corinthians were speaking in tongues was helping no one because believers did not understand what was being said, and unbelievers thought that the people speaking in tongues were crazy. Speaking in tongues was supposed to be a sign to unbelievers (as it was in Acts 2). After speaking in tongues believers were supposed to explain what was said and give the credit to God. The unsaved people would then be convinced of a spiritual reality and motivated to look further into the Christian faith. While this is one way to reach unbelievers, Paul says that clear preaching is usually better (14:5).",
    "prayer": "Dear Heavenly Father, I pray that my witness would always be clear to the unbeliever. May my actions be a true witness each and every day. I pray that my witness would motivate the unbeliever to examine Your Word more closely. Amen.",
    "reading": "",
    "original_content": "03/15/08~~~(food for thought)~~~You should never let adversity get you down ~\nexcept on your knees...(Jm. 5:13a)\n\nOur Bible Verses for Today:\n\nTongues, then, are a sign, not for believers but for unbelievers; \nProphecy, however, is for believers, not for unbelievers...\n\nSo if the whole church comes together and everyone speaks in\ntongues, and some who do not understand or some unbelievers\ncome in, will they not say that you are out of your mind?\n\nBut if an unbeliever or someone who does not understand comes \nin while everybody is prophesying, he will be convinced by all, that \nhe is a sinner and will be judged by all,\n\nand the secrets of the heart will be laid bare, so he will fall down and\nWorship God, exclaiming, \"God is really among you!\" (I Cor. 14:22-25 NIV\n\nOur Lesson for Today:\n\nThe way the Corinthians were speaking in tongues was helping \nno one because believers did not understand what was being \nsaid, and unbelievers thought that the people speaking in tongues\nwere crazy...\n\nSpeaking in tongues was supposed to be a sign to unbelievers\n(as it was in Acts 2)...\n\nAfter speaking in tongues believers were supposed to explain\nwhat was said and give the credit to God. The unsaved people \nwould then be convinced of a spiritual reality and motivated\nto look further into the Christian faith...\n\nWhile this is one way to reach unbelievers, Paul says that clear\npreaching is usually better (14:5).\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that my witness would always \nbe clear to the unbeliever. May my actions be a true witness\neach and every day. I pray that my witness would motivate \nthe unbeliever to examine Your Word more closely...Amen.\n\nKeep looking up, He is only a prayer away...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118bc174db2c6947",
    "date_utc": "Sun, 16 Mar 2008 13:19:26 -0600",
    "subject": "thoughts to live by",
    "verse": "What then shall we say, brothers? when you come together everyone has a hymn, or a word of instruction, a revelation, a tongue or an interpretation. All of these must be done for the strengthening of the church. If anyone speaks in a tongue, two or at the most three ~ should speak, one at a time, and someone must interpret. If there is no interpreter, the speaker should keep quiet in the church and speak to himself and God. (I Corinthians 14:26-28) NIV",
    "reflection": "Everything done in a worship service must be beneficial to the worshipers. This principle touches every aspect ~ singing, preaching, and the exercise of spiritual gifts. Those who are contributing to the services, such as (singers, speakers and readers) must have love as their chief motivation, speaking useful words or participating in a way that will strengthen the faith of other believers.",
    "prayer": "Dear Heavenly Father help me to always contribute to the worship service in such a way that it will be conducted in an orderly manner. I know Lord that You are not a God of confusion, and that Your Spirit cannot work when there is chaos and disorder. I pray this in the Name of Jesus. Amen.",
    "reading": "",
    "original_content": "03/17/08~~~(food for thought)~~~He who wants milk should not sit in the middle of the pasture \nexpecting the cow to come back up to him...(Pro. 10:4)\n\nOur Bible verses for Today:\n\nWhat then shall we say, brothers? when you come together everyone\nhas a hymn, or a word of instruction, a revelation, a tongue or an \ninterpretation. All of these must be done for the strengthening of the\nchurch...\n\nIf anyone speaks in a tongue, two or at the most three ~ should speak,\none at a time, and someone must interpret....\n\nIf there is no interpreter, the speaker should keep quiet in the church\nand speak to himself and God...(I Cor. 14:26-28) NIV\n\nOur Lesson for Today:\n\nEverything done in a worship service must be beneficial to the worshipers.\n\nThis principle touches every aspect ~ singing, preaching, and the exercise\nof spiritual gifts.\n\nThose who are contributing to the services, such as (singers, speakers\nand readers) must have love as their chief motivation, speaking useful \nwords or participating in a way that will strengthen the faith of other believers.\n\nOur Prayer for Today:\nDear Heavenly Father help me to always contribute to \nthe worship service in such a way that it will be conducted\nin an orderly manner. I know Lord that You are not a God \nof confusion, and that Your Spirit cannot work when there \nis chaos and disorder. I pray this in the Name of Jesus...Amen.\n\nKeep looking up, for His will to fulfill...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather...",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118c13fa43c7f323",
    "date_utc": "Mon, 17 Mar 2008 14:34:07 -0600",
    "subject": "thoughts to live by",
    "verse": "Women should remain silent in the churches. They are not allowed to speak, but must be in submission, as the Law says. If they want to inquire about something, they should ask their husbands at home; for it is disgraceful for a woman to speak in church. (I Corinthians 14:34, 35) NIV",
    "reflection": "Does this mean that women should not speak in church services today? It is clear from (I Corinthians 11:5) that women prayed and prophesied in public worship. It is also clear in Chapt. 12-14 that women are given spiritual gifts and are encouraged to exercise them in the body of Christ. Women have much to contribute and can participate in worship services. It may have been such a thing that the women were questioning the order of worship and cause disputes in the church that could have been settled at home. The purpose for Paul's words was to promote unity, not to teach about women's roles in the church. Remember God is ~ a God of order.",
    "prayer": "Dear Heavenly Father, I pray that you would guide us to take part in church functions in an orderly fashion. Help us to agree to disagree in a loving manner when we cannot come to an agreement on some subject. Amen.",
    "reading": "",
    "original_content": "03/18/08 ~~~ (food for thought) ~~~ The best bridge between hope and despair\nis often a good night's sleep...(Ps. 127:2)\n\nOur Bible Verses for Today:\n\nWomen should remain silent in the churches. They are not\nallowed to speak, but must be in submission, as the Law says.\n\nIf they want to inquire about something, they should ask their\nhusbands at home; for it is disgraceful for a woman to speak\nin church...(I Cor. 14:34, 35) NIV\n\nOur Lesson for Today:\n\nDoes this mean that women should not speak in church services today?\n\nIt is clear from (I Cor. 11:5) that women prayed and prophesied in public worship.\nIt is also clear in Chapt. 12-14 that women are given spiritual gifts and are\nencouraged to exercise them in the body of Christ...\n\nWomen have much to contribute and can participate in worship services...\n\nIt may have been such a thing that the women were questioning the\norder of worship and cause disputes in the church that could have been \nsettled at home...\n\nThe purpose for Paul's words was to promote unity, not to teach about\nwomen's roles in the church...\n\nRemember God is ~ a God of order...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that you would guide us\nto take part in church functions in an orderly fashion.\nHelp us to agree to disagree in a loving manner when\nwe can not not come to an agreement on some subject...Amen.\n\nKeep looking up, His will to obey...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118c681c2dc168d2",
    "date_utc": "Tue, 18 Mar 2008 14:44:07 -0600",
    "subject": "thoughts to live by",
    "verse": "Therefore my brothers, be eager to prophesy, and do not forbid speaking in tongues. But everything should be done in a fitting and orderly way. (I Corinthians 14:39, 40) NIV",
    "reflection": "Worship is vital to the life of an individual and to the whole church. Our church services should be conducted in an orderly way so that we can worship, be taught, and be prepared to serve God. Those who are responsible for planning the worship service should make sure it has order and direction rather then chaos and confusion.",
    "prayer": "Dear Heavenly Father, I pray that You would help me to prepare my heart for worship each time I enter Your church. Quiet my thoughts and give be a teachable spirit I pray in Jesus name. Amen.",
    "reading": "",
    "original_content": "03/19/08 ~~~ food for thought) ~~~ It is good the remember that a tea-kettle, although up to its\nneck in hot water, continues to sing...(I Thess. 5:16, 18)...\n\nOur Bible verses for Today:\n\nTherefore my brothers, be eager to prophesy, and do not forbid\nspeaking in tongues...\n\nBut everything should be done in a fitting and orderly way...\n(I Cor. 14:39, 40) NIV\n\nOur Lesson for Today:\n\nWorship is vital to the life of an individual and to the whole\nchurch. \n\nOur church services should be conducted in an orderly \nway so that we can worship, be taught, and be prepared \nto serve God...\n\nThose who are responsible for planning the worship service\nshould make sure it has order and direction rather then chaos\nand confusion...\n\nOur Prayer for Today:\nDear Heavenly Father, I pray that You would help me \nto prepare my heart for worship each time I enter Your \nchurch. Quiet my thoughts and give be a teachable\nspirit I pray in Jesus name...Amen.\n\nKeep looking up, He is the way and the truth...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118cb8be2de0daec",
    "date_utc": "Wed, 19 Mar 2008 15:10:04 -0600",
    "subject": "thoughts to live by",
    "verse": "Now, brothers, I want to remind you of the gospel I preached to you, which you received and on which you have taken your stand. By this gospel you are saved, if you hold firmly to the word I preached to you. Otherwise you have believed in vain. (1 Corinthians 15:1-2)",
    "reflection": "Many churches contain people who do not yet believe. Some are moving in the direction of belief, and others are simply pretending. Imposers, however, are not to be removed, for that is the Lord's work. The good news about Jesus Christ will save us if we firmly believe, it and faithfully follow it.",
    "prayer": "Dear Heavenly Father, Truly open my heart to Your Word, that I may not sin against you. Halter my tongue so that only wholesome words would precede from my lips. Amen.",
    "reading": "",
    "original_content": "03/20'08 ~~~ (food for thought) ~~~ It is good to be a Christian and know it, but it is better\nto be a Christian and show it...(Jn. 13:33)\n\nOur Bible Verses for Today:\n\nNow, brothers, I want to remind you of the gospel I preached to you,\nwhich you received and on which you have taken your stand...\n\nBy this gospel you are saved, if you hold firmly to the word I preached \nto you. Other-wise you have believed in vain...(Jn. 15: 1, 2) NLT\n\nOur Lesson for Today:\n\nMany churches contain people who do not yet believe...\n\nSome are moving in the direction of belief, and others are simply\npretending...\n\nImposters, however, are not to be removed, for that is the Lord's \nwork...\n\nThe good news about Jesus Christ will save us if we firmly believe,\nit and faithfully follow it...\n\nOur Prayer for Today:\nDear Heavenly Father, Truly open my heart to Your Word,\nthat I may not sin against you. Halter my tongue so that only\nwholesome words would precede from my lips...Amen.\n\nKeep looking up, He is only a prayer away...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118d0a6fa9b432cc",
    "date_utc": "Thu, 20 Mar 2008 13:27:49 -0600",
    "subject": "thoughts to live by",
    "verse": "What I received I passed on to you as of first importance: that Christ died for our sins according to the Scriptures, that He was buried, that He was raised on the third day according to the Scriptures. (I Corinthians 15:3, 4) NIV",
    "reflection": "There will always be people who say that Jesus didn't rise from the dead. But Paul assures us that many people saw Jesus after His resurrection: In verse 5 and following Paul says, Peter, the disciples (the twelve) and more than 500 Christian believers saw Him. The Resurrection is a historical fact. Don't be discouraged by doubters who deny the Resurrection. Be filled with hope because of the knowledge that one day you and they will see the living proof when Christ returns.",
    "prayer": "Dear Heavenly Father, I thank You for the Scriptures which tells us the Good News that Your Son did rise from the dead and that one day we too will be raised to new life. I pray that Your Holy Spirit will be able to awaken the hearts of those who do not believe. Amen.",
    "reading": "",
    "original_content": "03/21/08 ~~~ Sorry about the mix-up on yesterdays devo. I'm doing a devotional \nfrom John for some of my grand-kids and I typed in Jn instead of \nI Cor. The verses were right but the text was wrong....\n\nOur Bible Verses for Today:\n\nWhat I received I passed on to you as of first importance: that Christ died \nfor our sins according to the Scriptures,\n\nthat He was buried, that He was raised on the third day according to the\nScriptures...(I Cor 15:3, 4) NIV\n\nOur Lesson for Today:\n\nThere will always be people who say that Jesus didn't rise from the dead.\nBut Paul assures us that many people saw Jesus after His resurrection:\n\nIn verse 5 and following Paul says, Peter, the disciples (the twelve) and more\nthan 500 Christian believers saw Him...\n\nThe Resurrection is a historical fact. Don't be discouraged by doubters who\ndeny the Resurrection. Be filled with hope because of the knowledge that\none day you and they will see the living proof when Christ returns...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the Scriptures which\ntells us the Good News that Your Son did rise from the dead\nand that one day we too will be raised to new life. I pray\nthat Your Holy Spirit will be able to awaken the hearts of those\nwho do not believe...Amen.\n\nKeep looking up, in love for He first loved you...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118d5d0a7989f705",
    "date_utc": "Fri, 21 Mar 2008 16:09:24 -0600",
    "subject": "thoughts to live by",
    "verse": "Paul says, \"I am the least of the apostles and do not even deserve to be called an apostle, because I persecuted the church of God. But by the grace of God, I am what I am, and His grace to me was not without effect. No I worked harder than all of them ~ yet not I, but the grace of God that was in me. (I Corinthians 15:9, 10) NIV",
    "reflection": "As a zealous Pharisee, Paul had been an enemy of the Christian Church, even to the point of capturing and persecuting believers (see Acts 9:1-3). So he felt unworthy to be called an apostle of Christ. But it goes without saying that He did become the most influential of the apostles. Paul was deeply humble ~ he knew that he had worked hard and had accomplished much but only because God had poured kindness and grace upon him. True humility is not convincing yourself that you are worthless but recognizing God's work in you. It is having God's perspective on who you are and acknowledging His grace in developing your abilities.",
    "prayer": "Dear Heavenly Father, I do at times feel that I am not worthy, but seeking for sensitivity and obedience to Your Holy Spirits leading I can become what You will for me to be. Lead me in the path of righteousness. Amen.",
    "reading": "",
    "original_content": "03/22/08 ~~~ (food for thought) ~~~ God can help us love those who are often \nunlovable...(I Jn. 4:11)\n\nOur Bible Verses for Today:\n\nPaul says, \"I am the least of the apostles and do not even deserve\nto be called an apostle, because I persecuted the church of God.\n\nBut by the grace of God, I am what I am, and His grace to me was\nnot without effect. No I worked harder than all of them ~ yet not I, \nbut the grace of God that was in me... (I Cor 15:9, 10) NIV\n\nOur Lesson for Today:\n\nAs a zealous Pharisee, Paul had been an enemy of the Christian Church,\neven to the point of capturing and persecuting believers (see Acts 9:1-3).\n\nSo he felt unworthy to be called an apostle of Christ. But it goes without \nsaying that He did become the most influential of the apostles...\n\nPaul was deeply humble ~ he knew that he had worked hard and had\naccomplished much but only because God had poured kindness and\ngrace upon him...\n\nTrue humility is not convincing yourself that you are worthless but\nrecognizing God's work in you. It is having God's perspective on who\nyou are and acknowledging His grace in developing your abilities...\n\nOur Prayer for Today:\nDear Heavenly Father, I do at times feel that I am not worthy,\nbut seeking for sensitivity and obedience to Your Holy Spirits\nleading I can become what You will for me to be...Lead me\nin the path of righteousness...Amen.\n\nKeep looking up, He is the Way ~ the Truth ~ and the Life\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118e02b407cd24be",
    "date_utc": "Sun, 23 Mar 2008 16:14:05 -0600",
    "subject": "thoughts to live by",
    "verse": "If there is no resurrection from the dead, then not even Christ has been raised. And if Christ has not been raised, our preaching is useless and so is your faith. More than that, we are found to be false witnesses about God, for we have testified about God that He raised Christ from the dead. BUT He did not raise Him if in fact the dead are not raided. For if the dead are not raised, than Christ has not been raised either. And if Christ has not been raised, your faith is futile; you are still dead in your sins. Then those also who have fallen asleep in Christ are lost. (I Corinthians 15:13-18) NIV (Tuesdays devotion will give you the rest of the story)",
    "reflection": "The resurrection of Christ is the central thought of the gospel message, and because Christ was raised from the dead as He promised, we know that what He said is true ~ He is God. Because He rose, we have the certainty that our sins are forgiven. Because He rose, He lives and represents us to God. Because He rose, and defeated death, we know that we will also be raised.",
    "prayer": "Dear Heavenly Father, I thank you for all that You accomplished on the cross in my behalf. I thank You for the forgiveness of sins. I thank You that You are my mediator, and I thank You that one day You will raise me from the dead to a place that You have prepared for me in Your Kingdom. Amen.",
    "reading": "",
    "original_content": "03/24/08 ~~~ (food for thought) ~~~ We are rich according to what we are,\nnot according to what we have...(Pro.13:7) \n\nOur Bible Verses for Today:\n\nIf there is no resurrection from the dead, then not even Christ has been\nraised...\n\nAnd if Christ has not been raised, our preaching is useless and so is\nyour faith...\n\nMore than that, we are found to be false witnesses about God, for we \nhave testified about God that He raised Christ from the dead. BUT He \ndid not raise Him if in fact the dead are not raided...\n\nFor if the dead are not raised, than Christ has not been raised either.\n\nAnd if Christ has not been raised, your faith is futile; you are still dead \nin your sins...\n\nThen those also who have fallen asleep in Christ are lost...(I Cor. 15:13-18) NIV\n(Tuesdays devotion will give you the rest of the story)\n\nOur Lesson for Today:\n\nThe resurrection of Christ is the central thought of the gospel message,\nand because Christ was raised from the dead as He promised, we know\nthat what He said is true ~ He is God...\n\nBecause He rose, we have the certainty that our sins are forgiven.\nBecause He rose, He lives and represents us to God.\nBecause He rose, and defeated death, we know that we will also be raised...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank you for all that You accomplished\non the cross in my behalf. I thank You for the forgiveness of sins.\nI thank You that You are my mediator, and I thank You that one\nday You will raise me from the dead to a place that You have\nprepared for me in Your Kingdom...Amen.\n\nKeep looking up, He will guide you through life...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118e50ba0cdb05bf",
    "date_utc": "Mon, 24 Mar 2008 13:57:58 -0600",
    "subject": "thoughts to live by",
    "verse": "If only for this we have hope in Christ, we are to be pitied more than all men. But Christ has indeed been raised from the dead, the first fruits of those who have fallen asleep. (I Corinthians 15:19, 20 ) NIV",
    "reflection": "Why does Paul say believers would be miserable if there were only earthly value to Christianity? Well we need to remember that in Paul's day Christianity brought a person persecution, ostracism from family, and, in many cases, poverty. These were few tangible benefits from being a Christian in that society. It was certainly not a step up the social or career later. More important is the fact that if Christ had not been resurrected from the dead, Christian would not be forgiven of their sins or have any hope of eternal life. Now just as the first fruits of the harvest were brought to the temple as an offering, so Christ was the first to rise from the dead and never die again. He is our forerunner, the guarantee of our eventual resurrection to eternal life.",
    "prayer": "Dear Heavenly Father, I thank You that because of Your death and resurrection, I have the guarantee of my eventual resurrection to eternal life with You in Your Kingdom. Amen.",
    "reading": "",
    "original_content": "03/25/08 ~~~ (food for thought) ~~~ Life can only be understood by looking backward,\nbut it must be lived by looking forward...(Lk. 9:62)\n\nOur Bible Verses for Today:\n\nIf only for this we have hope in Christ, we are to be pitied\nmore than all men...\n\nBut Christ has indeed been raised from the dead, the first \nfruits of those who have fallen asleep...(I Cor. 15:19, 20 ) NIV\n\nOur Lesson for Today:\n\nWhy does Paul say believers would be miserable if there were\nonly earthly value to Christianity?\n\nWell we need to remember that in Paul's day Christianity brought\na person persecution, ostracism from family, and, in many cases,\npoverty...\n\nThese were few tangible benefits from being a Christian in that\nsociety. It was certainly not a step up the social or career later...\n\nMore important is the fact that if Christ had not been resurrected \nfrom the dead, Christian would not be forgiven of their sins or\nhave any hope of eternal life...\n\nNow just as the first fruits of the harvest were brought to the\ntemple as an offering, so Christ was the first to rise from the \ndead and never die again...\n\nHe is our forerunner, the guarantee of our eventual resurrection\nto eternal life...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You that because of Your\ndeath and resurrection, I have the guarantee of my eventual\nresurrection to eternal life with You in Your Kingdom...Amen.\n\nKeep looking up, to Jesus, who is the Leader\nand the source of our faith...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118ea8081da1f4de",
    "date_utc": "Tue, 25 Mar 2008 16:21:49 -0600",
    "subject": "thoughts to live by",
    "verse": "For since death came through one man, the resurrection of the dead comes also through a man. For as in Adam all die, so in Christ all will be made alive. Each in his own turn; Christ the firstfruits; then, when He comes, those who belong to Him. (I Corinthians 15:21-23) NIV",
    "reflection": "Death came into the world as a result of Adam & Eve's sin. In Romans 5:12-21, Paul explained why Adam's sin brought sin to all people, how death and sin spread to all humans because of his first sin and the parallel between Adam's death and Christ's resurrection.",
    "prayer": "Dear Heavenly Father, bring to the forefront of my mind my sins today, that I may confess them to You and have them washed away. Lead my feet on solid ground. Amen.",
    "reading": "",
    "original_content": "03/26/08 ~~~ (food for thought) ~~~ Sometime we are so busy adding up our troubles\nthat we forget to count our blessings...(Ps. 77:11, 12)\n\nOur Bible Verses for Today:\n\nFor since death came through one man, the resurrection\nof the dead comes also through a man...\n\nFor as in Adam all die, so in Christ all will be made alive...\n\nEach in his own turn; Christ the firstfruits; then, when He \ncomes, those who belong to Him...(I Cor. 15:21-23) NIV\n\nOur Lesson for Today:\n\nDeath came into the world as a result of Adam & Eve's sin...\n\nIn Ro. 5:12-21, Paul explained why Adam's sin brought sin to \nall people, how death and sin spread to all humans because \nof his first sin and the parallel between Adam's death and \nChrist's resurrection...\n\nOur Prayer for Today:\nDear Heavenly Father, bring to the forefront of my mind my\nsins today, that I may confess them to You and have them \nwashed away. Lead my feet on solid ground...Amen.\n\nKeep looking up, that you might be lead in childlike faith...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118efa1a709c2948",
    "date_utc": "Wed, 26 Mar 2008 11:53:11 -0600",
    "subject": "thoughts to live by",
    "verse": "He must reign until He has put all His enemies under His feet. The last enemy to be destroyed is death. For He \"has put everything under His feet.\" Now when it says that \"everything\" has been put under Him, it is clear that this does not include God Himself, who put everything under Christ. When He has done this, then the Son Himself will be made subject to Him who put everything under Him, So that God may be all in all. (I Corinthians 15:25-28) NIV",
    "reflection": "Even though God the Father and God the Son are equal, each has a special work to do and an area of sovereign control (15:28). Christ is not inferior to the Father, but His work is to defeat all evil on the earth. First, He defeated sin and death on the cross, and in the end He will defeat Satan and all evil. World events may seem to be out of control, and justice may seem to have vanished. But God is in control, allowing evil to remain for a time until He sends Jesus to earth again. Then He will present to God a perfect new world.",
    "prayer": "Dear Heavenly Father, I thank You for Your perfect plan ~ but I pray for patience while I wait for it to come into being. Forgive me for worrying about all the sinful worldly events, help me to put my trust in You. Amen.",
    "reading": "",
    "original_content": "03/27/08 ~~~ (food for thought) ~~~ Falling down doesn't make you a failure,\nbut staying down does...(Pro. 24:16a)\n\nOur Bible Verses for Today:\n\nHe must reign until He has put all His enemies under His feet...\n\nThe last enemy to be destroyed is death...\n\nFor He \"has put everything under His feet.\" Now when it says\nthat \"everything\" has been put under Him, it is clear that this does\nnot include God Himself, who put everything under Christ...\n\nWhen He has done this, then the Son Himself will be made\nsubject to Him who put everything under Him, So that God may\nbe all in all...(I Cor. 15:25-28) NIV\n\nOur Lesson for Today:\n\nEven though God the Father and God the Son are equal, each\nhas a special work to do and an area of sovereign control (15:28).\n\nChrist is not inferior to the Father, but His work is to defeat all\nevil on the earth. First, He defeated sin and death on the cross,\nand in the end He will defeat Satan and all evil...\n\nWorld events may seem to be out of control, and justice may\nseem to have vanished. But God is in control, allowing evil to\nremain for a time until He sends Jesus to earth again. Then \nHe will present to God a perfect new world...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for Your perfect\nplan ~ but I pray for patience while I wait for it to come\ninto being. Forgive me for worrying about all the sinful\nworldly events, help me to put my trust in You...Amen.\n\nKeep looking up, His timing is perfect...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118f4d9c9170c85a",
    "date_utc": "Thu, 27 Mar 2008 14:40:02 -0600",
    "subject": "thoughts to live by",
    "verse": "Now if there is no resurrection, what will those do who are baptized for the dead? If the dead are not raised at all, why are people baptizing them? And as for us, why do we endanger ourselves every hour? I die every day ~ I mean that, brothers ~ just as surely as I glory over you in Christ Jesus our Lord. If I fought wild beasts in Ephesus for merely human reasons, what have I gained? If the dead are not raised, \"Let us eat and drink, for tomorrow we die, \" Do not be misled: \"Bad company corrupts good character.\" Come back to your senses as you ought, and stop sinning; for there are some who are ignorant of God ~ I say this to your shame. (I Corinthians 15:29-34) NIV",
    "reflection": "If death ended it all, enjoying the moment would be all that mattered. But Christians know that there is life beyond the grave and that our life on earth is only a preparation for our life that will never end. What you do today matters for eternity. In light of eternity sin is a foolish gamble.",
    "prayer": "Dear Heavenly Father, I thank you for the Life that you have promised to all who believed. Help me to always remember to put my trust in You, each time I put my trust in myself I become frustrated. Forgive me for attempting to fix something only You can change. Amen.",
    "reading": "",
    "original_content": "03/28/08 ~~~ (food for thought) ~~~ If a task is once begun, never leave it till it's done.\nBe a labor great or small, do it well or not at all...(Jn. 17:4)\n\nOur Bible Verses for Today:\n\nNow if there is no resurrection, what will those do who are baptized\nfor the dead? If the dead are not raised at all, why are people baptizing \nthem?\n\nAnd as for us, why do we endanger ourselves every hour?\n\nI die every day ~ I mean that, brothers ~ just as surely as I glory over \nyou in Christ Jesus our Lord...\n\nIf I fought wild beasts in Ephesus for merely human reasons, what\nhave I gained? If the dead are not raised, \"Let us eat and drink, for\ntomorrow we die,\"\n\nDo not be misled: \"Bad company corrupts good character.\"\n\nCome back to your senses as you ought, and stop sinning; for\nthere are some who are ignorant of God ~ I say this to your shame...\n(I Cor. 15:29-34) NIV\n\nOur Lesson for Today:\n\nIf death ended it all, enjoying the moment would be all that mattered.\nBut Christians know that there is life beyond the grave and that our \nlife on earth is only a preparation for our life that will never end...\n\nWhat you do today matters for eternity. In light of eternity sin is a\nfoolish gamble...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank you for the Life that you have \npromised to all who believed...Help me to always remember \nto put my trust in You, each time I put my trust in myself I\nbecome frustrated. Forgive me for attempting to fix something only You can change...Amen.\n\nKeep looking up, God can change you for the better...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "118fa365f1f60a87",
    "date_utc": "Fri, 28 Mar 2008 10:43:06 -0600",
    "subject": "thoughts to live by",
    "verse": "Someone may ask, \"How are the dead raised? With what kind of body will they come?\" How foolish! What you sow does not come to life unless it dies. (I Corinthians 15:35, 36) NIV",
    "reflection": "Paul launches into a discussion about what our resurrection bodies will be like. If you could select you own bodies what kind would you choose??? What would you choose ~~~ would it be strong - athletic or beautiful? Paul explains that we will be recognizable in our resurrected body, yet it will be better than we can imagine, because it will be made to last for ever. We will still have our own personality and individuality, but they will be perfect through Christ's work.",
    "prayer": "Dear Heavenly Father, I thank You for the promise that one day I will have a glorious body one that will never age, one that will never experience pain or suffering, yet one that will be recognizable to those who have gone on before. Amen.",
    "reading": "",
    "original_content": "03/29/08 ~~~ (food for thought) ~~~ Time is more valuable than money because\ntime is irreplaceable...(Eph. 5:16)\n\nOur Bible Verses for Today:\n\nSomeone may ask, \"How are the dead raised? With what\nkind of body will they come?\"\n\nHow foolish! What you sow does not come to life unless it\ndies...(I Cor. 15:35, 36) NIV\n\nOur Lesson for Today:\n\nPaul launches into a discussion about what our resurrection\nbodies will be like. If you could select you own bodies what \nkind would you choose???\n\nWhat would you choose ~~~ would it be strong - athletic or beautiful? \n\nPaul explains that we will be recognizable in our resurrected\nbody, yet it will be better than we can imagine, because it will \nbe made to last for ever...\n\nWe will still have our own personality and individuality, but they \nwill be perfect through Christ's work...\n\nOur Prayer for Today:\nDear Heavenly Father, I thank You for the promise that one \nday I will have a glorious body one that will never age, one \nthat will never experience pain or suffering, yet one that will \nbe recognizable to those who have gone on before...Amen.\n\nKeep looking up, He will gently lead...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "1190459f68be9c97",
    "date_utc": "Sun, 30 Mar 2008 13:15:09 -0600",
    "subject": "thoughts to live by",
    "verse": "The sun has one kind of glory, while the moon and stars each have another kind. And even the stars differ from each other in their beauty and brightness. It is the same way of the resurrection of the dead. Our earthly bodies, which die and decay, will be different when they are resurrected, for they will never die. Our bodies now disappoint us, but when they are raised, they will be full of glory. They are weak now, but when they are raised, they will be full of power. They are natural human bodies now, but when they are raised, they will be spiritual bodies. For just as there are natural bodies, so also there are spiritual bodies. (I Corinthians 15:41-44) NLT",
    "reflection": "Our natural bodies are perishable and prone to decay. But our resurrection bodies will be transformed. Our spiritual bodies will not be limited by the laws of nature. This does not necessarily mean we will be super-people, but our body will be different from and more capable than our present earthly body. Our spiritual body will not be weak, we will never get sick, and we will never die. .",
    "prayer": "Dear Heavenly Father, I am looking forward to the day we will receive our spiritual bodies where there will be no more sorrows or tears, no more pain or death. I thank You for the promise of a new home with You. Amen.",
    "reading": "",
    "original_content": "03/31/08 ~~~ (food for thought) ~~~ The best way to forget your own problems\nis to help someone solve his...(Phil. 2:4).\n\nOur Bible Verses for Today:\n\nThe sun has one kind of glory, while the moon and stars each have\nanother kind. And even the stars differ from each other in their beauty\nand brightness...\n\nIt is the same way of the resurrection of the dead. Our earthly bodies,\nwhich die and decay, will be different when they are resurrected, for \nthey will never die...\n\nOur bodies now disappoint us, but when they are raised, they will be\nfull of glory. They are weak now, but when they are raised, they will\nbe full of power...\n\nThey are natural human bodies now, but when they are raised, they \nwill be spiritual bodies. For just as there are natural bodies, so also\nthere are spiritual bodies...(I Cor. 15:41-44) NLT\n\nOur Lesson for Today:\n\nOur natural bodies are perishable and prone to decay.\nBut our resurrection bodies will be transformed...\n\nOur spiritual bodies will not be limited by the laws of nature.\nThis does not necessarily mean we will be super-people,\nbut our body will be different from and more capable than\nour present earthly body...\n\nOur spiritual body will not be weak, we will never get sick, \nand we will never die....\n\nOur Prayer for Today:\nDear Heavenly Father, I am looking forward to the day we will\nreceive our spiritual bodies where there will be no more sorrows\nor tears, no more pain or death. I thank You for the promise of \na new home with You...Amen.\n\nKeep looking up, His hand is gently knocking on your door...\nYou are in the prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  },
  {
    "message_id": "11909506f2577ef1",
    "date_utc": "Mon, 31 Mar 2008 16:08:50 -0600",
    "subject": "thoughts to live by",
    "verse": "So it is written: \"The first man Adam became a living being; \" the last Adam, a life giving spirit. (I Corinthians 12:45) NIV",
    "reflection": "Because Christ rose from the dead, He is a life giving spirit. This means that He entered into a new form of existence. He is the source of the spiritual life that will result in our resurrection. Christ's new glorified human body now suits His new glorified life just as Adam's human body was suitable to his natural life. When we are resurrected, God will give us a transformed, eternal bodies suited to our new eternal life.",
    "prayer": "Dear Heavenly Father, Thank You for the promise of a glorified body. A Body that will know no pain or sorrow. A body that will live with you eternally. Amen.",
    "reading": "",
    "original_content": "04/01/08 ~~~ (food for thought) ~~~ God can heal a broken heart but He has to\nhave all the pieces...(Pro. 23:26a)\n\nOur Bible Verse for Today:\n\nSo it is written: \"The first man Adam became a living being;\"\nthe last Adam, a life giving spirit...(I Cor 12:45) NIV\n\nOur Lesson for Today:\n\nBecause Christ rose from the dead, He is a life giving spirit.\n\nThis means that He entered into a new form of existence.\nHe is the source of the spiritual life that will result in our \nresurrection...\n\nChrist's new glorified human body now suits His new glorified life\njust as Adam's human body was suitable to his natural life.\n\nWhen we are resurrected, God will give us a transformed, eternal\nbodies suited to our new eternal life...\n\nOur Prayer for Today:\nDear Heavenly Father, Thank You for the promise of a glorified \nbody. A Body that will know no pain or sorrow. A body that will \nlive with you eternally...Amen.\n\nKeep looking up, to the King Eternal...\nYou are in the Prayers of two who care...\nPastor Al & Marcie Sather",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "found_reading": false
  }
]