[
  {
    "message_id": "177650cf1868cf8e",
    "date_utc": "2021-02-02T23:21:23+00:00",
    "subject": "ONE PURPOSE AMID MANY VARIETIES",
    "verse": "Now there are different kinds of spiritual  gifts, but it is the same kinds of Holy Spirit who is the source of them all (I Corinthians 12:4)",
    "reflection": "Let us remember that there is a beauty in God’s people that being that they serve with the variety of gifts given to them by the Holy Spirit.\nPaul mentioned some: “To one there is given through the Spirit the message of wisdom, to another the mess-age of knowledge, -- to another faith, -- to another the gifts of healing” (I Corinthians 12:8)\nand so on. The Holy Spirit has one purpose in distributing the spiritual gifts in so great a variety, and that is that Christians not only profess but also proclaim that “Jesus is Lord” (I Corinthians 12:3). What a privilege!",
    "prayer": "Remember to always ask the Holy Spirit to assist you in properly using the gifts He has entrusted to you for the sake of Jesus, your Savior.",
    "original_content": "message_id: 177650cf1868cf8e\nsubject   : Subject: ONE PURPOSE AMID MANY VARIETIES (2-3-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 2 Feb 2021 17:21:23 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Now there are different kinds of spiritual *\n\n*gifts, but it is the same* *kinds of Holy Spirit who is the source of them\nall *(I Cor. 12:4)\n\n\n\n*Today’s Reflection:*\n\nLet us remember that there is a beauty in God’s people that being that they\nserve\n\nwith the variety of gifts given to them by\n\nthe Holy Spirit. Paul mentioned some:\n\n“To one there is given through the Spirit\n\nthe message of wisdom, to another the mess-age of knowledge, -- to another\nfaith, -- to another the gifts of healing” (I Cor.12:8) and so on. The\nHoly Spirit has one purpose in\n\ndistributing the spiritual gifts in so great a variety, and that is that\nChristians not only profess but also proclaim that “Jesus is Lord” (I Cor.\n12:3). What a privilege!\n\n* Pastor Sather*\n\n*Remember to always ask the Holy Spirit *\n\n*to assist you in pro**perly using the gifts He has entrusted to you for\nthe sake of **Jesus, *\n\n*your Savior.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 12:4-6 AI",
    "found_reading": true
  },
  {
    "message_id": "1776a67804846b33",
    "date_utc": "2021-02-04T00:18:24+00:00",
    "subject": "GOD GIVES THE HUMBLE A LIFT",
    "verse": "He has brought down rulers from their thrones but has lifted up the humble. (Luke 1:52)",
    "reflection": "How quickly God can bring down the proud and powerful! As the psalmist warned, “Do not put your trust, in mortal men, who cannot save. When their spirit departs, they return to the ground; on that very day their plans come to nothing” Psalm 146:3-4)\nWho alone saves? Of course it is Jesus Christ, the Son of God, who by the works of His own hands, the travail of His soul in the Garden of Gethsemane, and His death on the cross restored what Adam and Eve forfeited: the inher- itance of eternal life… Let us remember to ask the heavenly Father to give us the humble mind of Jesus Christ and to help us walk in His steps.",
    "prayer": "Almighty God, we humbly acknowledge our dependence on You alone for salvation and eternal life, recognizing the fleeting nature of earthly power and pride. Help us to embody the humility of Christ and faithfully follow in His footsteps each day. (AI)",
    "original_content": "message_id: 1776a67804846b33\nsubject   : Subject: GOD GIVES THE HUMBLE A LIFT (2-4-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 3 Feb 2021 18:18:24 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*He has brought down rulers from their*\n\n*thrones but has lifted up the humble. *\n\n*(Lk. 1:52)*\n\n\nToday’s * Reflection:*\n\nHow quickly God can bring down the\n\nproud and powerful! As the psalmist\n\nwarned, “Do not put your trust, in mortal\n\nmen, who cannot save. When their spirit\n\ndeparts, they return to the ground; on\n\nthat very day their plans come to nothing”\n\n*Ps. 146:3-4)*\n\nWho alone saves? Of course it is Jesus\n\nChrist, the Son of God, who by the works\n\nof His own hands, the travail of His soul\n\nin the Garden of Gethsemane, and His\n\ndeath on the cross restored what\n\nAdam and Eve forfeited: the inher-\n\nitance of eternal life…\n\n\n\n*Let us remember to ask the heavenly *\n\n*Father to give **us the humble **mind of *\n\n*Jesus Christ and to help us walk **in His *\n\n*steps.*\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "James 4:6 AI",
    "found_reading": true
  },
  {
    "message_id": "1776f49956188887",
    "date_utc": "2021-02-04T23:03:49+00:00",
    "subject": "PATIENCE PAYS OFF",
    "verse": "God sets Himself against the proud, but He shows favor to the humble. So humble yourselves under the mighty Power of God, and in His good time He will honor you. (James 4:6-7)",
    "reflection": "We often worry about position and status, hoping to get proper recognition for what we do. But Peter advises us to remember that God's recognition counts more than human praise. God is able and willing to bless us according to His timing. Humbly obey God regardless of present circumstances, and His good timing--either in this life or in the next--He will honor you!",
    "prayer": "Let us seek the Holy Spirit's leading to give us patience to wait for God's blessing . . .",
    "original_content": "message_id: 1776f49956188887\nsubject   : Subject: PATIENCE PAYS OFF (2-5-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 4 Feb 2021 17:03:49 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today's Verses:*\n*\"God sets Himself against the proud, but He shows favor*\n*to the humble. So humble yourselves under the mighty*\n*Power of God, and in His good time He will honor you.*\n* (I Pet. 5b-6)*\n\n*Today's Reflection:*\n*We often worry about position and status, hoping to get*\n*proper recognition for what we do. But Peter advises us*\n*to remember that God's recognition counts more than*\n*human praise. God is able and willing to bless us according*\n*to His timing. Humbly obey God regardless of present *\n*circumstances, and His good timing--either in this life*\n*or in the next--He will honor you!*\n* Pastor Sather*\n*Let us seek the Holy Spirit's leading to give us patience*\n*to wait for God's blessing . . . *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "James 4:10 AI",
    "found_reading": true
  },
  {
    "message_id": "177743b0d9657ed9",
    "date_utc": "2021-02-05T22:06:03+00:00",
    "subject": "BELIEVING IN THE WORD",
    "verse": "Since God did not even spare His own Son but gave Him up for us all, won’t God, who gave us  Christ, also give us everything else? (Romans 8:32)",
    "reflection": "Do you ever think that you are not good enough\nfor God, so He surely will not save you? Do you\never feel as if salvation is for everyone else?\nThen this verse is especially for you. If God gave\nHis Son for the world, He isn’t going to hold the\nthe gift of salvation from you! If Christ gave His\nlife for you, He isn’t going to turn around and condemn you! He will not withhold anything\nyou need to serve Him. The book of Roman’s is an explanation of God’s redeeming grace— it’s meant to be a book of comfort and confid- ence, addressed to the person who is dealing with doubt.",
    "prayer": "Ask the Lord Jesus to renew your faith in His great gift each day, so you will trust in Him to give you lesser gifts.",
    "original_content": "message_id: 177743b0d9657ed9\nsubject   : Subject: BELIEVING IN THE WORD (2-6-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 5 Feb 2021 16:06:03 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Since God did not even spare His own Son but*\n\n*gave Him up for us all, won’t God, who gave us *\n\n*Christ, also give us everything else? *(Ro. 8:32)\n\n\n\n*Today’s Reflection:*\n\nDo you ever think that you are not good enough\n\nfor God, so He surely will not save you? Do you\n\never feel as if salvation is for everyone else?\n\nThen this verse is especially for you. If God gave\n\nHis Son for the world*, *He isn’t going to hold the\n\nthe gift of salvation from you! If Christ gave His\n\nlife for you, He isn’t going to turn around and\n\ncondemn you! He will not withhold anything\n\nyou need to serve Him. The book of Roman’s\n\nis an explanation of God’s redeeming grace—\n\nit’s meant to be a book of comfort and confid-\n\nence, addressed to the person who is dealing\n\nwith doubt.\n\n*Pastor Sather*\n\n\n\n*Ask the Lord Jesus to renew your faith in His*\n\n*great gift each day, so you will trust in Him to*\n\n*give you lesser gifts. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 5:8 AI",
    "found_reading": true
  },
  {
    "message_id": "177791e6cd454706",
    "date_utc": "2021-02-06T20:52:53+00:00",
    "subject": "THE INDWELLING GOD",
    "verse": "I pray that from His glorious, unlimited resources He will give you His might  inner strength through His Holy Spirit.  And I pray that Christ will be more and  more at home in your hearts as you trust  in Him. May your roots go down deep  into the soil of God’s marvelous love.  (Ephesians 3:16-17)",
    "reflection": "The Bible teaches the indwelling of the Triune God in believers. This divine indwell- ing in Christians is totally different from pagan enthusiasm, however.The apostles clearly stated that God’s presence in\nour hearts comes “through faith.” This faith in the atoning merit of Jesus Christ as our Savior. It is created and sustained only through means of grace: Word and sacraments. It is not based on human\nfeelings or emotions but on the truths of God’s Word.",
    "prayer": "We need to pray that the Father, Son, and Holy Spirit, will dwell within us to strengthen us for the mission of the church.",
    "original_content": "message_id: 177791e6cd454706\nsubject   : \nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 6 Feb 2021 14:52:53 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Subject: THE INDWELLING GOD *\n\n(2-7-21)\n\n\n\n*Today’s Verse:*\n\n*I pray that from His glorious, unlimited resources He will give you His\nmight *\n\n*inner strength through His Holy Spirit. *\n\n*And I pray that Christ will be more and *\n\n*more at home in your hearts as you trust *\n\n*in Him. May your roots go down deep *\n\n*into the soil of God’s marvelous love. *\n\n(Eph. 3:16-17)\n\n\n\n*Today’s Reflection:*\n\nThe Bible teaches the indwelling of the\n\nTriune God in believers. This divine indwell-\n\ning in Christians is totally different from\n\npagan enthusiasm, however.The apostles\n\nclearly stated that God’s presence in\n\nour hearts comes “through faith.” This\n\nfaith in the atoning merit of Jesus Christ\n\nas our Savior. It is created and sustained\n\nonly through means of grace: Word and\n\nsacraments. It is not based on human\n\nfeelings or emotions but on the truths of\n\nGod’s Word.\n\n*Pastor Sather*\n\n\n\n*We need to pray that the Father, Son, *\n\n*and Holy** Spirit, will dwell within us *\n\n*to strengthen us for** the mission of the church. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Colossians 2:6-7 AI",
    "found_reading": true
  },
  {
    "message_id": "1777ebccb87d9977",
    "date_utc": "2021-02-07T23:03:58+00:00",
    "subject": "OUR PARTNERSHIP IN THE GOSPEL",
    "verse": "My job was to plant the seed in your hearts, and Apollos watered it but it was God, not  we, who made it grow. (I Corinthians 3:6)",
    "reflection": "Paul planted the seed of the Good News message in people’s hearts. He was a missionary pioneer; he brought the mess- age of salvation. Apollos watered the seed. He helped the believers grow stronger in\nthe faith. Paul founded the church in Corinthians- inth, and Apollos built on the foundation. Tragically, the believers in Corinth had split into factions, pledging loyalty to diff- erent teachers (I Corinthians 1:11-13). After the preachers’ work is completed, God is the one who makes Christians grow. Our lead- ers should certainly be respected, but we should not put them on a pedestal that creat- es barriers between people or set them up as a substitute for Christ.",
    "prayer": "Ask the Holy Spirt to bless the preaching of Christ’s Gospel in the world and the testimony we give by our personal words and deeds.",
    "original_content": "message_id: 1777ebccb87d9977\nsubject   : Subject: OUR PARTNERSHIP IN THE GOSPEL (2-8-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 7 Feb 2021 17:03:58 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*My job was to plant the seed in your hearts, and Apollos **watered it but\nit was God, not *\n\n*we, who made it grow. *(I Cor. 3:6)\n\n\n\n*Today’s Reflection:*\n\nPaul planted the seed of the Good News message in people’s hearts. He was a\nmissionary pioneer; he brought the mess-\n\nage of salvation. Apollos watered the seed.\n\nHe helped the believers grow stronger in\n\nthe faith. Paul founded the church in Cor-\n\ninth, and Apollos built on the foundation. Tragically, the believers in\nCorinth had\n\nsplit into factions, pledging loyalty to diff-\n\nerent teachers (I Cor. 1:11-13). After the preachers’ work is completed, God\nis the\n\none who makes Christians grow. Our lead-\n\ners should certainly be respected, but we should not put them on a pedestal\nthat creat-\n\nes barriers between people or set them up as\n\na substitute for Christ.\n\n* Pastor Sather*\n\n\n\n*Ask the Holy Spirt to bless the preaching *\n\n*of** Christ’s Gospel in the world and the testimony **we give by our\npersonal words *\n\n*and deeds.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "1 Corinthians 3:7-9 AI",
    "found_reading": true
  },
  {
    "message_id": "177840804680712a",
    "date_utc": "2021-02-08T23:44:14+00:00",
    "subject": "RIGHTEOUS IN GOD'S EYES",
    "verse": "I tell you, this sinner, not the Pharisee, returned home justified before God, for the proud will be humbled, but  the humble will be justified. (Luke 18:14)",
    "reflection": "We do well to follow those wh0 appreciate it when others sincerely and truthfully call their attention to spiritual shortcomings. It helps us to arrive at a proper self-evaluation. It is critical that we see ourselves as forgiven people having God’s full approval for Jesus’ sake.This is in Robert Burn’s expression a “giftie” only God can give. “It is by grace you have been saved, through faith—and is not from yourselves, it is the gift of God.” (Ephesians 2:8)",
    "prayer": "There are times we need to ask God to give us full understanding of what it means to be forgiven for Jesus sake and to see ourselves In this light.",
    "original_content": "message_id: 177840804680712a\nsubject   : Subject: RIGHTEOUS IN GOD'S EYES (2-9-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 8 Feb 2021 17:44:14 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*I tell you, this sinner, not the Pharisee, returned home justified before\nGod,*\n\n*for the proud will be humbled, but *\n\n*the humble will be justified. *(Lk. 18:14)\n\n\n\n*Today’s Reflection:*\n\nWe do well to follow those wh0 appreciate\n\nit when others sincerely and truthfully call their attention to spiritual\nshortcomings. It helps us to arrive at a proper self-evaluation.\n\nIt is critical that we see ourselves as forgiven people having God’s full\napproval for Jesus’ sake.This is in Robert Burn’s expression a “giftie”\nonly God can give. “It is by grace\n\nyou have been saved, through faith—and is not from yourselves, it is the\ngift of God.” (Eph. 2:8)\n\n*Pastor Sather*\n\n\n\n*There are times we need to ask God to give *\n\n*us **full understanding of what it means** to be *\n\n*forgiven for Jesus sake and to see ourselves In this light.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "James 4:6 AI",
    "found_reading": true
  },
  {
    "message_id": "1778910f57d20abb",
    "date_utc": "2021-02-09T23:12:06+00:00",
    "subject": "LEAVE ALL WITH GOD",
    "verse": "Trust in the Lord with all your heart, and do not lean on your own understanding. In all your ways acknowledge Him, and He will make straight your paths. (Proverbs 3:5-6)",
    "reflection": "When we have an important decision to make, we sometimes feel we can’t trust anyone—not even God!\nBut God knows what is best for us He is a better judge of what we need then we are! We must trust Him completely in every choice we make. We should not omit careful thinking or belittle our God- given ability to reason; but we should\nNot trust our own ideas to the exclus- ion of All others. We must not be wise in our own eyes but be willing to listen to and be corrected by God’s Word and wise counselors. Bring your decisions to God in prayer use the Bible as you guide; and then follow God’s leading. He will direct your paths by both guid-ing and protecting you.",
    "prayer": "Faithful God, help us to trust in Your wisdom and guidance as we face important decisions, and grant us the humility to seek Your will through prayer, Scripture, and godly counsel. (AI)",
    "original_content": "message_id: 1778910f57d20abb\nsubject   : Subject: LEAVE ALL WITH GOD (2-10-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 9 Feb 2021 17:12:06 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*Trust in the Lord with all your heart, and do not **lean on your own\nunderstanding. In all your ways **acknowledge Him, and He will make\nstraight your **paths. *(Pro. 3:5-6)\n\n\n\n*Today’s Reflection:*\n\nWhen we have an important decision to\n\nmake, we sometimes feel we can’t trust anyone—*not **even God*! *But* God\nknows what is best for us He is a better judge\n\nof what we need then we are! We\n\nmust trust Him completely in every choice we make. We should not omit\ncareful thinking or belittle our God-\n\ngiven ability to reason; but we should\n\nNot trust our own ideas to the exclus-\n\nion of All others. We must not be wise\n\nin our own eyes but be willing to listen\n\nto and be corrected by God’s Word and wise counselors. Bring your decisions\n\nto God in prayer use the Bible as you guide; and then follow God’s leading.\n\nHe will direct your paths by both guid-ing and protecting you.\n\n\n*Pastor Sather*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 25:4-5 AI",
    "found_reading": true
  },
  {
    "message_id": "1778e69efcf8d53e",
    "date_utc": "2021-02-11T00:07:23+00:00",
    "subject": "WE ARE CHRIST'S GUESTS",
    "verse": "Then Jesus directed them to have all people  sit down in groups on the green grass.  (Mark 6:9) ",
    "reflection": "Divine grace really means that we are Christ’s guests. We come to His holy meal empty handed. Salvation is God’s\noutright gift—we contribute nothing. The Good Shepherd, who laid down His life on our behalf, leads us to the “green\ngrass” of His Word, providing all we need for our spiritual nurture.\nWe sing, “The Lord is My Shepherd, I’ll not want; He makes me lie down in green pastures; He leads me by quiet waters.",
    "prayer": "Let us express our gratefulness to the Savior for having us as His guests and for providing for all our needs.",
    "original_content": "message_id: 1778e69efcf8d53e\nsubject   : Subject: WE ARE CHRIST'S GUESTS (2-11-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 10 Feb 2021 18:07:23 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Then Jesus directed them to have all people *\n\n*sit down in **groups on the green grass. *\n\n(Mk. 6:9)\n\n\n\n*Today’s Reflection:*\n\nDivine grace really means that we are\n\nChrist’s guests. We come to His holy\n\nmeal empty handed. Salvation is God’s\n\noutright gift—we contribute nothing.\n\nThe Good Shepherd, who laid down His\n\nlife on our behalf, leads us to the “green\n\ngrass” of His Word, providing all we need\n\nfor our spiritual nurture. We sing, “*The *\n\n*Lord is My Shepherd, I’ll not want;*\n\n*He makes me lie down in green pastures; *\n\n*He leads me **by quiet waters.*\n\n* Pastor Sather*\n\n*Let us express our gratefulness to the *\n\n*Savior for having **us as His guests and *\n\n*for providing for all our needs.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 23:1-3 AI",
    "found_reading": true
  },
  {
    "message_id": "1779364ccd951fe1",
    "date_utc": "2021-02-11T23:19:53+00:00",
    "subject": "HAVING A RESPONSIBILITY",
    "verse": "“You will be my witness in Jerusalem,  and all Judea and Samaria, and to the  ends of the earth. (Acts 18)",
    "reflection": "How wonderful it is to see that Christ’s church continues to grow. But, it has not been completed just because these places have been evangelized.\nremember our Lord says to every generation: “You will be my\nwitnesses . . . to the ends of the earth.” To this day ALL of Christ’s followers are to teach all nations the Word of salvation and baptize them in the name of the Triune God. He who suffered and died for the sins of mankind says “That Christ will suffer and rise from the dead on the third day, and repentance and forgiveness of sins will be preached in His name to all nations, begin- ning at Jerusalem” (Luke 24:46-47) Remem- ber it is our call and privilege to be Christ’s witnesses wherever we are in this world and to send missionaries to places beyond our reach.",
    "prayer": "We need to ask the risen and ascended Savior to equip us to be His witness at home, at work, in School, and in our community.",
    "original_content": "message_id: 1779364ccd951fe1\nsubject   : Subject: HAVING A RESPONSIBILITY (2-12-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 11 Feb 2021 17:19:53 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*“You will be my witness in Jerusalem, *\n\n*and all Judea **and Samaria, and to the *\n\n*ends of the earth. *(Acts 18)\n\n\n\n*Today’s Reflection:*\n\nHow wonderful it is to see that Christ’s\n\nchurch continues to grow. *But, *it has *not *\n\nbeen completed just because *these places*\n\nhave been evangelized. remember our Lord\n\nsays to every generation: “You will be my\n\nwitnesses *. . . *to the ends of the earth.”\n\n*To this day **ALL* of Christ’s followers are\n\nto teach all nations the Word of salvation\n\nand baptize them in the name of the Triune\n\nGod. He who suffered and died for the sins\n\nof mankind says “That Christ will suffer\n\nand rise from the dead on the third day, and repentance and forgiveness of sins\nwill be\n\npreached in His name to all nations, begin-\n\nning at Jerusalem” (Lk. 24:46-47) *Remem-*\n\n*ber* it is our call and privilege to be Christ’s witnesses wherever we are\nin this world\n\nand to send missionaries to places beyond our reach.\n\n*Pastor Sather*\n\n*We need to ask the risen and ascended *\n\n*Savior to equip** us to be His witness at *\n\n*home, at work, in School, and** in our community.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Matthew 28:19-20 AI",
    "found_reading": true
  },
  {
    "message_id": "17798baac683e4ed",
    "date_utc": "2021-02-13T00:11:47+00:00",
    "subject": "CLEAR THE AIR BEFORE SUNDOWN",
    "verse": "Don’t sin by letting your anger gain control over you. Don’t let the sun go down while  you are still angry (Ephesians 4:26)",
    "reflection": "The Bible doesn’t tell us that we shouldn’t feel angry, but points out that it is important to handle our anger properly. If vented thoughtlessly, anger can hurt others and destroy relationships. If bottled up inside, it can cause us to become bitter and destroy us from within. Paul tells us to deal with\nour anger immediately in a way that builds relationships rather than destroy them. If we nurse our anger, we will give Satan an oppor-tunity to divide us. Are you angry with some- one right now? What can you do to resolve your differences? Don’t let the day end be- fore you begin to work on mending your relationship.",
    "prayer": "Let us thank Christ for reconciling mankind with God so we can live in peace with others.",
    "original_content": "message_id: 17798baac683e4ed\nsubject   : Subject: CLEAR THE AIR BEFORE SUNDOWN (2-13-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 12 Feb 2021 18:11:47 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Don’t sin by letting your anger gain control over you. Don’t let the sun\ngo down while *\n\n*you are still angry *(Eph. 4:26)\n\n\n\n*Today’s Reflection:*\n\nThe Bible doesn’t tell us that we shouldn’t\n\nfeel angry, but points out that it is important\n\nto handle our anger properly. If vented thoughtlessly, anger can hurt\nothers and destroy relationships. If bottled up inside,\n\nit can cause us to become bitter and destroy\n\nus from within. Paul tells us to deal with\n\nour anger immediately in a way that builds relationships rather than\ndestroy them. If we nurse our anger, we will give Satan an\noppor-tunity to divide\nus. Are you angry with some-\n\none right now? What can you do to resolve your differences? Don’t let the\nday end be-\n\nfore you begin to work on mending your relationship.\n\n*Pastor Sather*\n\n*Let us thank Christ for reconciling man-*\n\n*kind with **God so we can live in peace with others.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Colossians 3:13 AI",
    "found_reading": true
  },
  {
    "message_id": "1779d5c271e59e2b",
    "date_utc": "2021-02-13T21:46:38+00:00",
    "subject": "WHAT GOD INTENDED",
    "verse": "“What God has joined together, let no man separate.” (Matthew 19:6)",
    "reflection": "What has taken place is that the union of husband and wife\nmerges two persons in such a way that little can effect the\none without also affecting the other. Oneness in marriage\ndoes not mean losing your personality in the personality of the other. Instead, it means caring for your spouse as you care for yourself, learning to anticipate his or her needs,\nis helping the other to become all he or she can be. The\ncreation story tells of God’s plan that husband and wife\nshould be one (Genesis 2:24), and Jesus also referred to this\nplan in (Matthew 19:4-6).",
    "prayer": "Gracious God, help us to cherish and nurture the sacred bond of marriage, embracing the oneness You intended while supporting each other's growth and individuality. May we learn to care for our spouses as ourselves, always seeking to uplift and encourage them in Your love. (AI)",
    "original_content": "message_id: 1779d5c271e59e2b\nsubject   : Subject: WHAT GOD INTENDED (2-14-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 13 Feb 2021 15:46:38 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*“What God has joined together, let no man separate.” *(Mt. 19:6)\n\n*Today’s Reflection:*\n\nWhat has taken place is that the union of husband and wife\n\nmerges two persons in such a way that little can effect the\n\none without also affecting the other. Oneness in marriage\n\ndoes not mean losing your personality in the personality\n\nof the other. Instead, it means caring for your spouse as\n\nyou care for yourself, learning to anticipate his or her needs,\n\nis helping the other to become all he or she can be. The\n\ncreation story tells of God’s plan that husband and wife\n\nshould be one (Gen. 2:24), and Jesus also referred to this\n\nplan in (Mt. 19:4-6).\n\n* Pastor Sather*\n\n\n\n*Let our Valentine prayer be that the union of—and the*\n\n*unity in—marriage everywhere maybe strengthened by*\n\n*the self-sacrificing love of Christ. *\n\n\n\nLet us remember to always be kind to our Valentine!\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Ephesians 5:31-33 AI",
    "found_reading": true
  },
  {
    "message_id": "177a303de6b91d78",
    "date_utc": "2021-02-15T00:07:56+00:00",
    "subject": "SPIRITUAL RENEWAL",
    "verse": "He satisfies your desires with good things so that your youth is renewed like the eagle’s (Psalm 103:5)",
    "reflection": "David’s praise focused on God’s glorious deeds. Now we often find it easy to com- plain about life, but David’s list gives us plenty for which to praise God: He forgives our sins, heals or diseases, redeems us from death, crowns us with love and compassion, satisfies our desires, and gives righteous ness and justice. We receive all these without\ndeserving any of them. No matter how difficult your life’s journey, you can always count your blessings, past, present, and future. When you feel as though you have nothing for which to praise God, take time to read David’s list (Psalm 103:3-6).",
    "prayer": "Let us remember to join David in giving thanks to God for His renewing grace in Christ and for all His blessings that renew our life.",
    "original_content": "message_id: 177a303de6b91d78\nsubject   : Subject: SPIRITUAL RENEWAL (2-15-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 14 Feb 2021 18:07:56 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*[He] satisfies your desires with good things so*\n\n*that your youth is renewed like the eagle’s *(Ps. 103:5)\n\n\n\n*Today’s Reflection:*\n\nDavid’s praise focused on God’s glorious deeds. Now we often find it easy\nto com-\n\nplain about life, but David’s list gives us plenty for which to praise God:\nHe forgives our sins, heals or diseases, redeems us from death, crowns us\nwith love and compassion, satisfies our desires, and gives righteous\n\nness and justice. We receive all these without\n\ndeserving any of them. No matter how difficult your life’s journey, you\ncan always count your blessings, past, present, and future. When you feel\nas though you have nothing\n\nfor which to praise God, take time to read David’s list (Ps. 103:3-6).\n\n* Pastor Sather*\n\n\n\n*Let us remember to join David in giving thanks **to God for His renewing\ngrace in Christ and **for all His blessings that renew our life.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 103:1-5 AI",
    "found_reading": true
  },
  {
    "message_id": "177a804722c8507b",
    "date_utc": "2021-02-15T23:26:40+00:00",
    "subject": "FULL COVERAGE IN CHRIST",
    "verse": "All have sinned and fall short of the glory of God,  and are justified freely by His grace and through the redemption that came through Christ Jesus.\n (Romans 3:23-24)",
    "reflection": "As human sinfulness remains constant, so does\nour need for God’s saving grace in Christ remains constant. God’s new covenant with us, which is\nthe character of our salvation, offers full coverage.\nNone is excluded; none is told that he is only frac- tionally redeemed (Perhaps three-fifths)\nand\nthat he must make up the rest himself. There is\nno balance due, as through Christ pays a certain amount of your debt and you are responsible for\nthe rest. No, Jesus died to bring each one of us salvation full and free.",
    "prayer": "Let us make this our prayer: “Redeemer, come! I open wide my heart to Thee; Here, Lord, abide. Amen.",
    "original_content": "message_id: 177a804722c8507b\nsubject   : Subject: FULL COVERAGE IN CHRIST (2-16-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 15 Feb 2021 17:26:40 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verses:*\n\n*All have sinned and fall short of the glory of God, *\n\n*and are justified freely by His grace and through*\n\n* the redemption that came through Christ Jesus.*\n\n(Ro. 3:23-24)\n\n\n\n*Today’s Reflection:*\n\nAs human sinfulness remains constant, so does\n\nour need for God’s saving grace in Christ remains\n\nconstant. God’s new covenant with us, which is\n\nthe character of our salvation, offers full coverage.\n\nNone is excluded; none is told that he is only frac-\n\ntionally redeemed (Perhaps three-fifths) and\n\nthat he must make up the rest himself. There is\n\nno balance due, as through Christ pays a certain\n\namount of your debt and you are responsible for\n\nthe rest. *No,* *Jesus died to bring each one of us *\n\n*salvation full and* *free.*\n\n* Pastor Sather*\n\n\n\n*Let us make this our prayer: “Redeemer, come!*\n\n*I open wide my heart to Thee; Here, Lord, abide.*\n\n*Amen. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 5:20-21 AI",
    "found_reading": true
  },
  {
    "message_id": "177ad324144a7f3e",
    "date_utc": "2021-02-16T23:34:48+00:00",
    "subject": "YOUTH CAN BE AN ASSET",
    "verse": "Don’t let anyone think less of you because you are young.\nBe an example to all believers in what you teach in the way you live, in your love. your faith, and your purity. (I Timothy 4:12)",
    "reflection": "Timothy was a young pastor. It would have been easy for older Christians to look down on him because of his youth. He had to earn the respect of his elders by setting an example in his speech, love, faith, and purity. Regardless of your age, God can use you. Whether you are young or old, don’t think of your age as a handi- cap. Live so others can see Christ in you.",
    "prayer": "Let us remember to express our thankfulness to God for having blessed Christ’s church with faithful teenagers as His precious gifts.",
    "original_content": "message_id: 177ad324144a7f3e\nsubject   : Subject: YOUTH CAN BE AN ASSET (2-17-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 16 Feb 2021 17:34:48 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Don’t let anyone think less of you because you are*\n\n*young. Be an example to all believers in what you*\n\n*teach in the way you live, in your love. your faith,*\n\n*and your purity. *(I Tim.4:12)\n\n\n\n*Today’s Reflection:*\n\nTimothy was a young pastor. It would have been easy\n\nfor older Christians to look down on him because of\n\nhis youth. He had to earn the respect of his elders by\n\nsetting an example in his speech, love, faith, and purity. Regardless of\nyour age, God can use you. Whether\n\nyou are young or old, don’t think of your age as a handi-\n\ncap. *Live so others can see Christ in you.*\n\n* Pastor Sather*\n\n*Let us remember to express our thankfulness to God for having blessed\nChrist’s church with faithful teenagers as His precious gifts. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Titus 2:7-8 AI",
    "found_reading": true
  },
  {
    "message_id": "177b27d31d830a68",
    "date_utc": "2021-02-18T00:14:45+00:00",
    "subject": "A PROPHET WHO PROFITS",
    "verse": "And you my child, will be called a prophet  of the Most High, because you will prepare  the way of the Lord. (Luke 1:76)",
    "reflection": "Zechariah had just recalled hundreds of years of God’s sovereign work in history, beginning with Abraham and going on in- to eternity. Then, intender contrast he personalized the story. His Son had been chosen for the key role in the drama of\nthe ages. Although God has unlimited power, He chooses to work through frail humans who begin as helpless babes. Don’t minimize what God can do through those who are faithful to Him.",
    "prayer": "Let us never forget to thank the Lord Jesus for being the great Prophet, proclaiming and con veying the great blessing of full salvation in Him.",
    "original_content": "message_id: 177b27d31d830a68\nsubject   : Subject: A PROPHET WHO PROFITS (2-18-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 17 Feb 2021 18:14:45 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*And you my child, will be called a prophet *\n\n*of the **Most High, because you will prepare *\n\n*the way of **the Lord. *(Lk. 1:76)\n\n\n\n*Today’s Reflection:*\n\nZechariah had just recalled hundreds of\n\nyears of God’s sovereign work in history, beginning with Abraham and going\non in-\n\nto eternity. Then, intender contrast he personalized the story. His Son had\nbeen\n\nchosen for the key role in the drama of\n\nthe ages. Although God has unlimited\n\npower, He chooses to work through frail humans who begin as helpless babes.\n\n*Don’t minimize what God **can do *\n\n*through those who are faithful to Him.*\n\n* Pastor Sather*\n\n\n\n*Let us never forget to thank the Lord *\n\n*Jesus for **being the great Prophet, proclaiming and con**veying the\ngreat *\n\n*blessing of full salvation in **Him.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Luke 3:4 AI",
    "found_reading": true
  },
  {
    "message_id": "177b79ccf31c9c14",
    "date_utc": "2021-02-19T00:07:23+00:00",
    "subject": "FAMINE OF THE WORLD",
    "verse": "“The time is surely coming,” says the Sovereign Lord, “when I will send a famine on the land—not a famine of bread or water but of hearing the Word of the Lord.” (Amos 8:11)",
    "reflection": "The people had no appetite for God’s Word when prophets like Amos brought it. Because of their apathy, God said He would take away even the opportunity to hear His word. We have His Word, the Bible. But many still look everywhere for answers to life’s problems except in scriptures. You can help them by directing them to the Bible, showing them the parts that speak to their special needs and questions. God’s Word is available to us. Let us help people know it before a time comes when they can not find it.",
    "prayer": "Let us ask God to grant us the continual use of His Word and the sacraments, that through them we may be nurtured and strengthened.",
    "original_content": "message_id: 177b79ccf31c9c14\nsubject   : Subject: FAMINE OF THE WORLD (2-19-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Thu, 18 Feb 2021 18:07:23 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*“The time is surely coming,” says the Sovereign Lord, “when I will send a\nfamine*\n\n*on the land—**not a famine of bread or water but of hearing the Word of\nthe Lord.”* (Amos 8:11)\n\n\n\n*Today’s Reflection:*\n\nThe people had no appetite for God’s Word when prophets like Amos brought\nit. Because of their apathy, God said He would take away even the\nopportunity to hear His word. We have His Word, the Bible. But many still\nlook everywhere for answers to life’s problems except in scriptures. You\ncan help them by directing them to the Bible, showing them\n\nthe parts that speak to their special needs and questions. God’s Word is\navailable to us. *Let us help people know it* *before a time comes when\nthey can not find it.*\n\n* Pastor Sather*\n\n\n\n*Let us ask God to grant us the continual *\n\n*use of His Word and the sacraments, that through them we may be nurtured\nand strengthened. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 119:105 AI",
    "found_reading": true
  },
  {
    "message_id": "177bc8b41b62915f",
    "date_utc": "2021-02-19T23:06:19+00:00",
    "subject": "FAMINE OF THE WORLD",
    "verse": "“The time is surely coming,” says the Sovereign Lord, “when I will send a  famine on the land—not a famine of  bread or water but of hearing the Word of the Lord.” (Amos 8:11)",
    "reflection": "The people had no appetite for God’s Word when prophets like Amos brought it. Because of their apathy, God said He\nwould take away even the opportunity to hear His word. We have His Word, the Bible. But many still look everywhere for answers to life’s problems except in scriptures. You can help them by directing them to the Bible, showing them the parts that speak to their special needs and quest- ions. God’s Word is available to us. Let us help people know it before a time comes when they can not find it.",
    "prayer": "Let us ask God to grant us the continual use of His Word and the sacraments, that through them we may be nurtured and strengthened.",
    "original_content": "message_id: 177bc8b41b62915f\nsubject   : Subject: FAMINE OF THE WORLD (2-20-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Fri, 19 Feb 2021 17:06:19 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse: *\n\n*(let us truly examine this verse)*\n\n*“The time is surely coming,” says the Sovereign Lord, **“when I will send\na *\n\n*famine on the land—**not a famine of *\n\n*bread or water but of hearing the Word*\n\n*of the Lord.”* (Amos 8:11)\n\n\n\n*Today’s Reflection:*\n\nThe people had no appetite for God’s\n\nWord when prophets like Amos brought\n\nit. Because of their apathy, God said He\n\nwould take away even the opportunity\n\nto hear His word. We have His Word, the Bible. *But many* still look every\nwhere\n\nfor answers to life’s problems except in scriptures. You can help them by\ndirecting them to the Bible, showing them the parts\n\nthat speak to their special needs and quest-\n\nions. God’s Word is available to us.\n\n*Let us help people know it* *before a time comes when they** can not\nfind it.*\n\n* Pastor Sather*\n\n\n*Let us ask God to grant us the continual *\n\n*use of** His Word and the sacraments, that through** them we may be\nnurtured and strengthened. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Psalm 119:105 AI",
    "found_reading": true
  },
  {
    "message_id": "177c15f8a0083e82",
    "date_utc": "2021-02-20T21:36:40+00:00",
    "subject": "FOLLOWING GOD'S REQUEST",
    "verse": "Comfort, comfort My people, says your God. (Isaiah 40:1)",
    "reflection": "“Comfort, comfort My people” is the most\nappropriate Lenten text. Forgiveness in Christ, the Lamb of God, is the comfort that pastor’s bring to the ailing and failing members of the church.\nIn this they have the assistance of elders and deacons in the congregation who pray for the sick (James 5: 14-15). And not only they but all members of the church bring words of hope and\ncheer to sorrowful and suffering brothers and sisters in the faith. That is how we can strengthen one another in the communion of saints.",
    "prayer": "Let us ask the Holy Spirit, our comforter, to keep us in the fellowship of faith, that we may be com forters to one another in Jesus’ name.",
    "original_content": "message_id: 177c15f8a0083e82\nsubject   : Subject: FOLLOWING GOD'S REQUEST (2-21-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sat, 20 Feb 2021 15:36:40 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Comfort, comfort My people, says your God.*\n\n(Isa. 40:1)\n\n\n\n*Today’s Reflection:*\n\n“Comfort, comfort My people” is the most\n\nappropriate Lenten text. Forgiveness in Christ, the Lamb of God, is the\ncomfort that pastor’s bring to the ailing and failing members of the church.\nIn this they have\n\nthe assistance of elders and deacons in the congregation who pray for the\nsick (Jm. 5:\n\n14-15). And not only they but all members\n\nof the church bring words of hope and\n\ncheer to sorrowful and suffering brothers\n\nand sisters in the faith. *That is how we *\n\n*can streng**then one another in the communion of saints.*\n\n*Pastor Sather*\n\n\n\n*Let us ask the Holy Spirit, our comforter, *\n\n*to keep** us in the fellowship of faith, that *\n\n*we may be com**forters to one another in Jesus’ name.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "James 5:14-15 AI",
    "found_reading": true
  },
  {
    "message_id": "177c6816d94bebef",
    "date_utc": "2021-02-21T21:31:47+00:00",
    "subject": "HOPE FOR RESTORATION:",
    "verse": "Even the wilderness will rejoice in those  days. The  desert will blossom with flowers. (Isaiah 35:1)",
    "reflection": "In the next 34 verses Isaiah delivers a mess- age of judgement on all nations, including Israel and Judah, for rejecting God. Although there have been glimpses of relief and restoration for the remanent of faithful\nbelievers, the climate of wrath, fury, judge-ment, and destruction, still prevailed. Now in verse one Isaiah comes through with a vision of beauty and encourage-\nment.\nGod is just in His mercy as He is in His judgement.\nGod’s complete moral perfection is revealed by his hatred for all sin, and this leads to judgement.\nThis same moral perfection is revealed in His love for all He has created. This leads to mercy for those who have sinned but who have sincerely loved Jesus and put their trust in Him.",
    "prayer": "Remember that scriptures tell us prayer changes things.\nThe bible says, “The effectual fervent prayer of a righteous man avails much” (James 5:16)",
    "original_content": "message_id: 177c6816d94bebef\nsubject   : Subject: HOPE FOR RESTORATION: (2-22-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Sun, 21 Feb 2021 15:31:47 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Even the wilderness will rejoice in those *\n\n*days. The **desert will blossom with flowers. *(Isa. 35:1)\n\n\n\n*Today’s Reflection:*\n\nIn the next 34 verses Isaiah delivers a mess-\n\nage of judgement on all nations, including Israel and Judah, for rejecting\nGod.\n\nAlthough there have been glimpses of relief\n\nand restoration for the remanent of faithful\n\nbelievers, the climate of wrath, fury, judge-ment, and destruction, still\nprevailed.\n\nNow in verse one Isaiah comes through\n\nwith a vision of beauty and encourage-\n\nment. God is just in His mercy as He is in\n\nHis judgement. God’s complete moral perfection is revealed by his hatred\nfor all\n\nsin, and this leads to judgement.\n\nThis same moral perfection is revealed in\n\nHis love for all He has created. This leads\n\nto mercy for those who have sinned but\n\nwho have sincerely loved Jesus and put\n\ntheir trust in Him.\n\n*Pastor Sather*\n\n*Remember that scriptures tell us prayer changes **things. The bible says,\n“The effectual fervent **prayer of a righteous *\n\n*man avails much” *(Jm. 5:16)\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Isaiah 35:1-2 AI",
    "found_reading": true
  },
  {
    "message_id": "177cc1e6120d3bdd",
    "date_utc": "2021-02-22T23:41:19+00:00",
    "subject": "CAUSE TO CELEBRATE",
    "verse": "“He calls his friends and neighbors together and says, Rejoice with me; I have found my lost sheep!” (Luke 15:5)",
    "reflection": "Why this great Joy? It means the recovery of a human soul worth more than all the material wealth of the world. It means the reinstatement of a person for whose redemp-\ntion Jesus Christ shed His precious blood.",
    "prayer": "Let your prayer be an intercession for someone who is a spiritual drop-out.",
    "original_content": "message_id: 177cc1e6120d3bdd\nsubject   : Subject: CAUSE TO CELEBRATE (2-23-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Mon, 22 Feb 2021 17:41:19 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*“He calls his friends and neighbors together and **says, Rejoice with me;\nI have found my lost sheep!” *(Lk. 15:5)\n\n\n\n*Today’s Reflection:*\n\nWhy this great Joy? It means the recovery\n\nof a human soul worth more than all the material wealth of the world. It\nmeans the reinstatement of a person for whose redemp-\n\ntion Jesus Christ shed His precious blood.\n\n*Pastor Sather*\n\n*Let your prayer be an intercession for someone who **is a spiritual\ndrop-out.*\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Luke 19:10 AI",
    "found_reading": true
  },
  {
    "message_id": "177d0f0cc262c43a",
    "date_utc": "2021-02-23T22:09:38+00:00",
    "subject": "HEAVEN--WHAT IS THERE",
    "verse": "There will be no more night. They will not need the light of a lamp or the light of the  sun, for the Lord God will give them light. (Revelation 22:5)",
    "reflection": ":\nHeaven is described as an extraordinary place. Life in heaven is so different from our earthly life that literal language and human imagination cannot begin to des- cribe its realities. To be in the presence of our heavenly Father as children recon- ciled and redeemed by the Lamb of God—THAT IS HEAVEN IN BRIEF.",
    "prayer": "Pray that God, for Jesus’ sake, may pre- serve in you the glorious vision of eternal life to come.",
    "original_content": "message_id: 177d0f0cc262c43a\nsubject   : Subject: HEAVEN--WHAT IS THERE (2-24-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Tue, 23 Feb 2021 16:09:38 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*There will be no more night. They will not need the **light of a lamp or\nthe light of the *\n\n*sun, for the Lord **God will give them light. *(Rev. 22:5)\n\n\n*Today’s Reflection**:*\n\nHeaven is described as an extraordinary\n\nplace. Life in heaven is so different from\n\nour earthly life that literal language and\n\nhuman imagination *cannot* begin to des-\n\ncribe its realities. To be in the presence\n\nof our heavenly Father as children recon-\n\nciled and redeemed by the Lamb of God—*THAT IS HEAVEN IN BRIEF.*\n\n* Pastor Sather*\n\n*Pray that God, for Jesus’ sake, may pre-*\n\n*serve in you **the glorious vision of eternal *\n\n*life to come. *\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Revelation 21:23 AI",
    "found_reading": true
  },
  {
    "message_id": "177d65520abeec81",
    "date_utc": "2021-02-24T23:17:19+00:00",
    "subject": "AN INCREDIBLE CHANGE",
    "verse": "Therefore, if anyone is in Christ, He is a  new creation; the old has gone, the new  has come. (II Corinthians 5:17)",
    "reflection": "Through forgiveness the arms of Jesus lift you—His blood cleanse you—and His love changes you-- It is His free gift to you. Turn your heart toward Jesus.",
    "prayer": "Pray to receive Him and His forgiveness by faith today He will come into your heart and make all things new. . .",
    "original_content": "message_id: 177d65520abeec81\nsubject   : Subject: AN INCREDIBLE CHANGE (2-25-21)\nfrom      : Pastor Sather <pastor.sather5@gmail.com>\nto        : undisclosed-recipients:;\ndate      : Wed, 24 Feb 2021 17:17:19 -0600\n===================================================================\nBody (clean, unformatted):\n===================================================================\n*Today’s Verse:*\n\n*Therefore, if anyone is in Christ, He is a *\n\n*new creation;** the old has gone, the new *\n\n*has come. *(II Cor. 5:17)\n\n\n\n*Today’s Reflection:*\n\nThrough forgiveness the arms of Jesus lift\n\nyou—His blood cleanse you—and His love changes you-- It is His free gift to\nyou.\n\nTurn your heart toward Jesus*. *\n\n* Pastor Sather*\n\n\n*Pray to **r**eceive Him and His **forgiveness *\n\n*by faith today*—*He will come into **your heart and make all things new*.\n. .\n",
    "found_verse": true,
    "found_reflection": true,
    "found_prayer": true,
    "reading": "Romans 6:4 AI",
    "found_reading": true
  }
]